{
    "news_1": {
        "title": "[Switch] Mig Flash clarifie sur le ban des consoles",
        "content": "La Team Mig Flash vient de publier un message sur le ban des consoles, l'équipe en charge du développement du linker Mig Flash a voulu apporter quelques précisions sur leur site officiel.\n \n \n\n \n \nD'après les rapports que nous avons reçus et vus avec Mig Flash, TOUS les bannissements de console à ce jour ont été dus à l'utilisation de dumps incomplets OU à un mélange de fichiers BIN provenant d'autres dumps de cartes de jeu.\n \nNous n'avons pas encore vu un seul bannissement lors de l'utilisation de dumps de cartes de jeu 100 % complets avec tous les fichiers BIN et XCI provenant de la même carte de jeu.\n \nDe plus, la désactivation du Wi-Fi de la console Switch n'efface aucune activité avec des dumps incomplets.\nToutes les activités hors ligne sur la console sont enregistrées et seront transmises la prochaine fois que le Wi-Fi sera à nouveau activé sur la console.\n \nGardez ces informations à l'esprit et n'utilisez JAMAIS de dumps incomplets pour éviter les bannissements de console.\n \n \nPour que l'équipe appuie cet argumentaire, c'est qu'elle doit avoir un certain nombre d'utilisateurs qui se plaignent du bannissement de leur console, mais les utilisateurs doivent aussi avoir en tête que leur propre utilisation peut avoir des conséquences. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196615/in-switch-mig-flash-clarifie-sur-le-ban-des-consoles-1.png"
        }
    },
    "news_2": {
        "title": "[Switch] Sudachi continue de s'améliorer sur MacOS, Windows et Android",
        "content": "Bien qu'il soit sous le retrait DMCA, le développement de Sudachi continue, le développeur Jarrod Norwell ne semble pas se soucier des injonctions de Nintendo et propose une mise à jour de son émulateur qui a la spécificité d'être proposé sur Windows, MacOS et Android, même si toutes les versions ne se suivent pas au même moment. \n \nLa version Android du fork de Yuzu reste celle qui obtient toujours les mises à jour les plus récentes, mais les utilisateurs de macOS peuvent désormais tester Sudachi sur Apple Silicon ! Attendez-vous à de nombreux plantages, car MoltenVK n'est pas encore à la hauteur. Il reste aussi à corrigé la réécriture, et notamment à tester sur iPad.\n \n \n\n \n \nSur Android la version 1.09 : \n \n- Ajout d'une page supplémentaire au flux de configuration et d'un bouton à la page des paramètres permettant aux utilisateurs de sélectionner un fichier title.keys\n \n- Correction d'un problème qui faisait planter l'application lors de l'installation d'un DLC ou d'une mise à jour.\n \n- Nécessite les fichiers prod.keys et title.keys\n \n- Les version Windows et MacOS se sont arrêtées à la 1.08, qui a apporté une amélioration de la précision et du dimensionnement de la mémoire.\n \n \nTéléchargement :  Sudachi 1.09\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196608/in-switch-sudachi-continue-de-sameliorer-sur-macos-windows-et-android-1.png"
        }
    },
    "news_3": {
        "title": "[PS5] PS5-Exploit-Host-Self-Host-Tool d'idlesauce v1.0.0-rc1",
        "content": "Le développeur idlesauce dévoila première version de PS5-Exploit-Host-Self-Host-Tool, un moyen simple d'auto-héberger PS5-Exploit-Host. \n \n \n\n \n \nCe programme ne doit pas être considéré comme prêt à l'emploi, utilisez-le à vos risques et périls, il serait plus sage d'attendre une version stable ! Si vous souhaitez l'auto-héberger et le mettre en ligne, pensez à utiliser des projets activement maintenus comme PiHole pour le DNS et nginx pour l'hébergement de fichiers statiques. \n \nVous pouvez trouver les fichiers statiques (en option) déjà configurés avec appcache sous l'onglet versions du dépôt PS5-Exploit-Host.\n \n \nTéléchargement : PS5-Exploit-Host-Self-Host-Tool v1.0.0-rc1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196597/in-ps5-ps5-exploit-host-self-host-tool-didlesauce-v100-rc1-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] PS5-Jar-Loader v1.0.1 pour désactiver les mises à jour intempestives",
        "content": "Le développeur Master-s s'intèresse au hack PS5 et souhaite apporter sa pierre à l'édifice, il propose une nouvelle version de PS5-Jar-Loader qui est désormais proposé en v1.0.1. \n \n \n\n \n \nAprès une première version 1.0.0 qui permet de lancer : \n \n- dumpclasspath-1.0-SNAPSHOT.jar\n- ftpserver-1.0-SNAPSHOT.jar\n- minitennis-1.0-SNAPSHOT.jar\n- printsysprops-1.0-SNAPSHOT.jar\n- ps5-jar-loader-1.1.2.iso\n- umtx-bug-1.0-SNAPSHOT.jar\n \n \n \n\n \n \nVoilà que la version 1.0.1 apporte la possibilité de bloquer les mises à jour intempestives sur firmware 5.xx et 7.xx : \n \n- PS5 7.xx : Disable-updates\n- PS5 5.xx : Disable-updates\n \n \nTéléchargement : PS5-Jar-Loader v1.0.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196594/in-ps5-ps5-jar-loader-v101-pour-desactiver-les-mises-a-jour-intempestives-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1196594/in-ps5-ps5-jar-loader-v101-pour-desactiver-les-mises-a-jour-intempestives-2.png"
        }
    },
    "news_5": {
        "title": "[XBO/Series] L'outil de dump bénéficie d'une mise à jour bienvenue",
        "content": "L'outil de dumping des jeux Xbo One / Series vient de bénéficier d'une mise à niveau très importante, cet update facilite le processus, pour rappel, cela fonctionne sous Xbox One / Series sous firmware version 4478, 4908, ou 4909.\n \n \n\n \n \nCaractéristiques:\n \n- Chargement des licences par menu (disque OGX/360/XB1 ou numérique)\n- Mettre à niveau l'exploit « à distance » vers la version « locale »\n- Monter/démonter le stockage de sauvegarde du jeu\n- Sauvegarder plusieurs éléments (ou tous)\n- Option pour trouver automatiquement votre sauvegarde Warhammer et y injecter Stage1\n- Possibilité de démarrer un reverse shell en arrière-plan via une tâche planifiée (vous pouvez fermer le script du jeu par la suite)\n \n \n \nTout est là : consolemods.org\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196587/in-xboseries-loutil-de-dump-beneficie-dune-mise-a-jour-bienvenue-1.png"
        }
    },
    "news_6": {
        "title": "[PS5] Il est désormais possible d'installer des PKG jusqu'au 5.50 mais pas de les lancer",
        "content": "Le développeur Zecoaxo nous informe avoir rajouté l'option dans son host nommée idlesauce_the_savior qui permet d'installer des PKG sur la PS5 jusqu'au firmware 5.50. \n \n \n\n \n \nAfin de mettre en avant son ami idlesauce, qui a réussi à porter le loader ELF 9020 sur UMTX, il affirme que toutes les éloges lui reviennent, et il dit à Sleirsgoevy qu'il doit pouvoir porter le HEN sur 1.xx et 2.xx. \n \n \n\n \n \nS'il est possible d'installer les FPKG jusqu'au firmware 5.50, il n'est pas possible de les lancer sans le HEN. Comme le précise Zecoxao, cela devrait rapidement arriver sur les firmwares 1.xx et 2.xx, grâce l'Hyperviseur cassé par Specter et la ROP de ChendoChap, mais cela sera plus long pour les firmwares supérieurs. \n \n \n\n \n \nQue cela soit des PKG PS4 ou PS5 pour le moment, il ne se lance pas car il n'y a pas les licences ni de HEN. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196567/in-ps5-il-est-desormais-possible-dinstaller-des-pkg-jusquau-550-mais-pas-de-les-lancer-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1196567/in-ps5-il-est-desormais-possible-dinstaller-des-pkg-jusquau-550-mais-pas-de-les-lancer-1.png"
        }
    },
    "news_7": {
        "title": "[3DS] Luma3DS v13.2.1 disponible",
        "content": " \nLe développeur TuxSH a déployé une nouvelle version de Luma3DS, il a mis en ligne la version 13.2.1 du meilleur CFW de la Nintendo 3DS. Comme vous le savez Luma3DS est le CFW indispensable pour les 3DS et 2DS et l'arrivée d'une nouvelle version est toujours intéressante à suivre. \n \n \n\n \n \n \nChangelog v13.2.1 :\n \n \n- Dans le sous-menu « Filtres d'écran » de Rosalina, ajout de la même manière une nouvelle option pour « corriger » la courbe de couleur de l'écran inférieur . Cela améliore considérablement la sortie couleur de certains écrans inférieurs IPS . Cependant, il semble y avoir une certaine loterie même avec les écrans inférieurs IPS, et le résultat peut parfois paraître trop rouge\n- Correction de la prise en charge du pavé circulaire dans le sous-menu de remplacement du volume\n- Réécriture du fichier README\n \n \nTéléchargement : Luma3DS v13.2.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196512/in-3ds-luma3ds-v1321-disponible-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] KartLANPwn, une faille critique dans Mario Kart Deluxe 8",
        "content": "Mario Kart Deluxe 8 est tout simplement le jeu le plus vendu sur Nintendo Switch, avec 65 millions d'exemplaires vendus depuis son lancement, c'est l'un des jeux incontournables de la console. \n \nRécemment une faille de sécurité a été découverte, connue sous le nom de KartLANPwn cette vulnérabilité CVE-2024-45200 permet l'exécution de code à distance ( RCE ), en s'appuyant sur une utilisation de certaines bibliothèques utilisée pour le multijoueur local en LAN/LDN et en ligne NEX.\n \n \n \n\n \n \n \nKartLANPwn exploite un problème de corruption de mémoire dans la façon dont le jeu gère les données pendant le processus de « recherche-réponse » en mode multijoueur LAN. En créant un paquet spécial, les pirates pourraient potentiellement exécuter du code sur votre console, leur donnant ainsi accès à des informations sensibles ou même au contrôle total de votre appareil.\n \n \n\n \n \nLa vulnérabilité réside dans la bibliothèque Pia, un outil réseau propriétaire utilisé par plusieurs jeux Nintendo Switch. En mode LAN, une console hôte envoie un paquet « Browse-Reply » aux autres joueurs du réseau. En manipulant la longueur de ce paquet, les attaquants pourraient faire déborder une mémoire tampon et exécuter du code arbitraire.\n \nLe chercheur a fourni un script Python de preuve de concept (PoC) lorsqu'un joueur ouvre le menu LAN Play, sa console envoie une requête de navigation au réseau. Le script de l'attaquant répond alors avec un paquet spécialement conçu pour faire planter le jeu. Le PoC sert de démonstration de la puissance de l'exploit, soulignant la facilité avec laquelle un attaquant sur le même réseau local peut cibler des joueurs dans une session multijoueur.\n \n \nLa vulnérabilité CVE-2024-45200 affecte toutes les versions de Mario Kart 8 Deluxe jusqu'à et y compris :\n \n- v3.0.1 pour la version mondiale\n- v3.0.2 pour la version Chine/Tencent\n \nNintendo a rapidement réagi à ce problème de sécurité critique en publiant un correctif dans la version 3.0.3 pour toutes les régions, à l'exception de la Chine, le 11 septembre 2024. Le correctif a ensuite été étendu à la version Tencent en Chine le 27 septembre 2024, sécurisant ainsi toutes les versions du jeu dans le monde. Cette mise à jour résout le problème de dépassement de mémoire tampon dans la bibliothèque réseau Pia, garantissant que outBufSize ne dépasse pas la taille de la mémoire tampon de sortie.\n \nSi vous êtes un joueur de Mario Kart 8 Deluxe, l'étape la plus importante est de vous assurer que votre jeu est mis à jour vers la dernière version ( v3.0.3 ). Sans ce correctif, votre console reste vulnérable à cet exploit hautement critique, en particulier dans les paramètres multijoueurs locaux comme le jeu en réseau local.\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196450/in-switch-kartlanpwn-une-faille-critique-dans-mario-kart-deluxe-8-1.png"
        }
    },
    "news_9": {
        "title": "[Switch] C'est la fin de Ryujinx suite à un accord avec Nintendo",
        "content": "Nintendo of America nous a refait le coup de Yuzu, la team Ryujinx nous a officiellement informé qu'il ne s'agit pas d'un retrait pour DCMA, mais il s'agit bel et bien d'un accord trouvé entre le développeur principal gdkchan et Nintendo.\n \nL'accord défini donc le retrait du projet, l'arrêt de l'entreprise, et de toutes les relations qu'elle contrôle, et comme pour Yuzu cela va très vite, les liens de téléchargement ont été retirés, l'entreprise a été supprimée. \n \n \n\n \n\n \n \ngdkchan n'en dira pas plus, il est probablement tenu au secret suite à l'accord, mais il tient à remercier ceux qui ont contribué aux codes, documentations et reports de bugs. Il remercie aussi l'équipe de modération, dont parfois les circonstances ont été difficiles.\n \nNous ne savons pas ce que l'accord prévoit, mais il semblerait que Ryujinx soit passé en sources fermées dans un premier temps, et que son retrait sera officialisé une fois l'accord définitivement signé. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196440/in-switch-cest-la-fin-de-ryujinx-suite-a-un-accord-avec-nintendo-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1196440/in-switch-cest-la-fin-de-ryujinx-suite-a-un-accord-avec-nintendo-2.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] ps5-jar-loader 1.1.2 de Hammer-83 disponible (jusqu'au fw 7.61)",
        "content": " \nLe développeur Hemmer-83 nous propose de découvrir la version 1.1.2 de ps5-jar-loader. Pour rappel,\n \nTout cela vous permet de démarrer via la chaîne d'exploitation BD-JB, les fichiers JAR transmis via le protocole réseau TCP. Un fichier JAR (Java archive) est un fichier ZIP utilisé pour distribuer un ensemble de classes Java. Ce format est utilisé pour stocker les définitions des classes, ainsi que des métadonnées, constituant l'ensemble d'un programme.\n \nAvec cette nouvelle version il a ajouté les dernières évolutions du hack, en intégrant le mappage SDK récents, et en implémentant le bug UMTX. Le développeur reconnait que cette version n'est pas très stable et que votre console peut subir des kernel panics. \n \n \n\n \n \nChangelog :\n \n- Ajout de mappages SDK utiles\n \nMarche à suivre :\n \n1- Compilez le projet et gravez le contenu de assembly/target/assembly-1.1.2 sur un disque BD-RE.   L'ISO précompilé est également fournie.\n2- Insérez le disque dans le PS5 et exécutez le loader JAR.\n3- Envoyez un payload : java -jar <payload.jar> <PS5 IP>\n \nExemples :\n \n- Serveur FTP (sandbox)\n- Exemple de mini jeu de tennis\n- Imprimante des propriétés du système\n- Implémentation du bug UMTX par flat_z, adapté à ce SDK. Notez qu'elle n'est pas très stable et qu'elle risque de faire paniquer la console à la fin de l'exécution dans son état actuel.\n \n \nTéléchargement : ps5-jar-loader 1.1.2 \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196356/in-ps5-ps5-jar-loader-112-de-hammer-83-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] Le kit complet de l'UnlockSwitch est là",
        "content": "Voilà il ne manquait que l'Xtractor pour que le kit de l'UnlockSwitch soit enfin complet ! C'est désormais chose faite, voilà le kit intégral de l'UnlockSwitch, le package contiendra : \n \n- L'UnlockSwitch PBS\n- Le programmeur (compatible avec l'UnlockSwitch et l'Xtractor)\n- L'Xtractor\n- Le câble USB de Type-C (on nous précise noir), non présent sur la photo.\n \n \n\n \n \nPour ceux qui n'ont pas suivi les prix annoncés : \n \n- La production d'UnlockSwitch sans l'antenne Wi-Fi pour 24,90 $ (10 000 pièces seulement)\n \n- Le Xtractor seul sera vendu pour 34,90 $ (permet de transférer vos propres jeux)\n \n- Le kit, comprenant le PBS UnlockSwitch avec l'antenne Wi-Fi, le programmateur et l'Xtractor, sera vendu à 59,90 $\n \nTous les détails sur la date de début de production et le lancement officiel de l'UnlockSwitch PBS seront annoncés cette semaine. A noter qu'à 24,90 $, le pack contiendra le linker UnlockSwitch PBS (sans Wifi) mais aussi le programmeur et le câble flex. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196259/in-switch-le-kit-complet-de-lunlockswitch-est-la-1.jpg"
        }
    },
    "news_12": {
        "title": "[PS5] Specter et ChendoChap ont cassé l'hyperviseur inférieur au 3.00",
        "content": "Le développeur Specter a annoncé hier que rester sur un firmware inférieur au 3.00 sur PS5 serait une bonne idée, c'est déjà difficile d'être dans ce cas, mais certains qui étaient en 2.50 sont passé sur un firmware 3.xx, ce qui n'a pas réellement de sens pour profiter par exemple du hack BD-J. \n \nIl rappelle donc que rester sur le firmware le plus bas possible est toujours plus intéressant que d'attendre un éventuel hakc qui ne pourrait jamais arriver, ou dans très longtemps. \n \nAinsi hier, il a officialisé le fait que l'Hyperviseur est désormais cassé sur les firmwares inférieurs au 3.00, cela était une théorie envisagée il y a plus d'un an qui aujourd'hui est confirmée. La chaine ROP imaginée et conçue par ChendoChap il y a plus an est fonctionnelle.\n \nIl y a un an, Specter disait : \n \nSur les versions 2.50 et antérieures, l'hyperviseur est intégré dans le binaire du kernel. Il s'agit de la \"première itération\" de l'hyperviseur, les versions ultérieures ont l'hyperviseur en tant que composant chargé séparément. Les principaux objectifs de l'hyperviseur sont de protéger l'intégrité du code du noyau et d'appliquer xotext (alias. eXecute Only Memory ou \"XOM\") sur le kernel.\n \nPour ce faire, Sony tire parti de diverses fonctionnalités fournies par AMD Secure Virtual Machine (SVM), telles que ; Tables de pages imbriquées (NPT), interruption d'exécution en mode invité (GMET) et interception des lectures/écritures dans les registres de contrôle (CR) ainsi que dans les registres d'état de la machine (MSR).\n \nDe plus, xotext semble être soutenu par du matériel en tant que collaboration avec AMD, nommée \"nda feature\". L'hyperviseur gère également l'unité de gestion de la mémoire d'E / S (IOMMU), comme l'indique le fait qu'il expose divers hypercalls pour le configurer.\n \nIl convient de noter que l'hyperviseur est très petit, surtout par rapport à celui de la PS3. Il ne prend en charge qu'une poignée d'hypercalls et existe principalement pour protéger le kernel. Il n'exécute pas plusieurs machines virtuelles ou n'utilise pas la virtualisation imbriquée, il ne virtualise que le kernel/l'espace utilisateur, que Sony appelle \"GameOS\".\n \n \n \nDe fait, il a confirmé via un screen que l'hyperviseur est contournée, on voit dans le code dans la chaine ROP que les tables imbriquées (NPT), et l'interruption d'exécution en mode invité (GMET) sont bien désactivées dans la machine virtuelle qui contrôle les blocks (VMCB), la protection spécifique à AMD. \n \n \n\n \n \nCela permet d'exécuter un pointeur et ainsi de casser l'hyperviseur, et de rediriger vers le kernel .text dans la fonction sys-getppid, souvent utilisé par des routines qui créent des fichiers temporaires uniques, en renvoyant l'identifiant du processus appelant. Cet adressage spécifique permet alors de \"contrôler\" l'hyperviseur, ou de bypasser ses sécurités, ce qui donne l'accès à la lecture et l'écriture dans le kernel. Peut être que cela pourrait déboucher sur une forme de HEN.\n \n \n\n \n \nComme Specter l'a dit à plusieurs reprises, sur les firmwares à partir du 3.00 l'hyperviseur n'est plus le même, Sony ayant corrigé son fonctionnement, de plus la problématique du processeur principal a53io qui gère séparément les packages PS5 (PKG) reste entière. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196228/in-ps5-specter-et-chendochap-ont-casse-lhyperviseur-inferieur-au-300-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1196228/in-ps5-specter-et-chendochap-ont-casse-lhyperviseur-inferieur-au-300-2.jpg"
        }
    },
    "news_13": {
        "title": "[PS3] webMAN MOD 1.47.47 disponible",
        "content": " \nLe développeur Aldo Vargas a travaillé sur une nouvelle version de webMAN MOD, l'outil qui ne cesse d'évoluer magré les 18 ans de la console. \n \nwebMAN est un plugin développé par Deank qui permet de lancer des backups de jeux PS3, PS2, PS1, PSP ainsi que des Blu-ray ou des DVD, stocké sur disque dur (y compris en NTFS) ou sur le réseau local, au format JB ou ISO. M@tsumot0 et Aldostools ont proposé une version MOD de webMan, apportant notamment le support de 21 langages utilisant des fichiers externes, un installer/updater pour CFW Cobra et NonCobra, le spoof IDPS/PSID, la désactivation des syscalls du cfw, et de nombreuses autres évolutions qui se sont succédées.\n \n \n\n \n \n \n \nCette version est une mise à jour importante car il s'agit d'une cumulative, c'est à dire qu'elle regroupe l'ensemble des correctifs précédents apportés.\n \nChangelog : \n \n- Mise à jour cumulative\n- Scannez les couvertures des ROMS dans les couvertures_retro de multiMAN\n- Améliorations de l'algorithme d'analyse du contenu\n- Ajout de nouvelles balises de nom de fichier\n- Correction des entrées CUE/BIN en double dans le dossier ROMS\n \n \nTéléchargement : webMAN MOD 1.47.47\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196226/in-ps3-webman-mod-14747-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] UnlockSwitch présente enfin son Xtractor",
        "content": " \nIl aura fallu attendre un moment, mais le voilà enfin, la team UnlockSwitch officialise enfin son Xtractor. Comme promis lors des annonces précédentes, la team explique avoir ajouté le même port de programmation que l'UnlockSwitch. \n \nCela permet d'utiliser le même programmateur pour flasher les deux appareils. \n \n \n\n \n \nVous pouvez également transférer vos jeux originaux sur votre PC ou directement sur le port MicroSD du Xtractor. La team précise que le port microSD de la version de production sera orienté dans le même sens que la cartouche. \n \n \n\n \n\n \nElle annonce aussi qu'une vidéo de démonstration sera bientôt dévoilée, présentant la copie de jeux, les tests de transfert et d'autres fonctionnalités. Quant à la production en série du kit PBS complet, l'annonce, accompagnée de photos et de vidéos, sera partagée via le compte Twitter. \n \n \n\n \n \nTous les détails sur la date de début de production et le lancement officiel du UnlockSwitch PBS seront annoncés la semaine prochaine.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196209/in-switch-unlockswitch-presente-enfin-son-xtractor-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1196209/in-switch-unlockswitch-presente-enfin-son-xtractor-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1196209/in-switch-unlockswitch-presente-enfin-son-xtractor-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1196209/in-switch-unlockswitch-presente-enfin-son-xtractor-4.jpg"
        }
    },
    "news_15": {
        "title": "[PS5] Les développeurs améliorent leurs codes pour les firmwares 5.xx",
        "content": "Un travail important a été réalisé sur le récent exploit PS5 pour les firmwares 5.xx, les développeurs souhaitent clairement faire progresser les codes sur ces firmwares afin d'apporter le plus d'éléments. \n \nC'est le cas de Sleirsgoevy qui propose depuis quelques jours de nombreuses modifications sur ses paylaods. Il a modifié le code afin que nous puissions exécuter sa base de données prosperogdb et tous les éléments nécessaires pour porter ps5-kstuff vers les firmwares 5.xx. \n \nCela devrait permettre aux payloads de fonctionner sur des firmwares sans dlsym fonctionnel, et là il vise clairement les firmwares 5.xx. \n \n \n \nprosper0gdb, ps5-kstuff: use crt-elf-ps5\n \ncrt-ps5: support environment with no dlsym\n \nAdd \"pldldr\" payload\n \nlib: add ps5+frankenelf library\n \nps5-kstuff: failed performance optimization\n \nTéléchargement : ps4jb-payloads\n \n \n \n\n \n \nDe son coté, John Tornblom, quand à lui a mis à jour son SDK afin d'y ajouter le support des firmwares 2.70 et 5.xx.\n \nTéléchargement : ps5-payload-dev\n \n \n\n \n \nZecoxao propose une nouvelle version du HEN via https://zecoxao.github.io/hen3/ qui permet de charger ps5-kstuff, il a reprécisé que l'installation des PKG PS4 sur PS5 et que l'installation des PKG PS5 n'a rien à voir en terme de sécurité. La désactivation de l'hyperviseur ne vous permettra pas automatiquement d'installer les packages PS5, même si vous avez accès à la lecture et à l'écriture du kernel .text. Vous pouvez cependant utiliser la puissance supplémentaire pour essayer de désactiver le processeur principal a53io qui gère séparément les packages PS5, mais personne n'a encore essayé. Tous les jeux ne sont pas pris en charge, un nombre croissant de jeux ps5 utilisent de plus en plus le noyau a53io. \n \nLe développeur Specter vient d'annoncer que ChendoChap a travaillé sur la chaine ROP sous les firmware 3.00, et qu'il serait sage de rester sur un firmware très bas. Une idée vieille d'une année et qui fonctionne ! \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196184/in-ps5-les-developpeurs-ameliore-leur-code-pour-les-firmwares-5xx-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1196184/in-ps5-les-developpeurs-ameliore-leur-code-pour-les-firmwares-5xx-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1114865094.jpg"
        }
    },
    "news_16": {
        "title": "[PS4] Comment TheFlow a créé PPPwn en cassant KASLR de la PS4",
        "content": " \nKASLR est une fonctionnalité de sécurité standard du noyau Linux qui permet d'atténuer l'exposition aux vulnérabilités d'accès à la mémoire non encore découvertes et les conséquences de ces vulnérabilités en répartissant de manière aléatoire la valeur de l'adresse de base du noyau.\n \nTheFlow lors de sa présentation a montré comment il a pu créer PPPwn, en écrivant certaines parties du code en 5 minutes, et d'autres en plusieurs jours, et il explique comment il a contourné le KASLR sur PS4, sa démonstration ne fonctionnant que sur PS4, équipée de FreeBSD 9, alors que cela ne marchera pas sur PS5 équipée de FreeBSD 11. Entre les deux consoles, il y a quelques modifications de codes (syscalls, drivers) mais aussi une migration de la sécurité avec pour la PS5, des sécurités supplémentaires à passer comme celle de SMAP/SMEP, CFI et XOM. \n \n \n\n \n \n \nTheFlow explique qu'il dispose d'un client PPPoE et qu'il souhaite obtenir un serveur PPPoE afin d'y corrompre la mémoire. L'idée a été d'envoyer beaucoup de paquets d'adresse IPv6, avec une sollicitation importante, d'apporter une corruption, et d'envoyer des données contenant l'IPv6 voisine afin de créer le leak. \n \n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n \n \nL'obtention de la chaine ROP se fait en deux étapes, la copie de la chaine afin d'obtenir un pivot, puis la désactivation des protections d'écriture afin de pouvoir injecter le stage1 avec un payload. \n \n \n \n\n \n\n \n \n \nA la fin de sa présentation, il s'est amusé du fait que des dongles \"One-key JB Tool\" soient apparues en reprenant son travail pour une trentaine de dollars, des dongles fonctionnant sur firmwares 9.0 et 11.0.\n \n \n \n\n \n\n \n \nAndy Nguyen, après une référence à Specter et à la PS Vita, est revenu aussi sur le fait qu'il ne joue pas à des jeux, que son objectif est de trouver des failles dans la sécurité des systèmes, que c'est pour lui un passe-temps comme un autre, que ce n'est pas son travail principal, et qu'il publiera les sources de sa présentation, même si nous avons pu tout découvrir hier lors de la RomHack 2024 (intervention à partir de 7h10 jusqu' à la fin). \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-1.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-4.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-5.jpg",
            "image_7": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-6.jpg",
            "image_8": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-7.jpg",
            "image_9": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-8.jpg",
            "image_10": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-9.jpg",
            "image_11": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-10.jpg",
            "image_12": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-11.jpg"
        }
    },
    "news_17": {
        "title": "[3DS] Luma3DS v13.2 disponible",
        "content": "Le développeur TuxSH a déployé une nouvelle version de Luma3DS, il a mis en ligne la version 13.2 du meilleur CFW de la Nintendo 3DS. Comme vous le savez Luma3DS est le CFW indispensable pour les 3DS et 2DS et l'arrivée d'une nouvelle version est toujours intéressante à suivre. \n \n \n\n \n \n \nLuma3DS apporte des améliorations dans les paramètres des langues de jeux, le débogage amélioré pour les développeurs, ou encore le déverrouillage de région, cette nouvelle version 13.2 apporte des changements dans le menu Rosalina (L + pavé de commande bas + SELECT), diverses informations sur le système , telles que le type d'écran, peuvent désormais être affichées. Il existe également une nouvelle option pour les filtres d'écran permettant de \"corriger\" la courbe de gradation (courbe de couleur) de l'écran supérieur, mais cela n'a de sens que pour les écrans IPS ( à voir ce que cela donne en réalité ).\n \nTuxSH a récemment procédé à une rétro-ingénierie du module du système QTM, responsable du suivi du visage pour la \"Super-Stable 3D\" sur la New3DS. Cela a abouti à un autre sous-menu dans Rosalina, avec lequel Super-Stable 3D peut être calibré plus en détail et peut être temporairement désactivé/activé.\n \nLes plugins peuvent désormais également accéder au stockage privé, ce qui facilite l'accès au réseau - il est donc recommandé de n'utiliser que des plugins de confiance . Enfin et surtout, la première fois que vous démarrez Luma3DS, le répertoire /luma/payloads sera créé automatiquement.\n \n \nChangelog :\n \n- Ajout du sous-menu Rosalina « Informations système », affichant diverses informations système, notamment les types d'écran (TN/IPS, pour chaque écran)\n- Dans le sous-menu « Filtres d'écran » de Rosalina, ajoutez une nouvelle option pour « corriger » la courbe de couleur de l'écran supérieur. Cela améliore considérablement la sortie couleur des écrans supérieurs IPS , les rapprochant assez des écrans sRGB normaux (bien que les couleurs paraissent légèrement plus sombres) :\n- tous les écrans 3DS (TN et IPS) sont calibrés selon une courbe de couleur unique aux systèmes 3DS qui s'adapte à la faible gamme de couleurs des écrans TN\n- Cette option est aléatoire sur les écrans TN et conduit souvent à des résultats étranges. En effet, les écrans TN sur 3DS ont une gamme de couleurs terrible, en particulier dans les verts et les jaunes, même selon les normes de 2011 (et les écrans TN 3DS ont également un temps de réponse bien pire que les écrans IPS 3DS)\n- cela ne résout pas le problème d'écrasement noir sur les écrans IPS 3DS, dans certains cas, cela peut légèrement aggraver la situation\n- cette option peut être conservée dans la configuration de Luma3DS via « Enregistrer les paramètres »\n- open_agb_firm a la même fonctionnalité, c'est de là que vient le LUT utilisé ici\n- Suite à mon travail de reverse engineering sur QTM (face tracking, 3D super-stable), dans le sous-menu \"New 3DS\" Rosalina :\n- Sous-menu pour activer/désactiver temporairement la fonction « super-stable 3D » (SS3D) des New 3DS. Les modifications apportées ne persistent pas, pour modifier le comportement au démarrage, vous devez toujours aller dans les paramètres système comme avant\n- ajout d'un sous-menu pour tester les 12 positions de barrière de parallaxe utilisées lorsque SS3D est actif. Les modifications sont annulées lorsque vous quittez le sous-menu\n- ajout d'un sous-menu pour calibrer SS3D. Même si les paramètres système ont une fonction similaire, celle-ci a moins de limitations et affiche plus d'informations sur le processus à l'écran\n- Réorganisation des entrées de l'écran supérieur du menu Rosalina pour faciliter l'utilisation des options les plus couramment utilisées ; fusionner « Éteindre » et « Redémarrer » dans un seul menu\n- Autorisation des plugins à utiliser la mémoire PRIVÉE au lieu de PARTAGÉE sur les requêtes ( #2086 , rapport de bogue et PR original merci à@LittlestCube). Cela permet aux plugins d'accéder plus facilement au réseau. Téléchargez uniquement des plugins provenant de sources fiables.\n- Lors du processus de « premier démarrage de Luma3DS/mise à niveau de Luma3DS », créez le répertoire des charges utiles s'il n'existe pas. Cela devrait simplifier encore davantage le processus de piratage de la 3DS\n- D'autres améliorations de la stabilité globale du système et d'autres ajustements mineurs ont été apportés pour améliorer l'expérience utilisateur\n \n \nTéléchargement : Luma3DS v13.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196154/in-3ds-luma3ds-v132-disponible-1.jpg"
        }
    },
    "news_18": {
        "title": "[2DS/3DS] nds-bootstrap 2.0.1 et TWiLight Menu++ v27.9.0",
        "content": "nds-bootstrap 2.0.1 et TWiLight Menu++ v27.9.0 viennent d'être mise en ligne par RocketRobz, ainsi le patch anti-piratage pour SaGa 3 a été corrigé et lors du démarrage d'une rom NDS, il est désormais vérifié si le dump est défectueux. La qualité sonore sur DSi et 3DS a également été corrigée et quelques corrections de bugs ont été apportées aux thèmes. \n \n\n \n \n \nQuoi de neuf sur TWiLight Menu++ ?\n \n- Le correctif AP pour SaGa 3 a été corrigé pour fonctionner sur nds-bootstrap !\n- Le correctif AP (par RetroGameFan) ne fonctionnait pas à cause du code de patch de nds-bootstrap. La version corrigée du correctif AP déplace le code de branchement vers une zone où il n'est pas affecté par le code de patch de nds-bootstrap.\n- Ajout d'un correctif AP pour Okamiden (traduction espagnole) !\n- Si un .ndsfichier corrompu a été détecté, un message s'affichera désormais indiquant que le titre et/ou la carte SD sont corrompus et empêchera le lancement.\n- Veuillez noter que le système de détection n'est pas parfait et que certains .ndsfichiers corrompus peuvent toujours être lancés.\n- La vitesse de défilement du menu DSi d'origine a été restaurée pour le thème DSi !\n- Des icônes personnalisées peuvent désormais être attribuées à des fichiers argv individuels !\n- Pour un démarrage plus rapide des anciens homebrews DS (ainsi que GBARunner2), le Load Bootloaderparamètre est désormais défini Directpar défaut.\n- Paramètre supprimé Slot-1 Touch Mode.\n- En raison des améliorations apportées au changement de fréquence sonore, le mode tactile DSi a provoqué une sortie sonore de très faible qualité lorsque nds-bootstrap passe en mode tactile DS.\n- Cela signifie malheureusement que les jeux exécutés en mode DSi via l'accès SCFG pour l'emplacement 1 ne peuvent plus utiliser les fonctionnalités de l'appareil photo. - Toute tentative d'utilisation des fonctionnalités de l'appareil photo entraînera désormais le plantage du jeu.\n \nCorrections de bugs\n \n- Correction de la mauvaise détection de Harvest Moon DS Cute en tant que homebrew.\n- Thème 3DS : bouton inférieur fixe STARTsur l'écran tactile qui ne fait rien.\n- Thème DSi : animation déroulante fixe jouant 5 images derrière un écran blanc.\n- Thème DSi : écran supérieur fixe apparaissant avec une teinte blanche.\n- Correction d'un problème de sortie sonore de faible qualité sur les consoles DSi/3DS.\n \n \nQuoi de neuf sur nds-bootstrap ?\n \n- Suppression de l'indicateur de préchargement pour les anciens homebrews DS, car il n'existe aucun frontend (connu) qui l'utilise.\n- Les anciennes versions de certaines applications système DSi démarrent désormais.\n \nCorrections de bugs\n \n- Le patch Nookingtons solo pour Animal Crossing: Wild World n'affiche plus d'écrans noirs en mode B4DS !\n- Correction du mauvais placement du drapeau de fréquence sonore empêchant le démarrage de l'ancien homebrew DS (ainsi que de GBARunner2).\n- Pour un changement correct de la fréquence sonore DSi/3DS, le codec est désormais écrit.\n- Les données indésirables restantes sont désormais effacées avant le démarrage lors de l'exécution à partir de l'emplacement 1 avec accès SCFG.\n- Quelques optimisations mineures.\n \nTéléchargement : ds-bootstrap 2.0.1 et TWiLight Menu++ v27.9.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196132/in-2ds3ds-nds-bootstrap-201-et-twilight-menu-v2790-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] La conférence RomHack.io avec TheFlow c'est demain !",
        "content": "Pour rappel, mémoire ou information, c'est demain que si tiendra la conférence RomHack.io en Italie. C'est à Rome que se tiendra la RomHack Conference Training Camp où le gratin du hack mondial va présenter leur travaux en live. \n \nLe site internet parle de la plus grande édition de RomHack jamais proposée, avec une diffusion en direct en livestream sur Youtube ! \n \n \n\n \n \nSi tout est proposé en live, ce sera une première ! Nous aurons donc doit aux interventions en livestream, notamment de McCaulay Hudson, le développeur américain qui a proposé mast1c0re, mais surtout à la présentation de TheFlow (Andry nGuyen).\n \n \n\n \n \nNous allons enfin savoir ce que contient la présentation de TheFlow même si on en connait le fond, la \" PlayStation 4 Remote Kernel Exploitation \", il reste la forme à découvrir. \n \n \n\n \n \n \nTout se passera ici : \n \n \n\nhttps://www.youtube.com/live/u0vN74JgTGg?feature=shared\n \n\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196125/in-ps4-la-conference-romhackio-avec-theflow-cest-demain-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1196125/in-ps4-la-conference-romhackio-avec-theflow-cest-demain-1.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1196125/in-ps4-la-conference-romhackio-avec-theflow-cest-demain-2.png"
        }
    },
    "news_20": {
        "title": "[PS5] De nouveaux ELF du 1.xx au 4.xx sont disponibles et des tests sur 5.xx",
        "content": "De nouveaux fichiers ELF ont été produits par la communauté, notamment pour l'exploit UMTX à destination des firmwares 1.xx, 2.xx, 3.xx et 4.xx.\n \nCes ELF ont été proposés par sleirsgoevy, et permettent désormais de charger des payloads que vous ne pouviez pas charger auparavant, comme par exemple le ps5ftp de Sistr0, vous devriez maintenant pouvoir le faire, sur le port 9019.\n \nPour tester la chose, vous pouvez par exemple utiliser le site mis en place par Zecoxao : https://zecoxao.github.io/umtx2/ \n \nIl rajoute d'ailleurs que cela devrait également permettre de commencer à porter le Hen vers les firmwares 1.xx et 2.xx, afin de lancer votre distribution Linux préférée et démarrer le portage.\n \nA noter que les firmware 5.xx sont toujours sous la contrainte, pour le moment il reste complexe de développer des payloads pour ces firmwares, mais cela progresse ! \n \n \n\n \n \nComme promis Flat_Z vient de confirmer avoir corrigé le SDK pour les 5.xx. Il a travaillé cette nuit sur des payloads pour les firmwares 5.xx, ils sont en train d'être testés. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196092/in-ps5-de-nouveaux-elf-du-1xx-au-4xx-sont-disponibles-et-des-tests-sur-5xx-1.jpg"
        }
    }
}