{
    "news_1": {
        "title": "[PS5] PS5 Temperature v1.00 pour PS5 disponible",
        "content": "Le développeur Lapy le reconnait lui même cet utilitaire n'est fondammentalement utile, mais il propose tout de même PS5 Temperature en version 1.00.\n \nIl tient à remercier Zecoxao et LightningMods et il estime q'un bon nettoyage et de l'entretien régulier sont bien meilleurs.\n \n\n \n \n \nTéléchargement : PS5 Temperature (v1.00)\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185844/in-ps5-ps5-temperature-v100-pour-ps5-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PS4] PS4 PKG Manager Beta 3 disponible",
        "content": "Le développeur Hippie68 propose un nouveau logiciel depuis quelques jours pour la scène PS4, il s'agit de PS4 PKG Manager qui est proposé en version Bêta 3.\n \nCette application a été conçu pour lire les PKG de PlayStation 4, et elle fonctionne sous Windows, MacOS ou bien Linux, elle sert à créer, lire et gérer les fichiers en stockant les metadonnées dans une base de données. \n \nUne fois stockée, les PKG peuvent être visualisés sans avoir réellement un accès physique, une sorte de prévisualisation, l'utilisateur pouvant sélectionner divers éléments du menu contextuel, pouvant être étendu avec des commandes personnalisées, des actions personnalisées, et il est possible d'intégrer des outils tiers avec des arguments sous forme de commandes. \n \n\n \n\n \n \n \nChangelog : \n \n- Correction de la variable d'action personnalisée %dir% qui ne fonctionne pas dans Windows 11 lorsqu'il s'agit simplement d'un nom de lecteur (par exemple \"C :\").\n- L'ajout récursif de répertoires via le menu Fichier devrait maintenant être une expérience fluide.\n- Sous Windows 11, la boîte de dialogue \"Fermer l'onglet\" est maintenant correctement centrée.\n- Correction de l'impossibilité de supprimer toutes les actions personnalisées.\n- Les actions personnalisées dangereuses peuvent être préfixées par \"CONFIRMER\" pour demander une confirmation à l'utilisateur.\n- Nouvelles entrées du menu \"Édition\" : Inverser la sélection, Sélectionner (non) existant, Sélectionner (non) synchronisé.\n- Ajout de mnémoniques dans le menu.\n- Nouvelles entrées du menu contextuel : \"Copier dans la liste\" et \"Déplacer dans la liste\".\n- Le traitement des données n'est plus interrompu lorsque l'on quitte l'application, sauf si l'utilisateur le souhaite.\n- Les éléments de liste sélectionnés peuvent désormais être supprimés en appuyant sur la touche DEL.\n- Correction de la récursion des répertoires interrompue par des répertoires inaccessibles (par exemple Recycle.bin).\n- Le montage et le démontage des répertoires synchronisés (clés USB) devraient maintenant être détectés.\n- La barre d'état affiche \"Processing...\" si des données PKG sont en cours de traitement.\n- Correction de Ctrl-A qui ne fonctionne pas sur Windows 11.\n- Après l'exécution d'une action personnalisée, les fichiers PKG qui n'existent plus sont supprimés de la liste.\n- Autres petites corrections de bugs et améliorations.\n \n \n \nTéléchargement : PS4 PKG Manager Beta 3 \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185816/in-ps4-ps4-pkg-manager-beta-3-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1185816/in-ps4-ps4-pkg-manager-beta-3-disponible-2.png"
        }
    },
    "news_3": {
        "title": "[PS4] Le firmware 11.50 pourrait combler des failles récentes",
        "content": "Comme vous pouvez vous en doutez des failles importantes ont récemment été recensées auprès de Sony, même si nous ne savons toujours pas ce qu'elles concernent, il se murmure que cela aurait un rapport avec SSL ou TLS, elles ont besoin d'être corrigées par la marque. \n \nL'arrivée d'un nouveau firmware est toujours l'occasion pour les dataminers d'aller chercher ce qui a changé avec le précédent, en ayant accès à la Bêta il est alors possible de commencer l'analyse. \n \nSamet Takao a dévoilé la mise à jour PS4 v11.50 Bêta 1.00 datée du 16 Janvier 2024, mais la paternité du leak aurait été possible grâce à Kat et Raven. \n \n \n\n \n \nMême si cela n'a pas encore été confirmé, il y a bien aussi une version PS5 de cette mise à jour, cela pourrait être le firmware 8.50, mais rien n'est encore sûr . Une chose est certaine, le bug de Theflow doit probablement être corrigé, reste à voir si c'est également le cas de celui de Aapo. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185787/in-ps4-le-firmware-1150-pourrait-combler-des-failles-recentes-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] PS5 Temperature en préparation par Lapy",
        "content": "Le développeur Lapy vient d'informer sur son profil Twitter / X que Zecoxao a insisté pour qu'il prépare une version PS5 de son outil de surveillance et de modification de paramétrage de température, PS4 Temperature mais pour PS5, qu'il a nommé PS5 Temperature. \n \nD'après Lapy l'outil PS5 Temperature n'est pas encore très utile, du fait que tous les paramètres ne sont pas encore débloqués et aussi probablement que son impact n'est pas très flagrant ou convaincant. \n \n \n\n \n \nQue cela ne tienne, l'outil est donc proposé en privé pour le moment, il pèse 53.75 MB comme le montre l'image proposé par Lapy, mais il s'agit probablement de la première version Bêta, la version finale pourrait être un peu plus légère comme cela avait été le cas avec PS5 Xplorer. \n \nComme il a pu obtenir cette première version privée, Zecoxao, lui, de son côté, a dévoilé un premier screenshot de l'utilitaire. \n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185785/in-ps5-ps5-temperature-en-preparation-par-lapy-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1185785/in-ps5-ps5-temperature-en-preparation-par-lapy-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS5] PS5 Xplorer v1.01 disponible",
        "content": "Le développeur Lapy continue de nous régaler sur PlayStation 5, et offre une première mise à jour officielle à son outil PS5 Xplorer qui est désormais livré en v1.01. \n \nComme vous le savez PS5 Xplorer est l'un des meilleurs manager/utilitaire créé sous Unity et qui permet d'effectuer diverses opérations comme couper, copier, coller, renommer, supprimer des fichiers ou des dossiers, ou encore d'explorer le stockage de la console. \n \nAvec cette nouvelle version 1.01, le développeur vient corriger des problèmes liés aux traductions et prend en charge les avatars. \n \n \n\n \nChangelog PS5-Xplorer 1.01 :\n \n- Correction du support des traductions (uniquement en mode root).\n- Prise en charge des avatars (à partir des fichiers Avatar Maker).\n- Merci crump_youtube pour le test bêta \n \n \n \nTéléchargement : PS5 Xplorer v1.01\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185784/in-ps5-ps5-xplorer-v101-disponible-1.jpg"
        }
    },
    "news_6": {
        "title": "[3DS] Citra v2.0 avec mode multijoueur en ligne",
        "content": "L'équipe en charge du développement du fork de Citra, essentiellement représentée par PabloMK7, est de retour avec une grosse annonce concernant leur émulateur, vous le savez peut être mais ce fork de Citra permet de profiter du mode multijoueur en ligne via l'un des meilleurs émulateurs de Nintendo 3DS actuellement supporté. \n \nPabloMK7 dévoile donc la version 2.0 de son fork avec au passage le mode multijoueur avec de gros changements. Pour l'instant, il n'est possible de se connecter qu'au Nintendo Network, mais la prise en charge du Pretendo Network est prévue pour bientôt. La plupart des fonctionnalités en ligne ne fonctionnent pas encore correctement sur Android.\n\n \nChangelog de la version v2.0 :\n \n- Retravaillée avec les derniers changements de Citra, ce qui inclut de nombreuses améliorations de stabilité et une meilleure interface Android.\n- Correction de plantages dans de nombreux jeux lors de la mise en ligne (affectant certains jeux Monster Hunter et autres).\n- Implémentation de fonctionnalités manquantes nécessaires à certains jeux (Zelda : Tri Force Heroes et autres).\n- Ajout de la prise en charge de CTCert.bin, qui :\n- Permet de lier et d'utiliser un Nintendo Network ID.\n- Permet d'utiliser les serveurs de remplacement Miiverse (tels que rverse et Juxtaposition).\n- Permet de lancer l'eShop (uniquement si les données de sauvegarde NIM sont extraites d'une vraie console).\n- Permet d'utiliser le Nintendo Badge Arcade.\n- Nombreuses améliorations des services SpotPass, en permettant l'utilisation de LLE BOSS.\n \nMise à jour depuis la version 1.0 :\n \n- Quelques sections des instructions d'installation ont été mises à jour et doivent être refaites si vous avez utilisé cette fourche dans le passé :\n- Section II : Télécharger les fichiers système depuis les serveurs Nintendo\n- Section IV. Dump Console Unique Secure Data (CTCert.bin)\n- Section V. Activation des modules système LLE.\n \n \nPourquoi cela ne figure-t-il pas dans les versions officielles de Citra ?\n \n- L'équipe Citra est actuellement en pourparlers avec des avocats pour savoir s'ils veulent supporter le multijoueur en ligne dans leur émulateur (que ce soit Nintendo ou Pretendo). En attendant, PabloMK7 a décidé de fournir un fork avec le support du multijoueur en ligne. \n- Une fois que le support en ligne sera ajouté à la version officielle de Citra, ce fork sera abandonné.\n \n \nTéléchargement : Citra v2.0 avec mode multijoueur en ligne\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185715/in-3ds-citra-v20-avec-mode-multijoueur-en-ligne-1.png"
        }
    },
    "news_7": {
        "title": "[Wii] Le Wii Shop est de retour sur Wii hackée avec RiiShop",
        "content": "Connu à l'origine sous le nom de projet \"LaunchShop\", RiiShop marque le retour d'une solution de type WiiShop et elle est plutôt belle et bien construite. \n \nNintendo a suspendu l'accès aux nouveaux titres le 30 Janvier 2019, le Wii Shop ne laissant que la possibilité de retélécharger les jeux précédemment achetés. \n \nLancé il y a quelques jours, le 08 Janvier 2024, RiiShop permet de profiter sous une Wii hackée d'une boutique Wii, et ainsi de parcourir la console virtuelle, de profiter à nouveaux des WiiWare, mais aussi des chaînes Wii originales. \n \nPour pouvoir disposer de RiiShop, il vous faut installer un fichier au format Wadd installable à partir d'une Wii hackée. \n \n \n\n \n \n \nPour l'heure, RiiShop conserve le statut de Bêta, il est donc probable que vous découvriez ou subissiez quelques bugs liés à l'utilisation, ou comme nous pouvons le voir quelques lenteurs. \n \n \n\n \n \n \nPour en profiter il convient d'accéder au téléchargement par https://discord.com/invite/WQVNuGhzfc et d'aller dans la section Download et ainsi de profiter du fichier new_vps_shop.wad de 24.84 MB. Une fois la phase de Bêta passée, RiiShop sera livré au grand public.  \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185711/in-wii-le-wii-shop-est-de-retour-sur-wii-hackee-avec-riishop-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] Le Mig Switch sera-t-il rapidement soumis à reverse engineering",
        "content": "A la réception des premiers échantillons tests, les détenteurs de Mig Switch ont ouvert le linker, il faut avouer que c'est tentant car une simple vis qui se trouve en haut du dispositif renferme l'ensemble. Il ne demande qu'à être ouvert.\n \nQuoiqu'il en soit dès l'ouverture quelque chose se remarque c'est que les deux puces présentent ont été grossièrement effacées. Nous pourrions penser que c'est soit pour s'assurer auprès du fournisseur un stock sans contrainte, soit c'est pour éviter, ou du moins retarder, le reverse enginering de la solution proposée par Mig Switch. \n \n \n\n \n \n\n \nL'identification des deux puces principales du Mig Switch sont \"effacées\" par grattage\n \n \nOn peut déjà penser que certains ont l'intention d'exploiter le Mig Switch, soit pour proposer une puce directement fonctionnelle et intégrable dans la console, soit pour casser les sécurités de la solution, pour en exploiter le code, ou bien pour en comprendre le fonctionnement. \n \nD'autres pourraient aussi être intéressé du reverse engineering afin de copier le Mig Switch ou bien pour en créer des clones. \n \n \n \n\n \n \n\n \n \n \nBien entendu, comme vous pouvez vous en douter, la solution est bien entendu protégée que ce soit au niveau du hardware ou du software, et c'est exactement la même chose pour le dumper de cartouches de jeux.  \n \nSans réelle surprise le Mig Switch a été sécurisé au niveau de ses logiciels, et comme nous en informe Mike Heskin (Hexkyz) \" Sans surprise, les binaires de mise à jour sont cryptés, il faudra donc dumper tout ce qui s'exécute sur les puces réelles (qui sont très probablement un FPGA à faible coût pour émuler le LSI de la carte de jeu et un MCU pour les tâches de gestion générale).\n \nProposé à 60 euros, la solution sera copiée tôt ou tard, car cela va rapidement attiré des convoitises, car facile à vendre et à mettre en oeuvre. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185690/in-switch-le-mig-switch-sera-t-il-rapidement-soumis-a-reverse-engineering-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1185690/in-switch-le-mig-switch-sera-t-il-rapidement-soumis-a-reverse-engineering-1.png"
        }
    },
    "news_9": {
        "title": "[Switch] Le premier rapport de RyuJinx de 2024",
        "content": "Les développeurs de l'émulateur RyuJinx publient leur premier rapport de 2024, cela fait plaisir car nous attendions cela depuis 2 mois car en Décembre 2023 il n'y a eu aucun rapport. \n \nDes correctifs graphiques, des optimisations sur les appareils sur batterie, une amélioration des performances ou encore un élargissement de la compatibilité.\n \n \n \n\n \n \n \nOnt été ajouté plus de 700 jeux à la liste de compatibilité en 2023, ce qui porte le total des jeux testés (et signalés) sur Ryujinx à 4255. Plus de 83 % d' entre eux n'auraient aucun problème graphique, technique ou de stabilité , avec 12 autres. % de titres ayant au moins un problème. Cette catégorie est principalement remplie de titres présentant des problèmes graphiques mineurs ou des problèmes de stabilité. Dans d'autres systèmes de marquage, ils peuvent également être considérés comme jouables. Les 4,5% de titres restants ne progressent que jusqu'aux menus, voire pas du tout.\n \n \n \n\n \n \n \n \nEn ce qui concerne les performances, nous avons enregistré une amélioration moyenne de 36 % sur un an dans notre propre suite de jeux habituelle. Comme d'habitude, cela dépend fortement du jeu et du matériel.\n \nTout est là : blog.ryujink.org\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185675/in-switch-le-premier-rapport-de-ryujinx-de-2024-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1185675/in-switch-le-premier-rapport-de-ryujinx-de-2024-2.png"
        }
    },
    "news_10": {
        "title": "[PS5] Le hack de 50 000 $ sera partagé dans quelques temps",
        "content": "Le développeur Aapo Oksman, spécialiste et chercheur en sécurité des réseaux informatiques, confirme que c'est bel et bien lui qui a touché la prime de 50 000 $.\n \nLa prime a fait l'objet d'une confirmation sur le bug bounty HackerOne suite à la remonté d'un bug l'année dernière. Le développeur confirme que le rapport lui a rapporté une prime de 50 000 $ distribuée uniquement pour les vulnérabilités les plus critiques de la console.\n \nIl y a beaucoup de spéculations autour du rapport, c'est pour cela qu'il annonce qu'il prévoit de publier plus d'informations ultérieurement.\n \n \n\n \n \nIl prévoit de dévoiler ses conclusions lors d’une conférence sur la sécurité cette année. \n \nBien entendu on pourrait parler d'une conférence à Hardwear.io qui se tiendra du 28 Mai au 01 Juin 2024 au Santa Clara Marriott aux USA.\n \nReste à voir si tout cela pourrait être utilisable par d'autres pour une implémentation fonctionnelle. \n \nTout est là : AapoOksman\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185669/in-ps5-le-hack-de-50-000-sera-partage-dans-quelques-temps-1.png"
        }
    },
    "news_11": {
        "title": "[PS4/PS5] Chiaki4deck v1.6.1 disponible",
        "content": "Le développeur Streetpea propose une mise à jour de Chiaki4deck, il s'agit d'un fork de Chiaki qui est optimisé pour le Steam Deck, et qui permet de proposer une solution beaucoup plus solide, plus fluide, meilleure même au niveau sonore, affichage et restitution graphique que le PlayStation Portal. \n \nLe développeur l'a bien copris et propose régulièrement des mises à jour de son outil afin de l'améliorer souvent, et le support est large car il va de Linux, à Windows en passant par MacOS, les versions récentes ont apportés une amélioration de l'interface utilisateur tactile, et une expérience plus intuitive. \n \n \n\n \n \n \nChangelog v1.6.1 :\n- Petits correctifs\n- Mises à jour\n- Correction de l'enregistrement de la console\n- Correction du double-clic en plein écran et des raccourcis F11\n- Ne pas fermer la fenêtre principale lors de la fermeture de la session de streaming sur MacOS\n- Ajout d'une option pour mettre en veille la PlayStation lors de la mise en veille du Steam Deck\n \nChangelog v1.6.0 : \n- Apporte à Chiaki4deck une interface graphique tactile et navigable à l'aide d'un contrôleur.\n- Version Linux sur Flathub sous le nom io.github.streetpea.Chiaki4deck\n- Version Windows, version MacOS et version appimage attachées.\n- Nouvelle interface graphique tactile et semi-contrôlable\n- Support de MacOS et du moteur de rendu libplacebo pour Windows\n- Reprise de la connexion depuis le mode veille sur Steam Deck\n- Possibilité de se connecter à PlayStation pour obtenir l'identifiant du compte via l'interface graphique\n- Correction de Senkusha, réduction du temps de connexion à la console et réglage correct du MTU\n- Passage de l'audio à SDL, y compris la correction du décalage audio au cours de la session\n- Nouveau logo\n- Prise en charge de Qt6\n \n \n \nTéléchargement : Chiaki4deck v1.6.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185602/in-ps4ps5-chiaki4deck-v161-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] Une première vidéo du Mig Switch et le voilà démonté",
        "content": "Une nouvelle vidéo de fonctionnement du Mig Switch débarque, et oui les livraisons du Mig Switch arrivent, donc les tests vont fleurir. \n \nLa vidéo montre bel et bien que le fonctionnement est ultra simple, on insère le linker, qui intègre la carte microSD avec la ROM, et comme vous le savez le jeu démarre comme s'il s'agit de l'original. \n \nPas d'homebrew, pas d'Atmosphere, rien de tel n'est ouvert avec le linker, pour votre information la microSD devra être formattée au format exFAT.\n \nAttention, actuellement, uniquement un FULL dump de cartouche (ID, certificats, etc...) fonctionnent.\nUn XCI provenant d'internet ne fonctionne pas.\n \nLe seul moyen d'obtenir un FULL dump est de passer via une console déjà hack, et d'utiliser l'Homebrew NxDumpTool\n \n \n\n \n\n \n\n \n\n \n\n \n \n \nTout est là : https://twitter.com/RomainJ_\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185581/in-switch-une-premiere-video-du-mig-switch-et-le-voila-demonte-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1185581/in-switch-une-premiere-video-du-mig-switch-et-le-voila-demonte-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1185581/in-switch-une-premiere-video-du-mig-switch-et-le-voila-demonte-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1185581/in-switch-une-premiere-video-du-mig-switch-et-le-voila-demonte-4.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] Une première mise à jour firmware pour le Mig Switch",
        "content": "Alors que les toutes premières livraisons du Mig Switch devraient se faire dans les prochains jours, la Team dévoile la toute première mise à jour du firmware du linker. \n \n \n\n \n \n \nLa team dévoile un message simple : \n \n\" Nous publions aujourd'hui notre première mise à jour du firmware. La version 1.0.8 prend en charge les fichiers de jeux fractionnés (il n'est donc plus nécessaire de les concaténer). La version 1.0.8 a déjà été ajoutée aux unités de vente au détail du Mig Switch et Dumper, donc cette mise à jour est réservée aux unités de test et d'évaluation ! \" qui ont déjà été expédiés. \n \n \nInstallation du firmware sur le Mig Switch :\n- Placer le fichier update.s2 dans le dossier racine de la carte microSD du Mig Switch. \n- Réinsérez la carte microSD dans le Mig Switch.\n- Mettez le Mig Switch sous tension en l'insérant dans la console ou dans le Mig Dumper.\n- La lumière LED du Mig Switch clignotera en bleu pendant un court instant.\n- Lorsque la mise à jour est terminée, la lumière LED cessera de clignoter et restera bleue.\n- Ejectez le Mig Switch et il fonctionnera à nouveau normalement.\n \nInstallation du firmware sur le dumper :\n- Branchez le Mig Dumper via USB\n- Un périphérique de stockage de masse apparaîtra, avec un dossier 'System'.\n- Glisser-déposer le fichier update.s2 (téléchargé) dans le dossier 'System' de Mig Dumper, pour remplacer le fichier update.s2 qui s'y trouve.\n- Attendez que la copie soit terminée\n- Débranchez le Mig Dumper pour que la mise à jour prenne effet.\n \n \nLe firmware est disponible ici : migswitch.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185580/in-switch-une-premiere-mise-a-jour-firmware-pour-le-mig-switch-1.png"
        }
    },
    "news_14": {
        "title": "[PSP] PSPSident v2.0 et PSP IDPS Dumper v1.0",
        "content": "Le déblocage récent proposé par Zecoxao relance la scène PSP, et nous le devons également au développeur Yoti qui vient de mettre à jour PSP IDPS Dumper en v1.0, il n'avait pas proposé de mise à jour depuis Octobre 2022, mais également de PSPident qui lui passe en v2.0.  \n\n \nChangelog PSPident 2.0 : \n- Ajout de la sortie du fichier version.txt à l'écran\n- Ajout de la région Wi-Fi de l'IDS (sauf E1000)\n- Ajout du MAC Bluetooth de l'IDS (seulement PSP Go)\n- Le FW envoyé a maintenant sa propre ligne à l'écran\n- Détection partielle de TA-088v1/v2 (nouvel algo)\n- Suppression de la ligne dupliquée avec la génération\n- Ajout de la détection du QA Flag\n \nChangelog PSP IDPS Dumper v1.0 [PSP/PSV] :\n- psp qaf detection\n- les régions ont également leurs codes de vente au détail\n \n \n \n \nTéléchargement : pspIdent v2.0 / PSP IDPS Dumper v1.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185558/in-psp-pspsident-v20-et-psp-idps-dumper-v10-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS4] BwE annonce sa puce de développement dans un mois ou deux",
        "content": "Le développeur magasin réparateur BetterWayElectronics (BwE) annonce l'arrivée d'une puce (modchip) qui arriverait assez rapidement puisqu'il parle d'un à deux mois, cela nous ferait du mi-Février ou d'ici Mars. \n \nAu delà du délai, le développeur annonce que cette puce n'aura aucun lien avec le lecteur bluray, et qu'elle sera très abordable, voir même parfois gratuite ou offerte de deux manières (probablement avec l'achat d'un logiciel ou d'une prestation de réparation). \n \n \n \n\n \n \n \n \nComme le précise le développeur l'intérêt d'une telle puce n'est pas de proposer un custom firmware ou une possibilité de hack, mais plutôt la possibilité aux utilisateurs finaux de réparer certaines erreurs ou encore de faire des tests de stabilité. \n \nComme le précise à plusieurs reprises le développeur, la puce sera abordable, voir très peu chère.\n \nTout est là : BwE_Dev\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185550/in-ps4-bwe-annonce-sa-puce-de-developpement-dans-un-mois-ou-deux-1.jpg"
        }
    },
    "news_16": {
        "title": "[PSP] La Rom Kirk a été dumpée",
        "content": "Le développeur Zecoxao nous informe que la rom Kirk a finalement été dumpée, comme prévu il a fallu utiliser une arche obscure, qui s'appuie sur plusieurs commandes spécifiques, allant de 0 à 0x12. \n \nPour le moment, la manière dont a été réalisé le dump restera secrète pour l'instant, cette méthode est d'ailleurs en cours d'analyse pour l'utilisation des clés.\n \nUn module est en cours de développement, les développeurs a remercier sont Anonyme, Proxima, Davee pour le reverse engineering, et LemonHaze pour l'opcode. \n \n \n\n \n \nAucun lien ne peut exister avec la PS4 ou la PS5, cela ne concerne que la PlayStation Portable. Kirk est un obscur co-processeur crypté dans la PSP. \n \n \nTout est là : Kirk\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185549/in-psp-la-rom-kirk-a-ete-dumpee-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] GameBato Store v1.02 disponible",
        "content": "Une mise à jour de la version stable de GameBato vient d'être proposée par l'équipe en charge de son développement. GameBato est un store qui vous permet de profiter à ses pleines capacités de votre PS4 ou PS4 Pro sous firmware 5.05, 7.55 ou 9.00 car pour rappel, il facilite le téléchargement, l'installation de jeux et de DLC.\n \nUne fois n'est pas coutume, le changelog est assez maigre. \n \n \n\n \n\n \n \nVersion 1.01 disponible !\n \n- Augmentation du FPS de l'application GameBaTo de 200%. Maintenant, les utilisateurs peuvent avoir une expérience plus fluide de l'utilisation de l'application.\n \n- Possibilité d'utiliser l'option Quitter du menu de l'application ou appuyer sur le bouton CERCLE sur l'écran principal de l'application chaque fois que vous voulez fermer l'application.\n \n \nTéléchargement : https://gamebatoapp.ir/\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185519/in-ps4-gamebato-store-v101-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1185519/in-ps4-gamebato-store-v101-disponible-2.png"
        }
    },
    "news_18": {
        "title": "[PS5] Playstation 5 Cleaned ELF disponible",
        "content": "Le développeur Kameleon propose le portage de PS4-CleanELF sur PlayStation 5, il l'a simplement nommé PS5-CleanELF. Pour rappel, cet outil permet la création de fichier ELF, en prenant en charge le langage C++ et en incluant des importations et des classes. \n \nL'outil devrait permettre de faire fonctionner des ELF du firmware 3.00 au firmware 4.51, de nombreuses fonctions sont intégrées, il vous faudra la possibilité d'exécuter le fichier ELF en le chargeant avec jkpatch ou avec l'API de votre choix. \n \nBien entendu, il souhaite créer une interface graphique simple et conviviale pour utiliser au mieux l'utilitaire. \n \n \n\n \n \nComment l'utiliser :\n \n- Assurez-vous que cc1plus est installé (sudo apt-get install g++)\n- Allez dans le répertoire contenant le Makefile sous Linux Shell\n- tapez 'make'\n- Le fichier project.elf est votre exectuable\n- Charger avec jkpatch ou l'api de votre choix\n \n \n \nTéléchargement : PS5-CleanELF /  PS5Debug_Elf_Injection\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185509/in-ps5-playstation-5-cleaned-elf-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] PS5 Game Info v0.92B disponible",
        "content": "Le développeur Sinajet propose un nouvel utilitaire pour la scène PlayStation 5, il s'agit de PS5 Game Info, comme son nom l'indique il s'agit d'un outil compatible avec Windows capable de restituer certaines informations contenues dans les dumps de jeux PS5. \n \nLe programme PS5 Game Info va lire le fichier param.jason, l'interpréter et ainsi afficher son contenu dans un tableau prévu à cet effet. Le logiciel peut également analyser l'eboot.bin du jeu et ainsi vérifier s'il est authentique ou s'il s'agit d'un fake. \n \nAttention, le logiciel ne peut pas afficher le contenu des PKG, y compris les jeux PS4 ou PS5, il ne prend en charge que les dumps PS5, et uniquement PS5. \n \n \n \n\n \n \n \n \nFonctionnalités :\n \n- Lire le fichier param.jason et l'afficher sur le tableau (peut-être **PAS TOUS** les jeux, il doit être testé)\n- Détecter si le fichier eboot.bin est faux ou non (il ne vérifie que le fichier eboot.bin, pas les autres)\n- Obtenir la taille du dossier du jeu (Difficile à lire dans les propriétés)\n \n \nUtilisation :\n \n- Vous devez sélectionner le chemin du dossier de jeu, Le chemin du dossier de jeu est en fait le chemin où vous voyez le fichier eboot.bin.\nVous avez quatre façons de choisir le chemin du dossier de jeu :\n1- Sélectionnez l'icône de dossier sur l'application, sélectionnez le dossier de jeu.\n2- Copier le chemin du dossier de jeu, le coller dans un champ vide, puis appuyer sur la touche ENTER.\n3- Ouvrir le menu Fichier de l'application, choisir \"Ouvrir le dossier du jeu\", puis sélectionner le dossier du jeu.\n4- Aller dans le dossier Game (qui doit se trouver dans le chemin eboot.bin), faire un clic droit sur un fichier (comme eboot.bin ou eboot.bin.esbak ou contentids.json), sélectionner \"Open with\", puis ouvrir le fichier avec les informations du jeu PS5.\n \nNote 3 : Si vous choisissez la quatrième option, ne supprimez pas ou ne déplacez pas le fichier exe.\n \n \nTéléchargement : PS5-Game-Info v0.90B\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185506/in-ps5-ps5-game-info-v090b-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[Switch] NxFileViewer v2.7.0 disponible",
        "content": "Première version de 2024 pour NxFileViewer qui passe en version 2.7.0. Pour rappel NxFileViewer est un logiciel PC qui vous permet de parcourir les fichiers NSP, NSZ, XCI et XCZ et ainsi afficher tout un tas d'informations et de vérifier s'ils disposent de signatures, et d'afficher les hashs.\n \nCréée par le développeur Myster-Tee, le logiciel permet donc de visualiser et de parcourir le contenu des fichiers qui seront déplacés vers votre console Nintendo Switch, il vous faudra disposer des 3 clés (prod.keys, console.keys et title.keys) pour qu'il fonctionne correctement.\n \nLa mise à jour de LibHac en v0.19.0 permet diverses améliorations, comme la capacité à ne pas lire des zones qui ne devraient pas l'être et ainsi ne pas signaler des erreurs abusivement, les jeux qui utilisent de nouvelles clés principales sont désormais pris en charge. De plus, un message s'affichera si les prod.keys sont introuvables.\n \n \n \n\n \n \n \n \nChangelog 2.7.0 : \n \n- Basé sur LibHac v0.19.0\n- N'essaye plus d'ouvrir des sections clairsemées pour éviter de signaler des erreurs inattendues\n- Notification affichée lorsqu'aucune clé de prod. n'est trouvée\n- Mise à jour vers .NET 7\n \n \nTéléchargement : NxFileViewer v2.7.0 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185460/in-switch-nxfileviewer-v270-disponible-1.png"
        }
    }
}