{
    "news_1": {
        "title": "[Switch] switch_AIO_LS_pack 5.4.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.4.0.Pour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.Le homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables. Depuis cette news les évolutions sont les suivantes:- Changelog pour la version 5.3.0:Mise à jour du firmware inclue vers la version 16.1.0.Ajout du homebrew SimpleModDownloader.Mise à jour de Hekate, d'Atmosphere, de Goldleaf et de DBI vers la dernière version de ceux-ci.Mise à jour des fichiers de patches pour NXThemesInstaller.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.20.00:Certains petits fichiers utilisés par l'application sont téléchargés en mémoire plutôt que sur la SD, ceci augmente la vitesse de traitement et réduit l'usage de la SD.Correction d'un bug qui faisait que l'installation du forwarder du homebrew était activée quoi qu'il arrive si l'installation du forwarder du Homebrew Menu était activée.- Changelog pour la version 5.4.0:Mise à jour de Hekate, d'Atmosphere, de NXThemesInstaller, de NXMP, de Status-monitor-overlay, de Lockpick-RCM, de ma version de Incognito-RCM et de ma version de TegraExplorer vers la dernière version de ceux-ci.Mise à jour des fichiers de patches pour NXThemesInstaller.Mise à jour du logo Switch pour le futur firmware 17.0.0.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.20.01:Correction d'un bug au niveau de la détection de mises à jour.Ajout dune protection durant l'extraction du pack pour éviter que l'extraction ne soit tentée si le fichier dans le zip n'a pas de nom car cela pourrait supprimer le contenu de toute la SD.Pour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.Note: Pour traiter les problèmes particuliers de lancement de la sysnand en firmware 17.0.0 j'ai donc mis à jour le pack en 5.4.0 plut tôt que prévu vu que le firmware 17.0.0 'est pas encore pleinement compatible avec toutes les fonctionnalités, cette version intégrant donc la nouvelle version 1.6.1 d'Atmosphere avec le pack on peut régler le souci facilement. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.Sauf pour la correction de bugs je pense que le homebrew AIO_LS_pack_Updater est arrivé plus ou moins à sa version final, cependant si vous avez des idées pour l'améliorer autres qu'une interface graphique n'hésitez pas à m'en faire part (consultez le readme du Github du projet pour voir les choses que je voudrais faire mais que je n'arrive pas à faire pour l'instant ou les choses que je pourrais faire mais la flemme, c'est dans la todo list), si vous êtes développeur et que vous voulez proposer des pull requests elles seront les bienvenues si elles respectent l'esprit du projet (du C si le C++ n'est pas indispensable, par exemple on évitera de faire appel à des modules en C++ pour la traduction que j'aimerai d'ailleurs faire en pur C car là elle utilise un vecteur qui est du C++ se qui me plaît déjà moyennement).N'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets.Si vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_2": {
        "title": "[PS4] LightningMods montre encore ses progès sur ItemzFlow sur PS5",
        "content": "Le développeur LightningMods propose des nouvelles sur les étapes de construction de la version PS5 de son utilitaire ItemzFlow, son gestionnaire d'homebrews.\n \nItemzFlow sur PS5 s'appuie sur le fonctionnement récent découvert sur le firmware 4.03, donc pour le moment tant que ce dernier n'a pas été étendu sur d'autres firmwares, il sera impossible de l'utiliser, mais nous pouvons compter sur les efforts de certains pour y parvenir. Qui aurait cru il y a encore quelques semaines que cela allait arriver. \n \nLe développeur n'a pas précisé combien de modifications ont été nécessaires jusqu'à présent pour que Itemzflow fonctionne sur la PS5, ni quand il prévoit de le publier, mais il est clair que le projet est régulièrement mis à jour en dehors du github, afin que soit gardé privé les modifications apportées. \n \n \n \n\n \n\n \n \n \nLe développeur se sert de son expérience PS4 pour modifier les paramètres sur PS5 \" Il a fallu quelques inversions mais cela sera utile plus tard dans le store\", ou encore \" Oui, je suis allé plus loin et je viens de mettre à jour vers le firmware 4.03 puisque je fais des homebrews alors pourquoi pas, j'ai également automatisé la création du PKG donc après sa compilation, il crée le PKG en utilisant liborbispkg \".\n \n \n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-520974720.png"
        }
    },
    "news_3": {
        "title": "[Switch] Atmosphère 1.6.1 Pre-release disponible",
        "content": "Le développeur SciresM dévoile déjà une nouvelle version d'Atmosphère, il y a une heure le développeur a en effet proposé la version 1.6.1, toujours en pre-release. \n \n \n\n \n \n \nGrâce à l'équipe de @switchbrew, Atmosphère 1.6.1 est livré avec hbl 2.4.3, et hbmenu 3.5.1.\n \nCe qui suit a été modifié depuis la dernière version :\n \n- Une solution améliorée au problème qui faisait que les consoles qui avaient précédemment reconstruit leur partition SYSTEM se bloquaient lors de la mise à jour vers la version 17.0.0 a été ajoutée.\n- En particulier, le démarrage d'atmosphère détectera automatiquement le problème et débridera toutes les consoles qui sont tombées dans cet état.\n- Quelques améliorations ont été apportées à haze :\n- Les performances ont été grandement améliorées :\n- Le support de GetObjectPropList a été ajouté, ce qui réduit le nombre de requêtes de ~8x.\n- Haze effectue maintenant le rendu sur le GPU, libérant le CPU pour répondre aux requêtes de manière plus opportune.\n- Un problème a été corrigé dans la façon dont Haze configure bMaxPacketSize0, ce qui améliore le support de l'USB3.\n- Améliorations générales de la stabilité du système afin d'améliorer l'expérience de l'utilisateur.\n \n \nTéléchargement : Atmosphère 1.6.1 Pre-release\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181015/in-switch-atmosphere-161-pre-release-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] Les développeurs Sleirsgoevy et Specter multiplient les efforts sur PS5",
        "content": "L'obsession des développeurs Sleirsgoevy et Specter est de pouvoir offrir un portage du hack du firmware 4.03 de la PS5 vers d'autres firmwares, mais cela ne semble pas aussi évident que de le dire car trouver les failles n'est pas simplement de trouver quelques offsets. \n \nDepuis la publication de son long article, Sleirsgoevy a poussé quelques commits intéressants sur son référentiel github, et celui le plus marquant est celui qui fait référence à l'ajout d'un script python permettant de porter Propser0gdb et PS4 fPKG (aussi appelé PS5 kstuff) vers d'autres firmwares PS5 que le 4.03.\n \n \n \n\n \n \n \nLes deux mondes se croisent, le développeur Sleirsgoevy est en train de tenter de batir une version personnalisée du loader de ELF de Specter appelé \"FrakenELF\", les deux solutions étaient assez éloignées l'une de l'autre, il a falloir adapter les propositions. \n \nIl s'agit en quelque sorte d'une solution alternative, permettant au code de chercher un accès différent, si ce qu'il rencontre n'est pas directement compatible avec lui, ainsi l'idée serait d'utiliser le débogueur prosper0gdb en lui ajoutant le support de frankenELF pour tenter de trouver les offsets à modifier sur les autres firmwares. \n \n \nprosper0gdb : miscallenous\n- suppression des offsets inutilisés de la liste des offsets, pour réduire la recherche\n- réécriture du code de fuite de doreti_iret pour une meilleure efficacité\n \nps5-kstuff : ajout d'un outil de portage WIP\nActuellement, il trouve la plupart des décalages basés sur les données (pas très intéressants) et le décalage doreti_iret, les autres décalages sont à faire. \n \n \nTout est là : ps4jb-payloads\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180962/in-ps5-les-developpeurs-sleirsgoevy-et-specter-multiplient-les-efforts-sur-ps5-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] ezRemote client, sys-CLK, SwitchThemeInjector, NxThemes Installer...",
        "content": "Que de nouveautés côté homebrews pour la Nintendo Switch, de nombreux programmes ont été mis à jour par leur auteur, ezRemote client, sys-CLK, SwitchThemeInjector, NxThemes Installer, ou encore Status Monitor Overlay, ont tous été mis à jour, faisons le tour du propriétaire.\n \n \nSwitch Ezremote Client\n \n \n\n \nezRemote Client est une application de gestion de fichiers qui vous permet de connecter la Switch à des serveurs FTP, SMB, WebDAV distants pour transférer et gérer des fichiers. Il remplace les applications \"Switch SMB Client\" et \"Switch FTP Client\".\n \nQu'est-ce qui est différent ?\n \n- Pour les opérations sur un seul fichier, il n'est plus nécessaire de \"marquer\" le fichier/dossier avec le bouton \"Y\" avant que les éléments de menu ne soient activés.\n- Ajout de la fonction couper, copier, coller pour les fichiers locaux\n- Ajout d'un éditeur de texte\n- Ajout de la prise en charge du serveur WebDav.\n- Une seule application pour accéder à FTP, SMB et WebDav\n- Testé avec les serveurs WebDAV suivants :\n(Recommandé) RClone - Pour héberger votre propre serveur WebDAV. Vous pouvez utiliser le serveur WebDAV de RClone comme proxy vers plus de 70 services d'hébergement de fichiers publics (par exemple Google Drive, OneDrive, Mega, Dropbox, NextCloud, etc.)\nDufs - Pour héberger votre propre serveur WebDAV.\nSFTPgo - Pour un serveur WebDAV hébergé localement. Peut également être utilisé comme frontal webdav pour le stockage en nuage comme AWS S3, Azure Blob ou Google Storage.\n \nTéléchargement : ezRemote client v1.00\n \n \n \nLe sysmodule sysclk\n \nEnorme mise à jour pour Sys-clk qui est proposé désormais en v2.0.0-rc (release candidate), la version précédente était la v1.0.3. Ce sont 69 changements dans les fichiers, 14 commits qui ont été apportés, mais voici les principales modifications :\n \n- sys-clk n'intègre plus les tables de fréquences, et les obtient désormais du HOS au démarrage.\n- Les fréquences réelles/instantanées et la consommation de la batterie peuvent maintenant être imprimées dans les rapports overlay, manager, logs et csv.\n- La prise en charge du firmware 17.0.0 a été ajouté.\n- Si vous remarquez des bugs ou des comportements bizarres (en particulier sur HOS < 7.0.0), vous pouvez créer un problème sur le repo, ou envoyer un message dans le Discord RetroNX.\n \n \nTéléchargement : sys-clk 2.0.0-rc\n \n \n \n \nSwitch Theme Injector et NX Themes Installer\n \n \n\n \n \nLes deux programmes ont été mis à jour par Exelix11, SwitchThemeInjector passe en 4.7.1 et NXThemesInstaller en 2.7.1, c'est surtout le support du firmware 17.0 qui a été ajouté , et quelques corrections et patchs.\n \nTéléchargement : Switch Theme Injector 4.7.1 et NX Themes Installer 2.7.1\n \n \n \nStatus Monitor Overlay\n \nConcernant Status Monitor Overlay, les problèmes survenus sur la version 17.0.0 du firmware ont été résolus, dans la version précédente, les températures du SoC et du PCB affichaient toujours la valeur 0 et les informations sur le type de chargeur, la tension maximale et le courant maximal du chargeur étaient incorrectes. Ces problèmes appartiennent désormais au passé.\n \nLes températures du SoC et du PCB affichent désormais des valeurs décimales, offrant un affichage plus précis de la température. La nouveauté est le temps estimé restant jusqu'à ce que la Switch s'éteigne, qui est désormais affiché à côté de la consommation d'énergie de la batterie dans les modes Full, Mini et Micro. Pour une meilleure lisibilité, l'affichage de la RAM en mode micro a été modifié de Mo à Go et affiche également une décimale. Également en mode micro, la consommation d'énergie n'est indiquée qu'avec une seule décimale ; Ceci s'applique également à l'affichage du niveau du ventilateur dans tous les modes.\n \nSur le firmware 17.0.0, audsnoop n'est plus disponible. Cela signifie que l'utilisation du DSP ne sera désormais plus affichée dans l'onglet \"Autre -> Divers\".\n \nProblèmes de firmware 17.0.0 résolus :\n- Températures du SoC et du PCB affichant 0\n- Type de chargeur, tension maximale du chargeur et courant maximal du chargeur affichant des valeurs erronées\nModifications générales :\n- Les températures des SoC et des PCB sur tous les FW affichent désormais des décimales.\n- À côté de la consommation de batterie dans les modes Full, Mini et Micro, vous pouvez désormais voir également le temps estimé restant avant l'arrêt du Switch (merci à rkuchkarov pour le PR #56)\n- Dans Micro, au lieu de Mo pour la RAM, vous verrez désormais Go jusqu'à une décimale\n- Dans Micro, la consommation électrique n'affiche désormais qu'une seule décimale\n- Le niveau du ventilateur n'affichera désormais qu'une seule décimale dans tous les modes\n- Divers affiche désormais également les horloges NVENC et NVJPG (merci à Averne pour le PR #57)\n- Étant donné que la version 17.0.0 audsnoop n'est pas disponible, l'utilisation du DSP n'est pas affichée dans l'onglet Autre -> Divers.\n \n \nTéléchargement : Status Monitor Overlay 0.9.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180929/in-switch-ezremote-client-sys-clk-switchthemeinjector-nxthemes-installer-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1180929/in-switch-ezremote-client-sys-clk-switchthemeinjector-nxthemes-installer-2.jpg"
        }
    },
    "news_6": {
        "title": "[PSP] PKGi PSP v1.0.0 disponible",
        "content": "Alors là c'est très intéressant de voir que la PSP attire toujours un peu de monde, le développeur Damian Parrino plus connu de nous sous le pseudonyme de Bucanero, nous propose la mise à jour de PKGi pour la PSP en version v1.0.0.\n \nClairement cela va faire revivre la PSP, après l'arrivée de Pandora Batterie pour la PSP Go, PSP Apollo Save Tool, voilà donc qu'il a mis à jour la v0.8.0 qu'il a proposé il y a environ 2 semaines. \n \nVitesse de téléchargement multipliée par 2 (jusqu'à 500 Ko/s), de nombreuses nouvelles fonctionnalités : installez .pkg au format ISO/CSO/Digital, prise en charge de la PSP Go, recherche, décryptage et installation de thèmes, mise à jour des fichiers DB en ligne, prise en charge du proxy réseau https ... \n \n \n \n\n \n \n \nPKGi PSP v1.0.0 :\n \nAjout\n- Installation du paquet comme ISO/CSO/Digital\n- Détection du stockage interne de PSP Go (ef0/ms0)\n- Mise à jour des fichiers de la base de données à partir des URL (option Refresh)\n- Activation de l'option Recherche (clavier à l'écran)\n- Ajout de la catégorie PSX\n- Vérification et notification de la nouvelle version de PKGi\n \nCorrection :\n- Installation et décryptage des thèmes dans /PSP/THEME/\n \nDivers\n- Amélioration de la vitesse de téléchargement (jusqu'à 500 Kb/s)\n- Prise en charge des paramètres de proxy réseau\n \n \nTéléchargement : PKGi PSP v1.0.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180914/in-psp-pkgi-psp-v100-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[PS4] GameBato Store v1.22 disponible",
        "content": "Le store GameBato, qui permet pour rappel de profiter à ses pleines capacités de votre PS4 ou PS4 Pro sous firmware 5.05, 7.55 ou 9.00, est désormais proposée en version v1.21.\n \nLes nouveautés sont encore une fois nombreuses et il est intéressant de voir à quoi les développeurs ont pensé pour faire évoluer leur solution. \n \n \n\n \n \n \nChangelog 1.21 :\n \n- Ajout d'un système de vérification pour déterminer les paquets corrompus pendant le téléchargement. Les utilisateurs peuvent être informés de la corruption d'un paquet plus tôt au cours du téléchargement, de sorte qu'ils peuvent supprimer le téléchargement de la liste et réinsérer le paquet dans leur liste de téléchargements.\n- Amélioration de la vitesse de navigation dans l'application. Appuyez également sur le bouton R1 et maintenez-le enfoncé pour naviguer plus rapidement dans les sections de l'application.\n- Correction d'un problème qui désinstallait l'application GameBaTo lorsque l'utilisateur essayait d'ajouter un téléchargement en mode console qui était déjà présent alors qu'il était arrêté dans le centre de notification de la console.\n- Correction d'un problème qui faisait que les téléchargements des utilisateurs qui avaient oublié d'utiliser Quitter pour fermer l'application tombaient à un pourcentage inférieur ou se réinitialisaient à zéro pour cent.\n- Correction d'un problème entraînant le blocage du processus de sortie dans l'écran de dialogue Closing GameBaTo.\n- Correction d'un débordement de chiffres dans les statistiques d'espace de stockage du disque dur affichées dans la section Téléchargements. \n- Effacement des fichiers temporaires lorsque l'utilisateur ferme l'application.\n- Correction de nombreux problèmes mineurs.\n \n- Et n'oubliez pas d'utiliser Exit à l'intérieur de l'application lorsque vous voulez fermer l'application. La fermeture forcée de l'application peut entraîner l'effacement de la liste des téléchargements en cas de panique de l'appareil.\n \n \n \nTéléchargement : gamebatoapp.ir\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180843/in-ps4-gamebato-store-v121-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[PS5] Le dashboard ItemzFlow en développement pour la PS5",
        "content": "Le développeur LighningMods précise notre news sur l'arrivée des homebrews sur PS5, l'animation que nous avons pu voir il y a quelques jours, était celle du fonds d'écran d'Itemzflow Game Manager, un manager de jeux qui est déjà proposé depuis quelques mois sur la PS4. \n \nAvant l'arrivée des jeux sur le dashboard officiel appelé XMB, il fallait passer par un dashboard proposé sous forme d'homebrew, notamment sur PS3, le projet avait été porté sur PS4 pour bénéficier d'un store. \n \nIl permet aussi d'autres opérations comme le dump de jeux, la lecture de fichiers multimédia ou encore de bidouiller un peu les paramètres de la console. \n \n \n\n \n \nPour la PS4, ItemzFlow avait nécessité plusieurs mois de développement pour bien comprendre le ShellUI de la PS4, et bien sur PS5 ce sera la même chose.\n \nBien entendu, pour le moment, le logiciel ne supporte que le contenu PS4, et toutes les options ne sont pas encore là, il faudra probablement un temps assez conséquent pour que l'ensemble des fonctionnalités soient portées. \n \n \n \n",
        "images": {}
    },
    "news_9": {
        "title": "[Switch] MissionControl compatible firmware 17.0.0",
        "content": "Le développeur ndealy propose la mise à jour de MissionControl qui est désormais compatible avec le nouveau firmware 17.0.0. Le « Atari Modern Wireless Controller » est également pris en charge et le pavé de commande du 8BitDo Zero a été remappé sur le stick analogique gauche.\n \nDes ajustement des commandes de mouvement sur les contrôleurs Sony et la correction d'un problème avec la Dualshock 4 où l'état du bouton de capture d'écran ne se réinitialisait pas correctement lorsque le pavé tactile était enfoncé ont été corrigés. \n \n \n\n \n \n \nChangelog : \n \n- Ajout de la prise en charge complète du firmware 17.0.0.\n- Ajout de la prise en charge des contrôleurs sans fil Atari Modern.\n- Mappé le D-pad 8BitDo Zero comme stick analogique gauche pour améliorer la compatibilité du jeu.\n- Suppression du facteur d'échelle gyroscopique inutile pour les contrôleurs Sony. Les rotations du contrôleur devraient désormais être plus sensibles/précises.\n- Correction d'un problème où l'état du bouton de capture n'était pas réinitialisé après le relâchement du bouton du pavé tactile Dualshock 4.\n \n \nTéléchargement : MissionControl 0.10.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180768/in-switch-missioncontrol-compatible-firmware-1700-1.jpg"
        }
    },
    "news_10": {
        "title": "[Switch] Hekate v6.0.7 &#38; Nyx v1.5.6 disponibles",
        "content": "Le développeur CTCaer vient de mettre en ligne il y a quelques heures Hekate v6.0.7 & Nyx v1.5.6.\n \nDans le monde de la personnalisation et du hack de la Nintendo Switch, le nom \"Hekate\" continue à susciter l'intérêt des passionnés. Hekate, un custom bootloader largement utilisé pour la Nintendo Switch, vient d'être mis à jour par CTCaer qui a également mis à jour NyX. Hekate sert de point d'entrée pour de nombreux utilisateurs souhaitant explorer les capacités personnalisées de leur console Nintendo Switch. Depuis sa création, il a été utilisé pour lancer des homebrews, des backups de jeux, et d'autres logiciels personnalisés, offrant ainsi aux joueurs une expérience différente de celle prévue par Nintendo.\n \n \n\n \n \nL'écosystème qui entoure Hekate comprend une communauté active qui partage des connaissances, des tutoriels et des expériences sur des plateformes en ligne. En résumé, Hekate continue d'évoluer en tant qu'outil majeur pour les passionnés de la Nintendo Switch qui souhaitent personnaliser leur expérience de jeu, cette nouvelle version n'échappe pas à la règle quand on découvre le changelog, même si le support du dernier firmware 17.0.0 peret déjà de nous satisfaire à lui seul. \n \nChangelog hekate v6.0.7 :\n- Prise en charge du support du firmware 17.0.0\n- Optimisation de HOS INI1 lorsqu'il peut tenir dans la région du kernel.\n- L4T : Autorise le sous-voltage de la RAM pour les fréquences stockées.\n- L4T : Correction de certains timings pour Arachne qui étaient plus élevés qu'ils n'auraient dû l'être.\n \nChangelog emuMMC :\n- Prise en charge du support du firmware 17.0.0\n- Comme toujours basé sur https://github.com/m4xw/emuMMC\n \nChangelog Nyx v1.5.6 :\n- Prise en charge du support du firmware 17.0.0\n- K4U6E3S4AB-MGCL dram a été validé par photo et est maintenant correctement nommé dans info\n \n \nTéléchargement : Hekate v6.0.7 & Nyx v1.5.6\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180741/in-switch-hekate-v607-nyx-v156-disponibles-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] Atmosphère compatible avec le firmware 17.0.0 disponible",
        "content": "Le développeur ScireM propose la version 1.6.0 d'Atmosphère qui est désormais compatible avec le firmware 17.0.0, la version 1.6.0 est la soixante-quinzième version officielle d'Atmosphère.\n \nRemarque : Atmosphère 1.6.0 est actuellement en pré-version et des problèmes peuvent survenir et doivent être résolus avant la sortie complète.\n \nSi des bugs sont signalés alors qu'Atmosphère est en pré-version, ils seront corrigés et la version sera mise à jour. La version 1.6.0 passera à la version après un court laps de temps sans appuyer sur les rapports de bugs. Atmosphère 1.6.0 est fourni avec hbl 2.4.3 et hbmenu 3.5.1.\n \n \n\n \n \n \nLes éléments suivants ont été modifiés depuis la dernière version :\n \n- Un support de base a été ajouté pour le firmware 17.0.0.\n- La console devrait démarrer et l'atmosphère devrait être entièrement fonctionnelle. Cependant, tous les modules n'ont pas été entièrement mis à jour pour refléter les dernières modifications.\n- Il ne devrait y avoir rien de visible par l'utilisateur à cause de cela, mais cela sera résolu dans une prochaine mise à jour d'Atmosphere.\n- exosphèrea été mis à jour pour refléter le dernier comportement officiel du moniteur sécurisé.\n- mesosphèrea été mis à jour pour refléter le dernier comportement officiel du noyau.\n- ncma été mis à jour pour refléter le dernier comportement officiel.\n- erpta été partiellement mis à jour pour prendre en charge le dernier comportement officiel.\n- Le gdbstub d'Atmosphere prend désormais en charge l'attente de connexion à un identifiant de programme spécifique au lancement (par opposition à n'importe quelle application).\n- La commande de surveillance pour cela est monitor wait <hex program id>, où l'identifiant du programme peut éventuellement avoir un 0xpréfixe.\n- La prise en charge a été ajoutée hazepour l'édition de fichiers sur place et l'exécution de transferts 64 bits (fichiers de plus de 4 Go).\n- bpc.mitma été activé sur les unités Mariko et déclenche désormais des arrêts/redémarrages basés sur pmic (merci@CTCaer), cela devrait empêcher la console de se réveiller environ 15 secondes après l'arrêt de Mariko.\n- Un certain nombre de problèmes mineurs ont été résolus et des améliorations ont été apportées, notamment :\n- Une solution de contournement a été ajoutée pour un changement dans la version 17.0.0 qui entraînerait le blocage des consoles qui avaient précédemment reconstruit leur partition SYSTEM lors de la mise à jour vers la version 17.0.0.\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \n \n \nTéléchargement : Atmosphère 1.6.0 Pre-Release\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180708/in-switch-atmosphere-compatible-avec-le-firmware-1700-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[Vita] Les gagnants du concours FuHEN sont là",
        "content": "Voilà c'est désormais bel et bien terminé pour le concours FuHEN qui une nouvelle fois cette année nous a proposé des pépites. Le concours a fait le choix de ses gagnants puisque ce sont pas moins de 2000 $ de gains qui ont été versés. \n \nOrganisé un tel concours est prenant et clairement nous devons remercier les organisateurs de ce concours FuHEN qui permet de profiter encore un peu de nos PlayStation Vita, et de l'étendu des possibilités offertes par les développeurs. \n \nCe concours a pu réunir pas moins de 40 propositions d'homebrews, distillés au travers de jeux, d'utilitaires et de portages. \n \n \nVoilà le classement : \n \nNuméro 3 : The World Ends with You , prix de 300 $\n \nThe World Ends with You est un jeu de rôle et d'action initialement développé pour la Nintendo DS, se déroulant dans le quartier commerçant moderne de Shibuya à Tokyo. Le développeur  Hatoving  (dont vous vous souvenez peut-être de son  portage Vita de Monument Valley ) a publié ce portage pour PS Vita basé sur la version Android. Il obtient la médaille de bronze au concours, ce qui lui rapporte 300$ !\n \n \n\n \n \nTéléchargement : The World Ends with You  \n \n \nNuméro 2 : VitaHot , prix de 530 $\n \nVitaHot est une démo basé sur le portage du jeu SuperHOT où le temps ne bouge que lorsque vous bougez - pressé sur la Vita avec la physique activée et un framerate constant et soyeux. Les développeurs MRKane et digradi ont tenu leurs promesses sur cette version et ont reçu 530 $.\n \n \n\n \n \nTéléchargement :  VitaHot  \n \n \nNuméro 1 : Purified\n \nLe développeur Balder a travaillé sur Purified depuis un bon moment. Des graphiques détaillés, des musiques de Brian Czernikowski d'une qualité exceptionnelle, et surtout un gameplay impressionnant. Clairement le jeu mérite son première place. \n \n \n\n \nTéléchargement : Purified  \n \n \nD'autres homebrews ont été mis en avant comme le jeu le plus original, comme Dream Punk, Feline Future  ou encore Gnomopolis, et au niveau utilitaire ce sont ezRemoteClient (1er), Vita TRP Builder et Genki Vocab qui sont récompensés. \n \n \n\n \n \nLe meilleur portage est Late Shift, proposé par Rinnegatamante, Professor Layton, et Gone Home.\n \n \n \nTous les résultats sont là : Résultats du concours FuHEN\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180671/in-vita-les-gagnants-du-concours-fuhen-sont-la-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1180671/in-vita-les-gagnants-du-concours-fuhen-sont-la-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1180671/in-vita-les-gagnants-du-concours-fuhen-sont-la-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1180671/in-vita-les-gagnants-du-concours-fuhen-sont-la-4.png"
        }
    },
    "news_13": {
        "title": "[Switch] Lockpick RCM 1.9.11 et TegraExplorer 4.1.1",
        "content": "Le développeur suchmememanyskill propose les mises à jour de Lockpick RCM et de TegraExplorer. \n \nConcernant TegraExplorer il s'agit en fait de la v4.1.0-b1, avec 2 changements :\n \n- bleck9999 a ajouté que les boutons d'alimentation et de volume peuvent toujours être utilisés comme haut/bas/a . Le clavier est aussi maintenant corrigé avec seulement les contrôles d'alimentation et de volume.\n- Le script firmwaredump n'essaye plus automatiquement de lire le firmware\n \nTéléchargement : TegraExplorer 4.1.1\n \n \n \n\n \n \nCôté Lockpick RCM, après un retrait DCMA, le code source est hébergé sur un serveur en dehors des États-Unis, où le DMCA ne s'applique pas. Pour rappel il s'agit d'un payload pour la Nintendo Switch qui va avoir la charge de dériver les clés de cryptage pour pouvoir utiliser des logiciels de manipulation de fichiers Switch comme hactool, hactoolnet/LibHac, ChoiDujour... sans démarrer Horizon OS.\n \nCette nouvelle version apporte le support du firmware 17.0.0 disponible depuis quelques heures. \n \n \nTéléchargement : Lockpick_RCM 1.9.11\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180665/in-switch-lockpick-rcm-1911-et-tegraexplorer-411-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] Les homebrews se rapprochent sur PS5",
        "content": "Le développeur LightningMods vient de publier une vidéo avec un texte laissant peu de doute. La première information provient d'un tweet nous apprenant que lors de la sortie de la mise à jour du site Web PKG-Zone ( https://pkg-zone.com ), ils ont ajouté la prise en charge sur le site Web des FPKG PS5 HB et PS5 compatibles PS4 et qu'ils mettront à jour davantage de PKG de jeux HB. \" Bientôt compatible PS5 \" . \n \nLa seconde petite information vient de son dernier tweet dans lequel il dit \" Le commencement \" avec une vidéo de ce qui serait un homebrew, assez propre d'ailleurs. \n \n \n\n \n \n",
        "images": {}
    },
    "news_15": {
        "title": "[Switch] Nintendo sort le firmware 17.00 pour la Switch",
        "content": "Nintendo a encore frappé cette nuit en sortant le firmware 17.00 pour sa Nintendo Switch, et ses dérivées. \n \nCette mise à jour ne contient encore une fois que des modifications « sous le capot ». Comme il faut le savoir, les numéros de version ne reflètent pas les modifications externes, mais plutôt les modifications internes des API et des interfaces. Selon SwitchBrew de nombreuses modifications ont été apportées,\n \nAtmsphère ne fonctionne pas encore, SciresM va s'efforcer de publier une mise à jour avant le week-end.\n \n \n\n \n \n \nVer. 17.0.0 (publiée le 10 octobre 2023)\n \n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \n \n \nLes rapports Yellow's8 sont là : yls8.mtheall.com\n \n \nLien vers Nintendo USA : en-americas-support.nintendo.com\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180631/in-switch-nintendo-sort-le-firmware-1700-pour-la-switch-1.png"
        }
    },
    "news_16": {
        "title": "[PS5] La PS5 Slim annoncée officiellement par Sony",
        "content": "On vous l'avait annoncé, la voilà désormais c'est officiel, la PS5 Slim est officialisée, bon on parle de Slim, mais dans quelques années, il y aura certainement une SuperSlim car des progrès sont encore réalisables. \n \nNe gâchons pas notre plaisir, la PS5 Slim si on la compare avec la PS5 FAT, voit son volume être réduit de 30 %, son poids réduire de 18 % et 24 %.\n\n\n \n \n \n \nPour simplifier la production, Sony lance 2 modèles, mais finalement il s'agit du même, d'un côté un lecteur amovible est présent de l'autre non. Niveau coque, il y a quatre panneaux de couvertures séparés, avec la partie supérieure d'aspect brillant, tandis que la partie inférieure reste mate. Si vous achetez la PS5 Digital Edition, vous pourrez ajouter ultérieurement le lecteur de disque Blu-ray Ultra HD contre 99 euros, celle-ci ne faisant que 2.6 Kg.\n \n \n \n\n \n \n \nD'ailleurs la PS5 avec lecteur de disque Blu-ray Ultra HD sera vendue à partir de 549,99 EUR, à compter de Novembre aux USA, puis plus tard dans le monde, tandis que l'Édition numérique PS5 sera commercialisée 449,99 EUR.\n \n \n\n \n \nNiveau hardware, il y a un changement de conception du PCB, mais il y a aussi une petite évolution au niveau du stockage puisque ce sont enfin 1 To qui sera intégré et pas 825 Go, cela ne changera pas grand chose, mais au moins cela remet les pendules à l'heure sur ce point. \n \n \n \n\n \n \nLe port USB-A qui était en façade sur la PS5 FAT disparait laissant désormais place à deux ports USB-C, là aussi ça devenait étrange de voir ce type de port.\n \nLe socle fourni ne permettra plus de mettre la console à la verticale, il faudra en acheter un autre 29.99 euros, il n'y a pas de petite carotte économique chez Sony.\n \n \nL'annonce officielle est ici : blog.playstation.com\n \n \nSortir un modèle Slim, c'est aussi moins de port, de transport, moins de matière, au niveau mondial, les économies devraient, à terme, permettre de baisser le prix de vente.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180613/in-ps5-la-ps5-slim-annoncee-officiellement-par-sony-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1180613/in-ps5-la-ps5-slim-annoncee-officiellement-par-sony-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1180613/in-ps5-la-ps5-slim-annoncee-officiellement-par-sony-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1180613/in-ps5-la-ps5-slim-annoncee-officiellement-par-sony-4.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] PS4 Wee Tools 0.9.0 bientôt",
        "content": "\nDans la prochaine version de PS4 Wee Tools, qui sera proposée en v0.9.0, aménera pas mal de nouveautés. Le flasher syscon d'Abkarino sera désormais intégré aux outils PS4 Wee Tools et il sera désormais multiplateforme.\n \n \n\n \n \nLa prochaine version 0.9.0 a également quelques nouvelles petites fonctionnalités (mais utiles) comme un terminal UART qui a été mis à jour avec les statistiques de rx/tx, la vérification du hachage syscon FW, le \"Patch CoreOS légitime\" et aussi un petite surprise.\n \nTout est là : AndyManDev\n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1420002594.png"
        }
    },
    "news_18": {
        "title": "[3DS] MSET v1.0 disponible",
        "content": "Le développeur dévoile déjà la version 1.0 de MSET, bonne nouvelle, cette solution est désormais proposée en version finale, entendez par là que ce n'est plus une bêta. \n \nMSET s'installe donc comme un exploit ARM9 compatibles avec les firmwares 11.4 au 11.17 actuel, autant sur OLD3DS que sur NEW3DS. \n \n \nVersion 1.0 : \n \n- Sortie de la phase Bêta\n- Ajout d'un menu pratique pour choisir le type de 3DS, remerciement à Lily pour cette fonctionnalité. \n \n \n \n\n \n \n \nAu sujet de MSET :\n \nQ : Cela installe boot9strap et écrit sur la NAND ?\nR : Oui ! Qu'est-ce que tu vas faire d'autre avec le contrôle ARM9, a9lh ? pastaCFW ? clones de Tetris fragmentaires\" \nQ : Cela semble dangereux, Zoogie !\nR : Oui, c'est un peu le cas, mais la scène fait ce genre de choses dangereuses depuis des années. \nQ : Que se passe-t-il si je ne parviens pas à désinstaller l'exploit quand j'aurai fini ?\nR : Vous aurez des difficultés à lancer les titres précédemment installés, en plus des plantages aléatoires dans FBI et les paramètres système. Assurez-vous donc de nettoyer l'exploit ! (l'option 4 dans le menu mset9.py)\n(le reste est plus une information que quelque chose d'important)\nQ : Ce fichier qui déclenche l'exploit (002F003A.txt)... il ressemble un peu à... une adresse virtuelle, hein ?\nR : Ce sont les caractères \":/\", quelque chose que nous ne pouvons pas afficher dans un nom de fichier/dossier typique. Un fait pratique de ce fichier (en plus de déclencher le crash global) est que les 8 premiers caractères de ce nom de fichier hexadécimal sont convertis en un u32 qui existe 0x44 après SP, je peux donc l'utiliser pour brancher les caractères manquants dans la charge utile. chemin de fichier \"sdmc???b9\", et gardez le système d'exploitation du PC heureux.\nQ : Vous avez suggéré dans l'explication du hack ci-dessus que FS_EnumerateExtData est la fonction responsable de l'autorisation du crash dans MSET/ARM9, cela pourrait-il être appelé dans l'homebrew de l'utilisateur pour prendre le contrôle d'ARM9 ?\nR : Peut-être ? J'ai brièvement joué avec cette idée, mais je n'ai pas réussi à trouver un contexte de crash que je pouvais contrôler, contrairement à la méthode pré-utilisateur MSET9. Cela pourrait peut-être être un exercice pour l'utilisateur dédié pour explorer et étoffer cette variante potentielle de MSET9 ! Cela pourrait être utile sur toute la ligne.\nFait amusant : le fichier hexadécimal à 8 chiffres, s'il est laissé dans extdata, fera également planter le FBI lors de la sélection de l'option \"Ext Save Data\" dans son menu principal. C'est le seul homebrew que je connaisse qui appelle FS_EnumerateExtData.\nQ : Vous avez raccourci SafeB9SInstaller.bin en SafeB9S.bin, pourquoi ? R : Conserve la norme de nom de fichier 8.3 de FAT, ce qui évite les noms de fichiers longs et permet ainsi des économies d'espace significatives dans la bibliothèque FatFs. \"B9\" est également utilisé pour la même raison, mais sans rapport avec les FatF. Une petite empreinte de code est d’une importance primordiale partout dans cet exploit.\n \n \nTéléchargement : MSET9 v1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/forums/public/style_emoticons/default/tongue.gif"
        }
    },
    "news_19": {
        "title": "[PS5] Fusionner vos FPKG PS4 9.00+",
        "content": "Suite à la publication du hack de Sleirsgoevy permettant l' exécution de FPKG ps4 sur PS5 4.03, un petit soucis est apparu...\nEn effet, les jeux 9.00+ backportés posent problème et donnent une erreur à la fin de leur installation, ne permettant donc pas leur lancement sur nos PS5 4.03.\n \nMais comme souvent sur les scènes hack, une solution a vite été trouvé, il suffit de fusionner le jeu de base et la mise à jour backporté en un seul FPKG et c' est ici que mon script intervient.\n \n\n \nCe script reprend le code de base de repackage PKG de Duxa, que j' ai modifié afin d' y ajouter la fusion des FPKG (Base + Update) et d' automatisé tous le processus...\n \nGrâce à ce dernier vous pourrez donc fusionner vos FPKG base + update backporté de vos jeux PS4 9.00+ afin de les lancer sur vos PS5 4.03.\n \nMalheureusement tous les jeux ne seront compatibles, certains auront des soucis de sons (Resident Evil 4 Remake par ex) et d'autres ne seront tous simplement pas compatibles du à la présence obligatoire des DLC (Street Fighter 6) qui ne sont pas pris en compte par la ps5.\n \nA part cela, la majorité seront 100% jouables comme AC Mirage ou encore Lies of P.\n \nTuto d'utilisation:\n \n\n- Copier votre jeux de base dans le dossier /game\n- Copier votre update backporté dans le dossier /update\n- Lancer Merge_FPKG.bat\n- Taper l' ID de votre jeu (trouvable dans le fichier Cusa Number.txt)\n- Patienter...\n \n\n \nAttention!!!\n \n\n- Si vous rencontrez un message d'erreur due à un soucis d'espace sur votre disque dur (dossier c:/windows/TEMP c:/USER/appdata/local/temp) déplacez ces derniers sur un disque dur où vous avez assez de place...\n \n- Pas d'espace dans le nom de vos dossiers, sinon vous rencontrerez une erreur au niveau du .gp4\n \n\n \nPour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:\nhttps://www.paypal.com/paypalme/markus00095\n \nTélécharger Merge_FPKG\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180593/in-ps5-fusionner-vos-fpkg-ps4-900-1.png"
        }
    },
    "news_20": {
        "title": "[Switch] DeepSea 4.8.0 disponible",
        "content": "Le développement de DeepSea continue, du moins sa mise à jour, puisque le développeur Team-Neptune propose une update de son outil All-in-one qui débarque en package 4.8.0. \n \n \n \n\n \n \n \nAu programme de nombreuses mises à jour pour ce qui se fait de mieux en matière de package tout-en-un sur Nintendo Switch,  l'objectif est de facilité l'accessibilité pour les utilisateurs d'Atmosphère.\n \n \n\n \n \nChangelog 4.8.0 : \n \n- Mise à jour de DeepSea Assets à la version 1.0.8\n- Mise à jour de DeepSea Toolbox en v4.04\n- Mise à jour de Emuiibo à la version 1.1.1\n- Mise à jour de Ldn_MITM en v1.16.0\n- Mise à jour de MissionControl vers 0.9.4\n- Mise à jour de Tinwoo vers 35b8a63\n- Cette version ajoute le support DNS_MITM à Emummc et met à jour DeepSea Toolbox.\n \n \nTéléchargement : DeepSea 4.8.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180583/in-switch-deepsea-480-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1180583/in-switch-deepsea-480-disponible-2.png"
        }
    }
}