{
    "news_1": {
        "title": "[3DS/Switch/NDS] ftpd pro v3.2.0 disponible",
        "content": "Le développeur mtheall propose une nouvelle version de ftpd pro qui passe en v3.2.0, il y avait plus de 3 ans que le programme n'avait pas été mis à jour !\n \nPour rappel, Ftpd est disponible en NDS (pour la DS), CIA et 3DSX (pour la 3DS), et en NRO (pour la Switch). L'application peut être utile pour transférer des fichiers de votre PC ou de votre smartphone sur la carte SD et aussi inversement. \n \n \n\n \n \n \nChangelog 3.2.0 : \n \n- Prise en charge du wifi de la DSi avec la mise à jour vers libnds-2.0.0\n- support mDNS\n- Prise en charge de glob\n- Effet stéréoscopique ImGui sur 3DS\n- Suppression de la version de la CIA pour la 3DS\n- Compilation avec CMake\n- Mise à jour vers Dear ImGui v1.91.4  ( https://github.com/ocornut/imgui/releases/tag/v1.91.4 ) \n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur\n \n \nTéléchargement : ftpd pro v3.2.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200208/in-3dsswitchnds-ftpd-pro-v320-disponible-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS4/PS5] PS Multi Tools v14.5.5 disponible",
        "content": "Le développeur SvenGDK propose une nouvelle version de son outil multifonction PS Multi Tools qui est désormais affublé de la numérotation 14.5.5. \n \nComme vous le savez probablement cet utilitaire s'adresse à tout ceux qui dispose d'une console Sony, de la PSP à la PS5 en passant par toutes les générations. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \nComme pour la version précédente, la 14.5.5 n'a pas été compilée, vous allez devoir le faire vous même, sachant que les modifications portent sur la PS4 et la PS5 avec des changements nombreux pour cette dernière. \n \n \n\n \n \n \nChangelog PS4 :\n \n- Ajout de l'exploit PPPwn manquant dans le menu 'Exploits'.\n- Mise à jour du téléchargement : Apollo Save Tool v1.4.0 -> v1.6.0\n- Mise à jour du téléchargement : GoldHEN v2.3 -> v2.4b18\n \nChangelog PS5 :\n \n- Mise à jour du téléchargement : BD-JB JAR Loader v2.0.0 -> v2.1.0\n- Téléchargement mis à jour : ELFLdr par john-tornblom v0.15 -> v0.16\n- Téléchargement mis à jour : FTPSrv par john-tornblom v0.10.2 -> v0.11\n- Téléchargement mis à jour : KLogSrv de john-tornblom v0.4.1 -> v0.5\n- Mise à jour du téléchargement : SHSrv de john-tornblom v0.10.1 -> v0.12\n- Mise à jour du téléchargement : WebSrv par john-tornblom v0.11 -> v0.14\n- Ajout d'un nouveau téléchargement : Byepervisor JAR payload v1.0\n- Ajout d'un nouveau téléchargement : Kerneldump JAR payload v1.0\n- Correction d'un problème dans l'outil 'Simple Shortcut PKG Creator' qui empêchait de définir la version requise du système\n- Correction d'un problème dans l'outil 'Simple Shortcut PKG Creator' qui empêchait de définir 'Enable HTTP cache' & 'TwinTurbo' dans certains scénarios\n- Correction d'un crash possible dans le « PKG Reader » lors de l'ouverture d'un fichier .pkg\n \n \n \nTout est là sachant que la version 14.5 (la dernière build compilée) se mettra à jour si vous demandez une update :  PS-Multi-Tools 14.5.5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200206/in-ps4ps5-ps-multi-tools-v1455-disponible-1.png"
        }
    },
    "news_3": {
        "title": "[Switch] Nintendo poursuit un streamer plutôt provoquant",
        "content": " \nNous apprenons via le site 404media.co que Nintendo vient d'entamer des poursuites contre un streamer pour diffusion et exploitation de logiciels piratés. \n \nNintendo a intenté une action en justice contre un streamer appelé EveryGameGuru, qu'elle accuse d'avoir diffusé des gameplays de jeux piratés avant même leur sortie et d'avoir fourni un accès à des copies de ROM illégales et à des outils de piratage. \n \nNintendo explique dans sa plainte que le stremer jouait à des jeux en direct sur YouTube, Discord, Twitch, TikTok, Trovo, Kick, Vaughn, Dlive, Picarto, Nimo, Facebook et Loco, avec très peu de commentaires à la clé, mais big N a identifié qu'au moins 10 jeux ont été montré et diffusé avant leur date de sortie officielle. \n \n \n \n\n \n \nLorsque cela a touché Mario & Luigi: Brothership en Octobre dernier, s'en était trop pour Nintendo puisque le jeu sortait officiellement le 07 novembre 2024. Bien entendu, Nintendo a d'abord demandé le retrait des vidéos, mais le streamer a continué a diffusé, narguant même Nintendo en disant qu'il avait « un millier de chaînes jetables » et qu'il « pouvait faire ça toute la journée ».\n \nL'entreprise réclame 150 000 dollars de dommages et intérêts pour chaque violation de ses droits d'auteur. Cela pourrait se chiffrer en millions, puisque Nintendo accuse le défendeur d'avoir diffusé illégalement au moins 10 jeux à au moins 50 reprises.\n \n \nTout est là : 404media.co\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200090/in-switch-nintendo-poursuit-un-streamer-plutot-provoquant-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] PS5 PKG Reader v1 de SvenGDK disponible",
        "content": "Le développeur SvenGDK propose un nouvel utilitaire sous forme d'homebrew à destination de la PS5.\n \nIl s'agit de PS5 PKG Reader qui est libéré en v1 et qui permet de lire les fichiers PKG PS5 provenant des PS5 retail ou debug. \n \n \n\n \n \nCe logiciel permet également d'extraire un certain nombre de fichiers (icon0.png, pic0.png, param.json, package-configuration.xml s'ils existent). \n \n \n \nTéléchargement : PS5PKGReader v1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200030/in-ps5-ps5-pkg-reader-v1-de-svengdk-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS3] Evilnat 4.91.2 Beta 13 disponible",
        "content": "Le développeur Nathan Martin, connu sous le pseudo d'Evilnat, propose une nouvelle version de son CFW, l'Evilnat 4.91.2 dans sa version Beta 13.\n \n \n\n \n\n \n \nDans cette nouvelle version le développeur nous informe qu'il a mis en place quelques changements. \n \n- Mise à jour des émulateurs PS1 et PS2\n- Ajout de l'option « Afficher les informations PS3 » (demandée par Luanteles)\n- L'option « Cobra Information » affiche désormais le stage2 actuelle et le syscall 8 (demandé par aldostools)\n \n \n \nTéléchargement : Evilnat 4.91.2 [BETA 13]\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200021/in-ps3-evilnat-4912-beta-13-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1200021/in-ps3-evilnat-4912-beta-13-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[PS4] Senua's Saga Hellblade II proposé par Lapy sur PS4 en homebrew",
        "content": "Le développeur Lapy propose une sorte de démo assez spéciale, il s'agit du portage d'une vidéo de gameplay de Senua's Saga Hellblade II tournant sur PS4. Il ne s'agit pas réellement d'un jeu, ni même d'une démo, mais plutot d'une séquence de gameplay filmée entrelacée de QTE. \n \nLes séquences de QTE, où le joueur doit appuyer sur certaines touches dans un temps limité implique une sorte d'interaction, assez limité mais qui permet l'immersion. \n \n \n\n \n\n \n\n \nIl a rajouté quelques défis et un menu pour donner l'impression d'être dans un jeu. \n \n \n \nTout est là : Twitter.com /  LAPY10025\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1199978/in-ps4-senuas-saga-hellblade-ii-propose-par-lapy-sur-ps4-en-homebrew-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1199978/in-ps4-senuas-saga-hellblade-ii-propose-par-lapy-sur-ps4-en-homebrew-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1199978/in-ps4-senuas-saga-hellblade-ii-propose-par-lapy-sur-ps4-en-homebrew-3.jpg"
        }
    },
    "news_7": {
        "title": "[3DS] 3DSident v0.9.0 disponible",
        "content": " \nLe développeur Joel16 nous propose de découvrir une nouvelle version de 3DSident, il s'agit pour rappel d'une application 3DS qui est inspirée de PSPident et de PS2ident, et qui est destinée à afficher un grand nombre d'informations sur la console sur lequel elle est lancée.\n \n \n\n \n \n \n3DSident a été réécrit en C++ qui utilise les dernières versions de devkitARM et libctru. Cette version ne sera disponible qu'avec la version GUI légèrement rafraîchie. Bien qu'il y ait toujours place à l'amélioration, cette version est basée sur une base de code beaucoup plus propre. Contrairement aux versions précédentes de 3DSident, cette version n'initialise pas tous les services utilisés ou n'actualise pas constamment les valeurs qui ne changent pas au fil du temps. Théoriquement, cela devrait résoudre les plantages sur certains appareils que certains utilisateurs ont rencontrés.\n \nAvec 3DSident, un peu comme un CPU-Z ou un GPU-Z sur PC, le logiciel va vous permettre d'obtenir facilement des informations critiques comme le modèle, la langue, le firmware installé avec la version du Kernel, l'adresse MAC , le statut de la batterie, et le programme évolue encore plus avec l'arrivée de cette version.\n \n \n \n\n \n \n \nChangelog :\n \n- Nettoyer les services qui ne sont pas constamment utilisés par l'interface utilisateur.\n- L'interface graphique a été légèrement rafraîchie avec des icônes représentant chaque catégorie. - (L'interface graphique utilise également une interface utilisateur en mode sombre)\n- Corriger l'exécution de la vérification du matériel dans la catégorie système.\n- Afficher le « chiffre de contrôle » avec le numéro de série dans la catégorie système.\n- Affiche la température de la batterie (°C/°F) dans la catégorie batterie\n \n \nTéléchargement : 3DSident\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1199976/in-3ds-3dsident-v090-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1199976/in-3ds-3dsident-v090-disponible-2.png"
        }
    },
    "news_8": {
        "title": "[PS5] La méthode la plus fiable pour charger etaHEN avec Byerpervisor",
        "content": " \nLe développeur LightningMods serait-il en passe de faire évoluer le hack PS5, il fait des efforts considérables pour tenter de proposer une solution avec son payload etaHEN sur PS5 via l'exploit Byerpervisor. \n \nAprès de nombreux tests, le développeur a étudié la méthode la plus stable et la plus fiable pour charger etaHEN sur une console PS5 bénéficiant de Byerpervisor. \n \nSelon lui, il est préférable de garder une certaine procédure, il faut commencer par charger etaHEN, qui vérifiera la version du firmware de la console, et si la version est inférieure au 3.00, etaHEN exécutera automatiquement Byerpervisoir affichant une notification pour informer l'utilisateur. \n \n \n \n\n \n \n \nL'exploit se mettra en attente durant 3 secondes afin de s'assurer que tout va bien, et que l'état de fonctionnement est dans un environnement sûr et stable. Une fois cet environnement certain, il faut recharger etaHEN, en utilisant elfldr, qui pour lui à l'avantage de rester actif en mode repos, ou via le webkit. \n \nLors de ce deuxième chargement, etaHEN s'initialise alors et termine complètement le processus, garantissant un fonctionnement stable. \n \n \nTout est là : x.com/LightningMods\n \n \n",
        "images": {}
    },
    "news_9": {
        "title": "[Switch] Moonlight-Switch v1.2.2 disponible",
        "content": "Le développeur Xitrix propose une toute nouvelle version de Moonlight-Switch, la dernière fois qu'il avait mis à jour son outil s'était en aout dernier. Cette nouvelle version apporte quelques corrections au portage de Moonlight Game Streaming Project pour la Nintendo Switch.\n \n \n\n \n \n \nChangelog : \n \n- Remplacement de la capture d'écran ou du bouton Accueil par la fonctionnalité du bouton Aide\n- Remplacement du bouton de capture d'écran ou d'accueil par la fonctionnalité de superposition InGame\n- Ajout de la prise en charge des ports personnalisés\n- Paramètre permettant de modifier le nombre de pressions pour ouvrir le clavier à l'écran\n \n \nTéléchargement : Moonlight-Switch v1.2.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1199653/in-switch-moonlight-switch-v122-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] etaHEN Toolbox est désormais compatible avec le firmware 2.30 de la PS5",
        "content": "LightningMods travaille de plus en plus sur le firmware 2.30, il nous informe que son etaHEN Toolbox est désormais entièrement compatible avec ce firmware sur la console PS5. \n \nLa mise à jour est aussi le fruit du travail proposé par Echo Stretch qui lui aussi a largement travaillé sur les correctifs des firmwares 2.xx de la PS5 puisqu'il a fourni de nombreux patchs. \n \n \n\n \n \n \nComme vous le savez, etaHEN Toolbox permet de changer de nombreux fichiers de configuration via des fichiers Ini, permettant ainsi de modifier le fonctionnement de la PS5. \n \n \n \n\n \n \n \nCela passe par la possibilité d'activer ou désactiver le chargement automatique de PS5Debug, le serveur FTP intégré, ou encore le serveur RPC de Discord. \n \nIl existe d'autres options permettant par exemple d'activer le service Direct PKG Installer, la journalisation du kernel ou l'accès FTP aux développeurs. \n \nTout est là : twitter.com/LightningMods_\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1199532/in-ps5-etahen-toolbox-est-desormais-compatible-avec-le-firmware-230-de-la-ps5-1.png"
        }
    },
    "news_11": {
        "title": "[PS3] De nouvelles fonctions PS1 et PS2 intégrées dans le CFW 4.91.2 d'Evilnat Beta 12",
        "content": " \nDes avancées intéressantes ont été faites ces derniers jours sur l'émulation PS1 et PS2 sur les consoles PS3.\n \nLes émulateurs qui sont intégrés dans le firmware de la PlayStation 3 ont reçu quelques modifications de la part de kozarovv et mrjaredbeta. Les nouveaux fichiers proposés peuvent être ajoutés manuellement à de nombreux firmwares ou bien vous pouvez mettre à jour vers la dernière version du CFW 4.91.2 d'Evilnat proposé en Bêta 12. \n \nLe développeur Evilnat a effectivement intégré ces évolutions dans son CFW, il a modifié les émulateurs qui sont directement prêts à être utilisé dans sa Bêta 12. \n \nLes changements et les fonctionnalités dépendent de l'émulateur PS2/PS1 utilisé et également du modèle de la PS3 (avec la PS2). Certaines fonctionnalités nécessitent davantage de tests pour voir à quel point elles peuvent être efficaces, comme les correctifs anti-flou partiel et EE Overclocking/Underclocking. \n \n \n \n \n\n \n \n \n \nÉmulateur PS1 sur PS3\nps1_emu - Émulateur inclus sur chaque PS3 pour lire le disque PlayStation 1.\nps1_netemu - Émulateur officiel de PSone Classic du PS Store\n \nÉmulateur PS2 sur PS3.\nps2_emu.self - Les modèles CECH-A/B ps3 utilisent ps2_emu.self capable d'utiliser le matériel PS2 intégré (mémoire EE/GS/Rambus) et offrent la meilleure compatibilité\nps2_gxemu.self - Les modèles CECH-C/E ps3 utilisent ps2_gxemu, cet émulateur utilise le synthétiseur graphique physique présent dans ce modèle ps3, mais Emotion Engine est entièrement émulé ici, il n'y a pas non plus de mémoire Rambus\nps2_softemu.self - Sony est passé à un émulateur PS2 100 % logiciel et cet émulateur était fortement basé sur ps2_gxemu dans les modèles PS3 FAT restants qui sont entrés en production\nps2_netemu.self - Cet émulateur est utilisé pour la \"PS2 Classic\". Cette version de l'émulation, comme ps2_softemu, est une émulation logicielle à 100%. C'est la seule version qui ne dispose d'aucune capacité de lecture de disque CDVD physique. C'est la seule version de l'émulateur qui peut être utilisée sur les modèles PS3 Slim / SuperSlim.\n \nTous les fichiers devraient être compatibles avec les firmwares supérieur au 4.75. Tous les correctifs ont été écrits en assemblage PPE et SPE pur, la portabilité du code n'existe pas si Sony met à jour les émulateurs.\n \n \n \nTéléchargement : ps1-and-ps2-emulator-mods  /  CFW Evilnat 4.91.2 [BETA 12]\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1199528/in-ps3-de-nouvelles-fonctions-ps1-et-ps2-integrees-dans-le-cfw-4912-devilnat-beta-12-1.jpg"
        }
    },
    "news_12": {
        "title": "[PS5] LightningMods tease l'etaHEN sur PS5",
        "content": "Le développeur LightningMods a montré cette nuit un screen prouvant le fonctionnement de l'etaHEN sur une PS5. Rentrons dans le détail, il s'agit de la version etaHEN Beta 1.9B, la dernière proposée depuis août 2024 est la 1.8b.\n \nAutre point important est que cette version de l'etaHEN tourne sur un firmware 2.30, il ne sera donc accessible, pour le moment, que sur les consoles disposant d'un firmware inférieur au 3.00. \n \n \n\n \n \nD'ailleurs à ce sujet le développeur rajoute que le firmware 2.70 est un firmware d'usine uniquement, vous ne pouvez pas le mettre à jour et si jamais vous devez réinstaller le firmware, vous devez le mettre à jour vers 3.00, le hack deviendra alors inaccessible.\n \nPour le moment il n'est pas encore pleinement fonctionnel, le développeur ne faisant que teaser son travail en cours. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1199074/in-ps5-lightningmods-tease-letahen-sur-ps5-1.jpg"
        }
    },
    "news_13": {
        "title": "[3DS/Switch] JKSV du 11.05.2024 disponible",
        "content": "Le développeur JDK (J-D-K) sort une nouvelle version de son utilitaire de sauvegarde, JSKV, pour des bugs-fix et des améliorations axé sur Webdav. \nLes paramètres de configuration par défaut de JKSV ont été mis à jour pour utiliser ZIP comme option de sauvegarde par défaut au lieu du format de dossier décompressé d'origine de JKSM.\n \nSi vous utilisez JKSV depuis un certain temps, il est probable que votre fichier de configuration actuel remplace ce changement. Si vous souhaitez la meilleure compatibilité possible, il est recommandé d'activer l'option « Exporter les sauvegardes vers ZIP » à partir de maintenant.\n \n \n \n\n \n \n \nLe fichier de configuration de JKSV est désormais écrit lors du basculement ou de la modification d'une option plutôt qu'à la sortie ou au nettoyage. Trop de gens ne savent pas que vous devez quitter JKSV avec le bouton plus au lieu du bouton d'accueil pour lui permettre d'enregistrer votre configuration et de nettoyer.\n \nLes traductions chinoises, espagnoles, coréennes et italiennes ont été corrigées, les instructions WebDav ont été mises à jour, et un guide sur le menu des paramètres a été écrit par le développeur. \n \n \n \nTéléchargement : JKSV du 11.05.2024\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1199063/in-3dsswitch-jksv-du-11052024-disponible-1.jpg"
        }
    },
    "news_14": {
        "title": "[PSP] L'émulateur PPSSPP est disponible en v1.18",
        "content": " \nLa mise à jour 1.18 de PPSSPP vient d'être dévoilée, sous ce nom se cache le meilleur émulateur PSP. La console PSP a été la première véritable console portable de Sony, elle fut commercialisée entre 2004 et 2015, mais son succès était basé sur le fait qu'elle offrait une qualité de restitution proche de celle de la PlayStation 2, un véritable tour de force pour l'époque, nous pouvions alors disposer d'une vraie PlayStation Portable dans la poche. \n \nL'émulateur PPSSPP multi-plateformes Android, Windows, iOS, Mac OSX, Blackberry, Maemo, Harmattan, Symbian, Pandora, Linux se met à jour en version V1.18. Premier émulateur de PSP pour Android, et d'autres plates-formes mobiles, qui fonctionne beaucoup plus rapidement que n'importe quel autre émulateur PSP sur Windows, Linux et MacOSX, PPSSPP vous permet d'exécuter en Full HD vos jeux PSP.\n \n \n\n \n \n \nAu programme de cette version 1.18, des améliorations de support de iOS, Mac, de décodage d'interprétation de Vertex, des corrections SDL, des corrections sur les icônes et de l'interface. De nombreux crashs, 3 nouveaux thèmes, les changements sont très nombreux. \n\n \nPlatform support\nImproved iOS/Mac support, Game Mode support (#19287, #19281, #19269, #19270, #19257, #19254, #19244, #19227, #19224, #19213, #19200, #19187, #19184, #19161, #19118)\nIR Interpreter: work on correctness and optimizations (#19299, #19280, #19268, #19265, #19262, #19260, #19255, #19252, #19240, #19233, #19231, #19193, #19189, #19173, #19128)\nInterpreted Vertex Decoder optimizations: (#19243, #19241)\nSDL fixes: (#19131)\nLegacy Edition for old Android TV devices (only for download on the website): (#19401)\nAndroid and Windows shortcuts - add icons and bugfixes: (#19139, #19142, #19138)\nImprove performance of CHD loading (#18931)\nUI\nMany crash, hang and performance fixes around the UI (#18950, #19561, #19556, #19531, #19507, #19523, #19529, #19482, #19473, #19438 #19165)\nNew post proc filter \"Sharp bilinear\" (#19530)\nMisc UI fixes (#19505, #19492, #19126, #19020)\n3 new themes (#19504)\nGame info in-game (#19471)\nNew remote iso UI (#19293)\nInstall save games from ZIP file (#19443, #19436)\nMore input-mappable actions like Reset, allow mapping Alt key (#19472, #19484, #19304)\nHomebrew Store: Added website links, license info: (#19425, #19426)\nRetroAchievements: Can now hash homebrew apps (#19096), RAIntegration support (#19002)\nFix regression of the AxisSwap feature (#19059)\nEmulation\nMisc crash fixes: (#19563, #19546, #19491, #19358, #19347, #19198)\nVulkan barrier fixes: ( #19009, #19017, #19018)\nMisc compatibility fixes (#19560)\nMisc filesystem fixes (FDs, date/time) (#19459, #19340)\nWorkaround for The Warriors video playback (#19450)\nExpose GPI switches and GPO leds, accessible in developer settings\nFix regression caused by the fix for UFC Undisputed (#18806)\nBroke out the Atrac3+ code from ffmpeg for easier debugging and maintenance (#19033, #19053, more)\nimplement sysclib_sprintf (#19097)\nRendering fixes\nSocom FB3 depth buffer problem in menu (#19490)\nPlatypus: Glitchy transparency with OpenGL (#19364)\nSyphon Filter: Logan's Shadow: Dark lighting in OpenGL (#19489)\nMGS2 Acid errors on AMD GPUs (#19439)\nFix regression in Genshou Suikoden (#19122)\nFix HUD glitch in GTA LCS by emulating \"provoking vertex\" correctly (#19334)\nDebugging improvements\nMIPSTracer - a new (rough) debugging tool by Nemoumbra (#19457)\nVR\nNew immersive mode (makes better use of reprojection by extending the rendered area) (#19361)\nA lot of fixes by Lubos (#19420, #19416, #19389, #19390, #19361, #19092, ...)\nMisc\nThe CHD file format is better supported and performance has been drastically improved (#18924, #18931)\n \n \n \n\n \n\n \nTéléchargement : PPSSPP\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198673/in-psp-lemulateur-ppsspp-est-disponible-en-v118-1.png"
        }
    },
    "news_15": {
        "title": "[Switch] switch_AIO_LS_pack 5.15.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.15.0.Pour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.Le homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format).Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables. Depuis cette news les évolutions sont les suivantes:- Changelog pour la version 5.15.0:Dernier firmware compatible mis à jour en version 19.0.1.Mise à jour d'Atmosphere, de Hekate, de Sys-patch, de Lockpick-RCM, du module gérant les overlays, de Status-monitor-overlay et de JKSV vers la dernière version de ceux-ci.La version de Sys-patch contient des fonctionnalités non présentes dans la version classique comme le nettoyage de son fichier de config, un patch \"no_erpt\" pour désactiver le module ERPT d'Atmosphere (à n'activer que si vous savez se que vous faites), un patch \"debug_flag\" permettant de rendre compatibles les anciens forwarders entre autres (peut cependant avoir des effets de bord comme l'impossibilité d'utiliser les cheats tant que ce patch est actif) et un patch \"debug_flag_off\" qui permet d'annuler le patch \"debug_flag\" (à activer, relancer le module puis désactiver le patch, sinon désactiver le patch \"debug_flag\" et redémarrer donnera le même effet). Les trois patches uniques sont désactivés par défaut.Mise à jour des forwarders intégrés pour être compatible avec la dernière version d'Atmosphere, par contre ils deviennent incompatibles avec les anciennes versions de celui-ci.Mise à jour des patches utilisés pour le logo de démarrage.Mise à jour des patches utilisés pour les thèmes.Mise à jour du homebrew AIO_LS_pack_Updater en version 6.80.12 contenant les évolutions suivantes:Le nettoyage des modules exclu les modules Sys-patch et le module de gestion des overlays.Mise à jour des forwarders inclus pour qu'ils fonctionnent avec Atmosphere 1.8.0 mais ceci les rends incompatibles avec les versions inférieures d'Atmosphere.Correction d'un bug durant l'installation du forwarder de l'application.Correction de bugs dans la détection de versions.Correction de potentiels bugs.Note: Pour traiter les problèmes particuliers de lancement de la sysnand en firmwares 17.0.0 et supérieurs c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.Note 2: La version 1.8.0 d'Atmosphere reste une version pouvant poser des problèmes notamment avec certains modules ou certains contenus, le pack et ses éléments sont sables mais les éléments n'en dépendant pas ne le seront peut-être pas.N'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets. Pour cela nous avons mis en place un questionnaire de satisfaction, en plus de pouvoir reporter les problèmes sur Github ou sur le forum vous pouvez utiliser ce questionnaire pour nous donner vos opinions de façon anonyme (pour des problèmes spécifiques il vaut mieux reporter sur Github ou ouvrir un sujet sur le forum, il y aura une réponse bien plus rapide et cela permet de demander plus de détails pour identifier et peut-être résoudre le possible problème.Pour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe et vous avez aussi un tutoriel plus détaillé sur cette page, d'ailleurs ce dernier site contient aussi pas mal de tutoriels notamment sur la Switch.Si vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_16": {
        "title": "[PS5] La PS5 Pro se met à nue, spécifications et PCB dévoilés",
        "content": "La PS5 Pro vient d'arriver dans certains salons, et les spécifications du manuel ont été dévoilées, tout comme le PCB qui dévoile le die gravé en 6 nm, et on remarque des composants très bien organisés, optimisés sur lequel et c'est une nouveauté appréciable, la pile CMOS est accessible !\n \nAuparavant il fallait démonter l'ensemble du ventirad, et démonter totalement la console afin de changer la pile, un comble quand on sait qu'elle peut être inutilisable en cas de défaillance sur le long terme.\n \n \n \n\n \n \n \nCôté spécifications, on parle donc d'une puissance de 16.7 Tfops, et de la présence de 2 Go de DDR5 supplémentaires, après il y a aussi du spécifique comme 2 Tb de stockage, la Wifi 7, et on reste sur la même architecture que la PS5, logique. Petit bémol, la puissance nominale peut monter jusqu'à 390 watts (350 watts auparavant). \n \n \n\n \n\n \n\n \n \nLes spéculations tablaient sur une puissance beaucoup plus importante, de l'ordre de 25 à 30 Tflops, seulement 16.7 Tflops peut surprendre, surtout par rapport au prix demandé, à voir si ce prix sera maintenu longtemps, l'inflation des composants ne peut pas tout justifier.\n \nCôté PCB, on voit bien que les composants sont très espacés, et que Sony va certainement prévoir la véritable SLIM de la PS5 dans quelques mois.\n \n \n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198638/in-ps5-la-ps5-pro-se-met-a-nue-specifications-et-pcb-devoiles-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1198638/in-ps5-la-ps5-pro-se-met-a-nue-specifications-et-pcb-devoiles-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1198638/in-ps5-la-ps5-pro-se-met-a-nue-specifications-et-pcb-devoiles-1.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1198638/in-ps5-la-ps5-pro-se-met-a-nue-specifications-et-pcb-devoiles-2.png"
        }
    },
    "news_17": {
        "title": "[DS/3DS/2DS] TWiLight Menu++ et nds-bootstrap ont été mis à jour",
        "content": " \nLe développeur RocketRobz propose depuis toujours des mises à jour importantes lors des fêtes particulièrement à Halloween et à Noël, cette année n'a pas échappée à cette règle, et il a mis en ligne une version spéciale Halloween de TWiLight Menu++ et nds-bootstrap, rapidement corrigé pour le premier avec une nouvelle mouture. \n \n \n\n \n \n \nTWiLight Menu++ :\n \n- @lifehackerhansol : Ajout d'un AP-fix pour Pokémon Moon Black 2 (v4.2.4).\n- Ajout d'un AP-fix pour Kawaii Koinu DS 3 (Rev 1).\n- Ajout du support pour les pilotes DLDI 32KB, permettant aux vieux linkers telles que la N-Card de fonctionner ! (Merci à @ApacheThunder pour le test !) La libnds32 (par @lifehackerhansol) est utilisée pour réaliser cela.\n- Ajout des fichiers de démarrage automatique pour les linkers suivants :\n -> N-Card\n -> R4 3DS Gold RTS/PK3DS (@Deletecat)\n- SNEmulDS lit maintenant les ROMs depuis fat:/roms/snes/ !\n \nCorrections de bugs (v27.11.0)\n \n- Suppression du chargement des binaires ARM du fichier .nds démarré dans le Memory Expansion Pak, afin d'éviter d'éventuels crashs.\n- Le réglage par défaut de Load Bootloader a été modifié de Direct à Thru nds-bs afin de corriger les plantages d'écran blanc chez certains utilisateurs lorsqu'ils essayaient de jouer à un jeu GBA via GBARunner2 ou de charger d'autres homebrew DS.\n- Si le dernier dossier utilisé n'est pas trouvé, TWLMenu++ démarrera désormais à la racine du SD sur la première page et le premier titre.\n \nBug connu\n- Les homebrew modernes ne démarrent pas FAT/DLDI avec les anciens linkers tels que la N-Card, car leurs pilotes DLDI ont une taille supérieure à 16 Ko. Ceci est dû au homebrew et non à TWLMenu++.\n \nCorrection de bugs (v27.11.1) :\n \n- Correction de la prise en charge des pilotes DLDI de 32 Ko, ce qui fait que certaines applications homebrew (dumpTool, Safe NAND Manager, GodMode9i, émulateurs, etc.) ne fonctionnent pas correctement et/ou ne permettent pas de revenir à TWLMenu++.\n- Le driver DLDI de la carte N est désormais compressé dans l'espace RAM du bootstub.\n- Correction du bootstub qui n'est pas préservé lors du démarrage d'une application homebrew en mode DS (à partir du mode DSi) à partir des linkers.\n- @lifehackerhansol : Le démarrage automatique est maintenant supporté pour le DSTT et ses clones avec une carte microSD non SDHC insérée !\n- Thème du Wood (interface utilisateur)  : Correction d'un crash lors de l'appui sur le D-Pad droit avec 2 fichiers/dossiers ou moins à l'écran.\n \nnds-bootstrap 2.1.0 \n \n- Mode B4DS : Ajout du support pour les pilotes DLDI 16KB, et pour la première fois, les pilotes DLDI 32KB sont maintenant supportés ! Cela signifie que les anciens linkers tel que la N-Card fonctionneront désormais avec nds-bootstrap ! (Merci à @ApacheThunder pour le test !)\n- La libnds32 (par @lifehackerhansol) est utilisée avec le rétrécissement du tas du jeu (à partir du SDK 2.1) afin d'y parvenir. (Voir « Bug connu ».)\n- Pour certains jeux, les données de la ROM seront désormais préchargées après le démarrage au lieu de l'être avant, ce qui accélère le temps de démarrage pour ces jeux.\n- Mode B4DS : Certaines données de deux ROM seront désormais préchargées dans le Memory Expansion Pak avant le démarrage (Base 10 & Sonic Rush Adventure) afin de réduire le scintillement de l'écran et d'améliorer légèrement la vitesse !\n- Mode B4DS : Afin de réduire les plantages dans les titres DSiWare suivants, le pilote DLDI a été déplacé vers ITCM afin de libérer au maximum les 4 Mo de RAM de la console.\n \nAiRace: Tunnel \nNeed for Speed: Nitro-X \nOrion's Odyssey\nPhantasy Star 0 Mini\nPicture Perfect: Pocket Stylist\nTales to Enjoy!: Little Red Riding Hood\nTales to Enjoy!: Puss in Boots\nTales to Enjoy!: The Three Little Pigs\nTales to Enjoy!: The Ugly Duckling\n \nCorrection de bugs : \n \n- Ajout de paramètres de préchargement de ROM pour MegaMan Battle Network 5 : Double Team DS (Undub) sur les consoles DSi afin de réduire les ralentissements dans l'intro d'ouverture.\n- Mode B4DS : Correction d'un bug de longue date (depuis la v0.73.0) qui empêchait les titres DSiWare SDK5.5 contenant des cloneboot (ex. Box Pusher) de démarrer.\n- Correction d'un bug négligé qui faisait que le synthétiseur KORG DS-10+ ne démarrait pas en mode DSi sur les consoles DSi.\n- Mode B4DS : Correction du mode VS en Base 10 qui provoquait un crash.\n- @lifehackerhansol : Améliorations mineures.\n \n \n \nTéléchargement : TWiLight Menu++ v27.11.1 / nds-bootstrap v2.1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198567/in-ds3ds2ds-twilight-menu-et-nds-bootstrap-ont-ete-mis-a-jour-1.png"
        }
    },
    "news_18": {
        "title": "[PS4/PS5/Switch] Chiaki-ng v1.9.1 disponible",
        "content": " \nL'outil Chiaki-ng s'améliore en ce début novembre, la version 1.9.1 du client Remote Play\nOpen Source vient d'être publiée. \n \nAu programme, une amélioration de l'émulation tactile, le réveil automatique de la console, mais aussi de nombreuses corrections de bugs et d'optimisations, sachant que les patchs intégrés pour Linux, Windows et MacOS ont eux aussi été mis à jour. \n \n \n \n\n \n \n \nChangelog :\n \n- Ajout de l'émulation tactile du pavé numérique pour utiliser le pavé numérique pour les touches et les balayages de l'écran tactile, voir l'émulation tactile du pavé numérique\n- Réveille automatiquement la console découverte lorsque la connexion est demandée au lieu de demander à l'utilisateur de se réveiller en premier\n- Ajout de l'option --exit-app-on-stream-exit pour quitter chiaki-ngimmédiatement après la fermeture d'une session de streaming\n- Résoudre les problèmes d'enregistrement liés aux paramètres de diffusion en détectant automatiquement quand la diffusion doit être utilisée\n- Réinitialise les commandes de mouvement si nécessaire pour éviter de sauter vers la position lors de l'utilisation des commandes de mouvement pour viser dans les jeux qui activent les commandes de mouvement via une pression sur la gâchette comme Resident Evil 4 Remake\n- Correction d'un bug où la découverte upnp pouvait prendre trop de temps, provoquant l'échec de la connexion à distance via PSN\n- Informe les utilisateurs de la possibilité d'une connexion à distance via PSN car de nombreux utilisateurs ne connaissent toujours pas cette option\n- Ajout un mappage pour le bouton Partager sur les contrôleurs Xbox Series et Xbox One\n- Affiche le nom du profil actuel avec deux points après le nom de l'application comme nom d'affichage de l'application\n- Mettre à jour les mappages de contrôleurs pour qu'ils soient portables sur toutes les plates-formes (Linux, Mac/OS et Windows)\n- Ajout d'un nom de contrôleur pour le mappage de contrôleur pour les contrôleurs qui n'ont pas de nom configuré dans le mappage lui-même\n- Autorise la saisie du mappage du contrôleur et réinitialiser le mappage à l'aide du bouton Retour\n- Rendre les boîtes de dialogue du journal, les consoles enregistrées et les consoles cachées déroulantes avec un contrôleur\n- Augmente les délais d'attente de STUN à 5 secondes + ajoutez des délais d'attente pour Curl de 10 secondes\n- Rendre la boîte de dialogue de mappage de touches navigable avec le contrôleur\n- Désactive la copie zéro pour les cartes matérielles qui ne la prennent pas en charge\n- Augmente le temps d'attente pour que les haptiques DualSense de DualSense edge soient en ligne à 15 secondes\n- Ajoute un fût de brassage maison pour chiaki-ngMacOS\n- Correction d'une erreur provoquant un crash lorsque l'allocation d'étourdissement aléatoire était utilisée pour une connexion à distance via PSN\n- Résoudre un leak (fuite de mémoire) dans une connexion à distance via PSN\n \n \nTéléchargement : Chiaki-ng 1.9.1\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198566/in-ps4ps5switch-chiaki-ng-v191-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] Apollo Save Tool 1.6.0 pour les joueurs PS2 sur PS4",
        "content": "Le développeur Damian Parrino, connu sous le pseudonyme de Bucanero, propose une nouvelle version de son application Apollo Save Tool qui est maintenant proposé en v1.6.0 pour la PS4. \n \nBucanero nous informe que cette version s'adresse surtout à ceux qui jouent à des titres PS2 sur PS4, il a en effet améliorer la gestion des cartes mémoires virtuelles (memcards) et des répertoires de sauvegardes directement sur la PS4 pour les jeux PS2. \n \nLe prochain support améliorera les jeux PS1, avec un support de cartes mémoires identiques, mais ce sera dans une autre version. Cette version 1.6.0 s'avère essentielle et très utile si vous jouez à des conversions PS2. \n \nLe développeur rajoute qu'avec les efforts de Bestpig, le support pour tous les firmwares sensibles de la PS4 a été ajouté, il fait référence aux firmwares 7.xx, 8.0x, 8.5x, 9.0x, 9.5x, 10.50 et 10.7x et il tient à remercier.  Nous nous joignons à ces remerciements. \n \n \n\n \n \nChangelog\n \nAjout :\n- Support du firmware 7.0x/8.0x/8.5x/9.0x/9.5x/10.50/10.7x (merci à @BestPig) à savoir que GoldHEN, PS4HEN ou ps4debug payload sont nécessaires \n- Gestion des images de cartes mémoire virtuelles PS2 (VMC)\n-> Supporte les images PS2 MemCard, ECC et non-ECC (.PS2, .VM2, .CARD, .VMC)\n-> Liste, importation, exportation et suppression des sauvegardes PS2 dans les images VMC\n-> Importation - Formats pris en charge : .PSU, .PSV, .XPS, .MAX, .CBS, .SPS\n-> Exportation - Formats pris en charge : .PSU, .PSV\n- Base de données en ligne : ajout d'une liste de sauvegardes PS2\n- Option de tri des sauvegardes par type (PS4/PS2/VMC)\n- Ajout d'une option de journal de débogage persistant dans les paramètres (activé/désactivé)\n \nDivers\n- Mise à jour du moteur de patch Apollo vers la version 1.1.0\n-> Amélioration de l'analyse du code\n-> Amélioration du code SW de type 3 (sous-type 3/7/B/F)\n-> Amélioration du code SW de type 4 (sous-type 4/5/6/C/D/E)\n-> Ajout de la commande de cryptage AES CBC (aes_cbc(key, iv))\n \n \n \nTéléchargement : Apollo Save Tool 1.6.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198565/in-ps4-apollo-save-tool-160-pour-les-joueurs-ps2-sur-ps4-1.png"
        }
    },
    "news_20": {
        "title": "[WiiU] Cemu 2.3 disponible",
        "content": "L'équipe en charge du développement de Cemu propose une nouvelle version de leur émulateur de Wii U, la version 2.3 vient d'être mis en ligne pour Windows 64 bit, MacOS, Ubuntu et Linux. \n \n \n\n \n \n \nChangelog :\n \n- Vulkan : Correction d'une condition de course où les données uniformes pouvaient être corrompues. Le plus souvent, cela causait des corruptions de polygones dans BotW ou XCX, mais en théorie, cela pouvait affecter tous les jeux.\n- Vulkan : Changements dans la façon dont l'affichage des images est géré pour réduire la latence d'entrée\n- Entrée : Correction d'un crash qui pouvait se produire lors de la fermeture de la boîte de dialogue d'ajout de contrôleur alors qu'une recherche de contrôleur était toujours active.\n- Amiibo : Correction d'un problème où les Amiibo n'étaient pas détectés dans Mario Kart 8\n- En ligne : La fonctionnalité SpotPass respecte désormais l'option proxy_server dans le fichier settings.xml.\n- Windows : En mode portable, les icônes de sauvegarde des raccourcis sont désormais stockées dans le répertoire Cemu au lieu de %appdata%.\n- Divers : Correction d'un crash qui pouvait se produire lorsque des paramètres de ligne de commande invalides étaient passés à Cemu\n \n \nTéléchargement : Cemu 2.3\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198488/in-wiiu-cemu-23-disponible-1.png"
        }
    }
}