{
    "news_1": {
        "title": "[PS3] CCAPI 4.92 CEX disponible",
        "content": "Enstone vient de mettre à jour son logiciel CCAPI (Control Console API), qui permet pour rappel de connecter une console PS3 à un autre appareil, comme un PC ou un smartphone, en s'appuyant sur l'API TMAPI (Target Manager), comme cela est possible via une console DEX. \n \nIl convient de faire attention, CCAPI peut provoquer un soft brick sur les slims et super slim en HEN, CCAPI se destine aux consoles disposant d'un CFW. Pour rappel, CCAPI (Control Console API) est une application qui nous permet de connecter un PC à la  PS3 via TMAPI comme il est possible de le faire avec les consoles DEX. Pour rappel, CCAPI établit une interface entre votre PS3 et votre PC, facilitant le lancement de commandes, comme la modification de l'IDPS (ou du PSID) de la console. Il vous permet aussi de connaître les températures en direct, ou encore d'établir des mods RTE, tout cela en wifi ou via le câble réseau. \n \n \n\n \n \nCette nouvelle version rev13 de CCAPI permet d'amener le support des CFW 4.92 CEX. Attention à ne pas utiliser sur HEN ni sur PEX 4.92.\n \n \nTéléchargement : CCAPI 4.92 CEX (Rev13)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204892/in-ps3-ccapi-492-cex-disponible-1.jpg"
        }
    },
    "news_2": {
        "title": "[Switch] Sudachi mis à jour en v1.0.15",
        "content": "Le développeur Jarrod Norwell nous propose une mise à jour importante de Sudachi, \nSudachi est un émulateur Nintendo Switch pour Android, Linux, macOS et Windows écrit en C++ et basé sur Yuzu, Sudachi est proposé pour Windows, MacOS et Android.\n \nAu chapitre des nouveautés, l'ajout de certaines fonctionnalités ont été implémentées, des optimisations ont été apportées, et l'utilisation \"d'artefacts\" améliore la gestion de projet. \n \n \n \n\n \n \n \nChangelog : \n \n- Ajout du support pour XCX:DE en supprimant ssl:s\n- Actuellement, le menu et une petite partie du jeu ont été testés\n- Modification de la façon dont MoltenVK est obtenu pour macOS afin d'obtenir des versions plus récentes\n- Les artefacts sont maintenant utilisés et peuvent être mis à jour plus fréquemment\n- Passage de SDL2 à SDL3 apportant ses améliorations\n- Correction des problèmes liés aux caps en inversant temporairement la réécriture\n- Correction de plusieurs erreurs de compilation sur macOS\n- Mise à jour de vcpkg vers la dernière version\n \n \nTéléchargement : Sudachi v1.0.15\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204884/in-switch-sudachi-mis-a-jour-en-v1015-1.png"
        }
    },
    "news_3": {
        "title": "[PS5] Kstuff testé pour les firmwares 7.xx, mais cela ne fonctionne pas",
        "content": "Le développeur EchoStretch vient de dévoiler la toute première version de Kstuff pour les firmwares 7.xx de la PS5. Pour le moment, il ne s'agit que d'une version de test, qui ne fonctionnera correctement que les firmwares 7.00 et 7.01 mais c'est déjà ça, en attendant la suite. \n \nCette version de Kstuff supporte tous les firmwares 7.xx, cependant elle ne passera pas les offsets présents dans offsets.sysentvec, c'est pourquoi il dévoile cette première version test afin de progresser sur son support. Il va commencer aujourd'hui les diagnostics pour corriger les erreurs au fur et à mesure. Il le dit très clairement les firmwares au delà du 7.01.01 ne sont pas encore accessibles, mais que cela va être corrigé.\n \n \n\n \n \nIl convient encore d'être un peu patient, cela va se décanter, en attendant nous ne pouvons que remercier tout ceux qui sont impliqués dans les recherches. \n \n \n \n\n \n \nkstuff sur PS5 7.01 bd-j en test \n \n \nMalheureusement, après plusieurs tests en profondeur, cela ne fonctionne pas, ils n'abandonnent pas pour autant. \n \nhttps://x.com/StretchEcho/status/1904583904008560946\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204857/in-ps5-kstuff-teste-pour-le-firmware-7xx-1.png"
        }
    },
    "news_4": {
        "title": "[XB360] BadBuilder v0.1 Alpha disponible",
        "content": "Le développeur Pdawg a créé le logiciel BadBuilder qui est destiné à ceux qui disposent d'une Xbox 360 et qui souhaite mettre en oeuvre l'exploit BadUpdate. \n \nA quoi sert BadBuilder ? \n \nIl s'agit d'un outil proposé dans une première version 0.1 Alpha qui va permettre de simplifier la création d'une clé USB compatible avec l'exploit BadUpdate, ainsi vous pourrez exécuter du code non signé et des applications homebrews sur votre Xbox 360 si vous disposez de tout ce qu'exige BadUpdate.\n \nAinsi BadBuilder va se charger de formater la clé USB au format FAT32, jusque là rien d'exceptionnel, mais surtout BadBuilder va télécharger automatiquement les fichiers nécessaires à l'exploit BadUpdate, le logiciel va détecter et télécharger la dernière version des fichiers disponibles, et réutilisera ceux qui sont déjà présents s'il s'avère qu'il n'est pas nécessaire de les mettre à jour.\n \nBadBuilder permet aussi de spécifier manuellement les chemins de fichiers spécifiquement et dynamiquement c'est à dire qu'il va recréer les liens si nécessaires dans les archives, et sur la clé.\n \n \n\n \n \nBadBuilder v0.1 [ALPHA] :\n \nIl s'agit de la première version de BadBuilder. Si vous rencontrez des problèmes, veuillez les signaler en créant un nouveau ticket. Le programme est fourni sous forme de build à fichier unique, mais assurez-vous que .NET 8.0 Desktop Runtime est installé avant de l'exécuter.\n \n \nExtraction et copie de fichiers :\n \n- Extrait automatiquement tous les fichiers nécessaires.\n- Prépare la clé USB pour l'exploit BadUpdate en copiant tous les fichiers requis.\n \nPrise en charge des homebrews :\n \n- Permet d'ajouter des applications homebrew en spécifiant leur dossier racine.\n- Recherche automatiquement le .xexfichier de point d'entrée ( ) dans le dossier.\n- Si plusieurs .xexfichiers sont trouvés, BadBuilder vous demandera de sélectionner le bon.\n- Copie tous les fichiers nécessaires et corrige l'entrée .xexà l'aide du XexTool téléchargé.\n \n \nTéléchargement : BadBuilder v0.1 Alpha\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204856/in-xb360-badbuilder-v01-alpha-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS5] Sony sort le firmware 25.02-11.00.00 pour la PS5",
        "content": "Contrairement à la PS4 où nous ne savons pas grand chose, le nouveau firmware pour la PS5 vient avec un changelog un peu plus détaillé. Les améliorations portent essentiellement sur des améliorations des activités et du contrôle parental.\n \nLa mise à jour apporte donc une meilleure visibilité des activités, qui sont désormais affichées en entier sur leurs cartes avec les spoilers automatiquement masqués. \n \nLa prise en charge d'Unicode 16.0 a été introduite, de nouveaux émojis sont donc désormais accessibles, et une fonctionnalité du contrôle parental a été ajoutée. Un nouveau paramétrage permet de limiter la communication et le contenu généré par l'utilisateur. \n \nIl est possible aussi de conserver les paramètres par défaut en \"personnalisant\" l'affichage. Comme pour la version PS4, Sony annonce avoir amélioré la convivialité de certains écrans. Sony a aussi ajouté une possibilité pour les utilisateurs de s'inscrire de manière centralisé au programme bêta.\n \n \n\n \n \nVersion : 25.02-11.00.00 :\n \n- Nous avons simplifié la visualisation des détails des activités.\nLes détails de l’activité sont désormais entièrement affichés sur les cartes.\nDes spoilers potentiels seront toujours cachés.\n- Les emojis Unicode 16.0 sont désormais pris en charge. Vous pouvez les utiliser dans vos messages.\n- Lorsque vous définissez votre niveau de restriction de contrôle parental sur 16 à 19 ans ou plus , l' option Communication et contenu généré par l'utilisateur sera désormais définie sur Restreindre par défaut. Si vous avez précédemment défini le niveau entre 16 et 19 ou plus , vos paramètres précédents ne seront pas modifiés et s'afficheront comme Personnalisé .\n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et la convivialité de certains écrans.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204848/in-ps5-sony-sort-le-firmware-2502-110000-pour-la-ps5-1.png"
        }
    },
    "news_6": {
        "title": "[PS4] Sony sort le firmware 12.50 pour la PS4",
        "content": "Alors que la PlayStation 4 semblait en fin de vie, Sony a discrètement déployé un nouveau firmware 12.50. Cette mise à jour surprise relance les spéculations sur un possible soutien prolongé à la console, malgré la domination de la PS5.\n \nAméliorations techniques, correction de bugs mineurs, optimisations du système ou bien mise à jour de sécurité. Contrairement aux anciennes grosses mises à jour, cette version semble être une optimisation technique plutôt qu’une révolution.\n \nSony met en avant un changelog assez limité, la firme japonaise annonce avoir amélioré les messages et la convivialité de certains écrans, ce qui est très peu pour se faire une idée réelle de ce qu'apporte ce firmware. \n \n \n \n\n \n \nVersion : 12.50 :\n- Nous avons amélioré les messages et la convivialité de certains écrans.\n \nDu reste, il faut attendre un peu pour voir ce que réellement va apporter ce firmware. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204846/in-ps4-sony-sort-le-firmware-1250-pour-la-ps4-1.jpg"
        }
    },
    "news_7": {
        "title": "[Multi] Nintendo bloque les hombrews sur Alarmo avec le firmware 3.0.0",
        "content": " \nNintendo vient de publier une mise à jour firmware pour son réveil Alarmo, jusque là rien de bien surprenant, cependant ce firmware 3.0.0 a pour ambition de fermer les failles de sécurité critique. \n \nSous couvert d'introduire de nouvelles fonctionnalités, si cela était réellement possible, Nintendo bloque les modifications sur son réveil. Nintendo prétend avoir amélioré la personnalisation des alarmes, en ajoutant la possibilité de définir des sonneries différentes chaque jour de la semaine, ou encore d'ajuster la durée des sons relaxants jusqu'à 60 minutes. \n \nEncore une fois le plus gros changement est lié au fait qu'un nouveau 2ndloader a été introduit, imposant la vérification du code de démarrage lors de l'allumage, et la vérification de la signature numérique du firmware chargé via USB, tout cela empêchant l'exécution de code non signé ou non officiel. \n \n \n\n \n\n \n \n \n \nBref, en attendant de voir si cela peut être contourné, il faudra désormais trouver un réveil en firmware 2.0.0 maximum, ce firmware 3.0.0 venant pour le moment du moins bloquer tout recours à des modifications. \n \nPour bloquer les updates il faut désactiver la connexion Wi-Fi ou bien bloquer les DNS via votre modem-routeur. \n \nSource : GaryOderNichts\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204820/in-multi-nintendo-bloque-les-hombrews-sur-alarmo-avec-le-firmware-300-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1204820/in-multi-nintendo-bloque-les-hombrews-sur-alarmo-avec-le-firmware-300-2.png"
        }
    },
    "news_8": {
        "title": "[PS5] Le payload PS5 Kstuff mis à jour en 1.2",
        "content": "Le développeur EchoStretch a mis à jour son solution payload PS5 Kstuff en version 1.2. \n \nPour rappel, kstuff est un payload pour PS5 créé à l'origine par Sleirsgoevy qui permet d'exécuter des faux packages PS4 (des FPKG) et certaines applications homebrew sur PS5. Cette nouvelle version apporte le support de tous les firmwares 6.xx, que ce soit le 6.00, 6.02 ou 6.50.\n \n \n\n \n \n \nChangelog : \n \n- Prise en charge les firmwares 3.00-6.50 \n- Les firmwares 6.XX nécessite un hôte/elfldr avec des offsets mis à jour\n \nTéléchargement : Kstuff 1.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204800/in-ps5-le-payload-ps5-kstuff-mis-a-jour-en-12-1.png"
        }
    },
    "news_9": {
        "title": "[Switch] Nxdumptool supporte désormais MacOS",
        "content": "Le développeur Sheldon10095 propose une mise à jour de Nxdumptool de DarkMatterCore, connu anciennement sous le nom de gcdumptool, le programme permet de dumper vos jeux Nintendo Switch, les DLC et aussi les mises à jour. \n \n \n\n \n \nL'utilitaire permet également de transférer, analyser et vérifier l'intégrité des jeux, et la nouvelle version supporte MacOS, ce qui n'était pas le cas jusqu'à présent. \n \n \nChangelog : \n \n- Support de MacOS\n- Initialisation USB mise à jour pour vérifier explicitement certains chemins libUSB courants sur macOS (Intel et Apple Silicon) et inviter l'utilisateur à installer libUSB via la partie homebrew s'il n'est pas trouvé. \n \n \nTéléchargement : nxdt_rw_poc.elf / nxdt_rw_poc.nro / prerelease\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204799/in-switch-nxdumptool-supporte-desormais-macos-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] Kstuff sur 6.xx et 7.xx très bientôt sur Lua et Blu-ray",
        "content": "Zecoxao vient d'annoncer que grâce à de généreux contributeurs, les clés sur les firmwares 6.xx et 7.xx sont tombées, comme cela s'est produit jusqu'à présent, quelques jours en suivant kstuff a été porté. \n \nIl annonce donc que TOUS les firmwares 6.xx et 7.xx vont bénéficier de kstuff très prochainement, dans les prochains jours, et que pour en bénéficier il faudra le faire via l'exploit Lua ou bien l'exploit Blu-ray.\n \n \n\n \n \n \nPour le moment, il n'est pas encore question d'exploit webkit utilisable, de fait pour ces firmwares il ne sera pas 'encore' possible de lancer kstuff via le navigateur. \n \n \nTout est là : x.com/notnotzecoxao\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204790/in-ps5-kstuff-sur-6xx-et-7xx-tres-bientot-sur-lua-et-blu-ray-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] Jailbreak UMTX2 pour PS5",
        "content": "Le projet UMTX2 est le fruit du travail de plusieurs développeurs et chercheurs en sécurité informatique, qui ont fait le choix de mettre en commun leurs connaissances afin de proposer une solution commune hébergée officiellement sur https://github.com/idlesauce/umtx2 \n \nUMTX2 est un nouvel outil de jailbreak qui exploite la vulnérabilité UMTX  pour permettre l'exécution de code non autorisé sur la console PS5 de Sony, le code d'exploitation est largement basé sur l'implémentation Lua développée par les développeurs Shahrilnet et n0llptr, disponible dans le référentiel remote_lua_loader.\n \n \n\n \n \n \nLe Jailbreak UMTX2 dispose de quelques caractéristiques propres : \n \n- Support des firmwares 1.00-5.50 : UMTX2 est compatible avec une large gamme de firmwares PS5, le rendant accessible à de nombreux utilisateurs. Au dessus du firmware 5.50, il n'existe pas de webkit exploitable, donc pour le moment il n'est pas possible de le porter sur 6.xx et 7.xx. \n- Menu payloads : le projet comprend un menu de gestion des payloads, ce qui facilite l'exécution de code personnalisé sur la console.\n- Intégration PSFree 150b : UMTX2 utilise PSFree 150b d'abc , un exploit webkit connu pour exécuter des exploits sur PS5 de manière stable. \n- Chargement automatique du chargeur ELF : Le projet inclut le chargement automatique du chargeur ELF développé par  @john-tornblom , qui vous permet d'exécuter des fichiers ELF sur la console.\n- Compatibilité avec les payloads plus anciens : UMTX2 inclut également le  loader ELF 9020, qui assure la compatibilité avec les payloads plus anciens (non disponible en mode Webkit uniquement).\n- Mode Webkit uniquement : pour les utilisateurs qui souhaitent envoyer des payloads et dumper le cache de l'application sans effectuer un jailbreak complet, un mode Webkit uniquement est disponible.\n \nHébergement : \n \nhttps://umtx2.pages.dev/\n \nhttps://idlesauce.github.io/umtx2/\n \n \nTéléchargement : \n \nhttps://umtx2.ps5browser.pages.dev/umtx2.pages.dev.pkg\n \nhttps://umtx2.ps5browser.pages.dev/umtx2.github.pkg\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204770/in-ps5-jailbreak-umtx2-pour-ps5-1.jpg"
        }
    },
    "news_12": {
        "title": "[PS4] shadps4 v0.7.0 - nom de code frobbo disponible",
        "content": " Le développeur George Moralis propose la version 0.7.0 de shadps4 le célèbre émulateur PS4 qui tire clairement le meilleur de la console. Ils sont très nombreux, les émulateurs PS4, mais aucun n'arrive à la cheville de shadPS4, tout simplement. \n \nUne nouvelle sortie passionnante de l'équipe ShadPS4, de nombreuses nouveautés (FSR, HDR) et de nombreux correctifs sont au programme. C'est un jour vraiment spécial pour shadPS4 et son développeur, car c'est son anniversaire (Shad) et nous sommes aussi 24 ans après la sortie de la première version de PCX2.\n \n \n\n \n \nC'est incroyable de voir ce que cette équipe a accompli, après quelques démos OpenOrbis l'année dernière, ils ont pu voir de nombreux jeux commerciaux tourner (et pas seulement Bloodborne).\n \nUne petite liste des changements intervenus :\n \n- Remappage des entrées clavier et souris\n- De nombreux correctifs pour le recompilateur de shaders\n- Correction des événements videoOut\n- De nombreux correctifs pour les appels HLE en mémoire\n- Corrections et améliorations de l'interface graphique Qt\n- Correction de certaines causes de « Tentative de suivi de la mémoire non GPU »\n- Correction de la gestion du gyroscope et du capteur d'accélération\n- Compatibilité améliorée avec les anciens processeurs\n- Compatibilité améliorée avec les jeux Unity\n- Ajout du support HDR\n \nTéléchargez-le ici : shadps4 v0.7.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204762/in-ps4-shadps4-v070-nom-de-code-frobbo-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[3DS] GodMode9 v2.2.0 la version du 9ème anniversaire",
        "content": " \nLe 22 mars 2016, un simple navigateur de fichiers basé sur ARM9, doté d'une fonctionnalité très intéressante (parcourir le système de fichiers NAND de votre 3DS), a été lancé au grand public. À ce moment-là, personne n'aurait imaginé que, neuf ans plus tard, le projet serait l'un des outils maison 3DS les plus importants, capable de pratiquement tout faire, et qu'il serait néanmoins toujours aussi performant. Pourtant, pour son 9e anniversaire, voici GodMode9 v2.2.0, qui intègre non pas une, mais deux nouvelles fonctionnalités majeures.\n \n \n\n \n \nEn effet, en 2025, il est encore possible de trouver des nouveautés à apporter à la 3DS, voilà les changements de cette version : \n \n[nouveau] Prise en charge des traductions, merci à@Epicpkmn11\n[nouveau] Prise en charge du script Lua, merci à@ihaveamac\n[amélioration] Un nouveau logo d'anniversaire brillant\n[correction] Nombreuses corrections de bugs et petites améliorations\n \nPrise en charge des scripts Lua :\n. Cette version implémente les scripts Lua ! Comparé à GM9Script, Lua offre de nombreux avantages, notamment des fonctions, un meilleur flux de contrôle, des tables, des E/S de fichiers améliorées, des calculs en virgule flottante, des modules, la gestion des erreurs, et bien plus encore. Chaque fonctionnalité de GM9Script possède une API Lua équivalente.\n \nUn script simple HelloScript.luaest inclus dans l'archive de publication, ainsi que dans le dépôt à l'adresse resources/sample. Ce script illustre les fonctionnalités de base de Lua (standard et GM9). La documentation complète de chaque fonction GM9 est disponible dans lua-doc.md, ainsi que dans l'archive de publication et le dépôt à l'adresse resources. Pour les fonctions Lua standard, reportez-vous au Manuel de référence de Lua 5.4 .\n \nGM9Script est toujours inclus mais il ne sera plus développé.\n \nPrise en charge des traductions\n: GodMode9 parle désormais votre langue ! Plus besoin de télécharger un fork de GodMode9 et de vous demander s'il est à jour pour obtenir une autre langue. Si vous ne trouvez pas votre langue ou si vous rencontrez des problèmes et souhaitez nous aider, rendez-vous sur le projet GodMode9 Crowdin .\n \nUn format « TRF » simple est utilisé pour stocker les traductions. Pour tester de nouvelles traductions, vous devrez convertir le fichier. Placez simplement votre fichier JSON depuis Crowdin dans le dossier resources/languages et compilez GodMode9 pour convertir automatiquement le fichier TRF et l'inclure dans le dossier de sortie. Vous pouvez également utiliser le script transriff.py directement depuis le dossier utils.\n \n \nTéléchargement : GodMode9 v2.2.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204747/in-3ds-godmode9-v220-la-version-du-9eme-anniversaire-1.png"
        }
    },
    "news_14": {
        "title": "[Multi] PS Multi Tools v15.0.1 disponible",
        "content": "Le développeur SvenGDK dévoile une nouvelle version de PS Multi Tools qui est maintenant proposé en v15. Les nouveautés sont nombreuses, notamment avec le dernier GoldHEN pour PPPwn GUI (v2.4b18.3). Comme vous le savez probablement cet utilitaire s'adresse à tout ceux qui dispose d'une console Sony, de la PSP à la PS5 en passant par toutes les générations. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n\n \n \n \nGénéral :\n- Mise à jour de .NET Framework 4.8 vers .NET 9\n- Le .NET 9 Desktop Runtime est maintenant nécessaire pour faire fonctionner PS Multi Tools\nhttps://dotnet.microsoft.com/en-us/download/dotnet/thank-you/runtime-desktop-9.0.3-windows-x64-installer\n- Remplacement de nQuant par SixLabors.ImageSharp (.Processing.Processors. Quantization) pour les images de projets PSX\n- Correction des plantages lors de l'ouverture de répertoires\n- Mise à jour des icônes\n- Une mise à jour vers la version 15.1 est disponible dans l'application et corrige les téléchargements interrompus\n \nPS4 :\n- Mise à jour des téléchargements GoldHEN & ; inclus un pour PPPwn GUI (v2.4b18.3)\n \nPS5 :\n- Les sauvegardes PS5 locales se chargeront désormais différemment, ce qui devrait réduire le temps de chargement.\n \nMise à jour PS5 Téléchargements :\n- BD-JB JAR Loader v2.1.0 -> ; v4.1.1\n- Itemzflow par LightningMods v1.06 -> ; v1.08\n- ELFLdr par john-tornblom v0.16 -> ; v0.18.1\n- etaHEN par LightningMods v1. 8B -> ; v1.9B\n- FetchPKG par john-tornblom v0.2 -> ; v0.3.1\n- FTPSrv par john-tornblom v0.11 -> ; v0.11.2\n- KLogSrv par john-tornblom v0.5 -> ; v0.5.3\n- OffAct par john-tornblom v0.1 -> ; v0. 3\n- SHSrv par john-tornblom v0.12 -> ; v0.14\n- WebSrv par john-tornblom v0.14 -> ; v0.21\n \nAjout de nouvelles charges utiles PS5 dans 'Downloads' :\n- etaHEN v1.9B No Toolbox\n- etaHEN v2. 0B Pre Release\n- PS5-kstuff by sleirsgoevy & ; EchoStretch for 3.00 - 6.50\n \nAjout de nouvelles charges utiles PS5 JAR dans 'Downloads' :\n- Debug Settings\n- Dump Current Process\n- Jailbreak\n- Kernel Log Server\n- List Directory Entries\n- UMTX1 + UMTX2\n \nUne petite mise à jour 15.0.1 a été publiée pour corriger les téléchargements qui ne proviennent pas de GitHub.\n \n \nTéléchargement : PS Multi Tools v15.0.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204744/in-multi-ps-multi-tools-v15-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[3DS] Première release stable pour l'émulateur Azahar 3DS",
        "content": " \nEt voici la première version stable de l'émulateur Azahar 3DS, il s'agit de la release 2120 qui est donc la première version stable de l'émulateur. \n \n \n\n \n \nAzahar 2120 Changelog\n \nTout :\nImplémentation du drapeau de retournement vertical du framebuffer récemment découvert | @PabloMK7 + un contributeur anonyme #699\nCeci corrige un problème de longue date où Starfox 64 3D apparaissait à l'envers\nLa méthode d'acquisition des fichiers système de la 3DS a été complètement revue, nécessitant désormais l'utilisation d'une vraie 3DS et du nouvel outil Artic Setup Tool. | @PabloMK7\nL'ancienne méthode d'acquisition des fichiers système a été supprimée\nPour en savoir plus sur les raisons de ce changement, consultez notre article de blog : https://azahar-emu. org/blog/game-loading-changes\nSi les fichiers système 3DS ont été installés, les jeux appartenant à votre compte eShop peuvent désormais être téléchargés directement à partir de l'application 3DS eShop | @PabloMK7\nCorrection de divers problèmes liés aux états de sauvegarde | @PabloMK7 #656\nAjout d'une nouvelle option de piratage des performances appelée \"Disable Right Eye Rendering\" | @PabloMK7 758ded7\nLa 3DS effectue le rendu pour l'œil gauche et l'œil droit, même lorsque la 3D n'est pas utilisée. Ce hack désactive le rendu de l'un des deux yeux, ce qui peut améliorer les performances jusqu'à 50 % pour certains jeux.\nCertains jeux peuvent rencontrer des problèmes graphiques lors de l'utilisation de ce hack. Essayez-le partout et voyez ce qui fonctionne !\nVous pouvez utiliser le mode stéréoscopique côte à côte pour vérifier si l'image de l'oeil droit est désactivée, afin de vérifier la compatibilité du jeu\nAjout d'une nouvelle option qui active tous les modules LLE nécessaires à la fonctionnalité en ligne | @PabloMK7 d5745ca\nLa prise en charge des applications cryptées a été abandonnée. Les applications doivent maintenant être vidées dans un format décrypté pour être utilisées. | @PabloMK7\nPour en savoir plus sur les raisons de ce changement, consultez notre article de blog : https://azahar-emu.org/blog/game-loading-changes\nPour des raisons historiques liées à l'origine de l'extension, la prise en charge de l'extension de fichier .3ds a été abandonnée\nAzahar utilise désormais l'extension .cci, qui est le véritable nom du format utilisé par les fichiers .3ds\nVous pouvez toujours utiliser des ROMs avec l'extension de fichier .3ds en renommant simplement le fichier afin d'utiliser l'extension .cci.\nPour en savoir plus sur les raisons de ce changement, consultez notre article de blog : https://azahar-emu.org/blog/game-loading-changes\nLa 3DS virtuelle a désormais une adresse MAC générée aléatoirement | @PabloMK7\nCette adresse peut être définie en fonction de l'adresse MAC de votre 3DS réelle ou régénérée à tout moment via le menu des paramètres\nLe microprofil est désormais désactivé par défaut au moment de la compilation, ce qui permet d'économiser une petite quantité de RAM | @PabloMK7 #651\nAjout de traductions en valencien et en suédois\nBureau :\nSi le système est configuré en mode sombre et que le thème Azahar par défaut est utilisé, les icônes blanches seront désormais utilisées à la place des icônes noires sur grises difficiles à voir | @kleidis #623, @rtiangha #668\nLinux :\nCorrection d'un problème où des artefacts visuels sévères apparaissaient sur les parties de la fenêtre non occupées par un écran 3DS sur Wayland | @OpenSauce04 #754\nWindows :\nCorrection d'un problème où la version Windows était parfois incapable de générer des chemins d'accès aux fichiers | @PabloMK7 #588\nAjustements mineurs pour moderniser l'installateur | @RedBlackAka #683\nAndroid :\nCorrection d'un problème où les traductions linguistiques pouvaient ne pas s'appliquer correctement | @PabloMK7 #735\nCorrection d'un bogue qui pouvait parfois faire échouer le renommage des fichiers | @PabloMK7 d5745ca\nCorrection de problèmes liés aux données de configuration qui n'étaient pas sauvegardées correctement | @PabloMK7 d5745ca\nAsynchronisation de l'analyse des titres de l'application AM, de démarrage des jeux dans la plupart des cas | @PabloMK7 d5745ca\nCertaines fonctions AM ont été rendues asynchrones, ce qui permet d'éviter les bégaiements inutiles pendant le fonctionnement des jeux | @PabloMK7 d5745ca\nCorrection d'un problème lié au service SOC qui pouvait provoquer des plantages | @PabloMK7 d5745ca\nTechnique :\nL'option CMake précédemment connue sous le nom de ENABLE_DEDICATED_ROOM a été renommée en ENABLE_ROOM | @OpenSauce04 56e96de\nUne nouvelle option CMake, ENABLE_NATIVE_OPTIMIZATION, a été ajoutée et active -march=native pour les compilateurs C et C++ s'ils sont supportés | @OpenSauce04 c024933\nVoir ici pour plus d'informations sur ce que cela signifie :\nUne nouvelle option CMake, ENABLE_MICROPROFILE, a été ajoutée pour activer le microprofil maintenant désactivé par défaut\nL'option ENABLE_OPENGL peut maintenant être activée manuellement sur Linux aarch64 au lieu d'être codée en dur à OFF | @OpenSauce04 #749\nElle est toujours désactivée par défaut\nDiverses dépendances externes ont été mises à jour | @OpenSauce04 #615 #616\nCorrection d'erreurs de compilation introduites avec la sortie des candidats à la sortie de CMake 4. 0 release candidates | @OpenSauce04 #688\nCorrection d'erreurs de compilation sur Linux introduites avec la publication d'une récente mise à jour de Pipewire | @mdartmann #691\nCorrection d'une erreur mineure qui pouvait causer des échecs de compilation sur certaines architectures non-x86 | @ouni666 @PabloMK7 #732\n \n \nTéléchargement : Azahar 3DS\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204731/in-3ds-premiere-release-stable-pour-lemulateur-azahar-3ds-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS3] BadHTAB : Le bug de l'hyperviseur HTAB de la PS3 en wip",
        "content": "Hier le développeur Zecoxao nous apprenait qu'un bug hyperviseur nommé BadHTAB est en cours d'implémentation, il s'agit d'un bug s'appuyant sur un glitch dans l'hyperviseur HTAB exploité par Geohot sur PS3 GameOS. \n \nBien entendu ce projet se concentre sur la mise en oeuvre d'un exploit connu, qui va profiter de la faille HTAB (qui correspond à la gestion de la tacle de hash) dans l'hyperviseur PS3, l'idée étant comme d'habitude d'obtenir un accès privilégié au kernel et ainsi de lancer du code non signé. \n \n \n \n\n \n \n \n \nSi on s'intéresse d'un peu plus près à ce bug, il a été découvert par XORLOSER, en combinant une intervention matérielle et une modification logicielle, permettant d'accéder à l'hyperviseur LV1.\n \nLa mémoire virtuelle et la mémoire physique sont toutes deux structurées dans HTAB, une erreur dans cette gestion permet de suspendre le pointeur de données, et ainsi de libérer l'accès à la mémoire de l'hyperviseur. Ainsi le glitch permet de provoquer cette erreur matérielle sur la mémoire NOR ou NAND, et puis il est exploité via un logiciel ou un payload. \n \n \n \n\n \n \n\n \n \n \n \nUn référentiel moderne a été créé par aomsin2526, bien que les détails de BadHTAB ne soient pas encore dévoilées, le projet a du sens, désormais les Raspberry Pico peuvent automatiser ce genre de glitch, c'est d'ailleurs ce que précise Zecoxao, un test aurait été effectué sur une PS3 disposant d'un firmware officiel 4.84.\n \nTout cela pourrait déboucher sur un hack des modèles 3000 et 4000, rappelons simplement qu'il ne sera pas persistant, c'est à dire qu'il faudra le lancer à chaque fois. \n \nLe code source de BadHTAB se trouve ici le projet entrant en WIP : BadHTAB\n \nMerci overload pour l'info\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204720/in-ps3-badhtab-le-bug-de-lhyperviseur-htab-de-la-ps3-en-wip-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1204720/in-ps3-badhtab-le-bug-de-lhyperviseur-htab-de-la-ps3-en-wip-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1204720/in-ps3-badhtab-le-bug-de-lhyperviseur-htab-de-la-ps3-en-wip-3.png"
        }
    },
    "news_17": {
        "title": "[PS4/PS5] PSXMaster v1.0.0 publié par ghost1372",
        "content": "Une nouvelle application, PSXMaster, fait parler d'elle dans le monde PlayStation. Développée par ghost1372, cette solution puissante et intuitive vise à simplifier le transfert de données entre un PC et une console PlayStation 5 ou PlayStation 4, ainsi qu'à faciliter la gestion des jeux PlayStation.\n \nPSXMaster se distingue par son interface conviviale et ses fonctionnalités avancées. Les utilisateurs peuvent désormais transférer des jeux, des sauvegardes et d'autres données rapidement et efficacement, sans avoir à recourir à des méthodes complexes ou fastidieuses.\n \n \n\n \n\n \n\n \n\n \n \nCette application est particulièrement utile pour les joueurs qui souhaitent organiser leur bibliothèque de jeux, sauvegarder leurs données localement ou simplement optimiser leur expérience sur PS5/PS4. Avec PSXMaster, la gestion des jeux PlayStation devient un jeu d'enfant !\n \nPSXMaster est disponible en version v1.0.0, s'agissant de la première version proposée, elle pourrait être sujette à des bugs. \n \n \nTéléchargement : PSXMaster v1.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204718/in-ps4ps5-psxmaster-v100-publie-par-ghost1372-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1204718/in-ps4ps5-psxmaster-v100-publie-par-ghost1372-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1204718/in-ps4ps5-psxmaster-v100-publie-par-ghost1372-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1204718/in-ps4ps5-psxmaster-v100-publie-par-ghost1372-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] L'app PS5 HB Store passe en version 2.7",
        "content": "Le développeur LightningMods propose du neuf aussi au niveau du PS5 HB Store, il s'agit de l'app qui permet d'avoir accès aux applications homebrews compatibles avec la PS5. \n \nCette version 2.7 vient apporter deux corrections, la première est la correction d'un problème qui empêchait l'affichage correct des versions des applications disponibles dans le store. Un autre bug de l'API a été corrigé. \n \nAucune action n'est requise, l'application se mettra à jour d'elle-même la prochaine fois que vous l'ouvrirez. \n \n \n\n \n \nChangelog\n \n- Correction de l'affichage des versions de l'application \n- Correction d'un bug avec l'API Store concernant les requêtes de lancement des développeurs\n \n \nTéléchargement : PS5 HB Store 2.7\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204688/in-ps5-lapp-ps5-hb-store-passe-en-version-27-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS3] etHANol v3.0.9 compatible avec le HFW 4.92",
        "content": "L'équipe PS3Xploit a dévoilé il y a quelques jours une nouvelle version d'etHANol, la suite d'outils destinés aux PS3 de la série 3000/4000 (Slim et Superslim) qui permet d'installer et d'utiliser les possibilités étendues et d'autres outils pour permettre de lancer le gestionnaire de packages, le fichier de débogage Debug PKG et les packages de style HAN, les ACT.DAT et RIF résignés, le type de licence gratuite PSX/PSP et plus encore sur le firmware d'origine. \n \netHANol est une solution limitée, pas très puissante, mais qui permet de profiter des possibilités de modification sur un firmware officiel. Dans cette nouvelle version 3.0.9, c'est le support officiel des HFW 4.92 qui a été ajouté. L'équipe tient à remercier Joonie pour son travail. \n \n \n \n\n \n \n \nChangelog : \n \n- Ajout du support pour HFW 4.92 (Hybrid Firmware)\n \n \nTéléchargement : etHANol\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204684/in-ps3-ethanol-v309-compatible-avec-le-hfw-492-1.png"
        }
    },
    "news_20": {
        "title": "[PS4] GoldHEN v2.4b18.3 disponible",
        "content": "Le développeur SiSTR0 propose une nouvelle version de son plugin GoldHEN, le payload le plus important de la PS4 qui offre des fonctionnalités avancées à la console. \n \nCette nouvelle version introduit la fonctionnalité d'application automatique des cheats codes dès le démarrage des jeux, le support du firmware 9.03 a été ajouté, et le serveur Kog sera plus performant. \n \n \n\n \n \nChangelog PS4 GoldHEN v2.4b18.3 :\n \n- Ajout de cheats à application automatique au démarrage du jeu (*)\n- Ajout du support pour 9.03\n- Serveur Klog amélioré\n \n*charge et active automatiquement vos cheats précédemment choisis lorsque vous lancez le jeu.\n \n \nTéléchargement : GoldHEN v2.4b18.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204681/in-ps4-goldhen-v24b183-disponible-1.png"
        }
    }
}