{
    "news_1": {
        "title": "[2DS/3DS] 3DS Homebrew Menu v2.4.2 disponible",
        "content": "Le développeur anglais Dave Murohy, répondant au pseudonyme de WinterMute, propose la mise à jour du 3DS Homebrew Menu d'habitude supporté par le développeur fincs. WinterMute a donc mis à jour l'Homebrew Launcher (hbmenu), le gestionnaire développé à l'origine il y a maintenant quelques années par Smealum. Ces mises à jour sont le bienvenue compte tenu qu'elles arrivent une à deux fois par an.\n \nNous parlons ici du Homebrew Launcher qui permet de lancer les homebrews au format 3DSX. Pour rappel, pour le lancer il faut soit un point d'entrée désormais d'un autre âge comme Ninjhax, hax 2.x ou soit Rosalina. \n \n \n\n \n \n \nCette version 2.4.2 apporte les changements suivants : \n \n- Reconstruit avec les dernières librairies\n- Correction du chemin de configuration à config/3ds-hbmenu\n- Ajout d'un paquet avec config/ssl/cacert.pem pour libcurl\n \n \nTéléchargement : 3DS Homebrew Menu v2.4.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182279/in-2ds3ds-3ds-homebrew-menu-v241-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PS5] Les premiers backups PS5 qui se lancent sur PS5 sont des démos",
        "content": "Pour la première fois et après un travail incroyable de LightningMods, voilà le lancement du premier backup PS5. \n \nLe titre PPSA03527 est jouable et peut donc être lancé sans avoir à ajouter de support de fPKG. \n \nComme nous pouvons le voir, le développeur lance PPSA03527 : Grand Theft Auto III – The Definitive Edition sur sa PS5 via ItemzFlow, mais surtout ce que l'on peut voir c'est qu'il utilise la version Beta 1.2 de etaHEN qui n'est pas encore sortie.\n \nLe firmware utilisé est le firmware 4.03.\n \n \n \n\n \n\n \n\n \n \n \n \nAu delà de cela, il a fait tourner également la démo Matrix, qui nécessite un crack, ou encore la démo d'abandonned, là encore il faut disposer d'un dump pour pouvoir la lancer. Il lance aussi la démo Maiden (la démo de Résident Evil Village).\n \nIl semblerait donc que ce sont les démos PSN dumpés qui fonctionneraient, celles qui ne nécessitent pas de licence, ou plutôt qui disposent de licence libre, donc pour le moment pas de jeu physique ni de jeux disposant d'une licence, et pas de fPKG. \n \nLes dumps qui tournent ce sont ceux sans DRM qui sont en obtenu via FTP, grâce au payload de Specter (app0 + eboot + modules + meta fichiers). \n \n \nTout est là : twitter.com/LightningMods_\n \n \n \n \n",
        "images": {}
    },
    "news_3": {
        "title": "[PS5] Les jeux Sega Saturn s'invitent sur PS5",
        "content": "Depuis le hack de Sleir permettant de lancer les FPKG PS4, nous avons vu la plus part des homebrews de cette dernière être adapté pour PS5. La grande majorité fonctionnent de base sur PS5, d'autres ont besoin d' être adaptés et d' autres ne fonctionnent tous simplement pas.\n \n\n \nC est le cas pour les jeux SEGA Saturn, impossible de les exécuter comme sur PS4, les FPKG donnent une erreur directement après leur lancement.\n \nMais ceci c'était avant, en effet, il est maintenant possible d’exécuter les jeux SEGA Saturn sur PS5, sous certaines conditions et malheureusement pas sur toutes les PS5.\nIl suffit de modifier le fichier nptitle.dat présent dans Sce_sys/ et d' y ajouter le \"CUSA\" de votre jeu pour que le FPKG PS4 soit compatible PS5 (pas de panique mon script le patch automatiquement ^^)\n \n\n \nJ'ai publié ce week end une première version de mon outil Saturn2PS4 v1.2 avec ajout du support PS5, fonctionnant parfaitement sur ma console mais bizarrement, pas sur d'autres PS5, cela donne une erreur au lancement\n \n\n \nJ ai donc modifié mon script afin qu' il soit compatible avec tous les modèles de PS5, cela a eu du bon car les jeux SEGA Saturn fonctionnent avec plus de modèles de PS5 mais pas pour tous malheureusement, donc si vous rencontrez une erreur (le screen du dessus) ne vous inquiétez pas, cela signifie simplement que votre PS5 n' est pas compatible, je cherche encore pourquoi...\n \n\n \nJe publie donc cette mise à jour de mon script v1.2.1 qui fonctionne sur certains modèles et pas sur d'autres, ceci est vraiment très aléatoire, il vous faudra donc tester par vous même pour voir si cela fonctionne pour vous... Je profite également de cette new pour vous demander votre modèle de PS5, votre firmware et si les FPKG Saturn fonctionnent sur vos modèles de PS5 afin de comprendre pourquoi ceci n' est pas compatible sur TOUTES les PS5.\n \nPour le fonctionnement du script je vous laisse visionner ma vidéo tuto PS4, la manip est exactement la même, il vous suffira juste de sélectionner l'option 2 pour PS5.\n \n\n \nPour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:\nhttps://www.paypal.com/paypalme/markus00095\n \n \nTélécharger Saturn2PS4 v1.2.1\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182233/in-ps5-les-jeux-sega-saturn-sinvitent-sur-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1182233/in-ps5-les-jeux-sega-saturn-sinvitent-sur-ps5-1.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1182233/in-ps5-les-jeux-sega-saturn-sinvitent-sur-ps5-2.jpg"
        }
    },
    "news_4": {
        "title": "[PS5] Les firmwares 7.61 et 7.20 décryptés",
        "content": "Le développeur Zecoaxo annonce que les firmwares 7.61 et 7.20 ont été décryptés, et qu'ils ont été documentés sur le Wiki. \n \nCes décryptages sont le fruit d'un utilisateur de Télégram, sans le citer.\n \n \n\n \n \n \nBref, pour parler simplement, et malheureusement, il ne s'agit pas encore d'un kernel exploit (je tiens à m'excuser pour la fausse joie) , mais simplement de firmwares décryptés, qui permettront peut etre de trouver des failles. \n \n \nTout est là : \n \nhttps://twitter.com/notnotzecoxao/status/1721278975945683305\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1489065883.png"
        }
    },
    "news_5": {
        "title": "[PS5] Le démontage de la PS5 Slim en vidéo",
        "content": "Davee Lee dévoile sur Twitter.com le teardown de la toute nouvelle PS5 Slim, et il faut avouer que Sony a fait des progrès gigantesques en matière d'optimisations d'emplacement et de composants. \n \nDavee Lee, influenceur avec presque 4 millions d'abonnés sur sa chaîne, dévoile le nouveau design de la console, là où Sony avait pris les devants sur les PCB précédents. \n \n \n\n \n \n \nIl montre comment retirer la coque avec sa partie supérieure glossy et sa partie inférieure mat, le nouveau lecteur bluray sans vis, il montre même l'emplacement NVMe du SSD (extension qui est toujours présente), le ventilateur, et surtout on découvre le PCB qui est clairement réduit. \n \n \n \n\n \n \n \nEn clair, ce n'est que le ventirad qui prend de la place désormais, et le PCB est clairement optimisé, il y a très peu de vide sur la carte, chaque espace est bien utilisé, rien n'est perdu, contrairement au conception précédente. \n \n \n \n\n \n \n \nSi vous vous posiez la question, le métal liquide est toujours là, et il y a toujours de la pâte thermique blanche peut efficace sur certaines puces, mal étalée et qui n'a une efficacité que limitée, dommage. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182146/in-ps5-le-deballage-et-demontage-de-la-ps5-slim-en-video-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182146/in-ps5-le-deballage-et-demontage-de-la-ps5-slim-en-video-2.jpg"
        }
    },
    "news_6": {
        "title": "[PS5] Le firmware 4.51 supporte les fPKG PS4 ainsi que etaHEN 1.1b",
        "content": "Bonne nouvelle, le développeur Sleirsgoevy vient de confirmer que le payload ps5-kstuff supporte désormais le firmware 4.51 de la PS5, cela signifie que le dernier firmware compatible avec l'exploit permet désormais de lancer le fPKG PS4. \n \nCe sont donc désormais les trois principaux firmwares de la PS5 disposant d'un kexploit  qui sont pris en charge, le développeur Zecoxao a également remercié cheburek3000 ce qui laisse supposer qu'il a largement contribué à trouver les offsets du firmware 4.51, notamment grâce à Meme Dumper. Il a même rajouté \"le tout puissant cheburek\".\n \n \n\n \n \nPour en profiter : \n \nhttps://zecoxao.github.io/ps5jb/\n \nLes offsets sont là :\n \nhttps://github.com/cheburek3000/ps4jb-payloads/commit/a7d715d9dd1e9cace5ded9b2638620920d8b8ae7\n \n \nTéléchargement : payload.bin\n \n \netaHEN le supporte également avec l'arrivée d'une toute nouvelle version 1.1b qui supporte le firmware 4.51. \n \nTéléchargement : etaHEN 1.1b\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182105/in-ps5-le-firmware-451-supporte-desormais-les-fpkg-ps4-ainsi-que-etahen-11b-1.png"
        }
    },
    "news_7": {
        "title": "[Multi] XLink Kai v7.4.45 disponible",
        "content": "Une toute nouvelle version de XLink Kai vient d'apparaitre sur les serveurs de Teamxlink, pour rappel, Xlink Kai est un programme qui permet de remplacer le mode natif de jeu en ligne de certains titres afin de proposer la prise en charge des modes multijoueurs LAN. Le programme supporté depuis 2003 est compatible PS2, PS3, PS4, Gamecube, Switch, Xbox, Xbox 360, Vita et Xbox One. \n \nBien entendu cette mise à jour vient corriger également quelques bugs comme en atteste le changelog.\n \n \n \n\n \n \nChangelog : \n \nNouvelles fonctionnalités : \n- Le partage de connexion cellulaire pour l'accès internet est désormais pris en charge\n- Le portugais a été ajouté à la localisation (Brésil)\n \nChangements :\n- La WebUI est désormais service depuis la mémoire pour améliorer la flexibilité des mises à jour\n \nDépannage : \n- Correction d'un crash dans le gestionnaire UPNP sur tous les systèmes d'exploitation\n- Correction d'un problème de gestion UTF16 pour la langue japonaise\n- Correction du rendu des caractères accentués courants dans la langue espagnole\n \n \nTéléchargement : XLink Kai v7.4.45\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182103/in-multi-xlink-kai-v7445-disponible-1.jpg"
        }
    },
    "news_8": {
        "title": "[GC/Wii/WiiU] Not64 20231102 disponible",
        "content": "Cela faisait quasiment un an jour pour jour que la version précédente de Not64 avait été proposée, et bien voilà que le développeur Extrems a compilé une nouvelle version de Not64 qui est proposé en version 20231102, correspondant à la date de compilation.\n \nPour rappel Not64 est l'un des meilleurs émulateur de Nintendo 64. Pour rappel, Not64 peut être installer sur la Nintendo GameCube, la Nintendo Wii ou encore la Wii U. A l'origine développé pour le PC, cette version permet de profiter des dernières évolutions comme le support du loader M2, la correction du support en écriture de la seconde version du GC Loader, ou encore la correction de détection de manette Wii, et cette version vient s'adapter aux changements liés à Swiss. \n \n \n\n \n \n \nChangelog : \n \n- Toujours supposer qu'il y a un premier contrôleur.\n- Correction de la copie du nom à partir de l'en-tête de la ROM (ROM header)\n- Ajustement pour les changements de libogc-rice.\n- Synchronisation des changements de Swiss.\n \n \nTéléchargement : not64\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182071/in-gcwiiwiiu-not64-20231102-disponible-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS4] GameBato Store v1.24 disponible",
        "content": "Le store GameBato, qui permet pour rappel de profiter à ses pleines capacités de votre PS4 ou PS4 Pro sous firmware 5.05, 7.55 ou 9.00, est désormais proposé en version v1.24, encore une fois, comme à l'arrivée de chaque nouvelle version, les changements sont très nombreux.\n \n \n \n\n \n \n \nChangelog :\n \n- Ajout des thèmes. Le système de thèmes est implémenté et les utilisateurs peuvent maintenant installer des thèmes en utilisant l'application GameBaTo. Ces thèmes sont installés de façon permanente et il n'est pas nécessaire de les réinstaller à chaque fois que la console est allumée.\n- Ajout d'un lecteur multimédia basé sur un navigateur pour regarder les médias des jeux, les bandes-annonces et les gameplays.\n- Ajout d'un système de dialogue personnalisé pour les messages d'information, les barres de progression et les confirmations.\n- Ajout d'un historique de navigation. Les utilisateurs peuvent désormais appuyer sur le bouton CIRCLE pour revenir exactement à l'endroit où se trouvait l'application dans son état précédent.\n- Ajout de la recherche multi-mots. Les utilisateurs peuvent maintenant rechercher des jeux avec des noms partiels ou complets.\n- Résultats complets dans Recherche, Catégories et Studios de jeux. Auparavant, seuls 24 résultats étaient affichés, mais les utilisateurs peuvent désormais naviguer pour explorer les résultats complets en mode pagination.\n- Ajout d'un système intégré de désactivation de la mise à jour du firmware. Les utilisateurs n'ont pas besoin d'utiliser une charge utile de désactivation des mises à jour, leurs appareils sont entièrement protégés contre les mises à jour une fois qu'ils ont lancé l'application GameBaTo.\n- Augmentation de la vitesse d'exploration. La vitesse d'exploration et aussi de navigation dans l'application a été augmentée.\n- Diminue le risque de panique de l'appareil après avoir quitté l'application.\n- Correction du dépassement de la vitesse de téléchargement et d'installation.\n- Correction de nombreux problèmes mineurs.\n \n- Pour bénéficier de toutes les fonctionnalités de cette version, les utilisateurs sont invités à télécharger à nouveau le fichier de l'application (.pkg) à partir des sources officielles et à le réinstaller. Ceci n'est pas obligatoire mais recommandé.\n- Official GameBaTo Application Package Direct Download Link : http://gamebatoapp.ir/home/app.pkg\n \n- Les problèmes de gel de l'écran et des téléchargements seront corrigés dans les jours à venir.\n \n- Des thèmes seront ajoutés quotidiennement à l'application. Les thèmes liés aux jeux seront téléchargeables à l'intérieur du jeu en question. Les thèmes personnalisés seront disponibles dans la section Thème du menu.\n- Les utilisateurs dont l'application tombe dans la boucle du processus de réparation peuvent savoir à quel stade du processus de mise à jour les fichiers de métadonnées ne sont pas téléchargés correctement.\n- Les utilisateurs qui obtiennent l'erreur CE-40740-5 après avoir téléchargé le package du jeu de base doivent télécharger le package de mise à jour/backport du même jeu pour que leur jeu fonctionne.\n \n- Informez-nous de tous les problèmes que vous rencontrez afin que nous puissions les résoudre. Ainsi, vous et d'autres utilisateurs qui n'ont pas accès à notre canal Telegram et à notre groupe pour poster les mêmes problèmes peuvent avoir une meilleure expérience en utilisant notre application.\n \n- Et la règle la plus importante de toutes est d'utiliser l'option Quitter dans le menu de l'application ou d'appuyer sur le bouton CERCLE sur l'écran principal de l'application chaque fois que vous voulez fermer l'application.\n \n \nTéléchargement : gamebatoapp.ir\n \n \n \n",
        "images": {}
    },
    "news_10": {
        "title": "[PS5] PS Multi Tools v13.1.1 disponible",
        "content": "Le développeur SvenGDK vient de mettre en ligne une nouvelle version de PS Multi Tools, l'outil à tout faire pour utilisateurs PlayStation est donc disponible dans sa version 13.1.1. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \nCette nouvelle version apporte son lot de changements. \n \n \n\n \n \nNouveau dans PS Multi Tools :\n \n- Ajout du dernier loader JAR de PS5 jusqu'au firmware 7.61 (pas d'exploit complet)\n- Menu Hôtes & DNS réorganisés\n- Ajout de nouveaux hôtes (Sleirsgoevy & Zecoxao)\n- Ajout d'un DNS alternatif (par Kameleon)\n- Plus de téléchargements ajoutés\n- etaHEN (par LightningMods)\n- etaHEN avec cheats\n- Homebrew Store (par LightningMods)\n- PS5-Kstuff (par Sleirsgoevy)\n- Mise à jour des patchs pour le jeu PS5 (libhijacker)\n \nCorrections :\n \n- Corrections et ajustements de l'utilisation hors ligne\n- Correction : PS3 PUP Unpacker ouvre maintenant la bonne fenêtre\n- Correction : Crash ou erreur lors de la recherche de correctifs pour les jeux PS5\n- Correction : PS5 PKG Builder n'acceptait pas un chemin avec des espaces\n- Correction : PSX XMB Installer Game Editor plantait lors du chargement de données non existantes depuis PSXDatacenter\n \n \nTéléchargement : PS Multi Tools v13.1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182043/in-ps5-ps-multi-tools-v1311-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] Sistr0 travaille sur un GoldHen PS5",
        "content": "Le développeur Sistr0 travaille sur une version de son payload GoldHen pour PS5, l'un des développeurs les plus connus de la scène PS4 vient en effet de publier une capture d'écran qui ne laisse aucun doute sur l'arrivée de la solution sur PS5. \n \nGoldHen est un payload PS4 qui s'apprente à une boite à outils qui intègre toutes les possibilités dans un seul endroit, avec lui sur PS4, il est possible de profiter d'énormémement de fonctions, comme le Debug Settings, le serveur FTP, un journal, les correctifs, patches, et autres mods, la possibilité d'appliquer des cheats codes ou encore la possiblité de lancer des homebrews. \n \n \n\n \n \nLe fait qu'il dévoile qu'il travaille sur une version PS5 de GoldHen est rassurant, cela signifie qu'il a bon espoir de porter GoldHen, qui viendra quelque peu en concurrence avec etaHEN de LightningMods, mais qui a n'en pas douter élargira les possibilités offertes sur PS5. \n \n \n \n\n \n \n \nLa capture d'écran montre un débogueur en cours d'exécution, qui se nommerait ps5debug v0.1 codé par Ctn & Sistr0 et ce qui serait un menu personnalisé. \n \n \nSource : ko-fi.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182016/in-ps5-sistr0-travaille-sur-un-goldhen-ps5-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182016/in-ps5-sistr0-travaille-sur-un-goldhen-ps5-1.png"
        }
    },
    "news_12": {
        "title": "[PS4] Unreal Engine 4 game MODDER v1.0",
        "content": "Il y a quelques temps, sur mon compte twitter, je vous annonçais avoir enfin réussi, après 3 ans environ, à convertir des mods complet Dragon Ball Fighter Z pc pour PS4. En effet, depuis un long moment je travaillais sur la conversion complète des mods PC vers PS4 mais j'étais bloqué à cause des textures PC qu'il fallait adapter pour PS4, c est maintenant chose faite...  De plus après un petit sondage, toujours sur mon compte Twitter, je vous proposais soit de publier les mods complets directement en PKG ,soit de publier mon outil de créationde FPKG des mods.Le résultat bien que très très serré, donne mon outil gagnant.  Vous trouverez donc cet outil et son fonctionnement dans cette new... Le principe est simple, ce script va décrypter la mise à jour du jeu, y ajouter les mods que vous aurez sélectionner et recréer la mise à jour incluant les mods, il ne vous restera plus qu' à installer le FPKG. Mon outil prend en compte les mods Dragon Ball Fighter Z, mais aussi les mods de Sifu, mais attention, il vous faudra AVANT de créer le FPKG convertir vous même les mods PC vers PS4, copier un mod PC directement dans l outil vous donnera un problème de textures in game...Je vous fourni une vingtaine de mods Dragon Ball Fighter Z convertis PS4, d autre viendront plus tard...Vous trouverez dans ce 1er pack de mods, Broly Xeno, Goku Armor, Trunk Armor, Gohan SSJ4, Goku God, Mod music, etc...  Tuto: - Placer le fpkg du jeu de base v1.0 dans le dossier game/dbz/- Placer le fpkg de la mise a jour du jeu dans le dossier maj/dbz/- Placer les mods voulus dans le dossier mods/dbz/- Lancer mod_builder.bat- Entrer le numéro CUSA de votre jeu (le numéro seulement)- Appuyer enter et patienter Pour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:https://www.paypal.com/paypalme/markus00095  Télécharger UE4 game modder v1.0Télécharger Mods_DBFZ ",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181991/in-ps4-unreal-engine-4-game-modder-v10-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1181991/in-ps4-unreal-engine-4-game-modder-v10-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1181991/in-ps4-unreal-engine-4-game-modder-v10-2.jpg"
        }
    },
    "news_13": {
        "title": "[XB360] J-Runner avec Extras v3.3.0 r2 disponible",
        "content": "En ce début de mois de novembre 2023, on se met au vert, cela faisait longtemps, donc basculons un peu dans le monde de Microsoft, bon bien entendu pour pouvoir le faire il faut se positionner sur deux générations de consoles, la Xbox 360. \n \nUne nouvelle mise à jour a été publiée pour J-Runner avec Extras, l'un des outils les plus complets toujours maintenu à jour par Octal450, et qui comme vous le savez s'intègre dans Xebuild pour lire, écrire ou encore créer des images NAND de la console de Microsft afin de réiniatialiser les problèmes de paramétrages ou appliquer le hack Jtag. \n \nLes nouveautés sont intéressantes, cela passe par une commande \" Nouvelle session \" qui a été améliorée, des correctifs pour les HDD XL, ou encore la correction d'un problème de détection d'image pour le modèle Corona 4 GO.\n \n \n\n \n \nChangelog :\n \n- Ajout : Amélioration de la commande New Session\n- Ajout : Mise à jour du patch XL HDD\n- Correction : Problème de détection de l'image Corona 4GB\n \nInstructions :\n \n- Téléchargez et extrayez J-Runner-with-Extras.zip pour l'exécutable et les fichiers d'assistance.\n- N'utilisez pas JR-Auto-Update-Delta.zip, ou le paquet pourrait ne pas être mis à jour correctement.\n \n \nTéléchargement :  J-Runner avec Extras v3.3.0 r2 \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181974/in-xb360-j-runner-avec-extras-v330-r2-disponible-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] PS5 Homebrew Store de LightningMods",
        "content": "Le développeur LightningMods a annoncé avoir mis en ligne le Homebrew Store pour la PS5, il a du pour cela travailler très dur puisqu'il a fallu refaire tous les packages des jeux et utilitaires de Lapy pour qu'ils fonctionnent sur PS5. \n \nAttention comme il le rappelle il faut disposer de etaHEN 1.0b (ou plus récent) pour en profiter, et bien entendu du firmware 4.03 et 4.50, seuls compatibles pour le moment. \n \n \n\n \n \nBien entendu, il ne s'agit pas d'un nouveau store, mais celui de la PS4 existant sur pkg-zone, il a juste été adapté pour qu'il fonctionne sur PS5.\n \nAvec lui vous allez pouvoir télécharger et installer les fPKG compatibles, si certains ne l'étaient pas, il faut le signaler à l'équipe PKG-Zone qui le travaillera pour remplacer le package et ainsi le rendre compatible PS5, preuve que ces changements sont plutôt simples à réaliser. \n \n \n\n \n \n \nIl existe toujours une page avec le chargement direct du payload \n \nLien : https://pkg-zone.com/exploit/PS5/index.html\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181953/in-ps5-ps5-homebrew-store-de-lightningmods-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1181953/in-ps5-ps5-homebrew-store-de-lightningmods-2.jpg"
        }
    },
    "news_15": {
        "title": "[PS5] Les premières photos de la PS5 slim, quoi en penser",
        "content": "A deux semaines du lancement officiel, voilà déjà que la PS5 \"Slim\" montre le bout de son nez, certains ont déjà le loisir d'en profiter et ont pu mettre la main sur ce nouveau modèle. \n \nQuelques utilisateurs de Twitter dévoile en effet des photos de PS5 Slim, mais là cela devient intéressant c'est lorqu'on la compare à l'ancien modèle.\n \n \n\n \n\n \n\n \n\n \n \nBien entendu, elle parait plus fine, mais elle l'est, elle est plus fine, plus légère, moins consommatrice d'énergie, les ports sont similaires, un port HDMI, deux ports USB, un connection d'alimentation et un port Ethernet. \n \nLe bémol, comme nous l'avions vu, il faudra bel et bien connecter votre PS5 à internet pour enregistrer votre lecteur optique à votre console. Il est en effet \"impossible d'utiliser le lecteur de disque. Vous devez connecter votre PS5 à votre réseau pour l'enregistrer sur votre PS5\". \n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181950/in-ps5-la-premiere-ps5-slim-en-image-quoi-en-penser-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1181950/in-ps5-la-premiere-ps5-slim-en-image-quoi-en-penser-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1181950/in-ps5-la-premiere-ps5-slim-en-image-quoi-en-penser-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1181950/in-ps5-la-premiere-ps5-slim-en-image-quoi-en-penser-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1181950/in-ps5-la-premiere-ps5-slim-en-image-quoi-en-penser-5.jpg"
        }
    },
    "news_16": {
        "title": "[2DS/3DS/DS] TWiLight Menu++ v26.2.0 et nds-bootstrap v1.0.2 disponibles",
        "content": "Le développeur RocketRobz est de retour avec de nouvelles versions de TWiLight Menu++ et de nds-bootstrap, au programme des correctifs AP supplémentaires ont été ajoutés à TWiLight Menu++ pour divers jeux, mais aussi le mode couleur pour les GBA/DS.\n \n \n \n\n \n \nTWiLight Menu++ v26.2.0 :\n \n- Ajout du mode de couleur GBA/DS Phat !\n- Le dé-banding des couleurs de la boîte/photo est maintenant utilisable sur les consoles DS debug/dev.\n- @edo9300 : Le niveau de luminosité peut maintenant être modifié sur les consoles DS Phat.\n- @lifehackerhansol : Ajout des fichiers de démarrage automatique pour les cartes EZ-Flash Vi et r4i.cn.\n- @R-YaTian : Ajout de quelques patchs AP et widescreen. (#2308)\n \nCorrections de bugs\n- @edo9300 : Correction de la détection des consoles DS Phat ou DS Lite.\n- @edo9300 : Correction d'un dépassement de tampon dans slot1launch. (#2310)\n- Thèmes R4/GBC : Correction de la liste des fichiers qui ne défile pas vers le bas jusqu'au fichier sélectionné, après avoir sélectionné l'icône Jeu.\n \n \nnds-bootstrap v1.0.2 :\n \n- Lors de l'utilisation des fonctions sans fil, le chargement de la ROM sur la carte SD de la DSi/3DS est à nouveau ralenti, afin d'éviter les erreurs.\n- Correction de la mise en miroir de la ROM si la taille de la ROM est supérieure à la taille de l'appareil définie dans l'en-tête de la ROM.\n- Correction de la prise en charge de certaines ROM modifiées (ex. traductions et ROM hacks).\n- Mode B4DS : Le moteur de triche a été déplacé vers la WRAM arm7 pour Inazuma Eleven 1 & 2.\n- Correction d'un cas où l'ouverture d'un menu fait planter le jeu avec un AP-fix appliqué.\n- Correction de la version européenne de Yoshi Touch & Go ne démarrant pas sur la carte SD de la DSi/3DS.\n- Mode B4DS : Pour éviter les bugs, TWiLight Menu++ doit maintenant être utilisé avec EZ_FLASH_RAM activé dans fat:/_nds/TWiLightMenu/settings.ini, afin d'utiliser une cartouche EZ-Flash Slot-2.\n \n \nTéléchargement : TWiLight Menu++ v26.2.0 et nds-bootstrap v1.0.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181945/in-2ds3dsds-twilight-menu-v2620-et-nds-bootstrap-v102-disponibles-1.jpg"
        }
    },
    "news_17": {
        "title": "[3DS] MSET9 version 1.2 disponible",
        "content": "Le développeur Zoogie vient de publié une nouvelle version de MSET9, cette nouvelle version le rend désormais compatible MacOS, pour rappel MSET9 est un exploit primaire ARM9 pour la 3DS qui peut être lancé avec seulement des données de nom de fichier ajoutées à la carte SD insérée.\nCette exploit fonctionne de la 11.4 a la 11.17, que ce soit sur Old ou New 3DS / 2DS\n \n\n \n\nChangelog :\n \n\n\n \n- Support de MacOS\n\n\n \nLien de téléchargement : MSET9 Beta 1.2\n \n\n \n",
        "images": {
            "image_1": "https://cdn.discordapp.com/attachments/1133267078929985636/1160914937934250014/image.png"
        }
    },
    "news_18": {
        "title": "[3DS/WiiU] Pretendo annonce la béta annuel plutôt que prévue",
        "content": "L'équipe de Prétendo vienne de faire une annonce concernant la sortie de la nouvelle béta et du contenue disponible, disponible des maintenant.\n \nPour rappel, Pretendo est un remplacement gratuit et open-source des serveurs Nintendo pour la 3DS et la Wii U permettant la connectivité en ligne pour tous, y compris après l'arrêt des serveurs officiels.\nComme vous le savez, les serveurs de Nintendo vont officiellement fermé en avril 2024,\nPretendo est donc l'alternative tout trouvé pour réimplémenté le online sur les jeux en ayant besoin sur 3DS et WiiU.\n \n\n \n \nComme annoncé par l'équipe de Prétendo, ils ont travailler pour apporté du nouveau contenue / jeux en béta public, car comme annoncé une béta est en effet proposé chaque année pendant le mois de décembre, mais l'équipe de Pretendo à annoncé que cette dernière allais bénéficier d'un mois supplémentaire et commencerais ce jour, le Mercredi 1 Novembre 2023.\n \n\n \nLes jeux ajoutés avec cette nouvelle béta sont : \n- Super Mario Maker pour la WiiU et la 3DS \n- Splatoon pour la WiiU\n- The Legend of Zelda : Tri Force Heroes pour la 3DS\n- IronFall : Invasion pour la 3DS \n- Pokkén Tournament pour la WiiU\n- PIKMIN 3 pour la WiiU\n- Steel Diver : Sub Wars pour la 3DS\nCela porte la liste totale des serveurs disponibles à\n- Wara Wara Plaza\n- Mario Kart 8 \n- Mario Kart 7 \n- Super Mario Maker pour la WiiU et la 3DS \n- Splatoon \n- The Legend of Zelda : Tri Force Heroes\n- IronFall : Invasion \n- Kid Icarus : Uprising \n- Pokkén Tournament \n- PIKMIN 3 \n- Steel Diver : Sub Wars\n \nLes serveurs suivants ne sont toujours pas disponibles actuellement, pour diverses raisons, mais sont toujours prévus pour la date de sortie initiale de décembre (ou peut-être même plus tôt)\n \n- Juxtaposition (Miiverse) \n- Pokémon Rumble World \n- Team Kirby Clash Deluxe \n \nPour des raisons techniques, les serveurs suivants ne sont pas programmés pour une version bêta publique \n \n- Minecraft : Édition Wii U\n \nLa liste peut-être susceptible à des changements.\nVeuillez noter que toutes les fonctionnalités ne sont pas prises en charge par tous les serveurs. Si une fonctionnalité ne fonctionne pas comme prévu, veuillez consulter le site de Pretendo pour avoir une vue d'ensemble des fonctionnalités prises en charge par chaque serveur. Si la fonctionnalité est listée comme étant prise en charge, mais qu'elle ne fonctionne pas comme prévu, veuillez remplir un rapport de bug dans le support.\nNote importante concernant Super Mario Maker\n \nEn raison de limitations techniques, à partir de cette version bêta, tous les cours postés AVANT sont supprimés. Ceci est dû au fait que nous avons changé de base de données et de fournisseur S3.\nL'ancien système de base de données n'étant pas compatible avec le nouveau, une migration des anciens cours n'était pas possible.\nDe plus, l'ancien serveur faisait BEAUCOUP de mauvaises suppositions concernant les données des utilisateurs et les téléchargements, et avait donc sa propre myriade de problèmes.\nCes problèmes ont été corrigés dans la dernière version, et la nouvelle base de données est conçue de manière à rendre les migrations possibles si un changement devait se produire à nouveau.\nÀ l'avenir, il ne devrait plus y avoir de réinitialisation pour Super Mario Maker, mais comme tout est encore en version bêta, cette situation est toujours sujette à changement \n \nNote importante concernant Steel Diver : Sub Wars\n \nNintendo a actuellement désactivé ce serveur pour des raisons de maintenance. Il n'y a pas eu d'explication publique à ce sujet. Il pourrait s'agir d'un autre exploit non divulgué dans le jeu, ou d'un problème sans rapport avec le jeu. Nous vous recommandons de procéder avec prudence\nPour installés et utilisé Pretendo.\nUn guide vous est présenté sur le site de Pretendo\n",
        "images": {
            "image_1": "https://news.nobuyoshi.red/articles/ressources/articles_images/Pretendo-1638441907.png",
            "image_2": "https://cdn.discordapp.com/attachments/413884110667251722/1158876793554604182/2022-08-17_13.53.29.466_TV.jpg"
        }
    },
    "news_19": {
        "title": "[Switch] NeXT 3.05 disponible",
        "content": "Le développeur mistervampi propose une nouvelle version de NeXT, la solution passe en version 3.05 à l'occasion d'Halloween.\n \nNeXT, pour ceux qui ne le connaitrait pas, est un tout en un qui supporte les CFW que ce soit Atmosphere ou SX OS, de plus sa gestion des applications est largement simplifiée par une interface utilisateur très fonctionnelle. Similaire à DeepSea ou encore RetroReloaded, NeXT intègre de nombreux payloads, et sa plus grande des possibilités est de pouvoir facilement gérer Atmosphere et SX OS au travers d'une interface graphique riche. \n \n \n\n \n \nNeXT assure une compatibilité totale avec toutes les consoles Switch qu'elles soient modifiées en hard ou en software. \n \nMise à jour de cette version 3.05 : \n \n- Support intégral du firmware 17.0.0\n- Atmosphere 1.6.2\n- Sigmapatches\n \n \nTéléchargement : NeXT 3.05  \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-167416608.jpg"
        }
    },
    "news_20": {
        "title": "[PS4] PS4 Wee Tools v0.9.5 disponible",
        "content": "En ce dernier jour d'octobre, le développeur Abkarino propose une nouvelle version de son outil PS4 Wee Tools qui est désormais livré en v0.9.5.\n \nLa solution gratuite de donwgrade PS4 dispose donc de nouvelles fonctionnalités.\n \n\nNouveautés :\n \n- NOR : patcher Southbridge\n- NOR : patcher Torus (WiFi+BT)\n- NOR : analyse et récupération de partition\n- NOR : mode rapide/expert pour la récupération des partitions\n- NOR : bascule du flag toogle actif\n- NOR : patch légitime rapide (drag&drop 2 dumps sur run.bat)\n- SCFlasher : Effacement sûr de syscon\n- SC : nettoyage complet\n- SC : autopatch fonctionne maintenant avec n'importe quel* syscon\n- SC : correction de la méthode B\n- SC : le patch manuel fonctionne maintenant avec flatdata\n- SC : affiche le compteur de lignes\n- Mise à jour de la librairie Util\n- Correction des bogues d'Utils\n- Optimisation du code\n \n\n \n\n \n\n \n \n \nPS4-Wee-Tools v0.9.5 disponible :\n- Mode rapide/expert pour la récupération des partitions\n- Patcheur Southbridge\n- Patcheur Torus (WiFi+BT)\n- Mise à jour de la librairie Util\n \nLe patcheur Torus (wi-fi+bt) est désormais inclus. Peut-être que pour quelqu'un ce sera quelque chose de \"nouveau\" mais toutes ces fonctionnalités sont très simples et en fait elles pouvaient être réalisées avec les versions précédentes de wee-tools comme le précise l'auteur. Cette option vous permet simplement de gagner du temps. \n \n \n \nTéléchargement : PS4-Wee-Tools v0.9.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2077743693.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1537784304.png"
        }
    }
}