{
    "news_1": {
        "title": "[PS4] Lapy va proposer probablement la mise à jour d'Easy PKG Extractor",
        "content": "Le développeur Lapy vient de mettre en ligne un post et une courte vidéo de ce qui serait la mise à jour d'Easy PKG Extractor. \n \nIl a annoncé sur son profil X qu'il va offrir à tout ceux qui l'ont soutenu un petit cadeau pour Noël sans préciser ce que c'est exactement. Cependant il a rajouté que cet outil sera compatible avec PS4-Xplorer 2.03 sur tous les firmwares, du 5.00 au 11.00. \n \n \n \n\n \n \n \nSi vous lui avez déjà fait un don, il suffira de lui envoyer un DM pour l'obtenir. \n \n \n\n \n \nCe cadeau semble être la mise à jour d'Easy PKG Extractor un logiciel qu'il ne souhaitez plus proposer pour des raisons éthiques comme nous vous l'avions expliqué en Mars 2022. \n \n \nDans mon pays, le piratage est pratiquement légal et beaucoup de mes amis vendent des PKG pour gagner leur vie. Mon application (NDLR : Easy PKG Extractor) leur était nuisible, c'est pourquoi je ne l'ai pas encore mise à jour.\n \n \nIl se pourrait que Lapy a donc évolué sur la question, et souhaite donc proposer la mise à jour de ce logiciel, espérons que cela soit cela, ce serait une excellente nouvelle tellement ce soft est utile. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1296316698.jpg"
        }
    },
    "news_2": {
        "title": "[PS3] PS3HEN 3.3.1 Bêta Test 6 d'esc0rd3w disponible",
        "content": " \n \nLe développeur esc0rd3w est de retour avec une nouvelle version de PS3HEN 3.3.1 qu'il souhaite mettre à jour afin de proposer les dernières nouveautés à la PS3. Ce sont pas moins de 6 versions tests qui ont été proposées via PSX-Place.com.\n \n \n \n\n \n \n \nLes changements sont nombreux après un mois de développement :\n \n- Le code lié à la création de fichiers RIF a été retravaillé de mappath vers les fichiers source et d'en-tête make_rif. OP a été mis à jour pour refléter les changements, et tous les anciens packages de test ont été archivés. \n \n- Il a aussi optimisé le code pour qu'il corresponde plus étroitement à la base du code COBRA actuel. Les fonctions mutex ont également été mises à jour dans mappath.\n \n- Cette mise à jour ajoute la prise en charge de la lecture du fichier rap.bin et la prise en charge de PS Home avec XML personnalisé de DeViL303\n \n- Ajout d'une version non-debug (test31b) et d'une autre pour laquelle @aldostools (test32) a apporté quelques modifications pour les performances\n \n- Mises à jour de make_rif depuis @aldostools pour les performances\n \n \nS'agissant de versions tests, ces versions sont à réserver à un public averti, qui pourraient rencontrer des bugs, il faut maitriser le sujet d'ailleurs l'URL dev devrait installer le package 3.3.1 uniquement si vous avez activé le mode développement dans HEN via HFW Tools -> Development.  \n \n \nLien de téléchargement : PS3HEN 3.3.1 Bêta Test 6\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-329717278.png"
        }
    },
    "news_3": {
        "title": "[Wii/GC] Swiss v0.6r1788 disponible avec de nombreuses nouveautés",
        "content": " \nLe développeur Extrems a travaillé énormément sur sa solution Swiss pour la Nintendo Wii et Nintendo Gamecube. \n \nComme vous le savez probablement Swiss est le digne successeur de SD-boot, il permet de lancer les homebrews GameCube mais aussi les backups stockés sur carte SD ou un disque dur, SDGecko, WODE, Wiikey Fusion et bien d'autres solutions. \n \nAu programme de cette version des changements imposants procédés par Extrems. \n \n \n\n \n \n \n \n \n \nChangelog : \n \n- Ajout le pilote de base du W5500 dans l'hyperviseur.\n- Ajout d'un pilote de base pour le W6100 dans l'hyperviseur.\n- Prise en charge du démarrage propre avec des jeux à 2 disques sur FlippyDrive.\n- Cacher les extensions .gcm.gcm et .iso.iso.\n- Ne copier le nouveau nom que si le renommage réussit.\n- Ne gérer les interruptions que lorsque c'est nécessaire.\n- Ajout de la sélection du profil RetroTINK-4K via ser2net.\n- Prise en charge du passage du lecteur de disque FlippyDrive.\n- Ajout d'un délai d'attente en cas de problème de couverture du FlippyDrive.\n- Tentative de décachetage du FlippyDrive lorsqu'un seul lecteur de disque est détecté.\n- Ne pas forcer le menu IPL à la sortie lorsque le FlippyDrive est présent.\n- Correction d'un masque de réseau erroné après un échec DHCP lors de la première installation.\n- Remplacer le cache FAT par libdvm.\n- Intégration du patch « contiguous clusters » de Wonderful Toolchain.\n- Correction d'une erreur de croissance de fichier sur exFAT.\n- Mise à jour de FatFs vers R0.15a.\n- Ne cacher que les fichiers cachés dans la vue triée.\n- Utiliser la vue non triée pour le démarrage automatique.\n- Appliquer la transparence à l'icône des fichiers cachés.\n- Ajout de Wii Swiss Booter.\n- Améliorer le transfert depuis le cMIOS.\n- Réécriture de la branche à la place.\n- Correction d'une coquille bizarre dans FSI_TrailSig.\n- Ajout d'une option permettant de réinitialiser les paramètres globaux/par défaut du jeu.\n- Mise à jour de la base de données No-Intro.\n- Mise à jour de la base de données Redump.\n- Déplacement de l'appel disk_shutdown vers f_mount.\n- Ajout de l'affichage du registre CID de la carte SD.\n- Ajustement pour les changements de libogc2.\n- Ajout de l'option hide file pour les périphériques FAT.\n- Cacher à nouveau le répertoire swiss.\n- Reconnaissance des fichiers .fdi sur FlippyDrive.\n- Ajout d'une solution de contournement pour la taille de fichier byteswapped.\n- Prise en charge du masquage des fichiers .dot sur tous les appareils.\n- Refonte des vérifications de la version de FlippyDrive.\n- Ajout d'un nom d'affichage pour les répertoires d'applications et de jeux.\n- Utilisation d'une vue non triée pour l'entrée de l'autoload.\n- Implémentation de statFile pour une utilisation future.\n- Compatibilité avec F-Zero GX Unleashed.\n- Ajout de l'affichage des classes de vitesse de la carte SD.\n- Affichage de la capacité totale de la carte SD.\n- Ajout d'une option pour désactiver un emplacement de carte mémoire.\n- Prise en charge du redémarrage sur FlippyDrive avec passthrough actif.\n- Retour anticipé si le périphérique n'a pas de répertoire.\n- Réduire le risque de blocage avec une liste récente vide.\n- Appliquer les graphiques appropriés pour ETH2GC Netcard+.\n- Éviter d'afficher une bannière factice dans le navigateur de fichiers.\n- Ajouter l'icône de fichier FPKG.\n- Activer le support du port série 1 dans l'hyperviseur.\n- S'assurer que tous les périphériques sont désinitialisés à la sortie.\n \n \nTéléchargement : Swiss v0.6r1788\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201968/in-wiigc-swiss-v06r1788-disponible-avec-de-nombreuses-nouveautes-1.jpg"
        }
    },
    "news_4": {
        "title": "[PS4] PPPwnUI 3.32a disponible avec GoldHEN 2.4b18.2",
        "content": "Le développeur Aldo Vargas, Aldostools, propose la mise à jour de PPPwnUI qui est maintenant déployé en v3.32a modded by aldostools.\n \nCette version a pour principale nouveauté l'intégration de la toute dernière version GoldHEN 2.4b18.2 de Sistr0. \n \n \n\n \n \n \nPPPwnUI 3.32a mis à jour avec la dernière version GoldHEN 2.4b18.2 par SiSTR0 :\n \n- Ajout du patch PPPoE pour éviter les exploitations multiples\n- Améliorations de l'analyse des packages :\n- Les dossiers commençant par un point et ceux contenant un fichier « .ignore » seront automatiquement ignorés.\n \n \n \nTéléchargement : PPPwnUI 3.32a\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201959/in-ps4-pppwnui-332a-disponible-avec-goldhen-24b182-1.png"
        }
    },
    "news_5": {
        "title": "[Wii/WiiU] Bluebomb Micro v1.1 disponible",
        "content": "Le développeur GaryOderNichts, à qui l'on doit des outils comme UDPIH, Bloopair, DNSpresso, Wii U recovery menu, ou encore BluUBomb, vient de mettre en ligne une nouvelle version de Bluebomb Micro. \n \nCette version est un portage de BlueBomb de BlueKitchen qui fonctionne sur divers systèmes embarqués et microcontrôleurs.\n \n \n\n \n \n \nCette nouvelle version ajoute le support des Raspberry Pi Pico 2 W, en plus des Raspberry Pi Pico W, et il supportait déjà les périphériques équipés de ESP32. \n \n \n\n \n \nUsage :\n \n- Assurez-vous que votre microcontrôleur est branché et que BlueBomb Micro est en marche.\n- Si votre microcontrôleur est équipé d'une LED, elle clignotera lentement à ce stade.\n- Démarrez votre Wii et accédez à l'application que vous exploitez. Pour le menu système, il vous suffit d'allumer la Wii, vous pouvez la laisser sur l'écran Santé et sécurité.\n- Éteignez votre Wiimote à ce stade. NE LAISSEZ RIEN d'autre se connecter à la console via Bluetooth.\n- Assurez-vous que votre console est proche de votre microcontrôleur. Vous devrez peut-être la rapprocher pour la mettre à portée, cela dépendra de votre microcontrôleur.\n- Cliquez sur le bouton SYNC de votre console. Vous devrez peut-être cliquer dessus plusieurs fois de suite avant qu'il ne voie le microcontrôleur.\n- Si votre microcontrôleur est doté d'une LED, vous saurez qu'il est connecté lorsque la LED commencera à clignoter rapidement. Arrêtez d'appuyer sur le bouton SYNC et attendez que BlueBomb s'exécute. BlueBomb Micro chargera un fichier boot.elf à partir de la racine d'une clé USB formatée en FAT32 et l'exécutera. Vous pouvez utiliser le fichier boot.elf de l'installateur HackMii à partir d' ici pour obtenir le canal Homebrew.\n \n \nTéléchargement : Bluebomb Micro v1.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201954/in-wiiwiiu-bluebomb-micro-v11-disponible-1.jpg"
        }
    },
    "news_6": {
        "title": "[PS4] GoldHEN v2.4b18.2 disponible",
        "content": "Et voilà il n'aura pas fallu attendre bien longtemps, le nouveau GoldHEN est disponible, il s'agit de la version v2.4b18.2 qui est proposée par SiSTR0 contre un petit café ou bien vous pouvez aussi l'obtenir gratuitement, il suffit juste de rentrer son adresse email. Bien entendu certains hosts vont mettre à jour leur proposition pour l'intégrer directement.\n \n \n\n \n \n\n \n \nDescription : \n \nBonjour à tous ! La nouvelle version bêta est disponible ! Désolé pour l'attente mais comme toujours dans mon temps libre je continue à travailler sur GoldHEN pour l'améliorer et ajouter de nouvelles fonctionnalités utiles à tous.\n \nMerci à mes amis ctn et kameleon pour leur soutien continu, pas seulement technique ! \n \nMerci aussi à tous ceux qui ont soutenu mon projet sur kofi !\n \n \nChangelog v2.4b18.2 :\n \n- Ajout d'un correctif PPPoE pour éviter les exploitations multiples\n- Amélioration de l'analyse des paquets :\n- Ajout de la prise en charge de l'exclusion de dossiers lors de l'analyse des paquets. Les dossiers commençant par un point (par exemple, « .test ») et ceux contenant un fichier « .ignore » seront automatiquement ignorés.\n \n \nListe des choses à faire\n \n- Ajouter la prise en charge de la version 9.03 et d'autres versions\n- Ajouter d'autres fonctionnalités étonnantes\n \n \nComme toujours, je vous rappelle qu'il s'agit d'une version bêta et que malgré mes vérifications minutieuses et celles des testeurs, certains bugs peuvent émerger.\n \nMerci de les signaler sur le serveur discord si vous en trouvez.\n \n \nTout est là : GoldHEN v2.4b18.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201950/in-ps4-goldhen-v24b182-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201950/in-ps4-goldhen-v24b182-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[PS4] PPlay 4.01 disponible",
        "content": "Le développeur psbax4 propose une nouvelle version de PPlay via PSXhax.com à destination de la PS4. Cette nouvelle version se distingue car elle prend en charge le DLNA, le stream et le https. \n \nDe plus dans cette version les shaders sont précompilés et les options réseau ont été mises à jour. \n \n \n\n \n \nLisez le fichier readme.txt pour la configuration, le développeur souhaite regarder s'il peut intégrer le support CEC, mais il pense que le matériel HDMI ne soit pris en charge par les logiciels open source.\n \n \n \nTéléchargement : PPlay 4.01 (PKG)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201938/in-multi-pplay-401-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[WiiU] Le plugin Aroma Better Settings passe en version 1.2",
        "content": "Le développeur Fangal-Airbag propose la version 1.2 de Better Settings, il s'agit d'un plugin Aroma, qui permet d'afficher des informations importantes sur la TV et d'apporter le support des contrôleurs Wii U Pro et Wii Classic. Cela rend l'accès aux paramètres du système plus pratique et intuitif.\n \n \n\n \n \nCe plugin est particulièrement utile pour les utilisateurs cherchant à améliorer leur expérience avec les paramètres système de la Wii U. Il permet de :\n \n- Afficher des informations importantes directement sur la TV.\n- Utiliser différents contrôleurs pour naviguer dans les paramètres.\n- Améliorer l'ergonomie et la convivialité des paramètres système.\n \nInstallation :\n \nPour installer Better Settings, placez le fichier .wps dans sd:/wiiu/environments/aroma/plugins. Accédez au menu de configuration du plugin en appuyant sur L+D-Pad Bas+Moins sur le GamePad, le Pro Controller ou le Classic Controller.\n \nChangelog 1.2 : \n \nBetter Settings utilise désormais la nouvelle API de stockage pour stocker les paramètres du plugin. : \n \n- Mises à jour de la nouvelle API de stockage WUPS\n \n \n \nTéléchargement : Better Settings 1.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201937/in-wiiu-le-plugin-aroma-better-settings-passe-en-version-12-1.png"
        }
    },
    "news_9": {
        "title": "[Multi] ScummVM v2.9.0 disponible",
        "content": " \nDepuis début Novembre 2024 l'équipe en charge du développement de ScummVM travaillait sur une nouvelle version de leur émulateur et proposait à quelques bêtas testeurs de les pré-tester. Et bien voilà que cette nouvelle version débarque sous l'estampille 2.9.0. \n \n \n\n \n \nPrès d'un an après la dernière sortie de la dernière version majeure, voilà une nouvelle version importante, qui amène par exemple le support de 15 nouveaux jeux, et une nouvelle plateforme supportée, avec notamment la version iOS qui rajoute la prise en charge de l'Apple Pencil, mais aussi le portage officiel pour Sailfish OS.\n \nFaisons le tour du changelog pour comprendre les améliorations de cette version 2.9.0 :\n \nLe support de 15 nouveaux jeux : \n \nThe Adventures of the Good Soldier Schweik\nBackyard Basketball\nCastle Master\nMarvellous Mice Adventures: Meeting Sea Rat\nMarvellous Mice Adventures: Sea Rat's Birthday\nMask Show\nMoonbase Commander\nOrion Burger\nRise of the Dragon\nThe Space Bar\nThimbleweed Park[^1]\nTotal Eclipse\nTotal Eclipse 2\nUnrest\nWait for it! Issue 3. Song for a Hare\n \n \nNouvelle plateforme :\n \nScummVM dispose désormais d'un portage officiel pour Sailfish OS. En attendant l'apparition des versions officielles, les utilisateurs aventureux sont invités à créer leur propre copie très personnalisée !\n \nAméliorations notables du moteur :\n \nLe moteur AGS a été mis à jour vers la version 3.6.1.30 en amont, ce qui ajoute la prise en charge de certains jeux récemment sortis, tels que Stranger in Utopia, The Phantom Fellows et It Takes Two to Tangle.\n \nLa prise en charge de Keymapper a été ajoutée à plus de 20 moteurs, permettant la personnalisation des touches, des boutons de la souris et des boutons du joystick utilisés pour jouer aux jeux.\n \nLe moteur SCI bénéficie de nombreuses corrections de scripts pour divers jeux et d'une impressionnante fonction de réparation vocale pour Gabriel Knight 1 CD.\n \nLe moteur SCUMM apporte des améliorations graphiques et audio pour la version Macintosh de plusieurs jeux.\n \n \nAméliorations notables de la plateforme :\n \nLa version macOS pour les systèmes Intel et Apple Silicon récents a été signée et notariée, elle a donc été acceptée par Apple Gatekeeper.\n \nLa version Android prend désormais en charge Android 15 et offre une prise en charge améliorée de la manette de jeu.\n \nLa version iOS ajoute la prise en charge de l'Apple Pencil, qui était l'une des fonctionnalités les plus demandées.\n \n \n \nTéléchargement : ScummVM v2.9.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201936/in-multi-scummvm-v290-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS4] Apollo Save Tool v2.0.0 disponible",
        "content": "A l'occasion de Noël, Damina Parrino, alias Bucanero, nous propose la version 2.0.0 d'Apollo Save Tool qu'il dévoile comme un cadeau pour le réveillon. \n \nVoici une version anticipée de Noël de la PS4 Apollo Save Tool v2.0.0, Apollo prend prend désormais en charge tous les firmwares PS4 actuels/passés/futurs sans aucun correctif ShellCore. \n \nAttention il convient de bien lire l'encadré selon les firmwares si vous souhaitez jouer avec les trophées. \n \n \n\n \n \nChangelog 2.0.0 : \n \nAjout : \n- Support complet du firmware PS4 (fonctionne sur tous les FW) - merci à hzhreal / Team-Alua\n- Agnostique au niveau du firmware\n- Pas besoin de GoldHEN, PS4HEN, ou ps4debug payload\n \nGestion des trophées :\n- Liste, montage et exportation des trophées\n- Fake trophées XMB (verrouiller/déverrouiller)\n- Exportation et sauvegarde des trophées\n- Suppression de jeux de trophées\nSupprimer les sauvegardes PS4\nAffiche la date et l'heure de la dernière modification de la sauvegarde\n \nRemarque : la suppression d'un ensemble de trophées supprime les fichiers de trophées critiques du compte de l'utilisateur, et le fait d'essayer de jouer à nouveau au jeu ne permettra pas d'obtenir les trophées de cet utilisateur.\n \nRemarque : le faux déverrouillage des trophées ne modifie pas les fichiers de trophées sécurisés ; il ne fait que modifier la base de données du XMB. Si vous jouez au jeu après avoir appliqué les modifications, les faux résultats peuvent être réinitialisés par le système.\n \nTéléchargement : Apollo Save Tool v2.0.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201901/in-ps4-apollo-save-tool-v200-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[Switch] SaltyNX 1.2.0 et FPSLocker 2.1.0 disponibles",
        "content": " \n \nLe développeur Masagrator a publié des mises à jour pour SaltyNX et pour FPSLocker, la communauté des moddeurs de la Nintendo Switch a été récemment mise au courant de la sortie de nouvelles versions de SaltyNX et FPSLocker, deux outils essentiels pour améliorer les performances et la compatibilité des jeux sur la console. \n \n \n \n\n \n \n \nSaltyNX est un processus en arrière-plan qui permet l'injection et la modification de code. Il est utilisé par divers outils tels que ReverseNX-Tool, ReverseNX-RT, et Status Monitor en conjonction avec NX-FPS, UnityGraphics, et plusieurs mods de Smash. SaltyNX est basé sur shinyquagsire23 et inclut de nombreuses améliorations l'expérience utilisateur (QoL) ainsi que le support des plugins.\n \nSaltyNX est particulièrement utile pour les moddeurs et les joueurs qui souhaitent optimiser leurs jeux sur la Nintendo Switch. Il permet de :\n \n- Afficher la fréquence d'images des jeux via le Status Monitor Overlay.\n- Modifier les paramètres de rendu pour améliorer les performances visuelles.\n- Faciliter le modding en affichant les résolutions utilisées par les jeux.\n- Exécuter des mods et des plugins pour des jeux 64-bit non compatibles avec les plugins externes\n \n \nChangelog 1.2.0 : \n \n- Ajout du support pour le changement des taux de rafraîchissement en mode docké, de 40 à 60 Hz.\n- Le symodule supporte maintenant la dernière version de libnx.\n- Le core est désormais totalement indépendant des nouvelles versions de libnx.\n- La formule mathématique pour changer le taux de rafraîchissement en mode portable a été considérablement améliorée.\n- Dans NX-FPS, diverses fonctions liées à l'envoi des images à l'affichage partagent maintenant une fonction commune pour compter les FPS, ce qui permet d'éviter les situations où différentes API pourraient avoir des problèmes différents.\n- Le taux de rafraîchissement est écrit dans le pointeur displaySync de NX-FPS chaque fois que le jeu fonctionne avec la synchronisation d'affichage activée.\n- Désactiver SaltyNX dans SaltyNX-Tool ne causera plus de problèmes avec dmnt.gen2 lorsqu'il est attaché avec l'application monitor wait.\n- Merci à toutes les personnes qui ont testé cela au cours des trois dernières semaines.\n \n \nTéléchargement : SaltyNX 1.2.0 \n \n \n\n \n \n \nIl a également mis à jour FPSLocker, cela n'avait pas été le cas depuis plus de 2 mois. FPSLocker est une superposition qui, en conjonction avec SaltyNX, permet aux utilisateurs de définir des taux de rafraîchissement personnalisés et des FPS dans les jeux Nintendo Switch. Cela permet d'améliorer les performances visuelles et de réduire les problèmes de latence.\n \n \nChangelog 2.1.0 : \n \n- Ajout de la prise en charge de la modification des taux de rafraîchissement en mode ancré. Pour en savoir plus, consultez le fichier README.\n- Modification de certains choix de conception de libtesla pour le rendre moins gourmand en ressources CPU. Correction de problèmes où l'ouverture de FPSLocker pouvait entraîner une baisse visible des performances dans certains jeux.\n- Chaque fois que le patch FPSLocker force actuellement 60 Hz, la superposition en informera dans le menu principal\n- SaltyNX 1.2.0+ est OBLIGATOIRE ! L'utilisation d'anciennes versions de SaltyNX peut et va probablement causer des problèmes !\n- Pour les jeux Xenoblade Chronicles et The Legend of Zelda, il est nécessaire de retélécharger la configuration et de la convertir en patch, sinon attendez-vous à des problèmes.\n \n \nTéléchargement : FPSLocker 2.1.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201892/in-switch-saltynx-120-et-fpslocker-210-disponibles-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201892/in-switch-saltynx-120-et-fpslocker-210-disponibles-1.jpg"
        }
    },
    "news_12": {
        "title": "[PS4] Une nouvelle version de GoldHEN sur PS4 pour Noël",
        "content": "Le développeur SiSTR0 propose une nouvelle version de GlodHEN, le plugin magique de la PS4 débarque dans une version Noël qui répond aux attentes de certains utilisateurs. \n\n \nAvant toute chose, le développeur souhaite un Joyeux Noël à ceux qui le fête, mais concernant GoldHEN il dit avoir préparé une version qui devrait améliorer l'expérience pour ceux qui utilisent PPPwn. Il semble qu'il existe plusieurs implémentations qui tentent à plusieurs reprises d'exploiter la console, provoquant une instabilité importante. La nouvelle version inclut une fonctionnalité optionnelle qui corrige PPPoE pour empêcher de nouvelles tentatives d'exploitation.\n \nDans cette version, il a également implémenté une fonctionnalité demandée sur GitHub par certains utilisateurs : la possibilité de définir des règles d'exclusion de dossiers lors de l'analyse des paquets. Tous les dossiers commençant par un point et ceux contenant un fichier \".ignore\" seront ignorés, y compris leur contenu, lors de la recherche. \n \n \n\n \n \nIl publiera bientôt cette mini mise à jour et il espère qu'elle aidera beaucoup d'entre vous. Enfin il conclut en disant qu'il travaille aussi sur d'autres nouvelles fonctionnalités majeures qu'il publiera dès qu'elles seront prêtes et testées.\n \nTout est là si vous souhaitez supporter le développeur : ko-fi.com\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201859/in-ps4-une-nouvelle-version-de-goldhen-sur-ps4-pour-noel-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201859/in-ps4-une-nouvelle-version-de-goldhen-sur-ps4-pour-noel-2.png"
        }
    },
    "news_13": {
        "title": "[Switch] Sphaira proposé en version 0.4.1",
        "content": "L'alternative au hbmenu sur Nintendo Switch, Sphaira, vient d'évoluer sous les traits de son développeur TotalJustice. \n \nIl y a un peu moins d'une semaine, notre ami sunriseur dotmedhdi nous présenté Sphaira, la solution de remplacement du hbmenu proposant des fonctionnalités inédites, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \n \n\n \n\n \n \nLe soft a déjà pas mal évolué TotalJustice ayant proposé une build v0.4.0 assez riche, avec notamment une contribution de notre ami shadow256 qui a amélioré la traduction française, ainsi qu'une v0.4.1 qui vient corriger quelques bugs, notamment sur l'affichage de l'heure. \n \n \n\n \n\n \n \nChangelog v0.4.0 : \n \n- Amélioration de la traduction portugaise par ninstaren \n- Utilisation de la traduction du chinois natif par WE1ZARD\n- Traduction italienne ajoutée par LNLenost\n- Amélioration de la traduction française par shadow256\n- Traduction chinoise par do-kiss\n- Traduction japonaise par ITotalJustice\n- i18n : Amélioration des paramètres régionaux fr par acuteaura\n- Nouvelle icône par ninstar\n- Ajout du thème noir OLED par Sanrax\n- Traduction coréenne par Yorunokyujitsud\n- Mise à jour de fr.json par Battosai94\n- Mise à jour ajoutée\n- Extrait de texte dans le navigateur de fichiers \n- Correction des effets sonores incohérents \n- Ajout de temps au menu principal\n- Correction de Sphaira qui ne sort pas du menu d'accueil lorsqu'il est lancé en tant que hbmenu\n- Ajout de la prise en charge du chargement des traductions localement dans/config/sphaira/i18n/\n- Ajout d'une option pour installer un gestionnaire nro via le navigateur de fichiers\n \nChangelog v0.4.1 :\n \n- Correction de l'heure affichée en heure GM, au lieu de l'heure locale\n- Mise à jour de ru.json par J0hnTR\n \nTéléchargement : Sphaira v0.4.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201851/in-switch-sphaira-propose-en-version-041-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1201851/in-switch-sphaira-propose-en-version-041-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1201851/in-switch-sphaira-propose-en-version-041-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1201851/in-switch-sphaira-propose-en-version-041-4.jpg"
        }
    },
    "news_14": {
        "title": "[PS3] CFW Evilnat 4.91.2 Beta 17 disponible",
        "content": "Le développeur Nathan Martin, plus connu sous le nom d'Evilnat, propose la Bêta 17 de son custom firmware à destination de la PS3. \n \nAvec cette nouvelle version du CFW Evilnat 4.91.2 Beta 17, le développeur a souhaité apporter un énorme patch pour éviter le brick sur CEX TargetID avec le kernel DEX chargé.\n \n\n \n \nAinsi voici le changelog :\n \n- kernel DEX patché pour contourner le brick de bip d'ambulance (Kernel DEX chargé avec CEX TargetID)\n- Seules les variantes PEX et D-PEX sont disponibles pour le moment (par manque de temps pour tester toutes les variantes).\n- Tous les tests concernant le contournement du « bip d'ambulance » lorsque le kernel DEX est chargé avec le CEX TargetID ont été effectués avec succès et fonctionnent correctement, merci à @Pusch3l pour l'avoir testé ! \n \nPour le patcher, vous devez décrypter 4.84 DEX lv2_kernel.self et patcher ce qui suit :\n \noffset : 0x283A7C\nValeur originale : 0xE86219787C0802A6\nRemplacer par : 0x386000004E800020 (retour 0)\n \nCeci remplacera la fonction entière pour retourner 0 au lieu de faire biper la PS3 et de l'éteindre, ce qui la rendra inutilisable lors de la conversion en CEX sans changer le Kernel.\n \nCette fonction n'est présente que sur les kernel DEX.\n \n \nTéléchargement : CFW Evilnat 4.91.2 Beta 17\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201838/in-ps3-cfw-evilnat-4912-beta-17-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[PS3] Movian M7 7.0.110 pour Android et PS3 par DeanK",
        "content": " \nLe développeur DeanK a mis à jour son célèbre lecteur multimédia Movian, connu anciennement sous le nom de ShowTime.\n \nSi vous vous souvenez bien Movian est une version modifiée du media center original qui avait été lancé sur la PS3, et qui fonctionne aussi sur Android, Amazon Fire Stick, MacOS, Windows, Linux et Raspberry pi. Le media center s'appelait à l'origine \"Showtime\" sur la PS3 mais a été renommé \"Movian\" par le développeur original Andreas Oman.\n \nDeank a continué à supporter le logiciel, et il a même fait évoluer le fonds puisqu'avec cette nouvelle version il a supprimé l'ancien décodeur/parseur vidéo \"libav\" à l'actuel \"ffmpeg\", mais aussi apporter de nombreuses corrections depuis des années. \n \n \n\n \n \n=== 7.0.110 (2024-12-19)\nAmélioré : BT Priorité aux morceaux critiques nécessaires au décodage vidéo par rapport aux morceaux en lecture anticipée\nCorrigé : BT Crash lors du suivi d'URLs encodées en base64\nAjouté : Option BT 'Injecter des trackers supplémentaires' (utilise trackerslist/ngosang et newtrackon)\nMise à jour : PS3, Linux et Chrome NaCl vers la version 7.0.110\n \n=== 7.0.108 (2024-12-15)\nCorrigé : Problème critique avec la détection de la mémoire libre (important !)\nCorrigé : Conserver ~48-64MB de mémoire système libre (important !) avec des paramètres de mémoire tampon/torrent élevés (en particulier pour les systèmes avec 1GB RAM)\nCorrigé : Détection correcte des codecs audio pour les titres uniquement audio (PCM/DTS dans un conteneur WAV)\nAjouté : Taille actuelle du cache du torrent dans MediaInfo\nModifié : Nouvelle limite par défaut du cache BT par torrent, nouvelle magie de cache pour nettoyer les anciens fichiers de cache.\n \n=== 7.0.107 (2024-12-13)\nCorrigé : Calculs corrects de la mémoire tampon vidéo (important !), maintenant M7 peut mettre en mémoire tampon jusqu'à la taille de la mémoire tampon vidéo correctement.\nAjouté : Support client/protocole FTP pour les commandes STOR et DELE (ftp_unlink, ftp_write) - le copier/coller vers un serveur FTP distant fonctionne maintenant\nCorrigé : Nettoyage du cache BT\n \n=== 7.0.105 (2024-12-11)\nAjouté : Option pour définir la mémoire maximale de BT pour les transferts actifs (96 - 384 MB)\nAdded : Option to set BT Max cache size per torrent (160 - 2000 MB)\nChanged : BitTorrent section is now in main Settings page\nChanged : MediaInfo affiche désormais des informations supplémentaires sur les données mises en mémoire tampon en Mo et en kbit/s.\nAmélioré : Nouvelle logique de lecture BitTorrent, sonde et timeouts, meilleures performances sur les connexions lentes.\n \n=== 7.0.103 (2024-12-07)\nBT : Changement des valeurs par défaut pour les pairs, la vitesse, les délais ; Délais de téléchargement des pièces de processus (débloquer l'interface utilisateur/navigateur).\nNotification pop-up et arrêt de la lecture lorsque la lecture réseau ne démarre pas en raison d'un manque de données ou d'un dépassement de délai pour les pairs.\nCorrection des délais d'attente pour les morceaux et les liens magnétiques\nLa mémoire dans MediaInfo est maintenant en Mo, System Free montre la mémoire disponible/en cache et la mémoire libre.\nPrise en charge de listes de lecture HLS plus volumineuses (jusqu'à 1 Mo - contre 100 Ko auparavant)\nMise à jour de la traduction de BG\n \n=== 7.0.102 (2024-12-01)\nAmélioré : Performance BitTorrent (mémoire, read-ahead, vitesse)\nAjouté : Support pour les boutons personnalisés de la télécommande TCL Android TV\nCorrigé : Logique de transfert audio pour l'option [Source ou DD/DD+/DTS] (nécessite que les modes de transfert corrects soient activés)\n \n \n \nTéléchargement : Movian M7 7.0.110 (lien direct PKG) sinon c'est ici : movian.eu\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201817/in-ps3-movian-m7-70110-pour-android-et-ps3-par-deank-1.png"
        }
    },
    "news_16": {
        "title": "[PS4/PS5] Entretien avec le hacker SpecterDev",
        "content": "Le hacker SpecterDev est l'un des plus connus de la scène PlayStation, récemment il a réussi à cracker les consoles PS5 en trouvant des vulnérabilités dans le système. Le site heise.de a pu lui parler de la conférence hardwear.io à Amsterdam, et nous livre cet entretien.\n \n \n\n \n \nVous vous êtes fait un nom en piratant les consoles Playstation. Comment tout a commencé ?\n \nSpecterDev : J'ai commencé avec la PS4 en 2018, peut-être fin 2017. À l'époque, je ne connaissais pas vraiment grand chose à l'exploitation des vulnérabilités ou à la sécurité. J'avais une formation en programmation, mais pas en sécurité. Je cherchais juste un projet intéressant qui me motiverait à apprendre et je me suis dit \"Hé, ce serait vraiment cool !\"\n \nJ'ai toujours trouvé le jailbreak intéressant, notamment avec les anciens iPod Touch et iPhone des années 2000. Je me demandais déjà comment ça fonctionnait. Je pensais que c'était magique. L'argent, en revanche, n'a jamais été ma motivation, car on ne gagne pas grand-chose grâce à la recherche en matière de sécurité dans le secteur des consoles. Je considère toutes les connaissances que j'ai acquises au cours des dernières années en travaillant avec des gens formidables de la communauté comme ma récompense.\n \nComment avez-vous pris conscience de la scène pour la première fois ?\n \nÀ l'époque, le développeur Fire30 avait publié un exploit WebKit qui fonctionnait sur ma OLD PS4. Je voulais l'essayer et en savoir plus sur la région. Heureusement, j'ai trouvé un groupe de personnes très expérimentées qui m'ont pris sous leur aile et m'ont appris les choses les plus importantes. Je suis encore en contact avec certains d'entre eux à ce jour.\n \nTravaillez-vous encore avec eux aujourd’hui ?\n \nCompte tenu de la complexité des systèmes et des nombreux niveaux de sécurité qu’il faut franchir, il est très difficile de tout faire soi-même en tant qu’armée composée d’un seul homme. Mon travail s'appuie sur le travail des autres et nous nous entraidons. D’un côté, il y a Flatz, qui travaille sur consoles depuis longtemps et qui est vraiment un expert. Presque chaque fois que je me demande si quelque chose fonctionnerait et que je le contacte, il s'avère qu'il y réfléchit depuis longtemps. Sinon, je travaille toujours en étroite collaboration avec ChendoChap, qui est aussi un pseudonyme. Nous échangeons toujours du code et essayons de résoudre les problèmes de chacun. Il y a quelques personnes supplémentaires, mais certaines ne veulent pas être nommées ou n'ont pas travaillé sur consoles depuis un moment.\n \nÊtes-vous également intéressé par d’autres consoles ?\n \nJusqu'à présent, je n'ai regardé que les consoles Playstation. J'ai l'intention d'examiner la Switch et quelques autres appareils, mais je n'y suis pas encore parvenu. Je veux essayer la Xbox car je pense que son modèle de sécurité est un peu plus avancé que celui de la Playstation. Microsoft a beaucoup plus d'expérience avec son cloud Azure et sa virtualisation. Ils existent depuis longtemps, alors que Sony est plutôt un nouvel acteur à cet égard. Par exemple, j'ai pu jailbreaker ma PS3 sans trop de problèmes, je n'ai rien fait de fou, je jouais juste.\n \nJe comprends d'où vient l'attrait d'un jailbreak. Par exemple, nous avons jailbreaké une calculatrice pour y jouer à Doom . Mais pourquoi les gens piratent-ils une PS5 ?\n \nCertaines personnes souhaitent y exécuter Linux. Cela ne m'intéresse pas beaucoup car les consoles, surtout les plus modernes, utilisent malheureusement des CPU très simples. Donc, à certains égards, ils sont pires que les PC bon marché. J'aime juste le défi, la conception et les sous-systèmes uniques dans lesquels ils ont été intégrés. J'aime étudier les pilotes personnalisés et les solutions de sécurité, les rétro-ingénierie pour découvrir à quoi les développeurs ont prêté attention. Vous voyez du code sur les consoles que vous ne voyez nulle part ailleurs.\n \nAvez-vous déjà écrit du code pour les consoles ?\n \nJ'ai déployé beaucoup d'efforts pour faire fonctionner les homebrews sur PS4. Cela vous permet d'exécuter votre propre logiciel sur une PS4, tout comme je l'ai montré dans ma présentation - à ne pas confondre avec l'homebrew de macOS. J'ai maintenu une chaîne d'outils pour créer un homebrew PS4 avec un code source entièrement open source qui n'utilise pas les outils Sony, vous n'avez donc pas à vous soucier de la violation du droit d'auteur. Cela s'est avéré génial.\n \nVous venez de mentionner votre présentation . Vous y avez montré deux nouvelles vulnérabilités qui peuvent être utilisées pour pirater la PS5. Qu'est-ce qui est possible avec eux ?\n \nPour faire simple, les deux vulnérabilités permettent de désactiver l’hyperviseur. Celui-ci gère les machines virtuelles et protège le noyau. Avec les autorisations d'écriture et de lecture du noyau obtenues par la suite, vous pouvez faire ce que vous voulez sur la puce principale ou sur les principaux cœurs x86. Les deux vulnérabilités que j'ai présentées étaient des problèmes de niveau logique, donc pas des problèmes classiques de corruption de mémoire en cas de débordement de tampon ou quelque chose du genre. Il s’agit plutôt de défauts de conception. Par exemple, l'hyperviseur et l'invité peuvent partager de manière inappropriée des données qu'ils ne devraient pas partager, ou les données peuvent ne pas être correctement isolées. C'est sur cela que reposent ces deux erreurs qui, lorsqu'elles sont exploitées, désactivent toutes les mesures de sécurité de l'hyperviseur .\n \nQue pouvez-vous faire avec la PS5 alors ?\n \nCertaines choses, avec un accès sans entrave au matériel, vous pouvez, comme mentionné précédemment, démarrer Linux dessus. Ou, comme moi, vous pouvez patcher le noyau pour exécuter du code arbitraire. Cela ouvre beaucoup de potentiel de recherche pour beaucoup d'autres puces et autres éléments du système, et c'est mon principal intérêt et la raison pour laquelle je l'ai fait.\n \nMais les vulnérabilités ne peuvent pas être exploitées avec la nouvelle version du logiciel, n’est-ce pas ?\n \nJustement, les lacunes ne fonctionnent qu'avec les versions 2.50 ou inférieures, mais elles datent déjà de quelques années. Cependant, les lacunes restent intéressantes pour la recherche car une grande partie du code du kernel reste la même d’une version à l’autre.\n \nEt quelles sont les prochaines étapes pour vous maintenant ? Essayez-vous de pirater la nouvelle version de l'hyperviseur ?\n \nJe suis encore un peu indécis. Certaines des personnes avec qui je travaille souhaitent trouver des attaques pour les versions supérieures. En fait, je veux les rejoindre, mais j'aimerais aussi essayer d'attaquer certains des autres jetons du plateau. Par exemple, le contrôleur SSD, des attaques contre celui-ci ont été récemment présentées lors du Security Analyst Summit. Je pense donc qu’avant de m’inquiéter des versions supérieures du firmware, je souhaite avoir une meilleure compréhension de l’ensemble du système.\n \nAvez-vous reçu des réactions de Sony à votre travail ?\n \nRien d'officiel, certainement. Parfois, les gens de l'équipe de sécurité de Playstation aiment mes tweets et je les vois aussi rôder dans la communauté (rires). J'ai également parlé personnellement à certaines personnes chez Sony. Mon impression de toutes mes interactions avec eux est qu’ils voient cela comme une sorte de compétition amicale. Surtout parce que nous - moi et les personnes avec qui je travaille - ne sommes pas intéressés par le piratage ou par les tentatives de nuire à Sony. Nous voulons juste casser le système et voir ce que nous pouvons faire.\n \nCela sonne certainement mieux que certaines autres entreprises hostiles aux jailbreakers ou aux pirates ?\n \nCertainement. Au début de la PS4, Sony ne disposait que d’un seul e-mail pour les contacter. Sony dispose désormais également d'un programme de bug bounty grâce auquel ils récompensent les chercheurs. Il s’agit d’une évolution positive. Sony essaie vraiment de travailler de bonne foi avec les responsables de la sécurité. C’est formidable, car malheureusement ce n’est pas le cas partout. J'ai l'impression que nous avons de la chance, du moins dans l'espace Playstation, que Sony ne soit pas aussi hostile que d'autres sociétés dont je préfère ne pas mentionner les noms pour le moment. Je ne peux donc que m'en féliciter.  \n \n \n \nTout est là : heise.de\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201816/in-ps4ps5-entretien-avec-le-hacker-specterdev-1.png"
        }
    },
    "news_17": {
        "title": "[PS3] webMAN MOD v1.47.47i disponible",
        "content": "Le développeur Aldostools, Aldo Vargas, vient de publier une nouvelle version de son plugin webMAN MOD. Il porpose en effet la version 1.47.47i de son plugin PS3.\n \nwebMAN est un plugin développé par Deank qui permet de lancer des backups de jeux PS3, PS2, PS1, PSP ainsi que des Blu-ray ou des DVD, stocké sur disque dur (y compris en NTFS) ou sur le réseau local, au format JB ou ISO. M@tsumot0 et Aldostools ont proposé une version MOD de webMan, apportant notamment le support de 21 langages utilisant des fichiers externes, un installer/updater pour CFW Cobra et NonCobra, le spoof IDPS/PSID, la désactivation des syscalls du cfw, et de nombreuses autres évolutions qui se sont succédées.\n \n \n \n \n\n \n\n \n \nChangelog v1.47.47i : \n \n- Ajout d'une option de menu pour basculer entre l'édition Lite et le XMB\n- Les répertoires par défaut sont désormais créés en fonction du type de contenu sélectionné dans /setup.ps3\n- Divers correctifs implémentés par Sunnyqeen\n \n \nTéléchargement : webMAN MOD v147.47i\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201811/in-ps3-webman-mod-v14747i-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201811/in-ps3-webman-mod-v14747i-disponible-2.png"
        }
    },
    "news_18": {
        "title": "[PS5] websrv 0.16 intègre RetroArch",
        "content": "Chaque sortie d'une nouvelle version de websrv apporte son lot de nouveautés, et pas des moindres ! \n \nLe développeur John Tornblom propose une nouvelle version de son payload websrv pour la PS5, comme vous le savez, ce payload lorsqu'il est injecté permet d'exécuter un simple serveur web, cependant il permet beaucoup de choses, puisqu'il permet de lancer des homebrews via le webkit ou bien à distance via un PC, smartphone ou des appareils compatibles.\n \n \n\n \n \nDans cette nouvelle version 0.16, le développeur a fait évoluer quelques scripts pour améliorer certains aspects de sa proposition. \n \nAu programme, une correction de rendu sur les firmwares PS5 inférieurs, l'ajout d'une première version pour YQuake2, RetroArch, LinkDev, la mise à jour de la version de Offact, et des textures et de l'audio en hautes résolutions pour eduke32. \n \nTéléchargement : websrv 0.16\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201807/in-ps5-websrv-016-integre-retroarch-1.png"
        }
    },
    "news_19": {
        "title": "[PS5Pro] Mark Cerny détaille les différences des GPU PS5 et PS5 Pro",
        "content": "Lors d'un nouveau séminaire technique sur la PS5 Pro, Mark Cerny, architecte principal de la PS5 Pro (mais aussi de la PS5, de la PS4 et de la PS4 Pro), partage des détails approfondis sur la console et révèle une collaboration plus approfondie avec AMD pour stimuler l'innovation dans les graphismes et le gameplay grâce à l'apprentissage automatique. \n \n \n\n \n\n \n \nCette conférence technique c'est un peu celle que l'on attendait lors de la sortie de la PS5, un peu comme il avait pu le faire lors de la sortie de la PS4, et ne pas attendre la version Pro, mais en 2020, il est probable que Mark Cerny s'est dit que le public n'était pas prêt à entendre ce genre de détails techniques, le crossgen étant bien trop présent, il fallait assurer la transition. \n \n \n \n \n\n \n \n \n \nDans la vidéo nous apprenons que le GPU de la PS5 Pro est plus puissant grâce à une collaboration poussée avec AMD permettant de profiter d'une technologie hybride entre la seconde et la troisième génération RDNA, mais aussi grâce à une mémoire vidéo GDDR6  plus importante. \n \n \n\n \n\n \n\n \n \nIl explique qu'ils auraient pu créer une nouvelle révision de console en RDNA3, mais que les jeux ne pourraient alors pas tourner sur PS5 Pro et sur PS5 car ils seraient différents, pour cela ils ont créé avec AMD un RDNA2.x permettant aux fichiers binaires de tourner sur PS5 Pro avec un patch RDNA2.\n \n \n \n\n \n\n \n\n \n\n \n\n \n \nCe qu'explique Mark Cerny pèse dans la balance, son discours est comme le plus souvent assez clair, et documenté, il est dommage de ne pas avoir ce genre de présentation avant le lancement de la console, mais cela ne justifie en rien le prix exorbitant de la PS5 Pro. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-5.png",
            "image_6": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-6.png",
            "image_7": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-7.png",
            "image_8": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-8.png",
            "image_9": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-9.png",
            "image_10": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-10.png"
        }
    },
    "news_20": {
        "title": "[3DS/2DS] Red Viper v0.9.7 disponible",
        "content": "Sous le nom de Red Viper se cache un émulateur de Virtual Boy, le Virtual Boy est une console de jeux vidéo créée par Nintendo en 1995 au Japon et aux États-Unis, se présentant sous la forme d'un visiocasque 3D. Tentant l'innovation avec un affichage stéréoscopique, la console est finalement un échec commercial. Malgré plusieurs baisses de prix, les ventes ne décollent pas et la commercialisation de la console en Europe sera annulée. \n \nRed Viper est l'une des meilleures solution de restitution actuelle, devançant même celle de RetroArch en s'appuyant sur les capacités 3D de la 3DS. \n \n \n\n \n \nAvec la nouvelle version 0.9.7, un mode anaglyphe avec des couleurs configurables pour chaque oeil a été ajouté. Une autre nouveauté est ce qu'on appelle l'émulation du temps de rendu , qui permet aux jeux de fonctionner à la même vitesse que Virtual Boy. Certains bugs ont été corrigés, la compatibilité a été améliorée et les correctifs de jeu sont désormais appliqués en fonction de l'ID du jeu, améliorant ainsi la compatibilité avec les hacks ROM.\n \n \nChangelog 0.9.7 : \n \n- Ajout du mode anaglyphe, avec des couleurs configurables pour chaque oeil\n- Les utilisateurs de 2DS peuvent configurer un décalage de profondeur en mode anaglyphe, car ils n'ont pas de curseur de profondeur\n- Ajout de l'émulation du temps de rendu, y compris une bascule pour la désactiver\n- Correction d'un bug audio dans l'intro de Colony dans Galactic Pinball\n- Résoud divers problèmes dans l'émulateur Game Boy\n- Correction du dessin graphique filaire de l'alarme rouge au-dessus de l'interface utilisateur\n- Ajout du hack pour Jack Bros. pour que le carillon d'intro soit joué à peu près à la bonne vitesse\n- Application des correctifs de jeu en fonction de l'ID du jeu plutôt que de la somme de contrôle, pour une meilleure compatibilité avec les hacks ROM\n- Augmentation de l'agressivité du saut d'image pour améliorer les performances en vitesse élevée\n- Mise à jour du framebuffer logiciel de manière plus conservatrice pour améliorer les performances dans Waterworld et Tetris 3D\n- Correction gamma ajustée pour une meilleure visibilité\n- Correction de la mise en miroir ABXY du D-Pad ayant une entrée droite incorrecte\n \n \nTéléchargement : Red Viper v0.9.7\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201785/in-3ds2ds-red-viper-v097-disponible-1.png"
        }
    }
}