{
    "news_1": {
        "title": "[PS2] Une mise à jour de l'émulateur Play! est disponible",
        "content": "Alors là clairement nous ne nous y attendions pas du tout, mais voilà qu'une mise à jour de l'émulateur Play! vient d'être mise en ligne. \n \nBonne nouvelle, cela débarque sur Windows (32 et 64 bits) mais aussi sur Mac OS, Linux, Android et iOS, que demande le peuple. \n \n \n\n \n \nPlus d'un an après la version 0.56, cette version 0.61 apporte beaucoup de nouveautés, tellement qu'il est impossible aux développeurs de toutes les citer. Play ! est un émulateur de PlayStation 2 gratuit, open-source, de haut niveau et multiplateforme. Sa compatibilité et ses fonctionnalités sont assez éloignées de celles de PCSX2.\n \n \n \n\n \n \n \n \nNouveautés :\n \n- Trop de choses à énumérer depuis la dernière version officielle (0.56), mais de nombreuses mises à jour de compatibilité et quelques optimisations.\n \n- Plus de 930 jeux confirmés comme jouables depuis la dernière fois.\n \n- Support préliminaire du Namco System 246. Il n'est supporté que dans la version desktop pour le moment.\n \n \nBien entendu tout n'est pas parfait, mais on s'approche de plus en plus de l'autre émulateur PS2, PCSX2, qui permet notamment de profiter de l'émulation sans dumper le bios, des paramétrages simples et la prise en charge d'Android sont attractives. \n \n \n \nTéléchargement : Play! 0.61  / code source\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-759839488.png"
        }
    },
    "news_2": {
        "title": "[Switch] switch_AIO_LS_pack 5.1.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.1.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.1.0:\nMise à jour de l'overlay d'EdiZon vers la dernière version de celui-ci.\nLe script de nettoyage de la SD supprime maintenant certains fichiers liés au module MissionControl si la suppression de module est choisi durant le nettoyage.\nMise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.00.00:\nNouvelle fonction d'auto-configuration ajoutée, celle-ci permet de lancer l'installation du pack avec une configuration des options pré-définie. Cette fonction est totalement contrôlable et configurable via le homebrew, voir le menu d'aide de celui-ci pour en savoir plus. Sinon ceci es configurable via un fichier de configuration du homebrew, voir les fichiers de configuration du homebrew sur la page du projet.\nDétection d'une nouvelle version du pack disponible et affichage d'une notification pour lancer son installation. Si l'auto-configuration sans accès complet à toutes les fonctions du homebrew est activée, si aucune nouvelle version du pack n'est détectée l'installation du firmware seule sera proposée et si elle est refusée l'installation du pack sera proposée.\nLa détection d'une nouvelle version du homebrew fonctionne comme celle du pack, ceci pose un problème aux anciennes versions du homebrew qui ne détecteront pas automatiquement cette nouvelle version, cependant la mise à jour manuelle du homebrew fonctionne toujours et une fois celle-ci faite tout rentrera dans l'ordre.\nDurant l'installation du pack et du zip complémentaire au pack le SHA256 de chaque fichier à extraire est comparé avant l'extraction si le fichier est présent sur la SD pour savoir s'il est nécessaire de le remplacer et après la copie pour savoir s'il a bien été extrait. Ceci augmente le temps nécessaire à l'extraction du pack mais augmente la durée de vie de la SD en copiant seulement se qui est nécessaire et cela augmente aussi la fiabilité de l'extraction. Ce paramètre peut être désactivé via les fichiers de configuration du homebrew, voir les fichiers de configuration sur la page du projet du homebrew.\nSi une erreur se produit durant l'extraction d'un fichier pendant l'installation du pack et du zip complémentaire au pack la copie du fichier est réessayée deux fois avant de stopper l'installation.\nLe nettoyage agressif n'est plus le même lorsqu'il concerne l'installation du pack ou du firmware, les noms des fichiers de configuration de cette fonction ont été mis à jour pour refléter ce changement.\nCorrection d'un bug qui ne détectait pas correctement le répertoire des bootlogos lors de l'extraction du pack en mode beta et correction d'un bug qui faisait que le répertoire du firmware n'était pas forcément nettoyé en mode beta.\nAjout d'informations dans le fichier de logs.\nCertains changements mineurs dans les messages affichés ont été effectués.\nProbablement des corrections de bugs et modifications mineurs que j'ai oublié.\n\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\nSauf pour la correction de bugs je pense que le homebrew AIO_LS_pack_Updater est arrivé plus ou moins à sa version final, cependant si vous avez des idées pour l'améliorer autres qu'une interface graphique n'hésitez pas à m'en faire part (consultez le readme du Github du projet pour voir les choses que je voudrais faire mais que je n'arrive pas à faire pour l'instant ou les choses que je pourrais faire mais la flemme, c'est dans la todo list), si vous êtes développeur et que vous voulez proposer des pull requests elles seront les bienvenues si elles respectent l'esprit du projet (du C si le C++ n'est pas indispensable, par exemple on évitera de faire appel à des modules en C++ pour la traduction que j'aimerai d'ailleurs faire en pur C car là elle utilise un vecteur qui est du C++ se qui me plaît déjà moyennement).\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_3": {
        "title": "[PS4] Créer un FPKG d'émulateur en un clic",
        "content": "Voici un petit programme qui va vous faciliter la création de FPKG PS4, afin de pouvoir jouer à vos émulateurs retros sur vos PS4 5.05/6.72 et 9.00.\n \n\n \nEn effet,  grâce à ce petit GUI (toujours en batch) il vous sera très très simple de créer un FPKG d' émulateur pour vos PS4, un simple clic sur l' émulateur voulu et tous se fera automatiquement, juste à patienter... Je ne peux pas faire plus simple ^^...\n \nVous pourrez donc en un clic créer un FPKG comprenant un émulateur GameBoy - Color, Nes, Snes, GameGear, Master System, Megadrive, Atari 800, Lynx, WonderSwam, NeoGeo Pocket, ou un retroarch tout en un comprenant tous les émulateurs pré-cités.\n \nUne seule chose à faire copier/coller vos roms dans le dossier Games, puis cliquer sur l' émulateur voulu, rien d'autre...\n \nAttention !!! Avant le premier lancement du .bat il vous faudra régler imgburn afin qu il crée l' ISO ps2 pour votre futur FPKG, sans ce réglage, l' émulateur ne trouvera pas vos roms une fois lancé sur vos PS4...Cette manip n' est à faire qu' une fois avant le premier lancement du .bat...\n \n- Lancer imgburn.exe  dans le dossier tools/\n- Sélectionner Create image file from files/folders\n- Puis l'onglet Advanced\n- Puis l' onglet Restrictions\n- Et sélectionner bien Level 2 - 31 characters\n- Fermer imgburn\n- Voilà il est bien configuré...\n \n \n \n \n \n\n \nTuto:\n \n\n- Copier/coller vos roms dans le dossier Games/\n- Cliquer sur l' émulateur de vos roms\n- Patienter\n- Installer le FPKG sur votre ps4\n- Jouer\n \n\n \nTélécharger Retroarch PS2 on PS4\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175709/in-ps4-creer-un-fpkg-demulateur-en-un-clic-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175709/in-ps4-creer-un-fpkg-demulateur-en-un-clic-2.png"
        }
    },
    "news_4": {
        "title": "[Multi] GaryOPA organise une cagnotte pour redémarrer sa vie",
        "content": "Il semblerait que Gary Bowser n'est peur de rien, il serait à l'origine du lancement d'un cagnotte sur gofundme.com, qui a l'heure où nous écrivons a déjà reçu 14 dons pour pas moins de 1021 $ CAD. \n \nCe qui est surprenant c'est de nombreux développeurs ont dors et déjà participé comme Senaxx ou encore José Coixão (notzecoxao) à moins que là aussi ce soit des noms d'emprunt ou des usurpations d'identité.\n \n \n\n \n \nUn long texte accompagne la cagnotte et on y apprend pas mal de chose, comme le fait qu'il démarre déjà un nouveau projet un serveur Retro Projects sur Discord. \n \n \nBonjour à tous, je m'appelle Gary Bowser alias GaryOPA comme beaucoup d'entre vous le savent, je recommence ma vie après quelques années de lutte contre le système judiciaire, il suffit de rechercher mon pseudo sur Google . \n \nQuoi qu'il en soit, je suis maintenant de retour à Toronto, au Canada, et je reconstruis ma vie, et ce n'est pas facile car je suis hors du Canada depuis 2010, donc je n'ai pas de maison ou d'autres choses ici pour m'aider à recommencer, en tant que tel j'espère pour collecter suffisamment de fonds pour aider à trouver un logement et acheter quelques choses dont j'ai besoin, en plus de m'occuper de ma jambe gauche qui a un gonflement extrême, en raison du lymphoedème en tant que tel, il est douloureux pour moi de marcher beaucoup et j'ai besoin de soins médicaux de base des fournitures comme des pompes à compression et aussi un fauteuil roulant pour me permettre de me déplacer plus facilement.\n \n \nComme vous le savez chaque image à un sens, on voit GaryOPA en tenue de prisonnier sur fonds d'un très vieux PC ou console de développement, et un phénix qui est le logo de son entreprise ( la plupart des éléments sont relatifs à sa chaine Youtube ). Ce qui peut paraitre surprenant c'est que la photo est celle tirée de la première interview de Nick Moses.\n \n \n \n\n \n \nTout est là également sur un site qu'il a humblement intitulé garyopa.com\n \nLa cognotte est ici : Gofundme.com/f/garyopa-restarting-his-life\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175667/in-multi-garyopa-organise-une-cagnotte-pour-redemarrer-sa-vie-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175667/in-multi-garyopa-organise-une-cagnotte-pour-redemarrer-sa-vie-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS5] Specter dévoile des détails sur l'hyperviseur &#34;in-kernel&#34; de la PS5",
        "content": "Le développeur Specter vient de mettre à jour la partie développeur du wiki PS5, il faut dire qu'il y a de la matière avec ce qu'il a présenté lors de sa conférence au Hardwear.io le 02 Juin dernier, il y a tout juste un mois. \n \nAinsi le développeur a montré que les espoirs se tournent désormais vers l'Hyperviseur, qui en quelque sorte protège le kernel et le firmware de la console. \n \nConçu comme un middleware, l'objectif de l'hyperviseur est d'empêcher toute exécution de code non signé, il s'assure que les règles définis dans le kernel soit les bonnes, et il empêche toute attaque ou écriture non prévue. \n \n \n \n\n \n\n \n \nSelon Specter, les premières versions des consoles PS5, celles qui disposent d'un firmware inférieur ou égal au firmware 2.50, intègrent l'hyperviseur au sein du kernel, ce qui le rend plus vulnérable, ou du moins en théorie plus facile à modifier. D'ailleurs le développeur a dévoilé sur le Wiki les 14 Hypercalls dont il parlait dans sa présentation d'il y a un mois. \n \n \n\n \n \nSur les versions 2.50 et antérieures, l'hyperviseur est intégré dans le binaire du kernel. Il s'agit de la \"première itération\" de l'hyperviseur, les versions ultérieures ont l'hyperviseur en tant que composant chargé séparément. Les principaux objectifs de l'hyperviseur sont de protéger l'intégrité du code du noyau et d'appliquer xotext (alias. eXecute Only Memory ou \"XOM\") sur le kernel.\n \nPour ce faire, Sony tire parti de diverses fonctionnalités fournies par AMD Secure Virtual Machine (SVM), telles que ; Tables de pages imbriquées (NPT), interruption d'exécution en mode invité (GMET) et interception des lectures/écritures dans les registres de contrôle (CR) ainsi que dans les registres d'état de la machine (MSR).\n \nDe plus, xotext semble être soutenu par du matériel en tant que collaboration avec AMD, nommée \"nda feature\". L'hyperviseur gère également l'unité de gestion de la mémoire d'E / S (IOMMU), comme l'indique le fait qu'il expose divers hypercalls pour le configurer.\n \nIl convient de noter que l'hyperviseur est très petit, surtout par rapport à celui de la PS3. Il ne prend en charge qu'une poignée d'hypercalls et existe principalement pour protéger le kernel. Il n'exécute pas plusieurs machines virtuelles ou n'utilise pas la virtualisation imbriquée, il ne virtualise que le kernel/l'espace utilisateur, que Sony appelle \"GameOS\".\n \n \n \nComme nous le prouve une nouvelle fois Specter, les premiers modèles de consoles sont toujours très intéressants car les constructeurs font évoluer leur sécurité sur les firmwares plus récents, et tente ainsi d'empêcher l'arrivée d'un jailbreak.\n \n \nTout est là : Hypervisor\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175630/in-ps5-specter-devoile-des-details-sur-lhyperviseur-in-kernel-de-la-ps5-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175630/in-ps5-specter-devoile-des-details-sur-lhyperviseur-in-kernel-de-la-ps5-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1175630/in-ps5-specter-devoile-des-details-sur-lhyperviseur-in-kernel-de-la-ps5-2.jpg"
        }
    },
    "news_6": {
        "title": "[Switch] HWFLY va arrêter de fabriquer l'ancien modèle",
        "content": "Il semblerait que l'arrivée de la solution RP2040 a bouleversé le marché des puces Nintendo Switch, à tel point que la Team HWFLY vient d'annoncer qu'elle ne va plus fabriquer l'ancien modèle, celui qui a fait son succès. \n \nLa Team va arrêter de fabriquer l'ancien modchip pour se concentrer sur ceux basés sur le RP2040, une excellente alternative puisqu'elle ne nécessite pas de résistances à souder, sauf pour le modèle OLED bien entendu. \n \n \n\n \n \n \nIl faut dire que les prix n'ont plus rien à voir, les modèles HWFLY basés sur RP2040 disponibles pour toutes les versions de Nintendo Switch tournent entre 10 et 15 $, jusqu'à 30 $ avec tous les flex selon les versions. \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175596/in-switch-hwfly-va-arreter-de-fabriquer-lancien-modele-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175596/in-switch-hwfly-va-arreter-de-fabriquer-lancien-modele-2.jpg"
        }
    },
    "news_7": {
        "title": "[PS4] Les émulateurs ShadPS4 et RPCSX (PS4 / PS5)",
        "content": "La liste des émulateurs s'étoffe un peu plus encore avec l'annonce de l'arrivée de deux nouveaux protagonistes, avec pour le premier un émulateur PS4, et pour le second un projet PS4/PS5. \n \n \n\n \n \n \nL'émulateur ShadPS4\n \nComme son nom l'indique, il s'agit là d'une émulateur PS4, proposé par le développeur George Moralis, il est à l'origine de PCSX, PCSX2, PCSP, JPCSP, arcadeflex et il a contribué à RPCS3. Récemment il a rajouté le support initial de Linux. \n \nSi le projet vous intéresse c'est par ici : shadPS4\n \n \n \nL'émulateur rpcsx\n \nNous vous l'avions annoncé sous le nom de RPCS4 mais voilà le premier bout de code de l'émulateur rpcsx qui n'est autre que l'émulateur PS4 et PS5 de l'équipe à l'origine de RPCS3. Il s'agit là du 8eme émulateur PS5 qui tente de se faire un nom, mais avec ses développeurs et notamment les trois grands développeurs nekotekina, kd-11 et DH, RPCSX à de l'avenir.\n \n \n\n \nLes premiers samples fonctionnels sur RPCSX\n \n \n \nSi le projet vous intéresse c'est par ici : RPCSX\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175595/in-ps4-les-emulateurs-shadps4-et-rpcsx-ps4-ps5-1.jpeg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175595/in-ps4-les-emulateurs-shadps4-et-rpcsx-ps4-ps5-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] Chromium mis à jour pour L4T Ubuntu et seconde Bêta de LineageOS 18.1",
        "content": "Le développeur CTCaer vient de nous informer via Twitter que le navigateur Chromium a été mis à jour pour L4T Ubuntu. \n \nIl nous informe en effet que le navigateur Chromium a été mis à jour, mais que contrairement aux mises à jour précédentes qui n'étaient que personnalisées au niveau de la configuration, celle-ci est construite avec des changements internes.\n \nChangements :\n \n- Ajout du décodage hardware VP9 \n- Support automatique de l'OSK dans les zones de texte (comme le reste de l'OS)\n- Correction d'un bug dans le site Youtube (UHD/HD restauré).\n \n \n \n\n \n \nAutre point intéressant, il nous informe que la seconde Bêta de LineageOS 18.1, qui pour rappel est basé sur Android 11, vient d'arriver hier 30 Juin 2023 pour la Nintendo Switch.\n \nCette deuxième Bêta apporte son lot de nouveautés : \n \n \nPoints forts de la version (Beta 2)\n \n- Ajout du support pour les nouvelles fonctionnalités de L4T comme l'analyse des données de calibration Lite.\n- Ajout du ddr200 pour les cartes microSD (désactivé par défaut contrairement à L4T à cause d'une possible incompatibilité avec certaines cartes) et quelques autres nouvelles options ini.\n- Les performances de l'Erista devraient être corrigées (encore un peu saccadé parfois, vous pouvez blâmer NVIDIA)\n- Les ventilateurs Erista s'allument désormais réellement et devraient utiliser les profils appropriés\n- U-Boot vidconsole devrait fonctionner maintenant (les options de configuration personnalisées et les erreurs durant cette étape sont imprimées sur la console au fur et à mesure qu'elles sont analysées)\n- L'audio ATV devrait être corrigé (duplication de la politique audio de l'onglet au lieu d'utiliser la politique ATV par défaut de NVIDIA)\n- Corrections de bugs diverses\n \nBugs connus (Beta 2)\n \n- Le mode dock nécessite parfois un retrait et un réancrage et certains affichages bizarres ne fonctionnent pas.\n- Le mode dock est parfois réglé par défaut sur une résolution stupide - il suffit de l'ajuster dans l'application Configuration du commutateur.\nSensor HAL (gyro, accel, etc.) est cassé sur tous les appareils - aucun support n'est prévu pour l'IMU Invensense trouvé dans l'OLED, mais les STM devraient fonctionner - je ne sais pas pourquoi ils ne le font pas.\n- CEC ne fonctionne pas\n- L'interface utilisateur du volume ne fonctionne pas en raison d'un bogue de plate-forme.\n- RSMouse n'est pas inclus\n- Le trackpad de la Shield TV Remote ne fonctionne pas\n- adb, mtp, etc. ne fonctionnent pas lorsque l'USB3 est désactivé\n- Les mises à jour sur place à partir de Q sont prises en charge mais peuvent être instables - nous recommandons des installations propres.\n- Le lanceur de console ne parvient pas à se mettre à jour en raison d'une signature qui ne correspond pas - ce problème sera bientôt résolu.\n- Les Joycons ne s'éteignent pas automatiquement en veille, assurez-vous de les éteindre en appuyant sur le bouton 'sync' sur le côté.\n \n \nTéléchargement : Android-11\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175587/in-switch-chromium-mis-a-jour-pour-l4t-ubuntu-et-seconde-beta-de-lineageos-181-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS2] Apollo Save Tool en développement pour la PS2",
        "content": "Le développeur Damián Parrino, Bucanero, continue de décliner les version d'Apollo Save Tool pour les consoles d'anciennes générations. \n \nIl est réellement surprenant de voir comment il arrive à proposer le portage de son outil sur les autres plates-formes, après la PS3, la PS4, la Vita, la PSP, voilà donc qu'il prépare la version PS2. \n \nPour rappel, il s'agit d'une application qui vous permet de gérer les fichiers de sauvegarde de jeu sur la console et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur la console. \n \n \n\n \n \nLe développeur nous le confirme, Apollo Save Tool fonctionne sur PS2, cependant il reste encore beaucoup de travail.\n \n \nTout est là : twitter.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175579/in-ps2-apollo-save-tool-en-developpement-pour-la-ps2-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS4] Participez à la prochaine phase test du flasher E4",
        "content": "Le développeur LightingMods propose à qui veut bien l'entendre qu'il vous est possible de participer à la prochain phase Bêta de l'E4 Flasher.\n \n \n\n \n \nLes flashers sont vendus au prix coûtant (25 $) avec livraison gratuite aux États-Unis et incluent une puce NOR de PS4 slim/pro de rechange pré-soudée à la carte. Pour une livraison en Europe, il faudra juste s'acquitter en plus des frais de port. \n \n \nLe googleform est disponible ici  : docs.google.com\n \nIl rajoute que pour lui la PS4 est beaucoup plus facile à souder que des appareils plus petits comme la Switch, déjà de part sa taille mais aussi par la disposition des puces. \n \n \n\n \n \nLe retour de la scène PS4 ? \n\n \nD'une manière générale cela s'accélère sur le downgrade de PS4, il semble que l'arrivée d'Abkarino a réveillé un peu tout le monde, le développeur BwE vient quand à lui annoncer un pack à 100 $ intégrant tout le nécessaire pour patcher le Syscon et la NOR de la PS4, ainsi que son logiciel BwE PS4 Downgrade Tool.\n \n \n\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175559/in-ps4-participez-a-la-prochaine-phase-test-du-flasher-e4-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175559/in-ps4-participez-a-la-prochaine-phase-test-du-flasher-e4-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1175559/in-ps4-participez-a-la-prochaine-phase-test-du-flasher-e4-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] Reconnaitre l'une des 3 révisions de votre DualSense",
        "content": "Oui il existe déjà 3 révisions de contrôleurs DualSense sur PlayStation 5 alors que la console n'a que 2 années et demi d'existence. \n \nSony tente d'améliorer continuellement ses produits, même si cela ne se voit pas au premier plan, en creusant un peu il est possible de voir les différences entre les manettes. \n \nDravszoo sur son profil Twitter nous propose de découvrir comment vous pourriez confirmer que vous avez la première, la seconde ou la dernière révision de la DualSense. \n \nIl existe différentes méthodes, la première est tout bêtement de regarder le numéro de série liés à l'ID FCC sur l'arrière de la manette, mais cela ne vous permettra que de distinguer un modèle BDM-010 avec un modèle BDM-020. \n \nLa seconde méthode est de vérifier la présence ou pas d'une lettre à côté de la référence du modèle.\n \nEnfin pour la troisième méthode il est possible de regarder l'intérieur des touches L2 et R2 afin de pouvoir les distinguer, ainsi vous pouvez découvrir quelle révision de DualSense vous disposez.\n \n \n\n \n \n \nPhoto ici : twitter.com/dravszoo1/\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175557/in-ps5-reconnaitre-lune-des-3-revisions-de-votre-dualsense-1.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] Joy-Con Utility de Yoti disponible en v1.0.1",
        "content": "Le développeur Yoti, que l'on connaissait davantage pour ses contributions à la PSP et  à ONELua, a développé un utilitaire livré sous format NRO à destination de ceux qui souhaitent modifier leur périphérique Joy-Con de leur Nintendo Switch. Il s'agit d'un fork de Joycon Utility proposé en 2020 par dx4m.\n \nL'outil permet de réaliser une sauvegarde du firmware de la manette, de le restaurer, de changer son numéro de série ou encore de le restaurer. \n \n \n\n \n \nLa nouvelle version 1.0.1 vient apporter quelques optimisations  :\n \n- Vous pouvez maintenant utiliser le SDK le plus récent\n- Correction de quelques plantages lors de l'utilisation de l'application\n- Modification de quelques chaînes de caractères ici et là\n- Utilisation du Joy-Con SN comme nom de fichier par défaut\n \n \n\n \n \n \nTéléchargement : Joy-Con_Utility 1.0.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175556/in-switch-joy-con-utility-de-yoti-disponible-en-v101-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175556/in-switch-joy-con-utility-de-yoti-disponible-en-v101-1.jpg"
        }
    },
    "news_13": {
        "title": "[WiiU] NUSspli Lite v1.137 disponible",
        "content": "Voici la 137 eme release de NUSspli Lite, est-il encore nécessaire de le présenter, probablement pour les petits nouveaux, ou pour les anciens qui ont oublié à quoi il peut servir. \n \nPour rappel, il s'agit du dernier loader et installateur de packages pour la Nintendo Wii U qui s'appuie sur un fork de l'excellent WUPDownloader de Poke303.\n \nEn effet, NUSspli vous permet d'installer du contenu directement depuis les serveurs de mise à jour Nintendo sur votre Wii U. Cette mise à jour permet encore et toujours d'améliorer la stabilité de l'outil, qui est proposé pour toutes les versions et tous les formats existants, que ce soit pour Aroma, pour la Homebrew Channel, HBL ou encore  en version Lite, et Debug. \n \n \n\n \n \nChangelog : \n \n- Améliorations de la stabilité et de la convivialité :\n- D'autres améliorations de la stabilité globale et d'autres ajustements mineurs ont été apportés pour améliorer l'expérience utilisateur.\n \n \nTéléchargement : NUSspli Lite v1.137s\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175511/in-wiiu-nusspli-lite-v1137-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[PS4] PS4 Syscon Tools v1.0.1 disponible",
        "content": "Quelques jours après l'annonce d'Abkarino, voilà qu'il débarque, PS4 Syscon Tools vient en effet d'être proposé au téléchargement dans sa version initiale 1.0.0.\n \nLa puissance du petit outil n'est déjà plus à démontrer avant même sa publication le développeur nous l'avait bien teasé, il a été créé avec EgyCnq et permet de manipuler, dumper, flasher la puce Syscon de la PS4 (Renesas RL78/G13). \n \n \n\n \n \n \nPour s'en servir au mieux, il vous faudra la partie logicielle représentée par cet outil PS4 Syscon Tools mais aussi la partie hardware avec un de quoi flasher le Syscon, un Teensy++ 2.0 ou Teensy 4.0.\n \nQuelques heures après l'arrivée de la 1.0.0, le développeur a corrigé l'outil en version 1.0.1 pour corriger un petit bug et ajouter un message d'avertissement lorsque vous essayez d'effacer le bloc 0, car cela peut conduire à briquer votre puce si vous ne savez pas ce que vous faites, alors il est conseillé de s'assurer d'abord que vous avez une connexion stable et essayez d'effacer/d'écrire partiellement.\n \n \n\n \n \n \nLa documentation est disponible ici : Lisez moi\n \n \nUn petit aperçu ! \n\n \nEst ce que je peux l'utiliser pour downgrader ma console ?\n \nIl faut souligner que le Syscon est l'endroit où les informations sur le firmware de la PlayStation 4 sont stockées et grâce à ces outils, il vous permet d'apporter des modifications, des réparations et de rétablir la console au firmware précédent qu'elle avait précédemment installé.\n \nPuis-je passer de la version 10.50 à la version 9.00 ? Uniquement si la version 9.00 était votre ANCIEN firmware.\n \nPuis-je passer de la version 10.01 à la version 9.00 ? Uniquement si la version 9.00 était votre ANCIEN firmware.\n \nPuis-je passer de la version 9.50 à la version 9.00 ? Uniquement si la version 9.00 était votre ANCIEN firmware.\n \nPuis-je rétrograder de la version 9.00 à la 5.50 ? Uniquement si la version 5.50 était votre ANCIEN firmware.\nVers quel firmware vais-je revenir ? Vers le firmware qui était votre PRÉCÉDENT.\n \nLIBÉRER DES FONCTIONNALITÉS SANS PRÉCÉDENT\nAvec PS4 Syscon Tools, les utilisateurs ont accès à un large éventail de fonctionnalités pour faciliter une manipulation efficace de la puce Syscon. Explorons quelques-unes de ses principales fonctionnalités :\n \nFLASH SYSCON DUMPS\nDump complet en moins de 50 secondes.\nDump partiel pour des blocs spécifiques ou des plages de blocs.\nDump NVS/SNVS utilisant un processus de lecture très efficace, évitant le recours à la méthode de boucle infinie utilisée par d'autres outils.\n \nÉCRITURE SYSCON FLASH\nScript complet terminé en moins de 1,5 minutes.\nÉcriture partielle pour des blocs spécifiques ou des rangs de blocs.\nCapacité d'écriture NVS/SNVS.\n \nEFFACER FLASH SYSCON\nEffacement complet réalisé en seulement 4,3 secondes.\nFlou partiel pour des blocs spécifiques ou des plages de blocs.\n \nMODE DE DÉBOGAGE SYSCON\nActivez le mode de débogage syscon en ne connectant que trois fils et en définissant l'indicateur OCD.\nLe processus se déroule sans heurts sans qu'il soit nécessaire de vider l'intégralité du syscon, d'appliquer des correctifs et des réécritures, comme on le voit dans d'autres outils alternatifs.\n \nEXIGENCES ET CONNECTIVITÉ\nPour utiliser PS4 Syscon Tools, vous aurez besoin des éléments suivants :\n \n- Teensy++ 2.0 .\n- Une résistance avec une plage d'impédance d'environ 100 à 200 ohms.\n- Câbles.\n- En option : adaptateur de prise LQFP 64 – 100.\n- Des compétences en soudage.\n\n \n \nTout est là : PS4 Syscon Tools v1.0.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175510/in-ps4-ps4-syscon-tools-v101-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[PS4/PS5/Switch] DS4Windows 3.2.12 disponible",
        "content": "Le développeur Travis Nickles, connu aussi sous le pseudo Ryochan, nous propose de découvrir une nouvelle version de DS4Windows. Cette version apporte quelques corrections notamment sur le support DualShock 3 mais aussi des sticks des JoyCon.\n \n Comme vous le savez probablement DS4Windows est une interface efficace pour paramétrer une manette sur PC, il est basé sur un fork de Jays2Kings. Pour en profiter cela passe par un câble micro-USB, mais il est aussi possible de s'en servir sans fils avec quelques adaptateurs Bluetooth 2.1 (ou supérieur). \n \n\n \n \nVoici le changelog de cette version : \n \n- Correction de l'impossibilité d'activer le support DS3. Contribution de sunnyqeen\n- Mise à jour de la traduction allemande. Contribution de PaulWentzel\n- Ajout de la traduction en finnois. Contribution de eemijun\n- Tentative d'ajustement des plages d'axes des manettes JoyCon en fonction des coordonnées initiales des axes.\n- Diminution de la période d'attente après la reprise. Réduit à 5 secondes. Probablement une erreur\n- Elimination de l'icône de notification avant la fermeture du programme. Au moins les erreurs H.NotifyIcon apparaîtront dans le journal lors de la fermeture du programme.\n- Correction de l'analyse de la calibration du stick RS pour les manettes JoyCon et Switch Pro\n- Modification de la routine de recherche du programme HidHideClient. Utilisation des informations du registre pour tenter de trouver l'emplacement de HidHide.\n- Ajout d'une sauvegarde supplémentaire si la liste des profils est vide. Evite le crash\n \n \n\n \n \n \n \nTéléchargement : DS4Windows 3.2.12\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175487/in-ps4ps5switch-ds4windows-3212-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175487/in-ps4ps5switch-ds4windows-3212-disponible-2.png"
        }
    },
    "news_16": {
        "title": "[PS4] Et Abkarino dévoile un tutoriel pour PS4 Syscon Flasher",
        "content": "Le développeur PS3 Abkarino est de retour sur le devant de la scène PS3 pour notre plus grand plaisir et nos souvenirs, après avoir proposé son outil PS4 Syscon Tool, il offre comme promis un tutoriel vidéo sur le flash du Syscon de la PS4. \n \n \n\n \n \n\n \n \n \nPour parvenir à reproduire son tutoriel vous devez disposer du matériel adéquat, c'est à dire une PS4 et surtout un Teensy++ 2.0, et les bonnes résistances de 100 à 200 ohm.\n \nIl tient à remercier egycnq pour son aide et son travail acharné à préparer ce tutoriel.\n \n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175479/in-ps4-et-abkarino-devoile-un-tutoriel-pour-ps4-syscon-flasher-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175479/in-ps4-et-abkarino-devoile-un-tutoriel-pour-ps4-syscon-flasher-2.png"
        }
    },
    "news_17": {
        "title": "[PS4] Zecoxao dévoile deux payloads et des clés PS4",
        "content": "Le développeur Zecoxao, Jose Coixao, sort du lourd ce matin, il dévoile des clés PS4 qu'il a intégré dans ps4devwiki, qui inclus les clés shellcore metadata et les clés sealed (scellées).\n \nVous me direz c'est très bien mais à quoi cela peut-il servir ? Avec ces clés, les développeurs et autres utilisateurs expérimentés vont pouvoir décrypter fpkg, en utilisant pfs_pkg_tool de flatz cependant, puisque l'outil ne supporte pas (encore) le multithreading, la méthode a privilégier sera toujours l'outil de Maxton.\n \nLes clés sont disponibles ici : clés shellcore metadata et les clés sealed\n \n \n\n \n \nIl a également ajouté quelques notes sur les flags utilisés dans le stockage non volatile sur le ps4devwiki, que vous pouvez trouver ici : psdevwiki\n \n \n\n \n \n \nA cela il ajoute deux nouveaux payloads qui pour l'un permet de sous-cadencé l'APU à 500 MHz, tandis que l'autre overclocke l'APU à 1725 MHz, autant vous le dire tout de suite, c'est extrêmement dangereux pour votre console, et il préconise de ne l'utiliser que si vous avez de quoi flasher, il informe qu'il va étendre le support de l'overclock (ou de l'underclock) à des homebrews mais cela sera pour plus tard. \n \n \nTéléchargement ici : overclock.bin / underclock.bin\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175478/in-ps4-zecoxao-devoile-deux-payloads-et-des-cles-ps4-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175478/in-ps4-zecoxao-devoile-deux-payloads-et-des-cles-ps4-2.png"
        }
    },
    "news_18": {
        "title": "[PS4] Abkarino est de retour sur PS4 avec PS4 Syscon Tool",
        "content": "Le célèbre développeur PS3 Abkarino, très connu car il a été l'un des membres actifs de la Team Rebug, vient d'annoncer sur Twitter la disponibilité prochaine d'un nouvel outil à destination de la PS4 et PS4 Pro, PS4 Syscon Tool. Sous ce nom se cache un utilitaire qui aidera à la \"réparation, modification et au downgrade de PS4\".\n \n \n\n \n \n \nPeu de doute avec un nom pareil, l'outil permettra de bidouiller la puce syscon de la console : \n \nDump du flash syscon :\n- Complet\n- Partiel\n- NVS/SNVS uniquement\nEffacer Syscon :\n- Effacer Flash complet\n- Effacer complètement le bloc Boot 0\n- Effacer partiel\nÉcrire Syscon :\n- Complet\n- Partiel\n- NVS/SNVS uniquement\nActiver le mode de débogage Syscon \n \n \n \n\n \n \n \nLa date de sortie de cet outil proposé par Abkarino et EgyCnq n'a pas encore été annoncée. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175454/in-ps4-abkarino-est-de-retour-sur-ps4-avec-ps4-syscon-tool-1.png"
        }
    },
    "news_19": {
        "title": "[Vita] pkg2zip v2.5 disponible",
        "content": "Le développeur Yoti vient de mettre en ligne la version 2.5 de Pkg2zip, qui comme vous le savez est une alternative intéressante à des solutions comme PkgDecrypt de St4rk ou unpkg_vita de RikuKH3.\n \npkg2zip est un utilitaire qui décrypte les fichiers pkg de la PlayStation Vita et crée un paquet zip. Les types de fichiers pkg pris en charge : application principale, DLC, patch, thème et fichiers PSM. A noter que pkg2zip prend également en charge les fichiers pkg PSX et PSP à utiliser avec Adrenaline.\n \nOptionnellement un fichier de fausse licence NoNpDrm ou NoPsmDrm à partir de la chaîne zRIF peut être utilisé, vous devrez fournir une clé de licence.\n \n \n \n\n \n \nChangelog 2.5 : \n \n- Prise en charge d'un plus grand nombre de régions\n- Ajout d'un support pour décrypter/extraire les PKG de type 1\n- Ajout de la prise en charge de KEYS.BIN pour les PKG de type 1\n- Ajout de la détection de région pour les jeux PS1\n- Correction de quelques messages ici et là\n \n \nTéléchargement : pkg2zip v2.5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175453/in-vita-pkg2zip-v25-disponible-1.jpg"
        }
    },
    "news_20": {
        "title": "[2DS/3DS/DS] TWiLight Menu++ v25.11.0 et nds-bootstrap v0.72.1",
        "content": "Le développeur RocketRobz propose à la scène 3DS de découvrir une nouvelle version de TWiLight Menu++ et de nds-bootstrap qui passent respectivement en v25.11.0 et 0.72.1.\n \nLe rythme d'une version par mois est maintenu, c'est une bonne chose pour TWiLightMenu++ qui pour rappel est un menu alternatif, open source et personnalisable pour lancer des homebrews DS, jeux et roms DS, GBA, BD via la DS, 3DS ou 2DS.\n \n \n\n \n \nChangelog : \n \n- Ajout de correctifs AP pour\nPokémon : Moon Black 2 (Beta v4.2.3)\nPokémon : Version Argent Apaisé (v1.3.2)\n- Les points de départ pour les musiques de skin personnalisées sont maintenant supportés !\n- Le fichier audio doit être nommé bgm.start.wav et doit être placé au même endroit que bgm.wav.\n- Si votre skin personnalisé utilise encore bgm.pcm.raw, il est recommandé de passer à bgm.wav. Voir cette page pour plus d'informations.\n- La musique originale du menu DSi a été rajoutée !\n- La qualité est la même que dans les versions précédentes qui contenaient la musique.\n- Pour célébrer la sortie de Sonic the Hedgehog sur SEGA Genesis/MegaDrive, l'écran d'accueil de TWLMenu++ joue maintenant un jingle du jeu !\n- Pour que cela prenne effet, TWiLight Menu++ doit être démarré à la date de sortie du jeu.\n- Pour contourner un bug, nds-bootstrap est maintenant utilisé pour démarrer Pictochat & DLP, lorsqu'ils sont lancés en dehors du DS Classic Menu.\n \nAmélioration\n \n- TWLMenu++ est revenu aux versions non-ADPCM des fichiers musicaux des thèmes DSi/3DS/HBL, afin d'en améliorer la qualité.\n- Cela améliore également les temps de chargement lors de la première utilisation d'une option musicale spécifique.\n \nCorrection de bugs\n \n- Correction de la visionneuse d'images qui ne lisait pas les images des flashcards.\n- Correction du jingle un peu silencieux lorsqu'il est joué dans la variante Style Savvy de l'écran d'accueil TWLMenu++.\n \nBug connu\n \n- Le point de départ de la musique HBL est légèrement incorrect.\n \nCorrections de bugs pour nds-bootstrap :\n \n- Le bug de verrouillage des sauvegardes dans Pokemon B&W 1&2 et quelques autres jeux a été corrigé une fois de plus.\n- Correction des erreurs de communication lors du démarrage des applications Pictochat ou DLP.\n- My Healthy Cooking Coach a été mis sur liste noire pour ne pas utiliser le DMA de lecture de carte, afin de pouvoir démarrer.\n- Le cache des correctifs devrait maintenant être correctement effacé lorsqu'il est obsolète.\n- Cela devrait résoudre le problème des jeux qui ne démarrent pas et qui ont déjà été démarrés par une version antérieure de nds-bootstrap.\n- Après avoir ouvert le menu du jeu, et en fermant le couvercle de la console 3DS ou 2DS, celle-ci ne se bloquera plus sur des écrans noirs.\n- Tentative de compatibilité avec les cartes SD de marques moins connues, en désactivant l'AMDN avant que le jeu ne démarre.\n- La NDMA est désormais toujours désactivée pour les homebrew.\n \n \nTéléchargement : TWiLight Menu++ v25.11.0 et nds-bootstrap v0.72.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175446/in-2ds3dsds-twilight-menu-v25110-et-nds-bootstrap-v0721-1.jpg"
        }
    }
}