{
    "news_1": {
        "title": "[PS3] Les premiers dumps d'une PS3 Super Slim DECH 4000 (DEX)",
        "content": "Le développeur Zecoxao partage quelques nouveautés sur la scène PS3, il s'agit en fait du partage du jeton QA flag et la signature respective tirés d'une console Super Slim DECH de la série 4000 avec le numéro de série 0000001 (le premier du genre).\n \nIl semble que cela provienne d'un utilisateur de discord qui a proposé le dump nvs complet de l'eprom.\n \n \n\n \n \nPour l'heure ce n'est pas encore utilisable pour parvenir à un CFW sur un firmware supérieur au 3.56, peut être que cela pourrait conduire à un CFW jusqu'au firmware 4.21.\n \nJoonie, le célèbre développeur de l'ancienne team Rebug, quand à lui pense que cela pourrait permettre de faciliter le downgrade OFW vers OFW. Zecoxao précise qu'à partir du firmware 4.21 tout a changé avec l'introduction de clé différente.\n \n \nSi le sujet vous intéresse :  QA Flag d'une Superslim_DEX / Psx-place.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191007/in-ps3-les-premiers-dumps-dune-ps3-super-slim-dech-4000-dex-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS4] PS4 App Lock v1.07 disponible",
        "content": " \nPS4 App Lock v1.07 est une application développée par Lapy qui permet de verrouiller l’exécution de jeux et d’applications homebrew sur le dashboard de la console PlayStation 4. \n \n \n \n\n \n \nVoici quelques fonctionnalités de cette application :\n \n- Création d’un code PIN unique.\n- Verrouillage individuel des jeux et des applications.\n- Affichage des classifications PEGI (en lisant le niveau de contrôle parental depuis le fichier SFO).\n- Affichage d’un message bloqué lorsque vous essayez d’ouvrir une application ou un jeu verrouillé\n \nCette nouvelle version 1.07 apporte le support du firmware 5.00 au firmware 11.00.\n \n \nTéléchargement : PS4 App Lock v1.07\n \n   \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190936/in-ps4-ps4-app-lock-v107-disponible-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS3] La 8ème Bêta du CFW 4.91.2 Evilnat est là",
        "content": "Le développeur Evilnat a récemment publié une nouvelle version bêta de son CFW (Custom Firmware) pour la PS3, la version 4.91.2 Beta 8. Cette mise à jour inclut plusieurs nouvelles fonctionnalités, notamment le support des consoles sans un lecteur blu-ray fonctionnel. \n \nCette version intègre en effet le support des consoles avec des lecteurs HS, qui pourront donc mettre à jour vers cette version et ainsi disposer des dernières évolutions. \n \nTrès peu de changements depuis la version Bêta 7.0, sur les CEX/DEX/PEX et D-PEX, mais comme le rappelle le développeur il faut faire attention lors de l'overclocking de la console.\n \n \n\n \n \nChangelog : \n \n- Mise à jour du chargement de la charge utile Cobra à un décalage différent dans le noyau LV2\n- Recompilation du noyau LV2\n- Recompilation de l'étage 2 du Cobra\n- Ajout d'une vérification de la charge externe du noyau LV2 lors de l'utilisation de l'option [CEX2DEX Tools > Swap Kernel].\n- Ajout d'une vérification MD5 pour les fichiers dtbImage.ps3.bin et dtbImage.ps3.bin.minimal pour OtherOS\n- [XAI] Ajout d'une nouvelle option pour alterner entre libaudio.sprx d'origine et suuport, patché avec un troisième casque BT (peut échouer avec certains)\n- [XAI] Réactivation de l'option [Toggle External Cobra] dans xai_plugin\n \n \nTéléchargement : CFW 4.91.2 Evilnat Beta 8\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190928/in-ps3-la-8eme-beta-du-cfw-4912-evilnat-est-la-1.jpg"
        }
    },
    "news_4": {
        "title": "[PS4] PS4-Xplorer 2.03, PS4 Player 1.08 et PS4 Player 3D 1.01",
        "content": "Le développeur Lapy est en pleine forme, il déplace des montagnes pour proposer ses meilleurs homebrews sur la PS4 pour intégrer le support des derniers firmwares exploitables. \n \nAinsi il propose son PS4-Xplorer 2.03, PS4 Player 1.08 et PS4 Player 3D 1.01, l'idée étant d'apporter le support des firmwares du 5.00 au 11.00 bien entendu.\n \n \n\n \n\n \n\n \n \nTéléchargement : PS4-Xplorer 2.03 / PS4 Player 1.08 / PS4 Player 3D 1.01\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190859/in-ps4-ps4-xplorer-203-ps4-player-108-et-ps4-player-3d-101-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1190859/in-ps4-ps4-xplorer-203-ps4-player-108-et-ps4-player-3d-101-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1190859/in-ps4-ps4-xplorer-203-ps4-player-108-et-ps4-player-3d-101-3.jpg"
        }
    },
    "news_5": {
        "title": "[PS4] PS4 Temperature v1.07 disponible",
        "content": " \nLe développeur Lapy a récemment publié une mise à jour pour son outil PS4 Temperature. Cet utilitaire permet non seulement d’afficher la température en degrés Celsius et Fahrenheit, mais aussi de définir une limite à partir de laquelle le ventilateur commence à tourner plus rapidement. \n \nSi vous êtes un utilisateur de la PS4, cela pourrait être utile pour surveiller la température de votre console et ajuster les paramètres du ventilateur en conséquence.\n \n \n\n \n \nCette version 1.07 de PS4 Temperature apporte le support du firmware 5.00 à 11.00 à l'aide du soutient de notnotzecoxao et de LightningMods.\n \n \nTéléchargement : PS4 Temperature 1.07\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190833/in-ps4-ps4-temperature-v107-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[2DS/3DS] Luma3DS v13.1.1 disponible",
        "content": " \nLuma3DS v13.1.1 vient d’être publié, ce qui est de nouveau une excellente nouvelle pour les amateurs de Nintendo 3DS ! Voici les détails de cette mise à jour :\n \n\n \nChangelog : \n \n- Correction d'un bug où l'option de connexion sans fil remplaçait le remplacement du volume\n- Forcer le menu wifi : gérer correctement les emplacements wifi non configurés\n- Modifications mineures du loader de plugin\n \n \nTéléchargement : Luma3DS v13.1.1 \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190797/in-2ds3ds-luma3ds-v1311-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[WiiU] Les plugins Region Free, SDCafiine, SwipSwapMe, Wiiload, FTPiiU et Screenshot",
        "content": " \nDe nombreux plugins ont été mis à jour à destination de la Nintendo Wii U, il faut dire que Maschell a mis à jour de nombreux d'entre eux suite à l'arrivée de la nouvelle version d'Aroma. \n \n \n\n \n \nPlugin ftpiiu v0.4.2 \n \n- La commande LIST qui affiche la liste des fichiers et dossiers a été corrigée.\n- Changer le CWD par défaut en / pour corriger l'accès à n'importe quel répertoire de carte non-dd pour certains clients ftp    \n \nTéléchargement : Plugin ftpiiu v0.4.2\n \n \nSDCafiine Plugin v0.1.5\n \n- Correction de la modification du paramètre pour appliquer automatiquement les modpacks dans l'écran de démarrage.\n \nTéléchargement : SDCafiine Plugin v0.1.5\n \n \nSwipSwapMe v0.1.2\n \n \n- Support de WUPS 0.8.0\n- Ajout de la prise en charge du miroir TV/DRC\n \n \nTéléchargement : SwipSwapMe v0.1.2\n \n \nsdcafiine plugin v0.1.5\n \n- Support for WUPS 0.8.1\n- Correction de la modification du paramètre d'application automatique directement dans l'écran d'accueil\n \nTéléchargement : sdcafiine_plugin v0.1.5\n \n \nRegion Free plugin v0.2.6\n \n- Correction de l'affichage de l'écran de démarrage sans région en 576i et 480i\n \nTéléchargement : Region Free plugin v0.2.6\n \n \nGamePad Auto Standby 0.6\n \n- Mise à jour vers WUPS 0.8.1.\n- L'option de mise hors/sous tension du GamePad basculera désormais entre la mise hors et sous tension pendant que le menu de configuration reste ouvert.\n- Amélioration de la fonctionnalité de mise hors tension au démarrage :\n-- Ne s'éteindra plus lors d'une relance du système d'exploitation (par exemple en quittant les paramètres système).\n-- Ne s'éteindra plus lors d'un rechargement du plugin (déterminé par la disponibilité du système d'exploitation < 5 minutes).\n- Des réparations liées à des bugs.\n \nTéléchargement : GamePad Auto Standby 0.6\n \n \nHomebrew on Menu 0.1.8 \n \n \n- Donner aux utilisateurs des conseils pour résoudre l'erreur 150-3030 lorsqu'ils la rencontrent dans le menu Wii U\n- Rediriger uniquement le répertoire de sauvegarde de l'utilisateur actuel\n \n \nTéléchargement : Homebrew on Menu 0.1.8 \n \n \n \nScreenshot Plugin v0.1.3\n \n- Prise en charge de WUPS 0.8.0, utilisation de l'heure de création de la capture d'écran dans le nom du fichier\n \nTéléchargement : Screenshot Plugin v0.1.3\n \n \nwiiload plugin v0.2.3\n \n- Ajout des notifications d'erreur si le wiiloading d'un rpx/wuhb échoue\n- Refonte pour support WUPS 0.8.0\n \nTéléchargement : wiiload plugin v0.2.3\n \n \n \nAroma Updater v0.2.3\n \n- Charger le certificat intégré pour permettre l'utilisation de l'Updater dans Tiramisu\n- Mise à jour du fichier cacerts.pem\n \nTéléchargement : Aroma Updater v0.2.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-660015649.png"
        }
    },
    "news_8": {
        "title": "[PS4] La réécriture de PPPwn_cpp ( PPPwn en C++) est finalisée",
        "content": "Le développeur xfangfang affirme avoir finalisé la réécriture C++ de PPPwn, comme vous le savez désormais cette réécriture permet d'utiliser et d'améliorer l'exploit sur les appareils moins puissants comme les routeurs ou les Raspberry Pi.\n \n \n\n \n \n \nCes dernières optimisations permettent d'améliorer la vitesse de l'exploit ainsi que sa fiabilité d'exécution selon le développeur. Les stages 3 et 4 ont été ajoutés, et de nouvelles options ont été rajoutées comme l'une d'entre elle qui permet de relancer automatiquement le stage 1 quand il est en échec. Des améliorations sur l'IPv6 à partir d'une adresse MAC ont également été intégrées par le développeur. \n \n \n \n\n \n \n \nTéléchargement : PPPwn_cpp\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190791/in-ps4-la-reecriture-de-pppwn-cpp-pppwn-en-c-est-finalisee-1.png"
        }
    },
    "news_9": {
        "title": "[PS4] Icon Mask 1.14 disponible",
        "content": "Encore une fois, Lapy travaille durement sur le firmware 11.00 comme nous venons de le voir, et avec l'appui d'autres grands noms il propose la mise à jour d'Icon Mask en version 1.14.\n \n \n\n \n \nComme vous le savez Icon Mask  permet de modifier l'apparence des icônes sur le dashboard de la PlayStation 4, Icon Mask est en effet une application Homebrew pour PS4 qui vous permet de modifier l'apparence de vos icônes, en leur appliquant un simple masque PNG. Cela vous permet de modifier la transparence, d'ajouter des bordures, d'afficher vos icônes dans une icône officielle \"PS4 box\".\n \n \n\n \n \nAvec les efforts de LightningMods, notnotzecoxao, et Anubis_Qz, mais aussi des bêtas-testeurs DouglasSampaioz et crump_youtube, cette nouvelle version a été adaptée avec le support des firmwares jusqu'au 11.00. Les développeurs se concentrent sur le firmware 11.00, mais les offsets sont également ouverts pour le firmware 9.00 par exemple. \n \n \nTéléchargement : Icon Mask 1.14\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190778/in-ps4-icon-mask-114-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1190778/in-ps4-icon-mask-114-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS4] PS4-Xplorer et PS4 Temperature teasés pour le firmware 11.00",
        "content": " \nLe développeur Lapy est de retour, il dévoile en effet que le firmware 11.00 va pouvoir bientôt bénéficier de PS4-Xplorer 2.0, il s'agirait de la version 2.03 même si cela reste encore à confirmer. \n \n \n\n \n \nCe sont une vidéo mais aussi quelques images qui prouvent la chose, pour y parvenir il faut bien entendu ouvrir les accès root sur le firmware 11.00 et ainsi pouvoir lancer le programme.\n \n \n\n \n\n \n\n \n \nBien entendu, nombreux sont ceux qui demandent le lien, mais pour l'heure rien n'est disponible car Lapy n'a pas encore lâché les programmes, que ce soit PS4-Xplorer ou PS4 Temperature, seuls quelques testeurs y ont eu droit. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190776/in-ps4-ps4-xplorer-et-ps4-temperature-teases-pour-le-firmware-1100-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1190776/in-ps4-ps4-xplorer-et-ps4-temperature-teases-pour-le-firmware-1100-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1190776/in-ps4-ps4-xplorer-et-ps4-temperature-teases-pour-le-firmware-1100-3.jpg"
        }
    },
    "news_11": {
        "title": "[PS4] PPPwnUI version 2.0 disponible et s'améliore encore",
        "content": " \nPPPwnUI est un programme qui ajoute une interface utilisateur (UI) à l’exploit PPPwn créé par TheFlow. Cette interface graphique proposée par Memz a largement été améliorée ces derniers jours, notamment avec les ajouts récents qui ont été effectués. De plus l'outil a été mis à jour aussi pour intégrer le support de goldHEN 2.4b17 de SiSTR0.\n \n \n \n\n \n \nChangelog :\n \n- Modification de la disposition de l'interface graphique, des étiquettes et du style des boutons\n- Correction du script py pour le firmware 9.60\n- Ajout de scripts manquants pour les firmwares 10.50, 10.70, et 10.71\n- Vérifie l'interface réseau avant de démarrer\n \n \nTéléchargement : PPPwnUI version 2.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190756/in-ps4-pppwnui-version-20-disponible-et-sameliore-encore-1.png"
        }
    },
    "news_12": {
        "title": "[PS4] PS4 Wee Tools PRO disponible en v1.0.1 pour PS4 et bientôt pour PS5",
        "content": " \nPS4 Wee Tools PRO 1.0.1 est une version améliorée de l’application PS4 Wee Tools, développée par Andy Man, et proposée contre un café. \n \nComme vous le savez PS4 Wee Tools dans sa version standard est une application open source gratuite qui facilite le travail avec les dumps NOR (sflash) et syscon de la PS4. Écrit en Python pour rester simple, il a été développé en s'appuyant sur Python 3.8.\n \n \n\n \n \nFonctionnalités :\n \n- Comparaison de fichiers multiples.\n- Outil NOR pour afficher des informations sur les dumps NOR de la PS41.\n- Dépendances: Aucune dépendance particulière.\n \nPS4 Wee Tools PRO (version améliorée, réservée aux donateurs/contributeurs):\n \nFonctions supplémentaires : \n \n- Patcher NOR pour la Southbridge.\n- Patcher NOR pour le module Torus (WiFi+BT).\n- Analyse et récupération des partitions NOR.\n- Modes Quick/Expert pour la récupération des partitions NOR.\n- Activation/désactivation du slot flag\n- Patcher SCFlasher pour une suppression sûre du syscon.\n- Nettoyage complet du syscon.\n- Correction de bugs pour la méthode B du syscon.\n- Patch manuel du syscon avec flatdata.\n- Affichage du compteur de lignes.\n- Optimisation du code et corrections de bugs\n \nEn résumé, PS4 Wee Tools PRO offre des fonctionnalités supplémentaires par rapport à la version standard, mais elle est réservée aux donateurs et contributeurs. Si vous avez besoin d’outils pour travailler avec les dumps NOR et syscon de votre PS4, il est donc conseillé d'utiliser cette version plus complète. \n \nA noter qu'une version PS5 est aussi en cours de développement, elle permettra d'en savoir plus sur les erreurs EMC, de connaitre à quoi correspondent justement ces erreurs, et aussi de patcher des nouvelles NOR. \n \n \n\n \n\nChangelog\nv1.0.1\n* Syscon Rebuilder modes\n* Spanish Language\n* Russian Language\n \nv1.0.0b\n* [new] Syscon auto-patch E\n* [new] Syscon FW recovery\n* [new] Stock syscon flasher (rl78flash)\n* [new] Syscon NVS viewer\n* [new] Decrypted PUP unpacker\n* [new] 11.50 support\n* [new] Rename to canonical name\n* [new] Syscon boot/mode select\n* [upd] Syscon flasher 2.02\n* [upd] Syscon flat data viewer\n* [upd] Code optimization\n* [fix] Syscon boot modes select\n* [fix] Syscon rebuilder (factory reset)\n \n \n\n \n\n \nTéléchargement : PS4 Wee Tools PRO 1.0.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190755/in-ps4-ps4-wee-tools-pro-disponible-en-v101-pour-ps4-et-bientot-pour-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1190755/in-ps4-ps4-wee-tools-pro-disponible-en-v101-pour-ps4-et-bientot-pour-ps5-2.png"
        }
    },
    "news_13": {
        "title": "[PS4] PS Multi Tools 14.1.1 disponible",
        "content": " \nPS Multi Tools, développé par SvenGDK, est maintenant disponible en version v14.1.1 et il intègre un nouveau “updater” complet ainsi que la nouvelle interface graphique PPPwn pour la PS4. Comme vous le savez, PS Multi Tools est un gestionnaire de sauvegardes pour PS1, PS2, PSX, PS3, PS4, PS5 (versions ultérieures), PSP et PS Vita, mais cette nouvelle version vient modifier uniquement des éléments pour la PS4 compte tenu des dernières évolutions liés à PPPwn. \n \n \n\n \n \nVoici les nouveautés de cette version:\n \n- Nouvel “updater” complet: Cet outil met à jour PS Multi Tools entièrement et peut également ajouter de nouveaux fichiers manquants au besoin pour les nouveaux outils dans la PSMT-Library.\nPPPwn GUI pour PS4: Cette nouvelle interface graphique facilite l’utilisation des outils sur la PS4.\nAméliorations générales: La mise à jour v14.1 apporte également des ajustements.\nPS4:\n- Mise à jour de l'interface graphique de PPPwn pour PS4\n- Mise à jour de pppwn.exe avec les derniers changements\n- Ajout des nouveaux fichiers 9.00 + 11.00 stage1 & stage2 de SiSTR0\n- Ajout des fichiers les plus récents et mis à jour 9.00 + 11.00 GoldHEN 2.4b17 de SiSTR0\n- Ajout d'un nouveau bouton pour copier goldhen.bin à la racine de l'USB\n \n \n \nTéléchargement : PS Multi Tools 14.1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190701/in-ps4-ps-multi-tools-1411-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[PS4] Stooged dévoile PI-Pwn pour les Raspberry Pi",
        "content": "Stooged a publié un projet intéressant pour les utilisateurs de Raspberry Pi : PI-Pwn. Ce script permet de configurer un environnement pour exécuter l’exploit GoldHen sur une PlayStation 4 (PS4) sous le firmware 11.0. \n \nVoici comment l’utiliser :\n \nPréparation du Raspberry Pi :\n \n- Installez Raspberry Pi OS Lite sur une carte SD.\n- Copiez le dossier PPPwn sur la carte SD.\n- Insérez la carte SD dans le Raspberry Pi.\n- Exécutez les commandes suivantes :\n \nsudo chmod 777 /boot/firmware/PPPwn/install.sh\nsudo bash /boot/firmware/PPPwn/install.sh\n \n- Une fois le Raspberry Pi redémarré, PPPwn s’exécutera automatiquement.\n \n \nConfiguration de la PS4 :\n \n- Allez dans les paramètres de la PS4, puis dans la section Réseau.\n- Sélectionnez Configurer la connexion Internet et choisissez Utiliser un câble LAN.\n- Optez pour la configuration Personnalisée et sélectionnez PPPoE pour les paramètres d’adresse IP.\n- Entrez n’importe quoi pour l’identifiant PPPoE et le mot de passe PPPoE.\n- Choisissez Automatique pour les paramètres DNS et MTU.\n- Sélectionnez Ne pas utiliser pour le serveur proxy.\n- Pour GoldHen, placez le fichier goldhen.bin à la racine d’une clé USB et branchez-la à la console.\n \n \n \n\n \n \n \nPwn automatique :\n \n- Connectez le Raspberry Pi à la PS4 via un câble Ethernet.\n- Le Raspberry Pi tentera automatiquement d’exploiter la console.\n- L’exploit peut échouer plusieurs fois, mais le Raspberry Pi continuera à purger la console jusqu’à réussir.\n- Une fois l’exploit réussi, le Raspberry Pi s’éteindra.\n \nL’idée est de démarrer la console et le Raspberry Pi ensemble, et le Raspberry Pi continuera à essayer de lancer l'exploit sur la console sans intervention de votre part. Attendez simplement sur l’écran d’accueil jusqu’à ce que PPPwn réussisse. Vous pouvez également personnaliser les scripts en modifiant le contenu de la carte SD sur votre ordinateur.\n \n \nTéléchargement : stooged/PI-Pwn\n \n \n",
        "images": {}
    },
    "news_15": {
        "title": "[PS4] TheFlow a modifié le code de l'exploit pour augmenter son taux de réussite",
        "content": " \nLe développeur TheFlow tente toujours d'améliorer l'exploit PPPwn, il dévoile en effet une nouvelle version du code, l'idée est permet à l'exploit d'ignorer le premier PADI lors du jailbreak afin d'augmenter le taux de réussite. \n \nLe code implémenté dans le script Python a été modifié avec notamment des optimisations sur ppp_negotation, lié à la gestion des négociations PPPoE, afin d'ignorer volontairement certaines demandes PPPoE. \n \n \n\n \n \nL'objectif de cette modification permet d'augmenter le nomre de paramètres, en rajoutant ignore_initial_req et une nouvelle logique pour ignorer les demandes initiales afin d'optimiser le processus PPP. \n \nCe sont des tests plus poussés sur le firmware 10.50 qui ont permis d'établir que les 6 premières requêtes PPPoE peuvent poser problème, il suffit donc d'ignorer ces 6 premières requêtes pour augmenter le taux de réussite sur ce firmware. \n \nTout est là : Ignore first PADI\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190638/in-ps4-theflow-a-modifie-le-code-de-lexploit-pour-augmenter-son-taux-de-reussite-1.png"
        }
    },
    "news_16": {
        "title": "[PS4] Le payload GoldHEN v2.4b17 est disponible (9.00 et 11.00)",
        "content": " \nGoldHEN est un Homebrew ENabler pour la PS4 sous forme de payload, qui permet aux utilisateurs de débloquer certaines fonctionnalités et d’exécuter des homebrews sur leur console. \n\n \nCe chargeur ne prend en charge que les payloads ayant un point d'entrée dans le kernel.\nLa version personnalisée de stage recherche d'abord le payload dans le répertoire racine de la clé USB, et si il est trouvée, il est copié sur le disque dur interne à ce chemin : /data/GoldHEN/payloads/goldhen.bin. Le payload interne est alors chargé et n'est plus nécessaire sur le lecteur USB externe.\n \nPour l'instant, seules les versions 9.00 et 11.00 du firmware sont prises en charge. Bientôt, les versions 10.00/10.01 seront également prises en charge.\n \n \n\n \n \nVoici les détails de la dernière version Version 2.4b17 :\n \n- Ajout de la prise en charge des payloads ayant un point d'entrée\n- Prise en charge du firmware 11.00 et 9.00\n- Ajout du syscal 11.\n- Problème connu : après l’utilisation de pppwn, le serveur klog n’est pas immédiatement accessible. Une reprise en mode repos est nécessaire pour le faire fonctionner. \n \nComme toujours, il est important de noter que ceci est une version bêta, et malgré les vérifications minutieuses effectuées par le développeur et les testeurs, il est possible que des bugs apparaissent. Si vous en trouvez, n’hésitez pas à les signaler sur le serveur Discord dédié.\n \nComme il est important de soutenir le développeur, il est possible de lui offrir un café ici : https://ko-fi.com/sistro\n \n \nTéléchargement : GoldHEN v2.4b17 v1.00\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190614/in-ps4-le-payload-goldhen-v24b17-est-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1190614/in-ps4-le-payload-goldhen-v24b17-est-disponible-1.jpg"
        }
    },
    "news_17": {
        "title": "[Switch] UnlockSwitch annonce vouloir publier 2 versions d'UnlockSwitch",
        "content": "Cela fait quelques jours que nous n'avions plus de nouvelles de la Team UnlockSwitch, dans un premier temps l'équipe a communiqué sur le fait qu'elle souhaitait laisser tout le monde profiter des mouvements sur la PlayStation 4 avec PPPwn, mais dans une seconde communication elle informe qu'elle a pris la décision de rendre disponible deux versions de l'UnlockSwitch.\n \nLa première sera notre version finale open source avec nos deux nouveaux chipsets. Toute notre énergie sera concentrée sur cette version, les mises à jour, etc.\n \n \n\n \n \nLa deuxième version sera basée sur les chipsets ice40/esp32s avec son programmateur également. Au moment où les fichiers seront divulgués en ligne, le matériel sera déjà disponible. \n \nElle tient à rappeler que le seul et unique compte est celui du Télégram officiel et que les informations seront publiées en même temps sur Twitter (X) :  https://t.me/unlockswitch\n \n \nQuoi penser de cette information de la commercialisation de deux versions ? \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190592/in-switch-unlockswitch-annonce-vouloir-publier-2-versions-dunlockswitch-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS4] Sistr0 tease GoldHEN sur le firmware 11.00",
        "content": " \nGoldHEN, développé par Sistr0, est un Homebrew ENabler pour la PS4. Il permet aux utilisateurs de débloquer certaines fonctionnalités et d’exécuter des homebrews sur leur console. Récemment, SistrO a annoncé que GoldHEN serait bientôt disponible pour le firmware 11.00. Cela marque une étape importante vers la création d’une solution de jailbreak complète pour cette version spécifique du firmware, et bien entendu pour tous les autres firmwares inférieurs. \n \n \n\n \n \nVoici quelques détails sur GoldHEN et son évolution :\n \nComme vous le savez PPPwn est une chaîne de jailbreak pour la PS4, publiée par TheFloW. Elle repose sur une vulnérabilité publique étonnamment ancienne dans l’un des pilotes réseau FreeBSD (sppp). Cette vulnérabilité n’a apparemment jamais été corrigée pour la PS4, ou a été incorrectement réintroduite à un moment donné.\n \nPPPwn est confirmé pour fonctionner jusqu’au firmware 11.00, avec des implémentations existantes disponibles pour les firmwares de 7.50 à 11.00 inclus.  Le firmware PS4 11.00 sera le premier à recevoir GoldHEN, après cela ce sera 10.x mais pas de date de disponibilité d'annoncée. (source SiStro).\n \nCertaines personnes sont bloquées sur un firmware donné et ne peuvent pas mettre à jour leur console en raison du problème “NoBD” : leur PS4 est considérée comme “NoBD” si le lecteur BluRay est manquant ou endommagé.\nGoldHEN est en train de progresser et est testé par quelques personnes de confiance. Michael Crump a partagé une vidéo montrant GoldHEN en cours d’exécution sur le firmware 11.00. \n \n \n\n \n \n \nIl est probable que cette nouvelle version soit proposée contre un café dans quelques jours. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190587/in-ps4-sistro-tease-goldhen-sur-le-firmware-1100-1.jpg"
        }
    },
    "news_19": {
        "title": "[WiiU] Aroma 19 disponible",
        "content": " \nAroma, développé par Maschell, est un environnement de hack pour la Wii U. Récemment, Maschell a mis à jour Aroma avec les versions 17 et 18, apportant des améliorations significatives pour les utilisateurs de Nintendo Wii U. \n \nAroma qui est l'environnement homebrew pour la Wii U, évolue une nouvelle fois avec de nouvelles options et corrections dans ses deux versions successives. \n \n \n\n \n \n \nVoici les détails sur ces mises à jour :\n \nAroma Beta 17 (6 mai 2024) :\n \n- Recompilation de presque tout avec les dernières versions de wut, devkitppc, wums/wups.\n- Refonte de l’EnvironmentLoader et du CustomRPXLoader pour initialiser le module WUMS plus tôt, permettant ainsi l’accès à tous les modules/plugins dans d’autres modules de configuration.\n- Ajout d’une option pour bloquer/débloquer les mises à jour depuis le sélecteur de démarrage ou l’écran d’avertissement de blocage de mise à jour.\n- Regroupement de l’installateur de chargeur de payload avec Aroma.\n- Possibilité d’utiliser l’application Health & Safety.\n- Amélioration des performances du pilote Cafe OS FAT32 pour les commandes readdir et stat.\n- Réécriture de l’API de configuration et de stockage (les plugins existants sont toujours compatibles).\n- Nouveau menu de configuration pour les plugins avec prise en charge des catégories imbriquées.\n- Notifications d’erreur lors de l’échec du chargement des plugins.\n- Détection automatique des configurations corrompues et suppression.\n- Amélioration de la détection des combinaisons de boutons dans le PayloadLoaderPayload.\n- Correction du lancement des paramètres de démarrage rapide depuis le menu de démarrage rapide.\n- Support initial pour le chargement d’applications homebrew depuis le menu de démarrage rapide1.\n \nAroma Beta 18 (07 mai 2024) :\n \n- Correction de chargement de Nanddumper via le PayloadLoaderPayload. \n- Les plugins dans le menu de configuration seront désormais triés par nom.\n \n \nTéléchargement : Aroma 18 Bêta\n \nEdit 09.05.2024 : version 19 disponible. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190585/in-wiiu-aroma-18-disponible-1.jpg"
        }
    },
    "news_20": {
        "title": "[PS4/PS5] PPPwn c++ en développement",
        "content": " \n \nPPPwn_cpp est un nouveau projet, il s’agit d’un réécriture en C++ de PPPwn. Malheureusement, il n’y a pas encore de versions publiées, mais vous pouvez suivre le développement sur GitHub. PPPwn est un exploit d’exécution de code à distance du noyau pour la PlayStation 4 jusqu’à la version 11.00 du firmware. Cependant, cette version C++ ne semble pas encore avoir de versions officielles publiées, uniquement des nightly.\n \n \n\n \n \n \n \nS'agissant de versions de développement pour le moment il n'est pas recommandé de l'utiliser au quotidien, il fait face à un taux d'échec bien trop important notamment sur les deux premières étapes du lancement de l'exploit, mais aussi à des problèmes liés à des vitesses d'exécution du C++ et du Python. Les utilisateurs Windows devront installer npcap. \n \nL'idée de ce projet est de pouvoir porté PPPwn sur de petits appareils comme des routeurs par exemple. \n \n \nTout est là : PPPwn_cpp\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190581/in-ps4ps5-pppwn-c-en-developpement-1.png"
        }
    }
}