{
    "news_1": {
        "title": "[PS4/PS5/Switch] Chiaki-ng v1.9.1 disponible",
        "content": " \nL'outil Chiaki-ng s'améliore en ce début novembre, la version 1.9.1 du client Remote Play\nOpen Source vient d'être publiée. \n \nAu programme, une amélioration de l'émulation tactile, le réveil automatique de la console, mais aussi de nombreuses corrections de bugs et d'optimisations, sachant que les patchs intégrés pour Linux, Windows et MacOS ont eux aussi été mis à jour. \n \n \n \n\n \n \n \nChangelog :\n \n- Ajout de l'émulation tactile du pavé numérique pour utiliser le pavé numérique pour les touches et les balayages de l'écran tactile, voir l'émulation tactile du pavé numérique\n- Réveille automatiquement la console découverte lorsque la connexion est demandée au lieu de demander à l'utilisateur de se réveiller en premier\n- Ajout de l'option --exit-app-on-stream-exit pour quitter chiaki-ngimmédiatement après la fermeture d'une session de streaming\n- Résoudre les problèmes d'enregistrement liés aux paramètres de diffusion en détectant automatiquement quand la diffusion doit être utilisée\n- Réinitialise les commandes de mouvement si nécessaire pour éviter de sauter vers la position lors de l'utilisation des commandes de mouvement pour viser dans les jeux qui activent les commandes de mouvement via une pression sur la gâchette comme Resident Evil 4 Remake\n- Correction d'un bug où la découverte upnp pouvait prendre trop de temps, provoquant l'échec de la connexion à distance via PSN\n- Informe les utilisateurs de la possibilité d'une connexion à distance via PSN car de nombreux utilisateurs ne connaissent toujours pas cette option\n- Ajout un mappage pour le bouton Partager sur les contrôleurs Xbox Series et Xbox One\n- Affiche le nom du profil actuel avec deux points après le nom de l'application comme nom d'affichage de l'application\n- Mettre à jour les mappages de contrôleurs pour qu'ils soient portables sur toutes les plates-formes (Linux, Mac/OS et Windows)\n- Ajout d'un nom de contrôleur pour le mappage de contrôleur pour les contrôleurs qui n'ont pas de nom configuré dans le mappage lui-même\n- Autorise la saisie du mappage du contrôleur et réinitialiser le mappage à l'aide du bouton Retour\n- Rendre les boîtes de dialogue du journal, les consoles enregistrées et les consoles cachées déroulantes avec un contrôleur\n- Augmente les délais d'attente de STUN à 5 secondes + ajoutez des délais d'attente pour Curl de 10 secondes\n- Rendre la boîte de dialogue de mappage de touches navigable avec le contrôleur\n- Désactive la copie zéro pour les cartes matérielles qui ne la prennent pas en charge\n- Augmente le temps d'attente pour que les haptiques DualSense de DualSense edge soient en ligne à 15 secondes\n- Ajoute un fût de brassage maison pour chiaki-ngMacOS\n- Correction d'une erreur provoquant un crash lorsque l'allocation d'étourdissement aléatoire était utilisée pour une connexion à distance via PSN\n- Résoudre un leak (fuite de mémoire) dans une connexion à distance via PSN\n \n \nTéléchargement : Chiaki-ng 1.9.1\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198566/in-ps4ps5switch-chiaki-ng-v191-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PS4] Apollo Save Tool 1.6.0 pour les joueurs PS2 sur PS4",
        "content": "Le développeur Damian Parrino, connu sous le pseudonyme de Bucanero, propose une nouvelle version de son application Apollo Save Tool qui est maintenant proposé en v1.6.0 pour la PS4. \n \nBucanero nous informe que cette version s'adresse surtout à ceux qui jouent à des titres PS2 sur PS4, il a en effet améliorer la gestion des cartes mémoires virtuelles (memcards) et des répertoires de sauvegardes directement sur la PS4 pour les jeux PS2. \n \nLe prochain support améliorera les jeux PS1, avec un support de cartes mémoires identiques, mais ce sera dans une autre version. Cette version 1.6.0 s'avère essentielle et très utile si vous jouez à des conversions PS2. \n \nLe développeur rajoute qu'avec les efforts de Bestpig, le support pour tous les firmwares sensibles de la PS4 a été ajouté, il fait référence aux firmwares 7.xx, 8.0x, 8.5x, 9.0x, 9.5x, 10.50 et 10.7x et il tient à remercier.  Nous nous joignons à ces remerciements. \n \n \n\n \n \nChangelog\n \nAjout :\n- Support du firmware 7.0x/8.0x/8.5x/9.0x/9.5x/10.50/10.7x (merci à @BestPig) à savoir que GoldHEN, PS4HEN ou ps4debug payload sont nécessaires \n- Gestion des images de cartes mémoire virtuelles PS2 (VMC)\n-> Supporte les images PS2 MemCard, ECC et non-ECC (.PS2, .VM2, .CARD, .VMC)\n-> Liste, importation, exportation et suppression des sauvegardes PS2 dans les images VMC\n-> Importation - Formats pris en charge : .PSU, .PSV, .XPS, .MAX, .CBS, .SPS\n-> Exportation - Formats pris en charge : .PSU, .PSV\n- Base de données en ligne : ajout d'une liste de sauvegardes PS2\n- Option de tri des sauvegardes par type (PS4/PS2/VMC)\n- Ajout d'une option de journal de débogage persistant dans les paramètres (activé/désactivé)\n \nDivers\n- Mise à jour du moteur de patch Apollo vers la version 1.1.0\n-> Amélioration de l'analyse du code\n-> Amélioration du code SW de type 3 (sous-type 3/7/B/F)\n-> Amélioration du code SW de type 4 (sous-type 4/5/6/C/D/E)\n-> Ajout de la commande de cryptage AES CBC (aes_cbc(key, iv))\n \n \n \nTéléchargement : Apollo Save Tool 1.6.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198565/in-ps4-apollo-save-tool-160-pour-les-joueurs-ps2-sur-ps4-1.png"
        }
    },
    "news_3": {
        "title": "[WiiU] Cemu 2.3 disponible",
        "content": "L'équipe en charge du développement de Cemu propose une nouvelle version de leur émulateur de Wii U, la version 2.3 vient d'être mis en ligne pour Windows 64 bit, MacOS, Ubuntu et Linux. \n \n \n\n \n \n \nChangelog :\n \n- Vulkan : Correction d'une condition de course où les données uniformes pouvaient être corrompues. Le plus souvent, cela causait des corruptions de polygones dans BotW ou XCX, mais en théorie, cela pouvait affecter tous les jeux.\n- Vulkan : Changements dans la façon dont l'affichage des images est géré pour réduire la latence d'entrée\n- Entrée : Correction d'un crash qui pouvait se produire lors de la fermeture de la boîte de dialogue d'ajout de contrôleur alors qu'une recherche de contrôleur était toujours active.\n- Amiibo : Correction d'un problème où les Amiibo n'étaient pas détectés dans Mario Kart 8\n- En ligne : La fonctionnalité SpotPass respecte désormais l'option proxy_server dans le fichier settings.xml.\n- Windows : En mode portable, les icônes de sauvegarde des raccourcis sont désormais stockées dans le répertoire Cemu au lieu de %appdata%.\n- Divers : Correction d'un crash qui pouvait se produire lorsque des paramètres de ligne de commande invalides étaient passés à Cemu\n \n \nTéléchargement : Cemu 2.3\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198488/in-wiiu-cemu-23-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] PS5 Jar Loader s'améliore sur 1.xx et 2.xx",
        "content": "Le développeur Hammer-83 vient d'améliorer son PS5 Jar Loader en implémentant désormais l'exploit Bypervisor.\n \nIl a ainsi rajouté de nombreuses options qui permettent de charger l'exploit sur les firmwares 1.xx et 2.xx. \n \nbyepervisor-1.0-SNAPSHOT.jar\nftpserver-1.0-SNAPSHOT.jar\nkerneldump-1.0-SNAPSHOT.jar\numtx2-1.0-SNAPSHOT.jar\n \n \n\n \n \nImplémentation de l'exploit byepervisor :\n \n- Ajout des correspondances pmap de FreeBSD et prise en charge de la randomisation de l'adresse dmap.\n- Ajout des mappages des structures proc et mtx.\n- Diverses améliorations de l'api des pointeurs. En particulier, s'il y a un défaut de mémoire lors de la lecture du noyau, une exception sera maintenant levée.\n- Ajout des mappages libkernel pour déclencher le mode repos.\n- Charge utile Byepervisor elle-même pour fw 1.xx et 2.xx.\n- Modification du dumper du noyau afin de décharger un segment de texte s'il est accessible.\n- Ajout des offsets pour tous les firmwares.\n \n \nTéléchargement : PS5 JAR Loader 2.1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198472/in-ps5-ps5-jar-loader-sameliore-sur-1xx-et-2xx-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] SaltyNX 1.0.0 disponible",
        "content": "Le développeur Masagrator accentue son travail sur la Nintendo Switch, et propose une nouvelle version de SaltyNX à l'origine proposée par shinyquagsire23.\n \nLancé il y a un peu plus de 4 ans, le plugin SaltyNX facilite la gestion du processus qui nous permet d'envoyer des commandes en arrière-plan pour éditer des fichiers et du code sous Nintendo Switch. \n \nAvec cette version 1.0.0, le développeur a réussi à implémenter le support des jeux 32 bit.\n \n \n \n\n \n \n \nChangelog : \n \n- Ajout de la prise en charge des jeux 32 bits (cela inclut NX-FPS et ReverseNX, cela exclut les plugins externes)\n- Correction d'un problème de débordement de la mémoire des patchs asm\n- Correction d'un bug dans le verrouillage des FPS ne fonctionnant pas correctement dans les jeux EGL et Vulkan\n- Merci à tous ceux qui ont aidé le développeur à tester cette version sur autant de jeux 32 bits que possible.\n \n \nTéléchargement : SaltyNX 1.0.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198470/in-switch-saltynx-100-disponible-1.jpg"
        }
    },
    "news_6": {
        "title": "[PS3] rpcs3 v0.0.34 Alpha disponible",
        "content": "Le développement de rpcs3 continue, et une toute nouvelle version vient d'être dévoilée par leurs développeurs, notamment AniLeo qui a mis en ligne sur Github la v0.0.34 Alpha. \n \nLe changelog énorme se trouve ici : changelog 0.0.34\n \n \n\n \n \nTéléchargement : rpcs3 v0.0.34 Alpha\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198468/in-ps4-rpcs3-v0034-alpha-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[PS4] shadPS4 v0.4.0 disponible",
        "content": "Une mise à jour a été publiée par l'équipe en charge de shadPS4, l'émulateur PS4 pour PC Windos, MacOS et Linux introduit plusieurs changements importants comme des correctifs sur le recompilateur de shaders, ou encore la prise en charge émulée des processeurs qui n'ont pas d'instructions SSE4.2a, des CPU anciens. \n \nLe système de synchronisation d'images de précision à 60 ips a été implémenté, l'image est plus précise, plus détaillée, et la gestion des données a été améliorée. \n \nCette version dispose d'un nom de code \"Divicius\".\n \n\n \n \n \nTéléchargement : shadPS4 v0.4.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198467/in-ps4-shadps4-v040-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[PS4/PS5] PKG tool Box 1.3.0 disponible",
        "content": "Le développeur Seregonwar propose une mise à jour de son outil PKG Tool Box en version 1.3.0. Il a encore amélioré son outil, même si tout n'est pas encore parfait comme nous allons le voir. \n \nLes packages retail PS3 sont désormais entièrement pris en charge, ainsi que ceux de la PSP, il a pour ambition d'ajouter la possibilité de compiler n'importe quel projet en pkg (vous aurez toujours besoin d'OpenOrbis/SDK d'origine).\n \n \n\n \n\n \n \n \nChangelog :\n \n- Prise en charge des packages PS3 et PSP\nVous pouvez désormais gérer les packages de vente au détail et de débogage pour PS3 et PSP, élargissant ainsi les options de compatibilité et de développement.\n \n- Prise en charge multilingue\nL'application prend désormais en charge 6 langues différentes pour une expérience utilisateur globale et étendue.\n \n- Personnalisation avancée de l'interface utilisateur\nL'interface utilisateur est désormais entièrement personnalisable ! Choisissez les couleurs d'arrière-plan, les couleurs de texte et bien plus encore pour correspondre à votre style. Ce n'est pas essentiel, mais pour les perfectionnistes comme moi, l'attention portée aux détails de conception est importante. \n \n- Fonctionnalité glisser-déposer\nLa nouvelle fonctionnalité glisser-déposer simplifie les importations de packages, vous permettant d'éviter la sélection manuelle du répertoire : faites simplement glisser votre fichier directement sur l'interface, et le tour est joué !\n \n- Interface graphique entièrement réécrite\nL'interface graphique a été entièrement réécrite dans cette version pour améliorer la convivialité et la conception. Elle est désormais plus intuitive et moderne, prête à prendre en charge les fonctionnalités à venir.\n \n \nLe développeur depuis la sortie de la version 1.3.0 a découvert que l'interface graphique a malheureusement quelques problèmes, cependant, cela n'affecte pas le fonctionnement du programme, il y aura une version 1.4.0 qui apportera quelques corrections. \n \n \nTéléchargement : PKG tool Box 1.3.0  (1.5.3 en dev build)\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198198/in-ps4ps5-pkg-tool-box-130-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1198198/in-ps4ps5-pkg-tool-box-130-disponible-2.png"
        }
    },
    "news_9": {
        "title": "[Switch] Les développeurs du fork de Citra et de Lime3DS vont travailler un projet commun",
        "content": "Dans le changelog de la dernière version de Lime3DS, il y a une sorte de communiqué, son développeur annonce que l'abandon du projet du fork de Citra par PabloMK7 au profit d'une nouvelle aventure.\n \nEt bien sachez que l'équipe Lime3DS est heureuse d'annonce que ce nouveau projet ne sera pas une entreprise solo, car ce nouveau fork Citra est un effort collaboratif entre Lime3DS et le fork de PabloMK7 pour créer un nouveau projet unifié. Le développement ne sera plus fragmenté entre ces forks, et à la place, tous les progrès seront réalisés dans un seul effort coordonné.\n \nEn conséquence, le développement de Lime3DS sera également interrompu et le temps de développement après la sortie de la mise à jour 2119 sera consacré à la mise en route de ce nouveau projet.\n \n \n\n \nÀ sa sortie, le nouvel émulateur contiendra des fonctionnalités des deux forks, de sorte que les efforts de développement antérieurs ne seront pas perdus lors de la transition.\n \nBref, vous l'aurez compris, il y a une unification des deux projets en cours, afin de proposer une seule version de l'émulateur 3DS beaucoup plus forte. \n \nLa dernière version de Lime3DS 2119 sera probablement la dernière sous ce nom, et elle apporte beaucoup d'évolutions. \n \n \n \n \n \nChangelog \n \nTous:\n- Ajout d'une fonctionnalité « Position petit écran » qui peut être utilisée avec la disposition grand écran |@DavidRGriswold~ #373\n \nDesktop : \n- Les entrées diagonales pour le circlepad et le c-stick peuvent désormais être liées à partir du menu Contrôles |@kleidis~ #404\n- Ajout de nouvelles options de ligne de commande pour l' lime3dsexécutable qui reflètent celles qui étaient disponibles avec l' -cliexécutable |@OpenSauce04~ #481\n- Vous pouvez afficher ces nouvelles options en exécutantlime3ds --help\n- Correction des étiquettes dans le menu déroulant du filtre de texture qui ne correspondaient pas |@rtiangha~ #454\n- Correction d'un problème où Vulkan pouvait ne pas être disponible lors de l'utilisation de Linux AppImage dans une session Wayland |@OpenSauce04~ #504\n \nAndroid:\n- Des raccourcis sur l'écran d'accueil peuvent désormais être créés pour les jeux à l'aide du menu à appui long |@kleidis~ #313\n- Ajout d'un paramètre d'orientation d'écran fixe disponible dans la section Disposition |@kleidis~ #420\n- Mise à jour de l'en-tête des sections Axe et Bouton du pavé directionnel pour rendre leur objectif plus clair |@DavidRGriswold~ #464\n \nTechnique:\n- Correction de la version minimale d'OpenGL définie par erreur en interne comme OpenGL 3.1 alors qu'il s'agit en réalité d'OpenGL 3.2 |@rtiangha~ #477\n- Problèmes résolus lors de la tentative de création de Lime3DS avec Qt 6.8 ou version ultérieure |@rtiangha~ #441\n- Le frontend SDL2, qui avait été précédemment supprimé dans la mise à jour 2118, a été réintroduit sous la forme d'une option de ligne de commande, mais il est actuellement désactivé par défaut au moment de la compilation |@OpenSauce04~ #508\n- Cette fonction est désactivée en raison de l'état extrêmement instable dans lequel elle a été laissée lorsque Citra a été abandonnée.\n- Il restera désactivé jusqu'à ce que ces problèmes soient résolus\n- Si vous savez ce que vous faites, vous pouvez l'activer en utilisant l' ENABLE_SDL2_FRONTENDoption cmake au moment de la compilation\n- L'option de ligne de commande pour accéder au frontend SDL2 est --no-gui ou -n en abrégé\n \n \nTout est là : Lime3DS 2119\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198195/in-switch-les-developpeurs-du-fork-de-citra-et-de-lime3ds-vont-travailler-un-projet-commun-1.png"
        }
    },
    "news_10": {
        "title": "[PS5] ftpsrv v0.11 disponible",
        "content": "Le développeur John Tornblom est de retour avec une nouvelle version de son payload ftpsrv, il n'est là pas question d'évolution par rapport à l'exploit UMTX, c'est seulement une version permettant l'ajout de nouvelles options.\n \n \n\n \n \n \nChangelog 0.11 : \n \n- Fournir une notification d'interface graphique lors du premier lancement\n- Augmenter les autorisations afin que nous puissions accéder à certains périphériques de caractères, par exemple /dev/sflash0\n- RETR : permet la récupération de tout type de fichier, par exemple, des périphériques de caractères\n \n \n \nTéléchargement :  ftpsrv v0.11\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198192/in-ps5-ftpsrv-v011-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[Switch] Du code personnalisé dans le réveil musical Alarmo",
        "content": "Le développeur GaryOderNichts vient de prouver via une preuve de concept (un poc) qu'il est possible d'injecter et de faire tourner du code personnalisé dans le nouveau réveil musical Alarmo de Nintendo. \n \nMême si en soit cela n'a rien d'extraordinaire, il est tout de même intéressant de savoir qu'il est très facile de jailbreaker l'appareil, il est équipé d'un microcontrôleur STM32, la même puce que celle déjà présente dans la Game & Watch Zelda Edition. \n \n \n \n\n \n \nAprès avoir découvert la chose, et souder quelques fils aux broches de débogage, il a été facile d'enregistrer quelques registres, et d'injecter la mémoire à l'aide du programme \"OpenOCD\". \n \n \n \n\n \n \n \n \nLa limitation cependant réside dans le fait que le STM32 est protégé en lecture, ce qui signifie que la mémoire flash interne ne peut pas être lue pour l'examiner plus en détail.\n \nLe développeur a créé un blog ici : Looking-into-nintendo-alarmo\n \n \n\n \n \nEt l'ensemble de son travail est répertorié ici : GaryOderNichts/alarmo\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198155/in-switch-du-code-personnalise-dans-le-reveil-musical-alarmo-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1198155/in-switch-du-code-personnalise-dans-le-reveil-musical-alarmo-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1198155/in-switch-du-code-personnalise-dans-le-reveil-musical-alarmo-2.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] Les vagues de ban commence sur le MigSwitch/MigFlash",
        "content": "Nintendo a sorti sont nouveau firmware 19.0.1 dans la nuit du 28 au 29 octobre et semble en vouloir plus que jamais au hacker qui ne respecte pas l'usage classique d'une Nintendo Switch.\nPour rappel, en fin d'année dernière, l'annonce fracassante d'un nouvelle acteur dans la scène switch a été faite. Ainsi, le premier linker a destination de la Nintendo Switch a vue le jour, le MigSwitch, développé désormais par la Team MigFlash, suite à des problèmes juridique.\nIl va s'en dire que ce linker allais forcément être utilisé de plusieurs manière, plus ou moins légal, et c'est dans un cadre légal qu'un internaute de discord y a été confronté, et il n'est pas le seul, ayant moi même eu une console bannis suite à l'usage légal d'un MigSwitch/MigFlash. \n \n\n \n\nEn effet, la console de cette utilisateur a été bannis des services en ligne de Nintendo pendant la mise à jour d'un jeu, jeu dumper de manière légal d'une de ces propres cartouche, et console pourtant toujours mise en \"mode avion\".\nLa Nintendo Switch enregistre tout un tas de logs, notamment un compteur de retrais de la cartouche, et ce n'est qu'une des nombreuses possibilités de détecter l'usage d'un MigSwitch/MigFlash et ce même avec un bouton.\nIl semblerais que Nintendo n'est pas choisis de super ban les consoles utilisant le MigSwitch/MigFlash, les autorisant donc à continuer les mises à jour firmware.\nCette news est avant tout là à titre de prévention, certain peuvent préférer l'usage d'un linker par simplicité ce qui est compréhensible. L'objectif et simplement d'avertir que le MigSwitch/MigFlash même dans un usage plus ou moins légal grâce au dump de cartouche réel peut entrainer un bannissement des services online de Nintendo.\n",
        "images": {
            "image_1": "https://i.ibb.co/WcZVtdK/image.png",
            "image_2": "https://i.ibb.co/pR5CXzW/image-1.png"
        }
    },
    "news_13": {
        "title": "[Switch] Les vagues de ban commence sur le mig switch",
        "content": "Nintendo a sorti sont nouveau firmware 19.0.1 dans la nuit du 28 au 29 octobre et semble en vouloir plus que jamais au hacker qui ne respecte pas l'usage classique d'une Nintendo Switch\nPour rappel, en fin d'année dernière, l'annonce fracassante d'un nouvelle acteur dans la scène switch a été faite\nAinsi, le premier linker a destination de la Nintendo Switch a vue le jour, le Mig Switch, développé désormais par la Team MigFlash suite a des problèmes juridique.\nIl en a s'en dire que ce linker allais forcément être utilisé de plusieurs manière, plus ou moins légal, et c'est dans un cadre légal qu'un internaute de discord a été confronté, il n'est pas le seul, ayant moi même eu une console bannis suite a l'usage légal d'un Mig Switch.\nEn effet, la console de cette utilisateur a été bannis des services en ligne de Nintendo pendant la mise à jour d'un jeu, jeu dumper de manière légal par une de c'est propres cartouche, et console pourtant bien toujours mise en mode avion.\nLa Nintendo Switch enregistre tout un tas de logs, notamment un compteur de retrais de la cartouche, ce n'est qu'une des nombreuses possibilités de détecter l'usage d'un Mig Switch et ce même avec un bouton.\nIl semblerais que Nintendo n'est pas choisis de super ban les consoles utilisant le Mig Switch, les autorisant donc a continué les mises à jour firmware.\nCette news est avant tout la a titre de prévention, certain peuvent préféré l'usage d'un linker par simplicité ce qui est compréhensible, l'objectif et simplement d'avertir que le Mig même dans un usage plus ou moins légal grâce au dump de cartouche réel\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198083/in-switch-les-vagues-de-ban-commence-sur-le-mig-switch-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1198083/in-switch-les-vagues-de-ban-commence-sur-le-mig-switch-2.png"
        }
    },
    "news_14": {
        "title": "[PS4] PPPwnUI 3.32 d'Aldostools disponible",
        "content": "\nLe développeur Aldostools (Aldo Vargas) dévoile une nouvelle version de PPPwnUI modded qui passe en 3.32 qui intègre maintenant la dernière version du payload GoldHEN 2.4b18 de SiSTR0 et donc fort logiquement le support des firmwares 10.50, 10.51 et 10.70 qui vient avec cette nouvelle version .\n \n \n \n \n\n \n \n \nTéléchargement : PPPwnUI 3.32 moddée par Aldostools\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-635340006.png"
        }
    },
    "news_15": {
        "title": "[PS5] Byepervisor supporte désormais le firmware 2.70",
        "content": "Le développeur Echo Stretch continue de faire progresser le support de Byepervisor qui pour rappel est simplement destiné au firmware 2.50 à l'origine. \n \nVoilà désormais qu'il a réussi à monter, c'est à dire à apporter le support d'un firmware plus récent que celui proposé à la base, à savoir que le firmware 2.70 est désormais supporté. \n \nBien entendu, nous sommes encore loin de pouvoir l'utiliser sur un firmware plus récent comme les 3.xx ou 4.xx, ou encore les 7.xx, mais il fait progresser le support en souhaitant se concentrer également sur d'autres firmwares plus anciens. \n \n \n\n \n \nIl cherche maintenant à ouvrir les offsets des firmwares 1.05, 1.10, 1.11 et 1.13 pour lesquels il demande qu'on les lui fasse parvenir. \n \nLa liste des firmwares supportés : 1.12, 1.14, 2.00, 2.20, 2.25, 2.26, 2.30, 2.50, 2.70\n \n \nTout est là : EchoStretch/Byepervisor\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-974163764.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] Nintendo sort l'inoffensif firmware 19.0.1",
        "content": " \nNintendo vient tout juste de sortir le firmware 19.0.1 pour les Nintendo Switch et Nintendo Switch Lite, mais il est déjà considéré comme inoffensif, c'est à dire qu'il ne change ni les clés, ni la structure interne des protections mise en place par le géant japonais pour contre les hacks de ses consoles. \n \nAinsi SciresM a déjà confirmé que la version d'Atmosphere 1.8.0 Pre-release est pleinement fonctionnelle sur le 19.0.1, du moins à première vue précise-t-il.\n \n \n\n \n \n \nAu chapitre des mêmes nouvelles, Vampitech, le développeur de NeXT confirme lui aussi que le firmware 19.0.1 n'affecte en rien le fonctionnement de sa solution, ce qui signifie là aussi que les changements de ce firmware doivent être assez légers. \n \nNintendo n'a livré aucun changelog avec ce firmware 19.0.1 qui arrive seulement quelques jours après la disponibilité le 07 octobre 2024 du firmware 19.0.0.\n \nLes rapports de Yellow's 8 se trouvent ici : yls8.mtheall.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197921/in-switch-nintendo-sort-linoffensif-firmware-1901-1.png"
        }
    },
    "news_17": {
        "title": "[PS5] L'exploit Byepervisor est en progression : offsets, compensations shellcore et dumps",
        "content": "Le développeur EchoStretch a réalisé un travail important sur Byepervisor, depuis quelques jours il travaille énormément dessus, il a commencé par vouloir apporter des compensations Shellcore, il a tout d'abord encouragé les détenteurs de consoles sous firmwares 1.12, 1.14, 2.00, 2.20, 2.25, 2.26 et 2.30 a tester certains de ces fichiers. \n \nSes modifications permettent d'exécuter la chaîne ROP sur les divers firmwares, le HEN d'origine étant dédié au firmware 2.50.\n \nMais EchoStretch a ajouté de nombreux offsets et il continue de le faire pour tenter d'apporter le HEN sur l'ensemble des firmwares inférieurs au 3.00, y compris le 2.70, il vient tout juste de mettre ceux du firmware 1.05, il a d'ailleur besoin de testeur sur 1.10, 1.11 et 1.13 pour avancer.  \n \n \n \n\n \n \n \nIl y a quelques heures cette nuit, il a dévoilé un screen montrant le dump en cours de ce qui serait le kernel de la PS5, cela reste à confirmer car seul le screen a été montré. Impressionnant !\n \n \nTout est là : EchoStretch/Byepervisor\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197878/in-ps5-lexploit-byepervisor-est-en-progression-offsets-compensations-shellcore-et-dumps-1.png"
        }
    },
    "news_18": {
        "title": "[Switch/PS4] Switchfin v0.5.3 disponible",
        "content": "Le développeur dragonflylee propose une nouvelle version de Swithfin, l'interface tierce dédiée à Jellyfin à destination de la Switch, des PC et de la PS4.  Si vous ne connaissez pas Jellyfin, il s'agit d'un serveur de contenus, un serveur multimédia open source et gratuit, offrant la possibilité de naviguer et lire les flux multimédia de toutes natures :\n \n- conteneurs : mkv, mov, mp4, avi\n- codecs vidéo : H.264, H.265, VP8, VP9, AV1\n- codecs audio : Opus, FLAC, MP3, AAC, AC-3, E-AC-3, TrueHD, DTS, DTS-HD\n- sous-titres : SRT, VTT, SSA/ASS, DVDSUB\n \n \n\n \n \nChangelog :\n \nAjout :\n- sauvegarder l'état de Windows lors de la sortie\n- supporter la saisie tactile sous linux (@xfangfang)\n- support du collage de texte pour la recherche (@xfangfang)\n- nouvelle option de mauvaise qualité\n- nouvelle option sous-titre de secours \n- support personnalisé de l'agent utilisateur dans le navigateur webdav\n- prise en charge du serveur http apache/nginx/rclone à distance (pour une télécommande)\n \nCorrection : \n- support du chargement de polices emoji personnalisées\n- onglet vide en cas d'échec de la recherche\n \n \nTéléchargement : Switchfin 0.5.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197877/in-switchps4-switchfin-v053-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] GoldHEN v2.4b18 de SiSTR0 disponible",
        "content": "Le développeur SiSTR0 vient de dévoiler une nouvelle version de son payload GoldHEN qui est désormais proposé en version v2.4b18 depuis quelques minutes. \n \nSelon ses mots il s'agit d'un version bêta, il affirme avoir très peu de temps libre mais il continue à travailler sur GoldHEN pour l'améliorer et ajouter de nouvelles fonctionnalités utiles à tous. \n\n \nCette nouvelle version supporte à la fois les anciens exploits WebKit et le nouveau pppwn, mais pour cela il faut un stage2 personnalisé, qu'il dévoile avec cette version. \n \n \nChangelog v2.4b18 :\n \n- Ajout du Cheat Downloader (Merci à ctn)\n- Ajout de la prise en charge des versions 10.50, 10.70 et 10.71\n- Amélioration de la prise en charge du mode repos\n- Correction de la sauvegarde de la configuration des serveurs réseau\n- Déplacement du serveur Klog vers le userland (meilleure prise en charge des déconnexions réseau)\n \nFirmwares supportés : \n \n5.05\n6.71 / 6.72\n9.00\n9.60\n10.00 / 10.01\n10.50\n10.70 / 10.71\n11.00\n \n \nIl tient au passage à remercier certaines personnes importantes : \n \n- TheFlow pour avoir publié son exploit (et pas seulement celui-ci) pour tout le monde.\n- flat_z pour avoir conçu et publié le HEN pour ps4 avec un writeup.\n- vortex pour avoir implémenté les premières versions du HEN.\n- golden pour avoir créé des projets qui m'ont aidé à comprendre beaucoup de choses.\n- OSM pour sa boîte à outils Orbis (Orbis Toolbox)\n- Hippie68 pour son travail sur le nouveau serveur FTP.\n- Al_Azif pour avoir fourni diverses ressources nécessaires.\n- SocraticBliss pour ses scripts RE.\n- Illusion pour ses patchs de jeux et plus encore.\n- bucanero pour son travail sur le gestionnaire de cheats.\n- Tous les développeurs de cheats qui ont partagé leurs travaux avec tout le monde.\n \nMerci aux testeurs qui ont eu beaucoup de patience :\n \n- Big_Wadger\n- EchoStretch\n- Opoisso893\n- mbcrumb\n- MODDED WARFARE\n- vapour\n \nEnfin, ses amis ctn et Kameleon pour leur soutien continu, pas seulement technique, et également à tous ceux qui ont soutenu mon projet sur Kofi.\n \n \nTout est là : GoldHEN v2.4b18\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-109866506.png"
        }
    },
    "news_20": {
        "title": "[PS5] PS5 Payload SDK 0.20 disponible",
        "content": "Le développeur John Tornblom dévoile une nouvelle mouture de son PS5 Payload SDK qui est désormais affublé de la numérotation 0.19. \n \nComme vous le savez, ce SDK a pour ambition de faciliter le portage et le développement de payloads qui pourront s'exécuter sur les consoles bénéficiant du loader ISO BD-JB ELF, mais aussi sur celles utilisant l'exploit \"ipv6 uaf\" basé sur le webkit.\n \n \n \n\n \n \n \nChangelog : \n \nC++ : déclare les symboles C dans l'espace de noms extern « C ».\nWindows : ajout de la commande prospero-deploy qui envoie des payloads à un loader elf\nWwindows : ajout de la commande prospero-cmake qui définit les valeurs par défaut avant d'appeler cmake\nindows : ajout des commandes prospero-clang et prospero-clang++ pour invoquer les compilateurs\nWindows : ajout de commandes prospero-lld qui est nécessaire pour les compilateurs qui compilent et lient dans la même commande\nKernel : ajout de la constante KERNEL_ADDRESS_TEXT_BASE pour contenir l'adresse de la base .text\nKernel : ajout de fonctions pratiques pour accéder à la mémoire arbitraire\nmeson : s'assurer que les payloads ne sont pas exécutées sur le système hôte lors de la configuration des projets\nmdbg : ajout de fonctions pratiques\n \n \nEdit 29.10.24\n \nTéléchargement : PS5 Payload SDK 0.20\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197860/in-ps5-ps5-payload-sdk-019-disponible-1.jpg"
        }
    }
}