{
    "news_1": {
        "title": "[WiiU] Minutes v1.2 disponible",
        "content": "Un peu plus de trois semaines après la v1.1, voilà que débarque la version 1.2 de Minutes, l'outil qui permet de remplacer le boot1 de la Nintendo Wii U, un peu comparable à BootMii. \n \nLe développement de Minute a été initié par dazjo, puis repris par StroopwafelCFW, est désormais entre les mains de Jan Hofmeier qui s'efforce de le soutenir pour corriger quelques bugs. \n \n \n\n \n \n \nChangelog v1.2 : \n \n- correction des incohérences sur l'écran lors du démarrage rapide\n- correcton du mode éco\n \nTéléchargement : Minutes v1.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203795/in-wiiu-minutes-v12-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PS3] RPCN 1.4.2 disponible pour RPCS3",
        "content": "L'émulateur PSN portant le nom de RPCN évolue une nouvelle fois avec la version 1.4.2 qui comme vous le savez se destine à l'émulateur PS3 RPCS3. \n \nRPCN est un serveur personnalisé conçu pour émuler les services en ligne du PlayStation Network (PSN) sur la PS3. RPCN vise à recréer l'infrastructure multijoueur, permettant aux utilisateurs de jouer en ligne, d'accéder au matchmaking personnalisé et même d'héberger des communautés privées.\n \nDepuis quelques jours son développeur principal, RipleyTom, propose des évolutions intéressantes de RPCN qui est successivement passé de la version 1.4.0 à 1.4.2.\n \n \n\n \n \nChangelog 1.4.1 : \n- Utiliser la configuration originale pour hasher les nouveaux comptes\n \nChangelog 1.4.2 : \n- Correction Notification à la cible de RequestSignalingInfos envoyant des informations IP erronées\n- CookiePLMonster : Correction de l'ordre du tableau d'affichage pour Super Hang-On\n- Mise à jour des dépendances\n \nUne liste de compatibilité est accessible ici : wiki.rpcs3.net\n \n \nTéléchargement : RPCN 1.4.2\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203794/in-ps3-rpcn-142-disponible-pour-rpcs3-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS5] PS5 Homebrew v1.5 et AirPSX pkg v1.0 de Master-s",
        "content": "Le développeur Master-s semble s'intéresser fortement au tout nouveau payload AirPSX, il faut dire que ce payload amène le support d'etaHEN et des jeux PS4 ! \n \n \n\n \n \nPour fêter cela il a proposé la version 1.5 de PS5 Homebrew qui intègre désormais airpsx.elf même s'il s'agit déjà d'une version obsolète puisqu'il s'agit de la v1.0.\n \n \n \n\n \n \n \nTéléchargement : PS5 Homebrew v1.5\n \n \nAutre proposition de Master-s, la disponibilité de la version PKG de PS5 AirPSX, dans cette première version, cela permet d'accéder aux informations de la PS5, mais s'il intègre la dernière version les possibilités vont être beaucoup plus large. \n \n \nTéléchargement : AirPSX pkg 1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203773/in-ps5-ps5-homebrew-v15-et-airpsx-pkg-v10-de-master-s-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] AirPSX 0.0.4 disponible avec le support de etaHEN et des jeux PS4",
        "content": "AirPSX, un payload conçu pour la PlayStation 5 (PS5) qui permet de gérer diverses opérations de la console via une interface web, passe en version 0.0.4. Ce projet est similaire à AirDroid, mais adapté pour la PS5 via une interface web, offrant des fonctionnalités comme la gestion des fichiers, l’exécution de scripts, et bien plus encore.\n \nLe développeur précise qu’il n’est pas responsable des dommages causés à la console ou de l’utilisation abusive de l’outil. AirPSX est construit avec le framework web hxwell, le code source est écrit en Haxe, qui est transpilé en C++ et compilé à l’aide du PS5 Payload SDK.\n \nCela évolue très vite, etaHEN est supporté comme désormais le lancement de jeux PS4 sur la v0.0.4 qui vient de sortir !\n \n \n\n \n \n \nComment utiliser AirPSX\n \nAvec elfldr :\n \n1.Exécutez la charge utile elfldr.\n \n2.Utilisez la commande suivante sous Linux :\n \nbash\n \nsocat -t 99999999 - TCP:PS5_HOST:9021 < \"airpsx.elf\"\n \nAvec etaHEN :\n \n1.Exécutez la charge utile etaHEN.\n \n2.Connectez-vous via FTP (ports courants : 1337, 2121).\n \n3.Placez le fichier airpsx.plugin dans le dossier /data/etaHEN/plugins.\n \n4.Activez le plugin via Debug Settings -> etaHEN Toolbox -> Plugins.\n \n5.Optionnellement, vous pouvez activer airpsx.plugin pour qu’il démarre automatiquement au démarrage de la console.\n \nAvec websrv :\n \nCette méthode est déconseillée, car AirPSX se ferme dès que le navigateur est fermé.\n \n \n \n \nTéléchargement : AirPSX 0.0.4\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203771/in-ps5-airpsx-004-disponible-avec-le-support-de-etahen-et-des-jeux-ps4-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] MigUpdater et firmware 1.1.7 pour le MigFlash",
        "content": "L'équipe en charge du MigFlash propose une nouvelle version du firmware de leur linker permettant de copier et lancer les jeux dont vous disposez, MigFlash propose en effet la version 1.1.7 du firmware, qui apporte une correction d'un problème empêchant la mise à jour de Mig Dumper pour les utilisateurs Mac et Linux.\n \nDe plus, l'équipe a ajouté une fonctionnalité permettant d'afficher la version du firmware sous forme de fichier (1.1.7) dans le dossier racine de la GameCard. Cela facilite la vérification de la version du firmware en cours d'exécution.\n \n \n \n\n \n \n \n \nEnfin, la team propose un nouvel outil, MigUpdater, il s'agit d'une application de bureau compatible avec Windows, Mac et Linux qui permet de vérifier et mettre à jour le firmware de Mig Dumper.\n \nCet outil est conçu comme une méthode de secours si la méthode traditionnelle de glisser-déposer ne fonctionne pas. Ce MigUpdater est disponible dans la section téléchargement du site officiel. \n \nTéléchargement : MigUpdater et firmware 1.1.7\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203764/in-switch-migupdater-et-firmware-117-pour-le-migflash-1.png"
        }
    },
    "news_6": {
        "title": "[Switch] JoyShockMapper disponible en v3.6.1",
        "content": "JoyShockMapper permet d'améliorer l'expérience utilisateur avec notamment la visée gyroscopique ou le flick stick, permettant ainsi de profiter des trois axes de ces contrôleurs Nintendo, ce que ne permettent pas les contrôleurs Xbox par exemple. JoyShockMapper convertit les entrées de contrôleur de jeu courantes en événements de clavier, de souris et de contrôleur virtuel afin que vous puissiez jouer à des jeux PC avec ces contrôleurs. Utilisez les commandes gyroscopiques et le stick analogique pour jouer à des jeux avec plus de précision que n'importe quelle autre console.\n \n \n\n \n \nL'alternative à DS4Windows qui n'est plus supporté passe en version v3.6.1 :\n \nDans cette mise à jour, le développeur a réparé ce qu'il avait cassé en insistant sur les bugs et les crashs : \n \n- Corrections de bugs\n- Correction d'un crash lors d'une pression simultanée\n- Correction d'un crash sur une action de commande\n- Améliorer la gestion du chevauchement des pressions simulées et des pressions diagnostiques\n- Correction du mode stick SCROLL_WHEEL\n \n \nTéléchargement : JoyShockMapper v3.6.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203763/in-switch-joyshockmapper-disponible-en-v361-1.jpg"
        }
    },
    "news_7": {
        "title": "[3DS] 3DSident v0.9.3 disponible",
        "content": "Le développeur Joel16 propose une nouvelle version de 3DSident, 3DSident, un peu comme un CPU-Z ou un GPU-Z sur PC, le logiciel va vous permettre d'obtenir facilement des informations critiques comme le modèle, la langue, le firmware installé avec la version du Kernel, l'adresse MAC , le statut de la batterie, et le programme évolue encore plus avec l'arrivée de cette version.\n \nDans cette nouvelle version 0.9.3 le développeur a apporté pas mal de corrections liés au NNID. \n \n \n\n \n \n \nChangelog :\n \nCorrection des informations NNID affichant de manière incorrecte les informations suivantes :\n- ID persistante\n- Base d'identification transférable\n- ID principal\nLes informations NNID affichent désormais les informations suivantes :\n- ID de compte\n- Statut du compte (si le compte du serveur a été supprimé ou est actif)\n- Pays lié au compte NNID\n \n \n \nTéléchargement : 3DSident v0.9.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203762/in-3ds-3dsident-v093-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[PS3] L'équipe RPCS3 demande le retrait d'aPS3e pour violation de licence",
        "content": "On ne rigole pas avec les licences, l\"équipe en charge du développement de RPCS3 impose le respect des licences en demandant le retrait du dépôt GitHub de l'émulateur PS3 pour Android, aPS3e, en invoquant une violation de la licence GPLv2. \n \nLe développeur d'aPS3e, connu sous le nom d'Aenu, avait refusé de publier le code source complet de son émulateur, malgré l'utilisation du code de RPCS3, un émulateur open-source pour PC. De plus, Aenu avait placé le code source derrière un paywall, demandant 2000 USD pour le rendre accessible. \n \n \n\n \n \n \nCette situation a conduit l'équipe RPCS3 à déposer une plainte DMCA, soulignant que la licence GPLv2 exige que tout fork soit également publié en open-source. Cette action a entraîné la suppression du dépôt GitHub d'aPS3e, rendant le projet actuellement inaccessible. \n \nC'est dommage d'en arriver là, le projet aPS3e peut être un bon portage de RPCS3 sur Android, mais pour cela il faut respecter les règles. \n \nSource : \n \nhttps://www.androidauthority.com/aps3e-ps3-emulator-3526869/\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-392587576.jpg"
        }
    },
    "news_9": {
        "title": "[PS4/PS5] Une faille rapportée et une faille dévoilée",
        "content": "Point commun ou pas, difficile à dire, mais il semblerait que TheFlow est corrigé une faille précédemment rapportée sur Hackerone.com. \n \nUne vulnérabilité a vu son statut modifier de \"prime attribuée\" à \"corrigée\" il y a quelques jours. Tout cela laisse entendre que Sony a corrigé la faille et proposera bientôt un firmware qui intégrera la correction. \n \nTout est là : https://hackerone.com/playstation/hacktivity?type=team\n \nHasard du calendrier, ou peut être pas, une faille FreeBSD vient d'être dévoilée, une preuve de concept PS5 et PS4 vient d'être publiée.\n \n \n\n \n \n \nLa CVE-2022-23088 est une vulnérabilité critique de type heap overflow (débordement de tas) dans la pile Wi-Fi de FreeBSD. Elle permet à un attaquant d'exécuter du code arbitraire en envoyant des trames Wi-Fi spécialement conçues. Cette vulnérabilité affecte FreeBSD 13.0 et les versions ultérieures. Un attaquant à proximité pourrait exploiter cette vulnérabilité pour prendre le contrôle d'un système vulnérable via une attaque sans fil.\n \nDescription : \n \nexploit.py : Le script principal pour l'exploitation.\nshellcode.bin : Un shellcode injecté en mémoire pour démontrer l'exécution de code.\nx86.py : Des fonctions utilitaires pour calculer les adresses mémoire.\n \nPrérequis pour l'exploitation : \n- Une carte Wi-Fi prenant en charge le mode Monitor Mode.\n- Un environnement Linux pour exécuter l'exploit.\n \nLors de l'exécution, l'exploit passe par plusieurs phases :\nPhase 1 : Écriture de la première page en mémoire.\nPhase 2 : Écriture de la couche réseau (L3).\nPhase 3 : Patch du noyau pour exploiter la vulnérabilité.\nPhase 4 : Réparation des dommages causés par l'exploitation.\nPhase 5 : Fin de l'exploitation avec succès.\n \n \nTout est là : https://github.com/Dark-life944/PoC-PS5-PS4\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203755/in-ps4ps5-une-faille-rapportee-et-une-faille-devoilee-1.png"
        }
    },
    "news_10": {
        "title": "[PS5] Un nouveau firmware pour améliorer les activités et les émojis",
        "content": "Sony vient de déployer un tout nouveau firmware bêta à destination de la PS5, l'occasion une nouvelle fois d'améliorer les activités et de proposer de nouveaux émojis comme le rapporte le site videogameschronicle.com.  \n \nS'agissant d'une version bêta elle n'est accessible qu'à ceux qui ont reçus un code par email pour y participer, les améliorations concernent la vue d'activité, la prise en charge de nouveaux émojis Unicode 16.0 et des modifications du contrôle parental. \n \n \n \n\n \n \n \nVoici ce que contient le changelog : \n \n- Nous avons simplifié l'affichage des détails des activités.\n- Les détails des activités sont désormais entièrement affichés sur les cartes.\n- Les spoilers potentiels seront toujours cachés.\n- Les emojis Unicode 16.0 sont désormais pris en charge. Vous pouvez les utiliser dans vos messages.\n- Lorsque vous réglez le niveau de restriction du contrôle parental sur Adolescents avancés ou plus âgés, la communication et le contenu généré par l'utilisateur sont désormais définis par défaut sur Restreindre. Si vous avez précédemment défini le niveau sur Adolescents tardifs ou plus âgés, vos paramètres précédents ne seront pas affectés et le niveau s'affichera comme Personnalisé.\n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et la convivialité de certains écrans.\n- Les emojis Unicode 16.0 ajoutés dans la nouvelle mise à jour comprennent un visage fatigué avec des poches sous les yeux, une empreinte digitale, un arbre sans feuilles, une harpe, une pelle, une éclaboussure et un légume-racine.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203754/in-ps5-un-nouveau-firmware-pour-ameliorer-les-activites-et-les-emojis-1.png"
        }
    },
    "news_11": {
        "title": "[PS4] PPPwnUI 3.32b moddé par Aldostools disponible",
        "content": "Le développeur Aldo Vargas propose une nouvelle version de PPPwnUI qui passe en v3.32b et qui intègre PS4HEN VTX 2.15 PPPwn-1.333. Cette nouvelle version du frontend en Python qui ajoute une interface utilisateur à l'exploit PS4 PPPwn créé par TheFlow, permet de lancer facilement les payloads sur PS4. \n \nCette nouvelle version PS4HEN VTX 2.15 PPPwn-1.333 permet de profiter des dernières optimisations de StretchEcho pour le firmware 7.50. \n \n\n \n \nTéléchargement : PPPwnUI 3.32b moddé par aldostools\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203718/in-ps4-pppwnui-332b-modde-par-aldostools-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] MeloNX, un émulateur Switch taillé pour iOS",
        "content": "MeloNX, un nouvel émulateur de Nintendo Switch pour iOS, a récemment publié sa version 1.1.0 le 13 février 2025, via sa page officielle https://melonx.org/. Cette mise à jour apporte plusieurs améliorations et corrections de bugs, renforçant ainsi l'expérience utilisateur et la compatibilité avec les jeux populaires comme The Legend of Zelda : Breath of the Wild, The Legend of Zelda : Tears of the Kingdom, ou encore Mario Kart 8 Deluxe.  \n \n \n \n\n \n\n \n \n \nPrincipales Fonctionnalités et Améliorations : \n \nMeloNX est compatible avec les appareils iOS à partir de l'iPhone X et des iPad de 7e génération et ultérieurs. Il supporte également les versions d'iOS allant de iOS 15 à iOS 17, bien que des problèmes puissent survenir sur les versions plus anciennes.\n \nPerformances Optimisées :\n \nCPU : L'émulateur utilise une version améliorée de l'émulateur ARMeilleure, qui simule un processeur ARMv8 avec des optimisations pour les instructions 64 bits et 32 bits.\n \nGPU : L'émulation de la GPU Maxwell de la Switch est réalisée via les API Metal, offrant des performances graphiques fluides.\n \nSupport des Contrôles :\n \nMeloNX prend en charge une variété de contrôleurs, y compris les Joy-Con, les manettes classiques et les écrans tactiles. Le support des motion controls est également disponible, bien que des outils tiers comme DS4Windows ou BetterJoy soient nécessaires pour une configuration optimale.\n \nCorrections de Bugs :\n \n- Correction du problème des contrôleurs passant en mode vertical.\n- Ajout de l'option \"Disabilita PTC\" pour désactiver la mise en cache des traductions de code.\n- Correction de l'interface utilisateur Airplay Metal HUD.\n \nInstallation et Configuration :\n \nL'installation nécessite un compte développeur Apple payant et l'utilisation d'outils de sideloading. Les utilisateurs doivent également activer des permissions spécifiques, comme l'augmentation de la limite de mémoire, pour une expérience optimale.\n \nEn bref, la version 1.1.0 de MeloNX marque une étape importante dans l'émulation de la Nintendo Switch sur iOS, offrant une expérience plus stable et performante. Les joueurs peuvent désormais profiter de leurs jeux préférés avec une compatibilité étendue et des fonctionnalités améliorées. \n \n \nTéléchargement : MeloNX v1.1.0\n \n \n \n",
        "images": {}
    },
    "news_13": {
        "title": "[PS3] Evilnat libère Xai Plugin 1.18",
        "content": "Le développeur Evilnat vient de mettre en ligne la version 1.18 de son plugin Xai qui se destine essentiellement à son Custom Firmware 4.91.3. Il pourrait être compatible avec les autres CFW d'Evilnat, mais il n'est pas recommandé de l'utiliser sur d'autres firmwares. \n \nCette mise à jour apporte des fonctionnalités innovantes et des améliorations techniques qui promettent d'enrichir l'expérience utilisateur. \n \n \n\n \n \n \nVoici un aperçu des principales nouveautés :\n \nChangelog Version 1.18 :\n \n- Enable/Disable QA Flags : Cette fonctionnalité permet aux utilisateurs d'activer ou de désactiver les drapeaux de contrôle de qualité (QA). Elle offre une flexibilité accrue pour tester et déboguer des configurations spécifiques, ce qui est particulièrement utile pour les développeurs de serveurs et les créateurs de contenu.\n \n- Dump Token Seed : Une nouvelle option pour extraire et analyser les \"Token Seeds\", essentiels pour comprendre et manipuler les générations aléatoires dans le jeu. Cette fonction est idéale pour les joueurs avancés qui souhaitent explorer les mécanismes internes de Minecraft.\n \n- Rebug Toolbox Options : La boîte à outils Rebug a été enrichie avec de nouvelles options pour faciliter le débogage et le développement. Ces outils permettent une meilleure gestion des erreurs et une personnalisation plus poussée des fonctionnalités du plugin.\n \n \nTéléchargement : Xai Plugin 1.18 (code source)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203627/in-ps3-evilnat-libere-xai-plugin-118-1.png"
        }
    },
    "news_14": {
        "title": "[PS4] FPKGi l'alternative à PGKi débarque sur PS4 en v0.81",
        "content": "FPKGi, une alternative à PKGi pour PS4, a récemment fait son apparition en version 0.81. Ce projet open-source permet de télécharger et d'installer des fichiers .pkg modifiés, notamment pour les jeux backportés sur des firmwares plus anciens de la PS4. FPKGi est conçu pour être utilisé avec des serveurs personnalisés, permettant aux utilisateurs de peupler l'application avec leur propre contenu via des fichiers .json locaux ou en ligne. \n \n \n\n \n \nFonctionnalités principales de FPKGi :\n \nSupport des fichiers .pkg : FPKGi prend en charge tout type de contenu .pkg, à condition que l'utilisateur dispose des licences nécessaires. Cela inclut les jeux, les applications, les mises à jour, les DLC et les démos.\n \nPersonnalisation via .json : Les utilisateurs peuvent ajouter du contenu en éditant des fichiers .json, en spécifiant des détails tels que le titre, la version, la taille, la région et l'URL de la couverture. Les liens doivent être directs vers les fichiers .pkg pour éviter les problèmes.\n \nNavigation et téléchargement : L'interface permet de naviguer facilement entre les catégories (jeux, applications, DLC, etc.) et de télécharger du contenu en arrière-plan ou en mode veille.\n \nCompatibilité avec les firmwares anciens : FPKGi est particulièrement utile pour les utilisateurs exploitant des firmwares plus anciens, car il supporte les jeux backportés.\n \n \nComment utiliser FPKGi :\n \nInstallation : Téléchargez le fichier .pkg précompilé ou compilez-le vous-même en suivant les instructions disponibles sur GitHub.\n \nConfiguration : Après le lancement, l'application crée automatiquement les répertoires et fichiers .json nécessaires. Les utilisateurs peuvent ensuite éditer ces fichiers pour ajouter leur contenu.\n \nTéléchargement : Une fois le contenu configuré, les utilisateurs peuvent parcourir et télécharger les fichiers .pkg directement depuis l'application.\n \nUsage éducatif et personnel : FPKGi est destiné à un usage éducatif et personnel uniquement. Il est important de respecter les lois locales concernant les droits d'auteur.\n \nBlocage des services Sony : L'utilisation de FPKGi peut bloquer l'accès aux services CDN et API de Sony, ce qui nécessite des ajustements dans les debug settings de la console s'agissant d'un PKG. \n \n \nCorrections changelog 0.81 :\n \n- Résolution d'un problème où l'application ne pouvait pas créer les répertoires et fichiers nécessaires.\n- Correction du nombre de packages pour garantir qu'il est mis à jour après la création du contenu de démonstration initial.\n \n \nTéléchargement : FPKGi v0.81 (Nightly)\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203613/in-ps4-fpkgi-lalternative-a-pgki-debarque-sur-ps4-en-v081-1.png"
        }
    },
    "news_15": {
        "title": "[PS4] shadPS4 v0.6.1 Wip pre-release disponible",
        "content": "La première version de la branche 0.6.1 de l'émulateur shadPS4, le désormais célèbre émulateur PS4, vient d'arriver sur le réseau github. Cette pré-version WIP montre que l'équipe de développement de shadPS4 continue d'améliorer activement l'émulateur, en se concentrant sur les performances, la qualité graphique et l'accessibilité. Les utilisateurs peuvent s'attendre à des versions encore plus stables et performantes à l'avenir.\n \n \n \n\n \n \n \nNouveautés de shadPS4 v0.6.1 Pre-release :\n \n- Mise à jour de Qt vers la version 6.8.2 :\n \nL'interface utilisateur de l'émulateur a été mise à jour pour utiliser Qt 6.8.2, une version plus récente du framework graphique. Cela devrait améliorer la stabilité et les performances de l'interface, ainsi que permettre une meilleure compatibilité avec les systèmes d'exploitation modernes.\n \n- Localisation pour plusieurs langues :\n \nUne prise en charge multilingue a été ajoutée, permettant à l'émulateur d'être traduit dans plusieurs langues. Cela rend l'outil plus accessible à un public international et facilite son utilisation pour les utilisateurs non anglophones.\n \n- Améliorations du shader_recompiler :\n \nLes entrées de fragments sont désormais exclues par défaut du transfert quad/rect dans le shader_recompiler. Cette optimisation vise à améliorer les performances graphiques en réduisant les calculs inutiles lors du rendu des shaders, ce qui peut se traduire par une meilleure fluidité dans les jeux.\n \n- Prise en charge HDR (High Dynamic Range) : \n \nLa sortie vidéo prend désormais en charge le HDR, permettant une meilleure qualité d'image avec des couleurs plus vives et un contraste plus élevé pour les écrans compatibles HDR. Cette fonctionnalité est particulièrement utile pour les jeux qui exploitent des graphismes riches et détaillés.\n \n \nTéléchargement : shadPS4 v0.6.1 Wip pre-release\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203600/in-ps4-shadps4-v061-wip-pre-release-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[PS5] PS5 Payload SDK v0.26.1 disponible",
        "content": "Le développeur John Tornblom continue de faire évoluer son offre PS5 Payload SDK et propose désormais la version v0.26. Encore une fois, le développeur nous régale, en proposant de nouveaux exemples, de nouveaux stubs, et bien entendu les tous derniers offsets 6.xx et 7.xx.\n \n \n\n \n \n \nChangelog v0.26 :\n \n- kernel : ajout des offsets 6.xx et 7.xx\n- sce_libs : ajout des stubs libSceAppInstUtil, libSceNetCtl et libSceSysCore\n- exemples : ajout de hello_kenv\n- échantillons : ajout de hello_cxx23\n \nEdit 14.02.2025 : \n \nTéléchargement :  PS5 Payload SDK v0.26.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203599/in-ps5-ps5-payload-sdk-v026-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[PS4/PS5] PS4 weeTools SE 1.0.2 / PRO 1.0.7 et PS5 weeTools PRO 0.2.1",
        "content": "Le développeur Andy_maN a mis à jour tous les outils pour la PS4 et la PS5, PS4 weeTools SE et PS4 weeTools PRO passent respectivement en 1.0.2 et 1.0.7, les nouveautés sont le support du firmware 12.02.\n \n \n\n \n \n \nChanglog v1.0.7\n \n- [nouveau] Enregistre désormais la configuration du port\n- [nouvelle] Informations sur la version EMC\n- [upd] Informations sur le circuit intégré Torus\n- [mise à jour] Prise en charge de la version 12.02\n \nTéléchargement : PS4 weeTools SE 1.0.2 / PRO 1.0.7\n \n \n \nPS5 Wee Tools (SE 0.1.7 / PRO v0.2.1)\n \nChangelog v0.2.1 :\n \n- Informations sur la version CEM\n- Visionneuse de cache du journal des erreurs EMC\n- Correction du décompresseur PUP de décembre\n \nTéléchargement : PS5 Wee Tools (SE 0.1.7 / PRO v0.2.1)\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203597/in-ps4ps5-ps4-weetools-se-102-pro-107-et-ps5-weetools-pro-021-1.png"
        }
    },
    "news_18": {
        "title": "[Multi] Apollo CLI tools v1.1.2 disponible",
        "content": "Le développeur Bucanero propose une nouvelle version de son outil appelé Apollo CLI tools, comme vous le savez Bucanero est à l'origine d'Apollo Save Tool sur PS3, PS4 et Vita, mais là c'est un peu particulier puisque CLI Tools est multiplateforme. \n \nCLI Tools permet d'appliquer l'assistant de sauvegarde et les codes de patch BSD à un fichier de données. La bibliothèque et les outils de ligne de commande implémentent un moteur de sauvegarde de données qui prend en charge les codes Save Wizard/Game Genie et les scripts Bruteforce Save Data.\n \nL'arrivée de nouveautés est très rare pour Apollo CLI Tools, l'objectif est de corriger des bugs et d'ajouter un nouveau support de paramètres. \n \n \n\n \n \nChangelog :\n \n- Correction du bug de recherche de code SW \n- Ajout de la prise en charge des paramètres de plage à l'outil de patch CLI\n \n \nTéléchargement : Apollo CLI tools v1.1.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203584/in-multi-apollo-cli-tools-v112-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] Une faille découverte dans le jeu Marvel Rivals",
        "content": "Un chercheur en sécurité répondant au nom de Shalzuth a trouvé une vulnérabilité grave dans le jeu Marvel Rivals, sorti sur PC et PS5. \n \nLe titre permet à quelqu'un de mal intentionné d'exécuter une vulnérabilité RCE de prise de contrôle à distance qui pourrait être mal utilisée par certains acteurs pour exécuter du code arbitraire. \n \n \n\n \n \nCe type de faille permet d'exécuter du code malveillant via des commandes ou de lancer des process non désirés. La faille de sécurité serait la conséquence d'un correctif du je qui utilise l'exécution de code à distance sans vérifier la connexion au serveur officiel. \n \n \n\n \n \nComme le montre la vidéo de Shalzuth, le titre sert de point d'entrée, de plus pour des raisons justement sécuritaire, le jeu fonctionne avec des privilèges administrateur, ce qui accentue le risque !\n \nLe développeur informe avoir voulu signaler le bug aux responsables des développements mais il souligne aussi l'absence de ce genre de faille dans le bounty program, ce qui encouragerait la découverte de ce type de failles. \n \nSi le sujet vous interpelle vous pouvez trouver son billet ici : shalzuth.com\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203582/in-ps5-une-faille-decouverte-dans-le-jeu-marvel-rivals-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] ps5-payload-dev supporte les firmwares 6.xx et 7.xx",
        "content": "Le développeur John Tornblom continue de faire avancer le kit SDK alternatif ps5-payload-dev, un SDK très utile auquel il a ajouté les offsets sur les firmwares 6.xx et 7.xx.\n \nComme vous le savez il s'agit d'un SDK pour le développement de payloads ciblant les PS5 exploitables exécutant un loader ELF, par exemple, ps5-payload-elfldr , le BD-J ps5-payload-loader ou l'exploit webkit de Specter.\n \n \n\n \n \nIl est donc désormais possible de développer des bibliothèques, des démons, ou des plugins via les payloads sur ces firmwares 6.xx et 7.xx.  \n \n \n \nTout est là :  ps5-payload-dev\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203528/in-ps5-ps5-payload-dev-supporte-les-firmwares-6xx-et-7xx-1.png"
        }
    }
}