{
    "news_1": {
        "title": "[DS/2DS/3DS] nds-bootstrap 2.2.2 et TWiLight Menu++ v27.12.2",
        "content": "Le développeur RocketRobz offre une mise à jour de nds-bootstrap et TWiLight Menu++ qui passent respectivement en v2.2.2 et v27.12.2.\n \n \n\n \n \n \nChangelog TWiLight Menu++ v27.12.2 :\n \n- Désormais à nouveau utilisable sur l'EZ-Flash Parallel avec la prise en charge du démarrage automatique réajoutée !\n- lifehackerhansola corrigé le bug qui causait la corruption de la carte microSD lors des écritures, en augmentant la latence entre les écritures. En conséquence, les écritures sont désormais un peu lentes, mais nds-bootstrap sauvegardera désormais correctement les jeux !\n \nCorrection de bug :\n \n- edo9300: Correction d'un bug négligé qui faisait que la sélection du bas apparaissait grisée dans le menu DS Classic lors de l'exécution à partir de cartes flash Slot-2 (selon ce qui est inséré et/ou quel micrologiciel est flashé).\n \n \nChangelog nds-bootstrp :\n \nCorrections de bugs :\n Le développeur a tenté de corriger les plantages occasionnels dans les jeux Pokémon Gen 5 exécutés en mode DSi sur les consoles DSi.\n- Obtenu en réduisant le tas de 2,5 Mo au lieu de 512 Ko, ce qui augmente l'espace de cache LRU en conséquence.\n- Correction du plantage de Rockman EXE : Operate Shooting Star sur les consoles 3DS lors de l'ouverture de Star Colosseum.\n- Iron Man 2 redémarre désormais sur la carte SD DSi/3DS en corrigeant un bug négligé qui s'est produit depuis la v1.6.0.\n- Correction d'un bug négligé qui empêchait le DMA de lecture de carte de fonctionner (et par conséquent, un éventuel plantage) pour les ROM DSi exclusives préchargeables sur les consoles 3DS.\n \n \nTéléchargement : nds-bootstrap 2.2.2 et TWiLight Menu++ v27.12.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201052/in-ds2ds3ds-nds-bootstrap-222-et-twilight-menu-v27122-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS4] Le chapitre 4 d'Hellblade 2 est ici",
        "content": "Le développeur Lapy vient de mettre en ligne le chapitre 4 de son adaptation d'Hellblade II pour la PS4. \n \nVoilà que débarque donc le 4ème chapitre, de ce film proposant quelques scènes en QTE pour amener une interactivité avec le \"joueur\". \n \nA noter qu'un autre développeur, dravszoo1, va proposer la version PKG de cette proposition avec les vidéos à l'intérieur.\n \n \n \n\n \n \nTéléchargement : HB2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201051/in-ps4-le-chapitre-4-dhellblade-2-est-ici-1.png"
        }
    },
    "news_3": {
        "title": "[PS5] Une mise à jour d'idlesauce pour PS5-UMTX-Jailbreak",
        "content": "Le développeur idlesauce ne s'arrête plus, voilà qu'il propose une nouvelle version de PS5-UMTX-Jailbreak. Son intérêt commence à être très intéressant faisant ainsi évoluer le jailbreak. \n \n \n\n \n \nChangelog : \n \n- Changements dans le CSS pour les textarea des crédits et du journal, cela permet de créer des crédits multilignes sur les boutons de payloads et créez une zone de texte du journal en lecture seule\n- Correction du loader d'elf sur le port 9020, il utilisait des sockets non bloquants mais ne vérifiait pas la présence de EAGAIN lors de la lecture.\n- Il utilise maintenant blocking+select puisque nous n'avons pas errno.\n \n \n \nTéléchargement : PS5-UMTX-Jailbreak\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201033/in-ps5-une-mise-a-jour-didlesauce-pour-ps5-umtx-jailbreak-1.jpg"
        }
    },
    "news_4": {
        "title": "[PS4] Remote Lua Loader pour PS4 et PS5 s'améliore avec Artemis",
        "content": "Remote Lua Loader pour PS4 et PS5, basé sur la découverte de gezine qui permet aux jeux créés avec le moteur Artemis de charger des fichiers Lua arbitraires. Actuellement, ce chargeur est spécifique au Raspberry Cube (CUSA16074). Le laoder ne dépend pas du firmware et a été testé avec succès sur une PS5 Pro sous le firmware 10.20 !\n \n \n\n \n \nL'utilisation a été documentée sous PS4 Jailbreakée, PS5, PS5 Slim et/ou PS5 Pro. Actuellement, Remote Lua Loader permet d'éditer et d'exécuter des scripts Lua directement dans les jeux, c'est finalement un outil puissant pour personnaliser l'expérience de jeu.\n \n \nTéléchargement : Remote Lua Loader\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201027/in-ps4-remote-lua-loader-pour-ps4-et-ps5-sameliore-avec-artemis-1.png"
        }
    },
    "news_5": {
        "title": "[PS4] Live Die Repeat v1.01 disponible",
        "content": "Le développeur Lapy a annoncé il y a quelques jours qu'il allait proposer une mise à jour de Live Die Repeat car il a vu que les 10 000 téléchargements ont été dépassés. \n \nCe jeu est un hommage à Dragon's Lair, tant pour les QTE que pour la difficulté ou encore la mécanique du jeu. L'expérience est assez difficile à maîtriser du fait du gameplay qui se répète et qu'il oblige à se concentrer sur un gameplay prenant. \n \n \n\n \n \nLa mise à jour apporte la \" Visual Alert \", il s'agit de là d'un signalement du prochain bouton QTE qui disposera d'une aura lumineuse pour simplifier l'expérience. Lapy informe qu'il ne faut pas appuyer trop tôt sinon cela échouera. \n \n \nTéléchargement : Live Die Repeat 1.01 (pour PS4)\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200993/in-ps4-live-die-repeat-v101-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[Oldies] Mise à jour de RAWeb, des nouvelles fonctions pour RetroAchievemnts",
        "content": "Une mise à jour de RAWeb vient de débarquer, RAWeb c'est la plateforme RetroAchievements.org gère les réalisations, les données de jeu et les fonctionnalités gèrent la communauté de rétrogaming. \n \nRAWeb est une application qui permet aux utilisateurs d'interagir avec la plateforme RetroAchievements pour ainsi profiter des avantages de la communauté. \n \n \n\n \n \nRAWeb 6.20.0 s'adresse à tous ceux qui utilisent http://RetroAchievements.org pour obtenir des succès et des badges sur les émulateurs pris en charge comme ceux de 32X, Atari, Genesis, Saturn, Game Boy/Color/Advance, DS/DSi, NES, SNES, N64, GameCube, PlayStation, PlayStation 2, PSP, NeoGeo ... bref vous l'aurez compris cela s'adresse à beaucoup de monde.  \n \nTéléchargement : RAWeb 6.20.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200984/in-oldies-mise-a-jour-de-raweb-des-nouvelles-fonctions-pour-retroachievemnts-1.png"
        }
    },
    "news_7": {
        "title": "[PS3] Apollo Save Tool pour PS3 passe en v2.0.2",
        "content": "Le développeur d'Apollo Save Tool, Damian Parrino, nous propose de découvrir une nouvelle version de son outil indispensable pour la PS3. \n \nComme vous le savez, il s'agit d'un outil à installer sur votre console et qui va vous permettre de sauvegarder vos sauvegardes, cela l'air de rien, mais quand vous avez passé plusieurs centaines d'heures de jeux, vous ne voulez pas tout recommencer à cause d'un crash ou d'un bug. Bref, nous vous recommandons de faire régulièrement des sauvegardes de vos jeux. \n \n \n\n \n \nAjout : \n \n- Supprime les sauvegardes PS3 de l'USB\n- Images de la carte mémoire virtuelle PS2 (VMC)\n- Prise en charge de formats d'importation supplémentaires : .XPS, .CBS, .MAX, .SPS\n- Base de données en ligne : affichage des icônes PS1\n- Outils utilisateur :\n- Conversion des sauvegardes PS1/PS2 au format .PSV\n- Convertir les enregistrements .PSV aux formats .MCS/.PSU\n- Re-signature des sauvegardes .PSV\n \nCorrection :\n \n- L'option « Copier sur le disque dur » n'est disponible que lorsque l'on parcourt des sauvegardes USB.\n \nDivers :\n \n- Mise à jour du moteur de patch Apollo vers la version 1.1.2\n- Correction du bug de recherche du code SW lorsque les octets ne sont pas trouvés\n- Option pour lancer une application externe\n- (L1 + START) exécute /dev_hdd0/game/NP0APOLLO/USRDIR/EXTRA.SELF\n \n \nTéléchargement : Apollo Save Tool v2.0.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200980/in-ps3-apollo-save-tool-pour-ps3-passe-en-v202-1.png"
        }
    },
    "news_8": {
        "title": "[Switch] L'émulateur Switch Citron coule sur le jus de Yuzu",
        "content": "Depuis 5 jours est proposé un tout nouvel émulateur Switch, se nommant Citron, il est développé par Zephyron et reprend les bases de Yuzu. \n \nBien entendu, ce projet est une alternative à usage éducative, et le développeur tente de se prémunir de l'avenir en mettant en garde dès le téléchargement et l'installation, dès que l'on tente d'ouvrir la version PC un avertissement apparait prétextant que le logiciel est proposé \" à des fins éducatives uniquement \", et \"nous interdisons strictement l'utilisation de Citron pour des copies piratées ou non autorisées\". \n \n \n\n \n \nIl faut l'admettre, une fois les clés intégrées, il est possible de réaliser à peut prêt ce que l'on veut avec l'émulateur comme cela était possible avec Yuzu ou Ryujinx, Suyu ou Sudachi, toute retirées par Nintendo.\n \nCitron n'échappera pas à la règle, et se fera presser par les avocats de Nintendo. Les vidéos d'installation et de démonstration pleuvent sur Youtube. \n \n \nTéléchargement : Citron\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200931/in-switch-lemulateur-switch-citron-coule-sur-le-jus-de-yuzu-1.png"
        }
    },
    "news_9": {
        "title": "[3DS] La fusion de Citra3DS et Lime3DS se nomme Azahar",
        "content": "Fin octobre, le développeur PabloMK7 nous avait annoncé lors de la dernière version de Lime3DS qu'un projet d'unification de Lime3DS et de Citra3DS était en cours d'élaboration, et bien le projet est né et se nomme Azahar, le site officiel se trouve ici https://azahar-emu.org/\n \nLe projet est simple, faire de Azahar le meilleur émulateur 3DS qui existe, tout simplement, unifiant les deux projets, bénéficiant de capacités techniques incroyables, mais aussi d'une certaine philosophie de développement visant à préserver les capacités techniques, vidéoludiques et d'expérience de la 3DS. \n \n \n \n\n \n \n \n \nUne des grandes avancées est la possibilité d'entrer dans l'eShop, cela a nécessité l'implémentation de certaines fonctionnalités manquantes concernant la signature avec le certificat unique de la console. Le développeur tient à remercier luigoalma pour son aide. L’étape suivante consiste à déterminer comment installer les jeux. N'oubliez pas que même s'il n'est plus possible d'acheter des jeux sur l'eShop, vous pouvez toujours télécharger les jeux et les démos achetés, ainsi que les mises à jour.\n \nCette modification supprime la nécessité d'un dump de CTCert.bin, mais nécessite à la place une copie de l'OTP. movable.sed sera également requis, pour éviter d'interrompre les transferts système pour la console donneuse.\n \nPour le moment aucune release d'Azahar n'a été proposée au public, le projet n'est pas encore prêt à être diffusé mais son développement avance. \n \n \n \n",
        "images": {}
    },
    "news_10": {
        "title": "[PS5] PS5-UMTX-Jailbreak mis à jour par idlesauce",
        "content": "Le développeur idlesauce propose sa mise à jour de PS5-UMTX-Jailbreak, cette version modifiée du jailbreak de Specter, change quelques éléments comme la mise à jour de Byepervisor ou encore des évolutions de EchoStretch notamment sur la présence de patchs permettant de facilité l'installation des PKG.\n \n \n\n \n \nAinsi voilà les modifications :\n \n- Payloads /menu inclus pour charger les payloads directement depuis le navigateur\n- Laoder Elf sur 9020 pour les payloads qui n'ont pas été construits avec le SDK de John-Tornblom\n- Mode Webkit uniquement, pour effacer le cache d'application ou envoyer des payloads supplémentaires aux démons du loader elf tels que elfldr de john-tornblom (qui est automatiquement chargé dans le cadre de l'exploit du kernel)\n- Patch SDK pour 1.05 à 4.51\n- Ajout du SDK PS4 pour la version 1.02\n- Mise à jour de Bypervisor\n- Désactivation des correctifs intégrés au SDL PS4 sur 1.xx-2.xx\n- Intégration de meilleurs correctifs pour l'installation de PKG\n \n \nJailbreak UMTX pour PS5 (firmware 1.xx à 5.xx) : https://umtx.pages.dev/\n \n \nTéléchargement : PS5-UMTX-Jailbreak (de idlesauce)\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200929/in-ps5-ps5-umtx-jailbreak-mis-a-jour-par-idlesauce-1.jpg"
        }
    },
    "news_11": {
        "title": "[PS3] Nautilus Toolset v1.02 disponible",
        "content": "Le développeur DeViL303 nous propose de découvrir un outil nommé Nautilus Toolset qui est proposé en v1.02.\n \n\nNautilus est une interface graphique Windows conçue pour travailler sur les ressources de Playstation Home à un niveau plus profond que jamais. L'objectif final est de disposer d'une solution tout-en-un pour automatiser les tâches courantes et traiter les nombreux types de fichiers personnalisés utilisés dans Home. En raison de la nature des millions d'actifs de Home et des nombreux cas de figure impliqués, cette application ne sera probablement jamais « terminée ».\n \n \n\n\n \n \n\n \n \n \nChangelog : \n \n- Correction d'un bug d'horodatage sur le packaging en masse \n- Il lit et applique désormais correctement le fichier timestamp.txt \n- Déballage en masse considérablement optimisé \n- Une journalisation excessive provoquait un ralentissement \n- Dispose désormais d'un mode Repack sur le décompresseur qui jettera chaque dossier directement dans le créateur d'archives et reconditionnera automatiquement le tout avec les paramètres choisis \n- Essentiellement un convertisseur d'archives \n- Peut maintenant faire glisser les SQL dans l'éditeur de base de données \n- Bouton Afficher le journal ajouté à l'onglet Paramètres \n- Éditeur SceneList.xml et onglet Éditeur TSS ajoutés \n- Ceux-ci s'intègrent au créateur SDC/ODC et à l'éditeur de base de données et les uns aux autres pour faciliter la gestion du CDN\n \n \nTéléchargement : Nautilus Toolset v1.02\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200928/in-ps3-nautilus-toolset-v102-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1200928/in-ps3-nautilus-toolset-v102-disponible-2.png"
        }
    },
    "news_12": {
        "title": "[3DS] 3DSident v0.9.1 disponible",
        "content": "Le développeur Joel16 nous propose de découvrir une nouvelle version de 3DSident, il s'agit pour rappel d'une application 3DS qui est inspirée de PSPident et de PS2ident, et qui est destinée à afficher un grand nombre d'informations sur la console sur lequel elle est lancée.\n \nAvec la version 0.9.1, 3DSident a été réécrit en C++ qui utilise les dernières versions de devkitARM et libctru. Cette version ne sera disponible qu'avec la version légèrement actualisée de l'interface graphique.\n \n3DSident, un peu comme un CPU-Z ou un GPU-Z sur PC, le logiciel va vous permettre d'obtenir facilement des informations critiques comme le modèle, la langue, le firmware installé avec la version du Kernel, l'adresse MAC , le statut de la batterie, et le programme évolue encore plus avec l'arrivée de cette version.\n \n \n \n\n \n \n \nChangelog :\n \n- Métadonnées d'application corrigées et versions .cia réintroduites.\n- Le testeur de boutons peut désormais vérifier les entrées du bouton d'accueil.\n- Correction du code ami local NAND corrigé dans la catégorie système.\n- Affichez le PMIC et le code du fournisseur de batterie sous la catégorie de batterie.\n \n \n \nTéléchargement : 3DSident v0.9.1\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200918/in-3ds-3dsident-v091-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[PS5] Playstation-4-Save-Mounter s'adapte à la PS5 avec la v1.3.1",
        "content": "Le développeur idlesauce propose le fork de Playstation-4-Save-Mounter du célèbre Chendochap en l'adaptant à la PS5. Initié sur PS4, ce logiciel est donc porté sur PS5 avec cette version v1.3.1-ps5-r1.\n \nCe programme vous permet de monter des données de sauvegarde en LECTURE/ÉCRITURE\n \nAvec ce soft vous pouvez :\n- Faites des copies décryptées de vos sauvegardes\n- Remplacer les sauvegardes par des sauvegardes modifiées\n- Remplacer les fichiers de sauvegarde par les fichiers de sauvegarde de quelqu'un d'autre (partager les sauvegardes)\n- Créer de nouvelles sauvegardes\n- A noter qu'il n'est pas possible de remplacer les fichiers de sauvegarde par une sauvegarde cryptée, ni d'utiliser une console qui ne dispose pas d'un exploit\n \n \n \n\n \n \n \n \nChangelog pour PS5 : \n \nPrend en charge les firmware 4.03 et 5.10 de la PS5 : \n- Il est possible que d'autres firmwares avec la même version majeure aient les mêmes offsets \n \nTéléchargement : Playstation-4-Save-Mounter 1.3.1-ps5-r1\n \n \n \n",
        "images": {}
    },
    "news_14": {
        "title": "[Vita] eCFW 6.61 Adrenaline 7.1.1 disponible",
        "content": "Le développeur isage a publié une nouvelle version d'Adrenaline, une version personnalisée du plugin qui permet de modifier l'émulateur PSP interne de la PlayStation Vita en s'appuyant sur taiHEN pour permettre d'exécuter le custom firmware 6.61.\n \nComme vous le savez le plugin Adrenaline injecte le code personnalisé dans l'IPL - Inital Program Loader - et ainsi lancer du code non signé dans la console lorsqu'elle s'allume.\n \nSuccessivement, ce sont deux versions qui se sont succédées, la 7.1.0 puis la 7.1.1. \n \n \n\n \n \n \nChangelog v7.1.1 :\n- Correction de l'affichage des informations de version.\n- Vous pouvez mettre à jour à partir de la version 7.1 en utilisant « Mise à jour du système » à partir du XMB\n \nChangelog v7.1.0 :\n- Application de caméra XMB corrigée.\n- Ajout de la prise en charge du lien de jeu PS2/PS3 <-> PSP.\n- Nettoyage de récupération avec couleur réglable.\n \n \nTéléchargement : eCFW 6.61 Adrenaline 7.1.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200897/in-vita-ecfw-661-adrenaline-711-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[DS] MelonDS v1.0 RC bientôt la version définitive",
        "content": "Plus de deux ans de développement, et voici que débarque la première RC (Release Candidate) de MelonDS, l'un des meilleurs émulateurs de Nintendo DS.\n \nLe développeur a fait le choix de dévoiler la Release Candidate, de nombreux changements qui suite à de nombreux tests, permet de proposer cette version 1.0.\n \nLe kernel a été retravaillé, permettant l'exécution de plusieurs instances de l'émulateur au sein d'un seul processus, ainsi la gestion de la partie du multijoueur local a été améliorée, tout comme la prise en charge du jeu en réseau. \n \nOui, le multijoueur en réseau local a été réintégré et optimisé, même si une connexion Ethernet de haute qualité est nécessaire. \n \nCette version dispose aussi d'un nouveau moteur de rendu OpenGL, qui combine une précision graphique du moteur de rendu logiciel avec la prise en charge de la mise à l'échelle, améliorant là aussi l'émulation par rapport aux versions précédentes. \n \nDernière information, une prise en charge de la R4 Revolution et du M3 Simply. Jusqu'à présent, la manière dont la prise en charge DLDI était effectuée dans melonDS était de niveau assez élevé. Elle était implémentée via un pilote DLDI personnalisé que melonDS corrige, et une classe de chariot spéciale (CartHomebrew) est utilisée, qui peut s'interfacer avec le pilote DLDI de melonDS. Bien que cela ne soit pas trop éloigné de la réalité et fonctionne très bien, il s'agit d'une solution entièrement personnalisée qui ne repose sur aucun matériel existant.\n \n \n\n \n \n \nasiekierka a travaillé sur l'émulation de modèles de linkers spécifiques : le R4 Revolution et le M3 Simply. Cela permet, par exemple, d'exécuter les menus originaux de ces flashcarts. C'est très sympa d'avoir une référence sur le fonctionnement de ce matériel. \n \n \nChangelog :\n \n- Ajout d'un écran de démarrage (Arisotura)\n- Ajout d'une boîte de dialogue À propos (Nadia)\n- Correctifs d'émulation pour calico (fincs)\n- Rendre le frontend principalement thread-safe\n- Retravailler le kernel pour prendre en charge plusieurs instances dans un processus\n- Moteur de rendu OpenGL : évitez le Z non défini lors de l'utilisation de la mémoire tampon W (générique)\n- Améliorer l'entrée du microphone (Arisotura)\n- Ajout de la prise en charge de plusieurs fenêtres (Arisotura)\n- Nouveau système de configuration (Arisotura)\n- Ajout d'un moteur de rendu de shader de calcul OpenGL (générique)\n- Implémentation des préréglages de fréquence d'images cible (Jakly)\n- Corriger le bruit de souffle du microphone en entrée (générique)\n- Ajout du support LAN (Arisotura)\n- Ajout de Nix (Nadia)\n- Tentatives d'amélioration des connexions multijoueurs locales (Arisotura)\n- De nombreuses améliorations de précision du logiciel de rendu 3D (Jakly)\n- Corriger l'inexactitude avec les registres de débogage NO$GBA (pants64DS)\n- Moteur de rendu OpenGL : ajout de la prise en charge de la modification de l'image médiane BG0HOFS (Arisotura)\n- Résoudre les problèmes de chargement de la ROM zstd (Nadia)\n- Audio : ajout d'une interpolation gaussienne (SNES) (Nadia)\n- Correction de la détection DSiWare (JesseTG)\n- Ajouter le support pour les chariots R4 Revolution/M3 Simply (asiekierka)\n- Correction de la communication DS/GBA qui ne fonctionne pas lors de l'utilisation de FreeBIOS (Nadia)\n- Probablement plus\n \n \n \nTéléchargement : melonDS 1.0 RC\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200894/in-ds-melonds-v10-rc-bientot-la-version-definitive-1.png"
        }
    },
    "news_16": {
        "title": "[PS3/PSP/PS4] raylib 5.5 disponible",
        "content": "Le développeur raysan5 est fier d'annoncer après un an de développement la version 5.5 de raylib. Avec plus de 140 contributeurs au projet, et des milliers de lignes de codes, voilà la nouvelle version de raylib. \n \nUn an après la sortie de Raylib 5.0, arrive raylib 5.5 la prochaine grande révision de la bibliothèque. Cela fait 11 ans que Raylib est sortie en 1.0 et pendant tout ce temps, elle n'a jamais cessé de grandir et de s'améliorer. Avec un nombre exceptionnel de nouveaux contributeurs et d'améliorations, c'est, encore une fois, la plus grande version de Raylib à ce jour.\n \n \n \n\n \n \n \nPour ceux qui ne connaitraient pas, raylib est une bibliothèque simple et facile à utiliser pour profiter de la programmation de jeux vidéo. raylib est fortement inspiré de la bibliothèque graphique Borland BGI et du framework XNA et il est particulièrement adapté au prototypage, à l'outillage, aux applications graphiques, aux systèmes embarqués et à l'éducation. Attention raylib est une bibliothèque de programmation pour profiter de la programmation de jeux vidéo, pas d'interface sophistiquée, pas d'aides visuelles, pas de bouton de débogage, juste du codage à la manière la plus pure des programmeurs spartiates.\n \nraylib peut servir à créer des homebrews, d'ailleurs les plates-formes de rétro-gaming comme la Dreamcast, la Nintendo 64, la PSP, la PS Vita ou encore la PS4 sont officiellement supportées. \n \nAu fil du temps, ce sont plus de 640 contributeurs qui ont participé au projet, raylib 5.5 d'après les développeurs c'est \"le meilleur raylib de tous les temps\". \n \nTéléchargement : raylib 5.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200888/in-ps3pspps4-raylib-55-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[PS5] Initialisation du mode sans échec de la PS5 sur un émulateur",
        "content": "Les progrès réalisés sur l'émulation de la PS5 sont relativement lents, cela est le fait que la console est ultra sécurisé, et que donc accéder à l'ensemble de ces bibliothèques n'est déjà pas évident. \n \nDe plus, l'émulation d'une console non optimisée nécessite une puissance hardware importante, mais il semblerait que cela progresse doucement. \n \n \n\n \n\n \n \n \nPour preuve, voilà que le développeur Zecoxao rapporte qu'il est désormais possible d'émuler le safe mode, ou le mode sans échec, de la PS5. Bien entendu, il ne s'agit là que d'une étape parmi des milliers encore à effectuer. \n \nTout cela se passe sous RPCSX, tout est là.\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200887/in-ps5-initialisation-du-mode-sans-echec-de-la-ps5-sur-un-emulateur-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1200887/in-ps5-initialisation-du-mode-sans-echec-de-la-ps5-sur-un-emulateur-2.png"
        }
    },
    "news_18": {
        "title": "[Switch] NeXT v3.32 disponible",
        "content": "Le développeur Vampitech propose la version 3.32 de NeXT, pour rappel NeXT est un pack qui supporte les CFW que ce soit Atmosphere ou SX OS, de plus sa gestion des applications est largement simplifiée par une interface utilisateur très fonctionnelle. \n \nAvec la 3.32, Tesla Overlay a été retiré, et remplacé par la version améliorée d'UltraHand. Les sigpatches ont également été mis à jour pour améliorer la compatibilité et offrir une prise en charge élargie.\n \n \n\n \n \nUn bug empêchant les cheats de s'activer sur la console, et provoquant le redémarrage du système au début d'un jeu, a également été corrigé.\n \nVous pouvez appliquer la mise à jour en écrasant la version précédente de NeXT ou bien vous pouvez utiliser NeXT Updater. \n \nLe retrait de Tesla s'explique par le fat qu'il n'a pas été mis à jour depuis un moment. Ultrahand est super vitaminé et se spécialise dans l'overclocking sans laisser de côté les usages habituels, c'est du moins comme cela que justifie le développeur. \n \n \nTéléchargement : NeXT 3.32\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200880/in-switch-next-v332-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS3] PS3HEN 3.3.1 Test build disponible",
        "content": "Le développeur esc0rtd3w propose à ceux qui disposent encore, et à très juste titre, d'une PlayStation 3, de tester une nouvelle build de PS3HEN proposé en 3.3.1. \n \n \n\n \n \nChangelog 3.3.1 :\n \nChangelog du plugin HEN :\n- Ajout d'une fonctionnalité de restauration HEN pour les nouveaux paquets qui supportent HEN après un reformatage du disque dur (merci @LuanTeles )\n- Renommage temporaire des fichiers du plugin d'amorçage, au lieu de les supprimer si un WMM est trouvé.\n- Ajout de la fonction create_default_dirs pour créer les dossiers standards s'ils manquent sur dev_hdd0 (merci @LuanTeles )\n- Ajout de la fonction DLOG pour la sortie vers usb000 (réservé aux développeurs)\n- Ajout du nettoyage des fichiers PSN (merci @LuanTeles )\n- Nettoyage de la fonction clear_web_cache_check\n- Mise à jour des fonctions pour les presets LED\n- Ajout de la fonction sysLv2FsRename\n- Mise à jour de la fonction set_build_type pour vérifier les ports USB 000 - 007 (pour le mode développeur)\n- Mise à jour de l'installateur d'urgence pour vérifier les ports USB 000 - 007 (HEN_UPD.pkg à partir de l'USB)\n \nChangelog dans le payload :\n- Mise à jour des décalages de cellFsMkdir_symbol\n- Ajout du symbole cellFsRename_symbol\n \nChangelog dans les ressources :\n- Ajout de nouveaux fichiers RAF de coldboot personnalisés pour release, debug, usb, et DEX (merci @Charles_n_town )\n- Utilisation du répertoire de jeu PS3XPLOIT pour ajouter le statut d'installation HEN à la base de données GAMEDATA, pour le format de disque dur survivant (caché du XMB) (merci @LuanTeles )\n- Correction de l'entrée seg_mcutility dans category_game.xml (Corrige un problème avec l'élément de menu carte mémoire virtuelle PS1/PS2 (merci @LuanTeles )\n \n \nTéléchargement : PS3HEN 3.3.1 Test build\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200854/in-ps3-ps3hen-331-test-build-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] Le PlayStation Portal va bénéficier du cloud gaming (via une update)",
        "content": "Lancé il y a un peu plus d'un an, le PlayStation Portal a su convaincre, contrairement au PSVR2, et Sony souhaite le supporter, un produit ambitieux pour la marque, avec de nombreux retours positifs, et une communauté qui ne cesse de s'étendre, notamment aussi avec la version anniversaire.\n \n \n\n \n \nSony a dévoilé hier un tout nouveau firmware qui permet d'ajouter de nouvelles fonctionnalités au périphérique de la PS5 : \n \n- Réglage de la sortie audio du haut-parleur pour réduire le volume lorsque le niveau audio est réglé au minimum\n- Vous pourrez désormais régler les paramètres de votre appareil PlayStation Link à partir du menu Paramètres du portail PS, ce qui vous permettra d'optimiser le volume et le volume de l'effet local.\n \nDe plus, cette mise à jour inclue également une version bêta d'une nouvelle fonctionnalité demandée par de nombreux fans : la prise en charge du streaming cloud sur PS Portal. Une fois la mise à jour disponible, les membres PlayStation Plus Premium pourront participer à une version bêta du streaming cloud sur PS Portal, permettant de diffuser certains jeux PS5 du catalogue de jeux PlayStation Plus directement depuis les serveurs Sony, même sans console PS5. Bien entendu tout cela peut évoluer d'ici la version finale de cette Bêta. \n \n \n\n \nFonctionnalités disponibles pendant la bêta : \n \n- Diffusez certains jeux PS5 dans le catalogue de jeux PlayStation Plus\n-- Plus de 120 jeux PS5 du catalogue de jeux PS Plus, dont Dave the Diver, Ghost of Tsushima, Marvel's Spider-Man: Miles Morales, Monster Hunter Rise et Ratchet & Clank: Rift Apart, seront accessibles sur le PS Portal via le streaming cloud\n- Streaming jusqu'à 1080p/60fps\n- Fonctionnalités du contrôleur sans fil DualSense, notamment le retour haptique, les déclencheurs adaptatifs, les haut-parleurs, le pavé tactile (émulé sur l'écran tactile pour PS Portal) et le capteur de mouvement\n- Stockage cloud PlayStation Plus\n- Les données de sauvegarde et la progression du jeu peuvent être stockées jusqu'à 100 Go et seront automatiquement synchronisées avec votre console PS5, ce qui facilite le basculement entre le jeu local et le streaming, et entre plusieurs appareils.\n \nConcernant le hack du PlayStation Portal, tout s'est arrêté au firmware 2.06, mais en se dotant de fonctions de cloud gaming, la console est beaucoup plus intéressante. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200853/in-ps5-le-playstation-portal-beneficie-va-beneficier-du-cloud-gaming-via-une-update-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1200853/in-ps5-le-playstation-portal-beneficie-va-beneficier-du-cloud-gaming-via-une-update-1.png"
        }
    }
}