{
    "news_1": {
        "title": "[Switch] Flycast v2.2 disponible avec de nombreuses améliorations",
        "content": "Il y a déjà 8 mois sortait la version 2.1 de Flycast, et bien le développeur flyinghead vient de mettre en ligne sa remplaçante au travers de la v2.2 qui apporte de nombreuses nouveautés et optimisations. \n \n \n \n \n\nDavantage connu sur PlayStation Vita, Flycast est, s'il faut le rappeler, un émulateur Dreamcast open source de qualité, qui permet une restitution idéale de la console 128 bit de Sega lancée en 1998. Cette console connue comme celle qui aura succédée à la célèbre Saturn, aura sonné le glas du hardware Sega car elle a été mal accueillie par le public avec un peu plus de 8 Millions d'unités vendues durant les 2 années et demi de commercialisation. Les ventes sont arrêtées le 31 Mars 2001.\n \n \n\n \n \nNouveautés :\n- Naomi F355 multiboard\n- Émulation Sega SystemSP\n- Support de la carte RFID de Virtua Fighter 4. Serveur d'émulation VF.Net\n- Ecran tactile Naomi (Manic Panic Ghosts, Touch de Uno 1 & 2, Touch de zunou)\n- Hopper pour Kick'4'Cash, Shootout Pool et Club Kart Prize\n- Imprimante F355 Deluxe et Touch de Uno 1 & 2\n- Simulateur de conduite Sega\n- Stockage Android Scoped\n- SH4 option under/overclock\n- Série Mushiking\n- Serveur de classement mondial Naomi Alien Front\n- Émulation de haut niveau du réseau NetDIMM 3.7\n- Manette de course, manette de pêche, maracas, manette Densha de Go, manette Pop'n'Music (@AltoRetrato)\n- Routage vidéo en temps réel pour les streamers (@vkedwardli)\n- Emulation de puce RFID SystemSP : Dinosaur King, Love & Berry\n- Option Dreamcast 32 MB RAM (@cepawiel)\n \nCe qui a été amélioré :\n- Prise en charge des jeux Windows CE sur architecture x86 32 bits\n- Raccourcis clavier pour la sauvegarde et le chargement de l'état\n- Force feedback info netcast vers le plugin FFB de Boomlangnz : F355, 18 Wheeler, Club Kart, King of Route 66\n- Utilisation d'une manette de jeu avec les jeux d'arcade au pistolet laser\n- Option VMU A1 par jeu\n- Amélioration de la détection des jeux Windows CE\n- Prise en charge des polices de caractères latines-1 et asiatiques dans le BIOS HLE\n- Prise en charge du centrage vidéo (San Francisco Rush 2049, Street Fighter III - 3rd strike, Metropolis Street Racer)\n- Réseau Daytona USA\n- Compatibilité Eldorado Gate 4 à 7\n- Implémentation du dithering en mode d'émulation Full Framebuffer\n- Mise à jour des dépendances, amélioration de la construction, et plus encore grâce à @scribam\n- Et beaucoup, beaucoup, beaucoup de corrections de bugs grâce à @kihato et à tous les rapporteurs de bugs.\n \n \nTéléchargement : Flycast v2.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181728/in-switch-flycast-v22-disponible-avec-de-nombreuses-ameliorations-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1181728/in-switch-flycast-v22-disponible-avec-de-nombreuses-ameliorations-2.png"
        }
    },
    "news_2": {
        "title": "[WiiU] DNSpresso un nouvel exploit Wii U grâce au client DNS",
        "content": "Le développeur GaryOrnichts vient de dévoiler un nouvel exploit kernel qui exploite une vulnérabilité du client DNS de la Wii U. DNSpresso  est le nom de cet exploit qui s'appuie sur le DNS qui est utilisé pour déterminer l'adresse IP associée à un nom de domaine.\n \n \n \n\nLe réseau de la Wii U est une version modifiée de NicheStack , développée par InterNiche Technologies. La vulnérabilité CVE-2020-25928 n'a été connue qu'il y a deux ans, une faille de la mémoire tampon pouvant conduire à l'exécution de code à distance.\n \n \n\n \n \nPour bien expliquer, un paquet DNS modifié doit être envoyé, qui est chargé dans un tampon de taille fixe, bien que la taille réelle ne soit pas vérifiée . Il s’est avéré que Nintendo avait déjà corrigé ce bug lui-même, mais pas complètement. Vous pouvez trouver l'article complet sur le blog de GaryOrnichts .\n \nLe writeup est là : exploiting-dns-response-parsing-on-wii-u\n \n \nL'exploit peut tout à fait être hébergé localement, ou bien être accessible ici directement : http://85.215.57.182/\n \nTout est là : DNSpresso\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181727/in-wiiu-dnspresso-un-nouvel-exploit-wii-u-grace-au-client-dns-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1181727/in-wiiu-dnspresso-un-nouvel-exploit-wii-u-grace-au-client-dns-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS5] PS4 SDK Spoofer et PS5 Jar Loader (5.00 à 7.61)",
        "content": "Deux sujets intéressants à aborder pour ceux qui s'intéressent à la PlayStation 5 qui il faut l'avouer commence à devenir attractives surtout depuis l'arrivée des fPKG PS4, le premier est PS4 SDK Spoofer et le second est PS5 Jar Loader. \n \nPS4 SDK Spoofer\n \nQuelques développeurs se sont penchés sur un spoof permettant de faire fonctionner certains fPKG PS4 sur PS5 qui par défaut ne fonctionnent pas, ainsi Zecoxao et quelques autres testeurs ont permis de créer PS4 SDK Spoofer, qui va permettre de lancer ces fPKG qui jusqu'à présent n'étaient pas fonctionnel. Bien entendu pour le moment cela reste limité aux seuls firmwares permettant de lancer les fPKG PS4 sur PS5 à savoir les firmwares 4.03 et 4.50, le temps de trouver les offsets sur les autres.\n \n \n\n \n \nSon spoof fonctionne directement via son exploit : \n \nhttps://zecoxao.github.io/ps5jb/\n \n \n \nPS5 Jar Loader\n \nUne autre nouveauté sur PS5, l'arrivée du support des firmwares 5.00 à 7.61 sur PS5 Jar Loader. Dans la toute dernière version de PS5 Jar Loader de John Tornblom, il est donc possible d'utiliser les dernières évolutions en matière de hack PS5 sur les firmwares 5.00 à 7.61, on y voit donc le lien avec les dernières trouvailles de TheFlow sur l'exploit Bluray sur PS5.\n \n \n\n \n \n \nBien entendu il ne s'agit là de ne pas utiliser un exploit mais d'avantage d'une preuve de concept d'exécution de fichier JAR sur une PS5 avec un firmware compris entre 5.00 et 7.61.\n \n \nTéléchargement : ps5-jar-loader.iso /  hello-world-native-remote.jar\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181711/in-ps5-ps4-sdk-spoofer-et-ps5-jar-loader-500-a-761-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1181711/in-ps5-ps4-sdk-spoofer-et-ps5-jar-loader-500-a-761-2.png"
        }
    },
    "news_4": {
        "title": "[Switch] Jouer à Simpsons : Hit and run sur Switch",
        "content": "Plutôt récemment, le développeur ZenoArrow a publié une adaptation remastérisé du jeu Simpsons : Hit and Run sur Nintendo Switch.\n \nDéveloppé par Radical Entertainment et sorti à l'origine en 2003 sur GameCube, PlayStation 2, Xbox et Windows, ce jeu open world basé sur la série populaire de dessins animés \"Les Simpson\" avec des missions, exploration, et une bonne dose d'humour!\n \n \n \n \n \n\n \n \nPour le télécharger : https://github.com/ZenoArrows/The-Simpsons-Hit-and-Run\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181709/in-switch-jouer-a-simpsons-hit-and-run-sur-switch-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS5] Sony sort le firmware 8.20 et il est déjà décrypté",
        "content": "Un peu dans l'urgence Sony vient de proposer un tout nouveau firmware que personne n'attendait de trop. Le plus souvent la sortie d'un firmware PS5 s'accompagne d'un firmware PS4, là rien, étrange ? \n \nNon pas vraiment car ce firmware 8.20 intègre des nouveautés !\n \n \n\n \n \nPS5 – 23.02-08.20.00\n \n- La musique  dans le centre de contrôle est désormais beaucoup plus facile à utiliser. Avec sa disposition en deux colonnes, vous pouvez facilement parcourir différentes catégories, listes de lecture et chansons.\n- Vous pouvez éviter de diffuser involontairement votre environnement lors de la diffusion de jeux avec votre PlayStation VR2.\n- Accédez à  Paramètres  >  Accessoires  >  PlayStation VR2 et activez  Bloquer la vue transparente sur le téléviseur  pour empêcher l'image transparente de la caméra de s'afficher sur votre téléviseur lorsque vous utilisez votre PS VR2.\n- Si vous dites « Quoi de neuf ? » via la commande vocale sur n’importe quel écran, vous pouvez désormais rechercher les nouvelles fonctionnalités PS5.\n- Actuellement, la commande vocale (aperçu) n'est disponible qu'en anglais pour les joueurs disposant de comptes PlayStation Network aux États-Unis et au Royaume-Uni.\n- Améliorations des messages et la convivialité sur certains écrans\n \nCe firmware ne vient probablement pas corrigé de bugs car aucune mention d'amélioration de stabilité n'est intégrée, mais comme toujours, il est plus prudent d'attendre un peu, surtout que certains développeurs travaillent dur pour trouver les failles.\n \n \nIl est à noter que ce firmware a déjà été décrypté : \n \nhttps://twitter.com/notnotzecoxao/status/1717698725655548103\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181679/in-ps5-sony-sort-le-firmware-820-et-il-est-deja-decrypte-1.jpg"
        }
    },
    "news_6": {
        "title": "[Switch] Atmosphère 1.6.2 disponible",
        "content": "Le développeur SciresM dévoile une toute nouvelle version d'Atmosphère qui est maintenant proposé en version 1.6.2 depuis quelques heures. \n \nIl s'agit là de la 67 ème version d'Atmosphère sachant qu'elle intègre hbl 2.4.4 et hbmenu 3.6.0.\n \nPas de révolution à en attendre car la version 1.6.0 apportait déjà le support du firmware 17.0.0, mais quelques changements dans erpt, jpegdec et pm. \n \n \n\n \n \nChangelog 1.6.2 :\n \nLes éléments suivants ont été modifiés depuis la dernière version :\n \n- La prise en charge du firmware 17.0.0 est terminée.\n- erpt a été mis à jour pour prendre en charge la dernière version.\n- jpegdec a été mis à jour pour prendre en charge la dernière version.\n- pm a été mis à jour pour prendre en charge la dernière version.\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \n \nTéléchargement : Atmosphère 1.6.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181678/in-switch-atmosphere-162-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[PS5] Les PS5 avec un firmware inférieur au 8.00 seraient hackables",
        "content": "Selon le développeur TheFlow, toutes les consoles PS5 dont le firmware est inférieur au firmware 8.00 seraient vulnérables à la Toolchain BD-JB.\n \nTheFlow a confirmé via un Tweet sur X (ex Twitter) une preuve de concept (PoC) qui confirme qu'un hack BD-JB a été corrigé sur le firmware 8.00. Cela signifie tout simplement que le code peut permettre l'exécution native d'un exécutable sur le firmware 7.61 et inférieur, à condition de trouver les offsets adaptés. \n \n \n \n \n\n \n \n \n \n \nIl précise qu'il s'agit d'un exploit userland, et que donc la partie kernel n'est pas complète. Tout cela pourrait mener à l'exécution de fPKG PS4 sur PS5, tout comme cela est déjà possible sur firmware 4.03 et 4.50. \n \n \nC'est le 13 septembre 2023 que le firmware 8.00 a été lancé, venant donc corrigé le firmware 7.61 lancé le 11 août 2023.\n \nRecemment le programme bounty a récompensé TheFlow à hauteur de 500 $, probalement pas directement ce bug, peut être d'une moindre importance, que ce genre de bugs qui remporterait une récompense plus large. \n \n \nTout est là : twitter.com/theflow0/\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181551/in-ps5-les-ps5-avec-un-firmware-inferieur-au-800-seraient-hackables-1.png"
        }
    },
    "news_8": {
        "title": "[Switch] Les patchs signatures du 17.0.0 sont là",
        "content": "Dans la nuit sont tombés les patchs signatures pour le firmware 17.0.0. En raison de changements majeurs dans la conception et le fonctionnement du module FS, la mise à jour des patchs signatures pour le firmware 17.0.0 a pris du temps. \n \nMais voilà les nouveaux patchs signatures sont désormais bel et bien disponibles, la mise à jour de sys-patch a également été proposée dans la foulée. \n \n \n\n \n \n \nSys-patch (ITotalJustice) : https://github.com/ITotalJustice/sys-patch\n \nIPS_Patch_Creator (MrDude) : https://github.com/mrdude2478/IPS_Patch_Creator/releases\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1409470731.png"
        }
    },
    "news_9": {
        "title": "[Switch] switch_AIO_LS_pack 5.6.0 disponible [MAJ]",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.6.0.Pour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.Le homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables. Depuis cette news les évolutions sont les suivantes:- Changelog pour la version 5.5.0:Mise à jour du firmware inclue vers la version 17.0.0.Mise à jour d'Atmosphere et de Sys-patch vers la dernière version de ceux-ci.Suppression de Incognito-RCM, de PPlay et des overlays de SimpleModManager.Mise à jour de la documentation.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.20.03:Ajout d'une fonction permettant de réinitialiser la console (si exécution sur l'emunand cela réinitialisera l'emunand, si exécution sur la sysnand cela réinitialisera la sysnand).Correction d'un bug de détection d'un modèle de console.- Changelog pour la version 5.6.0:Mise à jour d'Atmosphere, du Homebrew Loader et du Homebrew Menu, de DBI et de Haku33 vers la dernière version de ceux-ci.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.30.00:Pour valider une réinitialisation de la console il faudra faire le combo de touches \"L+R+LT+RT+A\".Note: Pour traiter les problèmes particuliers de lancement de la sysnand en firmware 17.0.0 c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.Sauf pour la correction de bugs je pense que le homebrew AIO_LS_pack_Updater est arrivé plus ou moins à sa version final, cependant si vous avez des idées pour l'améliorer autres qu'une interface graphique n'hésitez pas à m'en faire part (consultez le readme du Github du projet pour voir les choses que je voudrais faire mais que je n'arrive pas à faire pour l'instant ou les choses que je pourrais faire mais la flemme, c'est dans la todo list), si vous êtes développeur et que vous voulez proposer des pull requests elles seront les bienvenues si elles respectent l'esprit du projet (du C si le C++ n'est pas indispensable, par exemple on évitera de faire appel à des modules en C++ pour la traduction que j'aimerai d'ailleurs faire en pur C car là elle utilise un vecteur qui est du C++ se qui me plaît déjà moyennement).N'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets.Pour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.Si vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_10": {
        "title": "[PS4] PS2-FPKG v0.7 Beta un tool indispensable",
        "content": "Vous qui aimez la PlayStation 2, vous qui aimez la PlayStation 4, voilà le meilleur des deux mondes, un outil qui renait un peu de ses cendres puiqu'il aura fallu attendre 3 années depuis la dernière mise à jour. \n \nPS2-FPKG développé par Jabu permet pour rappel de convertir les jeux au format ISO ou BIN PlayStation 2 à destination de la PlayStation 4. \n \nAvec de nombreuses options à la clé, cet outil permet de personnaliser le FPKG avec notamment la possibilité de modifier l'icône de jeu, l'écran de démarrage, il supporte la création de multidisques jusqu'à 5 ISO, de sélectionner votre propre texte / lua, ou encore le choix de l'émulateur à utiliser. \n \n \n \n\n \n \n \nIl est facile à utiliser, il suffit de :\n \n- Exécuter ps2-fpkg.exe\n- Sélectionner l'image ISO/BIN du jeu PS2 dans \"Disc1\".\n- Personnaliser quelques paramètres\n- Cliquez sur \"Create fPKG\" et choisissez un emplacement de stockage\n- Installez le fPKG créé sur votre PS4 et jouez.\n \nRemarque : pour les jeux sur CD (.bin), cliquez sur OUI lorsque l'on vous demande d'ajouter le secteur LIMG. Les jeux sur CD ne fonctionneront pas sans ce secteur. L'application sélectionnera automatiquement un fichier de configuration qui corrige généralement certains problèmes avec le jeu, mais seulement s'il en trouve un dans sa base de données.\n \n \nListe complète des changements dans la v0.7-Beta :\n \n- Tout a été réécrit à partir de zéro avec un code plus propre, plus rapide et moins merdique\n- Certains onglets ont de nouveaux noms, certaines options ont été déplacées, un dialogue FirstRun a été ajouté, etc.\n- Le code de création de pkg n'affiche plus d'erreur si le chemin de sortie contient des espaces (cette erreur était un échec épique depuis longtemps dans la v0.6).\n- L'application affiche maintenant un formulaire d'erreur avec des informations complémentaires lorsque la création de pkg échoue\n- Les patchs widescreen sont maintenant ajoutés en tant que trophy_data afin qu'ils n'entrent plus en collision avec d'autres scripts lua\n- Les scripts lua de fonctionnalités diverses comme l'avance rapide, la couleur personnalisée de la barre lumineuse et quelques autres ont été déplacés dans feature_data\n- Toutes les icônes/splashs du jeu sont maintenant converties nativement par l'application, il n'y aura plus d'erreur sur les systèmes qui n'aimaient pas ImageMagic\n- Il est maintenant possible d'activer/désactiver \"Reset on Disc Change\" lors d'un changement de disque.\n- Il est maintenant possible de désactiver MTVU, ce qui devrait aider certains jeux qui ne fonctionnent pas correctement avec l'émulation VU1 Multi-Threaded (comme Crash Nitro Kart, Gradius V, Timesplitters etc.)\n- Ajout d'une option pour désactiver le transfert VIF1 instantané, ce qui devrait corriger des jeux comme MK Shaolin Monks, Soul Calibur 2 et quelques autres.\n- L'application montre maintenant si elle a trouvé la configuration txt/lua/ps3 pour le disque sélectionné\n- Il est maintenant possible de sélectionner un scanline shader dans les options graphiques.\n- Il est maintenant possible de choisir si l'on veut avoir un MultiTap connecté\n- Il est maintenant possible de baisser le volume du jeu dans les paramètres\n- Ajout d'options de débogage/test et d'une visionneuse de configuration intégrée (lancez l'application avec l'argument cmd -test)\n- Beaucoup d'autres choses dont je ne me souviens plus, car tout a été réécrit.\n \n \nTéléchargement : PS2-FPKG v0.7 Beta\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181483/in-ps4-ps2-fpkg-v07-beta-un-tool-indispensable-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] Save Transfer Wizard v1.0.0 disponible",
        "content": "Le développeur Rajesh propose un nouvel outil à destination de la PlayStation 5, enfin pas directement, il s'agit d'un utilitaire PC qui va vous permettre de transférer facilement les sauvegardes entre votre PS5 et votre PC. \n \nLivré avec une interface sobre, il en dispose néanmoins des fonctions avancées, il vous permet de copier, télécharger, supprimer des sauvegardes via la connexion FTP. \n \n \n\n \n \n \nLa PlayStation est connue pour accepter le transfert de sauvegarde uniquement en étant connecté au compte utilisateur, mais avec un tel outil plus besoin de passer par le PSN, ce qui est particulièrement intéressant à un moment où les fPKG PS4 arrivent en masse. \n \n \n\n \n \nFonctionnalités\n- Outil FTP simple\n- Peut transférer des sauvegardes dans les deux sens\n- Parcourir et télécharger des sauvegardes\n- Plate-forme Windows\n \nLimites :\n- Ne fonctionne que sur Windows\n- Ne peut pas resigner les sauvegardes\n- Nécessité d'activer le FTP dans la console\n- Actuellement, les sauvegardes ne sont récupérées qu'à partir de \\Utilisateur\\home\\savedata\n \nTélécharger la sauvegarde du jeu :\n- Activer le FTP dans PS5\n- Saisir l'IP et le numéro de port de la console\n- Cliquer sur \"Obtenir des utilisateurs\".\n- Sélectionnez le profil de l'utilisateur dans la liste déroulante\n- Sélectionnez la sauvegarde que vous souhaitez télécharger\n- Cliquez sur \"Télécharger\".\n- Les sauvegardes seront téléchargées Desktop\\SaveTransfer\\Import\n \nUploader la sauvegarde du jeu :\n- Activer le FTP dans PS5\n- Saisir l'IP et le numéro de port de la console\n- Cliquer sur \"Obtenir des utilisateurs\".\n- Sélectionner le profil de l'utilisateur\n- Cliquer sur le bouton Upload\n- Parcourir le dossier et télécharger\n \nSupprimer la sauvegarde du jeu :\n- Activer FTP dans PS5\n- Saisir l'IP et le numéro de port de la console\n- Cliquer sur \"Obtenir des utilisateurs\".\n- Sélectionnez le profil de l'utilisateur dans la liste déroulante\n- Sélectionnez la sauvegarde que vous souhaitez supprimer\n- Cliquez sur Supprimer et confirmez\n- La sauvegarde sera supprimée.\n \n \nTéléchargement : Save-Transfer-Wizard v1.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181453/in-ps5-save-transfer-wizard-v100-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[PS5] La première version de PS5 Wee Tools disponible",
        "content": "Le développeur Andy_maN vient de mettre en ligne la première version de PS5 Wee Tools, comme vous le savez il s'agit d'un outil gratuit qui permet de réaliser sensiblement les mêmes choses que Nor Tool proposé par Better Way Electronics. \n \nIl s'agit d'un script python qui pour l'heure est assez limité dans son nombre d'options, il permet tout de même de connaitre les informations sur le dump de la NOR, comme le MD5, l'ID de la carte, le modèle, le SKU, la région, le numéro de série, l'id Kiban, le firmware actuel / minimum / usine, l'adresse MAC (LAN/Wifi) ou encore permet d'autres options pour activer/désactiver IDU (mode kiosque) et le type de modèle (avec lecteur optique ou numérique).\n \nCette version permet aussi bien entendu de réaliser des dumps, des extractions de partitions ou encore des contrôles basiques de validation. \n\n\n\n \nPS5-wee-Tools v0.1a\n- Nor dump info:\nMD5, Board ID, Model, SKU, Region, SN / Mobo SN\nKiban ID, FW (current/min/factory), MACs\n- Flags: kiosk mode (idu), model (disc/digital)\n- Extract NOR's partitions\n- Build dump from extracted files\n- Basic validation\n \n \nTéléchargement : PS5-wee-Tools v0.1a\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-607636849.png"
        }
    },
    "news_13": {
        "title": "[PS5] Qui est le développeur qui a trouvé les offsets du firmware 4.50 de la PS5",
        "content": "A la surprise générale, ce n'est ni Specter, ni sleirsgoevy, ni ChendoChap, ni TheFlow a qui l'on doit l'ouverture du firmware 4.50, voyons ensemble pourquoi et qui a réalisé cet exploit. \n \nComme nous pouvons le voir dans l'exploit sleirsgoevy, le crédit de l'ouverture du firmware 4.50 revient à un développeur nommé cheburek3000, qui est ce développeur ?\n \n \n \n\n \n \n \nUn petit nouveau ? \n \nOui et non, comment a-t-il fait son oeuvre, essayons d'y voir un peu plus clair. \n \nLe développeur cheburek3000 est peu connu de la scène, il semble être russe, et a proposé à la scène un outil nommé Meme_Dumper en Février 2023. C'est d'ailleurs la seule proposition qu'il a faite, du moins sous ce pseudo. \n \n \nComment a-t-il réussi ? \n \nIl semble s'être appuyé sur proper0gdb pour trouver les offsets ça c'est une chose mais en plus il semble avoir apporté une nouveauté. \n \nIl y a un aspect technique qui n'avait jusqu'alors pas été utilisé, le développeur sleirsgoevy l'a remercié pour l'accès à la mémoire physmem, une nouveauté qui jusqu'alors n'avait pas été envisagé ou trouvé. \n \nIl s'est probablement servi de son outil Meme_dumper qu'il a proposé en Février 2023, et que peu de développeur ont su exploité. \n \nEn trouvant les offsets du firmware 4.50 avec Meme_dumper, il prouve que son outil est plus qu'indispensable. \n \n \n \n\n \n \n \nSon outil Meme_Dumper permet à défaut d'accéder à la mémoire par l'adresse virtuelle, d'y accéder par l'adresse physique, qui est mappée sans aucune protection !\n \nAvec cette idée en tête, cet outil va faire tourner un serveur, qui va vous déverser presque toute la mémoire, qui serait normalement protégée de l'userland et du kernel.\n \nCette nouvelle procédure ouvre la voix à la découverte des offsets pour tous les autres firmwares exploitables, et peut être plus encore. Une solution qui a été proposée il y a plusieurs mois, mais qui aujourd'hui porte ses fruits ! \n \n \n \n \nFTPS5 1.3 parfaitement fonctionnel sous firmware 4.50 sur PS5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181346/in-ps5-qui-est-le-developpeur-qui-a-trouve-les-offsets-du-firmware-450-de-la-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1181346/in-ps5-qui-est-le-developpeur-qui-a-trouve-les-offsets-du-firmware-450-de-la-ps5-1.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1181346/in-ps5-qui-est-le-developpeur-qui-a-trouve-les-offsets-du-firmware-450-de-la-ps5-2.jpg"
        }
    },
    "news_14": {
        "title": "[Wii/NC] Swiss v0.6r1548 disponible",
        "content": "Le développeur Extrems propose une mise à jour de son outil Swiss afin d'apporter des corrections indispensables. \n \nComme vous le savez probablement Swiss est le digne successeur de SD-boot, il permet de lancer les homebrews GameCube mais aussi les backups stockés sur carte SD ou un disque dur, SDGecko, WODE, Wiikey Fusion et bien d'autres solutions. \n \n \n \n\n \n \n \nChangelog :\n \n- Une régression avec le SD2SP2 a été corrigée par la libogc2.\n- Mise à jour de la base de données No-Intro.\n- Changements pour corriger la panique pour le loader M.2.\n- Mise à jour de la base de données Redump.\n \nTéléchargement : Swiss GC\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181340/in-wiinc-swiss-v06r1548-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS5] Le firmware 4.50 supporté pour le hack ps5-kstuff (fPKG PS4)",
        "content": "Finalement c'est possible ! Voilà que les offsets du firmware 4.50 viennent à l'instant de tomber, cela signifie tout simplement que ps5-kstuff vient d'être porté pour fonctionner sur le firmware 4.50, rien que ça ! \n \nCela signifie aussi que les consoles PS5 qui vont pouvoir faire tourner le hack PS4 vont être beaucoup plus nombreuses que seules les consoles disposant d'un firmware 4.03. \n \n \n\n \n \nLes efforts commencent à payer, nous devons à priori les offsets du firmware 4.50 à cheburek3000. Dans quelques heures, tout cela va donc être mis à jour pour fonctionner sur 4.50.\n \nPour parler simplement, les fPKG PS4 peuvent désormais être installés et lancés sur le firmware 4.50 de la PS5 ! \n \n \nTout est là : ps5-kstuff offsets firmware 4.50\n \n \nLe développeur sleirsgoevy a mis à jour sa page host ici, et remercie cheburek3000 pour la technique d'accès au physmem et les offsets du firmware 4.50 : \n \nhttps://sleirsgoevy.github.io/ps4jb2/ps5-403/index.html\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181301/in-ps5-le-firmware-450-supporte-pour-le-hack-ps5-kstuff-1.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] Yuzu aussi a progressé en septembre 2023",
        "content": "Les développeurs de la Team Yuzu montrent aussi les progrès qu'ils ont fait durant le mois de septembre 2023. Il faut dire que durant l'été est souvent une période plus calme, la conséquence des vacances et des longues journées à bronzer . \n \nDepuis un certain temps, il est possible de charger les Miis par défaut dans les jeux supportés sur yuzu. Cependant, la mise en oeuvre du service Mii par Yuzu ne disposait pas du support nécessaire pour la base de données Mii.\n \nLa base de données Mii est un fichier enregistré sur la Switch pouvant contenir jusqu'à 100 Mii. Sans la prise en charge appropriée de cette base de données au sein du service Mii, il était impossible de charger vos Mii personnalisés.\n \n \n \n\n \n \n \nGrâce à un travail important, la Team Yuzu annonce qu'après avoir entrepris de porter une rétro-ingénerie complète sur le service Mii, que Yuzu supporte la possibilité de charger leurs propres personnages Mii dans n'importe quel jeu en plaçant le fichier de base de données de leur console dans %appdata%/yuzu/nand/system/save/8000000000000030/MiiDatabase.dat.\n \nUne fois le service Mii terminé et derrière lui, Narr retourna rapidement à la tâche consistant à faire fonctionner l'applet MiiEdit de manière transparente sur yuzu. Grâce à l'aide au dépannage de byte[] , il a finalement réussi à le faire fonctionner. La dernière pièce du puzzle consistait à compléter la prise en charge de la base de données Mii pour l'applet, et avec cet ajout crucial, la fonctionnalité Mii de yuzu est désormais plus robuste que jamais. Les utilisateurs peuvent désormais créer, modifier et stocker leurs Mii en toute transparence à l'aide de la nouvelle applet MiiEdit via Tools> Open Mii Editor, et les jeux peuvent générer automatiquement un Mii aléatoire pour les joueurs sans planter.\n \nAu délà de ça, Yuzu bénéficie désormais d'améliorations graphiques, sous Pikmin 4 , Mortal Kombat 1 et Sonic Forces sous Vulkan.\n \n \n \n\n \n \n \nAméliorer l'expérience Android est aussi l'un des objectifs de la team, qui a apporté de nombreuses corrections, mais la partie audio aussi a été optimisée, améliorant ausi la restitution des musiques et des voix, notamment dans New Super Mario Bros U Deluxe. \n \nD'autres changements sous le capot, comme pour VSync, Vulkan, ou encore l'amélioration du support implémenté du système de vérification simple NCA (Nintendo Content Archive), qui vérifie que les noms des fichiers NCA correspondent à leur contenu pour se prémunir contre la corruption du système de fichiers.\n \nL'équipe aborde encore quelques progrès notamment sur les drivers des GPU Adreno 700, 725 et 730, le pilote officiel Qualcomm a reçu quelques mises à jour, mais il continue d'être absolument terrible, il n'est encore pas envisageable ni recommandé de l'utiliser. \n \nL'article est disponible ici : yuzu-emu.org\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181299/in-switch-yuzu-aussi-a-progresse-en-septembre-2023-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS5] La version PS5 de Wee Tools en préparation",
        "content": "Le développeur Andy_maN est clairement en feu, il propose une nouvelle version de son script python PS4 Wee Tools, l'outil de manipulation de la mémoire NOR et Syscons de la PS4. \n \nIl propose en effet la version 0.9.2 de son outil avec des nouveautés importantes. \n \n \n\n \n \nChangelog 0.9.2 :\n \n- NOR : patch légitime rapide (glisser-déposer 2 dumps sur run.bat)\n- SC : autopatch fonctionne désormais avec n'importe quel* syscon\n- SC : correction d'un bug de la méthode B\n- SC : le patch manuel fonctionne désormais avec les flatdata\n- SC : affiche le compteur de lignes\n* pour ceux qui veulent tenter leur chance\n \n \nTéléchargement : PS4 Wee Tools 0.9.2\n \n \nMais énorme nouveauté, nous venons d'apprendre depuis quelques minutes qu'une version PS5 de Wee Tools est en préparation !\n \n \n\n \n \nLe développeur demande de lui livrer des dumps PS5 et des informations, alors si vous avez des dumps, il ne faut pas hésiter car la scène va passer à la vitesse supérieure avec l'arrivée de ce genre d'outils sur PS5.\n \nPour le moment, PS5 Wee Tools prend juste la forme d'un teasing en image de la version 0.1.0 qui permet quelques actions comme la possibilité de connaitre l'IDU, le modèle de PS5, l'extraction des partitions de la mémoire flash, ou encore de réaliser un dump de fichiers.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181263/in-ps5-la-version-ps5-de-wee-tools-en-preparation-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1181263/in-ps5-la-version-ps5-de-wee-tools-en-preparation-2.png"
        }
    },
    "news_18": {
        "title": "[Switch] Ryujinx progresse en septembre 2023",
        "content": "Le rapport de Septembre 2023 de Ryujinx vient de faire son apparition sur les serveurs de la Team en charge de son développement.\n \nAu programme, comme toujours un article profonds qui explique comment le programme progresse.\n \nSeptembre a été un mois inhabituellement calme pour la publication de jeux, le plutôt décevant remaster de Baten Kaitos , aux côtés d'un Mortal Kombat 1 douteux, avec des énormes chuttes de framerate. \n \nAinsi la mémoire tampon est très mal gérée dans ce jeu, qui a du mal à atteindre les 60 FPS.\n \n \n \n\n \nDes optimisations du jeu ont permis d'obtenir jusqu'à 46 % d'améliorations de restitution vidéo, mais il en faudra bien plus pour que le jeu soit parfaitement jouable, notamment des patchs du développeur. \n \nLe plus gros gagnant du mois est sans aucun doute R-Type Final 2, qui se voit passer de 8 FPS à 60 FPS (+750 % d'amélioration). \n \n \n\n \n \nD'autres jeux comme Super Bomberman R 2, sont directement jouables, si vous voulez en savoir davantage veuillez lire l'article ci-dessous. \n \n \nLien : blog.ryujinx.org/progress-report-september-2023\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2018076885.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-827943228.png"
        }
    },
    "news_19": {
        "title": "[3DS] MSET9 v1.1 disponible",
        "content": "Le développeur Zoogie propose une nouvelle version de MSET9 qui passe en v1.1.\n \nL'exploit principal MSET est du kernel ARM9 pour les firmwares 11.4 à 11.17 pour toutes les consoles de la famille Nintendo 3DS, il passe en v1.1. \n \nAu programme, le script mset9.py a été retravaillé, merci ToxicAven ! Et surtout nous bénéficions désormais d'une réduction de certains fichiers inutiles.\n \n \n \n\n \n \nTéléchargement : MSET 1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181207/in-3ds-mset9-v11-disponible-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] switch_AIO_LS_pack 5.4.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.4.0.Pour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.Le homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables. Depuis cette news les évolutions sont les suivantes:- Changelog pour la version 5.3.0:Mise à jour du firmware inclue vers la version 16.1.0.Ajout du homebrew SimpleModDownloader.Mise à jour de Hekate, d'Atmosphere, de Goldleaf et de DBI vers la dernière version de ceux-ci.Mise à jour des fichiers de patches pour NXThemesInstaller.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.20.00:Certains petits fichiers utilisés par l'application sont téléchargés en mémoire plutôt que sur la SD, ceci augmente la vitesse de traitement et réduit l'usage de la SD.Correction d'un bug qui faisait que l'installation du forwarder du homebrew était activée quoi qu'il arrive si l'installation du forwarder du Homebrew Menu était activée.- Changelog pour la version 5.4.0:Mise à jour de Hekate, d'Atmosphere, de NXThemesInstaller, de NXMP, de Status-monitor-overlay, de Lockpick-RCM, de ma version de Incognito-RCM et de ma version de TegraExplorer vers la dernière version de ceux-ci.Mise à jour des fichiers de patches pour NXThemesInstaller.Mise à jour du logo Switch pour le futur firmware 17.0.0.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.20.01:Correction d'un bug au niveau de la détection de mises à jour.Ajout dune protection durant l'extraction du pack pour éviter que l'extraction ne soit tentée si le fichier dans le zip n'a pas de nom car cela pourrait supprimer le contenu de toute la SD.Pour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.Note: Pour traiter les problèmes particuliers de lancement de la sysnand en firmware 17.0.0 j'ai donc mis à jour le pack en 5.4.0 plut tôt que prévu vu que le firmware 17.0.0 'est pas encore pleinement compatible avec toutes les fonctionnalités, cette version intégrant donc la nouvelle version 1.6.1 d'Atmosphere avec le pack on peut régler le souci facilement. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.Sauf pour la correction de bugs je pense que le homebrew AIO_LS_pack_Updater est arrivé plus ou moins à sa version final, cependant si vous avez des idées pour l'améliorer autres qu'une interface graphique n'hésitez pas à m'en faire part (consultez le readme du Github du projet pour voir les choses que je voudrais faire mais que je n'arrive pas à faire pour l'instant ou les choses que je pourrais faire mais la flemme, c'est dans la todo list), si vous êtes développeur et que vous voulez proposer des pull requests elles seront les bienvenues si elles respectent l'esprit du projet (du C si le C++ n'est pas indispensable, par exemple on évitera de faire appel à des modules en C++ pour la traduction que j'aimerai d'ailleurs faire en pur C car là elle utilise un vecteur qui est du C++ se qui me plaît déjà moyennement).N'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets.Si vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    }
}