{
    "news_1": {
        "title": "[Vita] AutoPlugin II v2.17 disponible",
        "content": "L'équipe ONElua vient de publier une nouvelle version d'AutoPlugin II qui est maintenant proposé en v2.17. Pour rappel, il s'agit d'un programme phare destiné à la PlayStation TV et à la PSTV, le logiciel AutoPlugin a été l'homebrew le plus téléchargés de la scène PlayStation Vita développé par theheroGAC et qui permettait d’installer facilement des plugins. L'équipe Onelua a ensuite repris le flambeau dans cette version II qui ajoute encore des caractéristiques plus complètes. \n \n \n\n \n \nDans cette nouvelle version, les plugins ef2uma et ef2xmc du custom firmware ARK-4 ont été ajoutés , tandis que le plugin Quick Menu Plus a été mis à jour vers la version 3.0.0, grâce au travail de GrayJack, basé sur le projet Cuevavirus original.\n \n \nTéléchargement : AutoPlugin II v2.17\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208975/in-vita-autoplugin-ii-v217-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PS4] PS4HEN Lite 2.2.0 disponible",
        "content": " \nLe développeur KrisztianKende propose PS4HEN Lite dans sa version 2.2.0, il s'agit là d'une version simplifiée de PS4HEN qui n'inclut que les fonctionnalités essentielles. Ce projet est basé sur Scene-Collective / ps4-hen et Scene-Collective / ps4-payload-sdk. Cette solution supporte les firmwares 5.05 à 12.02.\n \n \n\n \n \n \nCaractéristiques : \n \n- Homebrew Enabler\n- Jailbreak\n- Sandbox Escape\n- Debug Settings\n- VR Support\n- Remote Package Install\n- Rest Mode Support\n- External HDD Support\n- Bypass Firmware Checks\n- Debug Trophies Support\n- sys_dynlib_dlsym Patch\n- Never Disable Screenshot\n- Remote Play Enabler\n- Firmware Update Block\n- Disable ASLR\n \n \nTéléchargement : PS4HEN_Lite 2.2.0\n \n",
        "images": {}
    },
    "news_3": {
        "title": "[Switch] switch_AIO_LS_pack 5.19.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.19.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format).\nLe mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.19.0:\nDernier firmware compatible mis à jour en version 20.2.0.\nMise à jour d'Atmosphere, du module Ultrahand-ovlmenu, de Ultrahand-overlay, de Sphaira, de Edizon-overlay, de Goldleaf, de SimpleModDownloader, de NXDumpTool et de NXThemeInstaller vers la dernière version de ceux-ci.\nMise à jour des fichiers de patches pour NXThemesInstaller.\nNote: Pour traiter les problèmes particuliers de lancement de la sysnand en firmwares 17.0.0 et supérieurs c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.\nNote 2: Les problèmes de chauffe et de consommation excessive de la batterie qui peuvent se produire sur une minorité de consoles sur les firmwares 19.0.0 et supérieurs ne sont pas du fait du pack, cela semble venir du firmware mais on arrive pas à savoir vraiment de quoi et se qu'il faut faire pour corriger le problème.\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets. Pour cela nous avons mis en place un questionnaire de satisfaction, en plus de pouvoir reporter les problèmes sur Github ou sur le forum vous pouvez utiliser ce questionnaire pour nous donner vos opinions de façon anonyme (pour des problèmes spécifiques il vaut mieux reporter sur Github ou ouvrir un sujet sur le forum, il y aura une réponse bien plus rapide et cela permet de demander plus de détails pour identifier et peut-être résoudre le possible problème.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe et vous avez aussi un tutoriel plus détaillé sur cette page, d'ailleurs ce dernier site contient aussi pas mal de tutoriels notamment sur la Switch. Enfin si vous souhaitez voir le changelog complet du pack il est consultable ici pour la version stable et ici pour la version beta.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_4": {
        "title": "[Switch] NxNandManager compatible avec le firmware 20.3.0",
        "content": "Le développeur THZoria dégaine aussi vite que son ombre le support du firmware 20.3.0 pour l'adaptation de NXNandManager.\n \nL'arrivée d'un nouveau firmware change beaucoup trop d'éléments pour que les homebrews et autres utilitaires puissent continuer de fonctionner sans une adaptation de certains offsets. Le développeur a donc modifié le NCA afin qu'il puisse s'adapter aux changements du firmware 20.3.0. \n \nComme vous le savez NxNandManager  est un utilitaire dont le but principal est de copier le contenu de Nintendo Switch (NAND complet ou une partition spécifique) vers / depuis un fichier ou un lecteur physique, cependant il faut le mettre à jour à chaque arrivée de nouveau firmware. \n \n \n\n \n \n \nChangelog \n \n\n- Mise à jour du NXNandManager 20.3.0\n- Modification du nca pour refléter les changements du firmware 20.3.0\n \n\n \nTéléchargement : NxNandManager 20.3.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208955/in-switch-nxnandmanager-compatible-avec-le-firmware-2030-1.png"
        }
    },
    "news_5": {
        "title": "[Switch 1&#38;2] Nintendo sort le firmware 20.3.0 pour la Switch 1 et 2",
        "content": " \nLes mises à jour système pour la Nintendo Switch 2 et la Nintendo Switch de première génération se succèdent, voilà que débarque déjà le firmware 20.3.0, cette mise à jour déployée pour les deux consoles est censée apporter plus de stabilité système. \n \n \n\n \n \n \nL'idée de ces firmwares est essentiellement d'apporter le support de titre Switch 1 sur la Switch 2, plus d'une vingtaine de jeux ont été rajoutés sur la dernière update afin d'en assurer la rétrocompatibilité. \n \nLa mise à jour d'aujourd'hui devrait se télécharger automatiquement en arrière-plan pour la plupart des utilisateurs. Vous serez ensuite invité à redémarrer votre système pour terminer l'installation.\n \nTHZoria propose le firmware ici.\n \nLe rapport se trouve ici :  https://switchbrew.org/wiki/20.3.0\n \n \nLes System Titles suivants ont été mis à jour :\nSystemData (non-sysver) : BrowserDll, 0100000000000859.\nApplets : LibAppletWeb, LibAppletShop, LibAppletOff, LibAppletLns, LibAppletAuth.\nChangements NPDM (en plus de l'habituel saut de version) : aucun.\n \nChangements RomFs :\n \nBrowserDll : \"/buildinfo/buildinfo.dat\" mis à jour, \"/nro/netfront/core_3/default/cfi_enabled/webkit_wkc.nro.lz4\" mis à jour\nSystemVersion : Tous les fichiers ont été mis à jour.\nLibAppletWeb/LibAppletShop/LibAppletOff/LibAppletLns/LibAppletAuth : Tous les fichiers ont été mis à jour.\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1206807871.jpg"
        }
    },
    "news_6": {
        "title": "[PS4] Une interface pour EzPPPwn sur PS4",
        "content": "Le développeur ItsJokerZz, que l'on connait déjà pour des propositions pour PSP, Vita et PS3 comme des forks de PKGi avec notamment FPKGi, propose une interface visant à moderniser l'utilisation et l'exécution de l'exploit PPPwn dans sa version CPP sur PS4 et PS4 Pro. \n \nSon application a pour ambition d'offrir une interface simple d'utilisation pour permettre à l'utilisateur peu expérimenté d'agir sur les paramètres de l'exploit. \n \nEzPPPwn va vous permettre de charger les payloads GoldHEN, VTX ou PS4-HEN, ainsi que les stage2 personnalisés, le tout avec une comptabilité avec le mode backend PPPwn C++, qui peut être activé simplement avec une bascule, profitant également d'option de redémarrage. \n \n \n\n \n \nEzPPPwn supporte l'ensemble des firmwares compris entre le 7.00 et le 11.00, il est dommage que les firmwares un peu plus anciens, de type 5.05 ne soit pas officiellement supportés. \n \n \nFirmwares supportés : \n \n7.00 / 7.01 / 7.02 /7.50 / 7.51 / 7.55\n8.00 / 8.01 / 8.03 / 8.50 / 8.52\n9.00 / 9.03 / 9.04 /9.50 / 9.51 / 9.60\n10.00 / 10.01 / 10.50 / 10.70 / 10.71\n11.00\n \n \n \nTéléchargement : EzPPPwn v1.0\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208924/in-ps4-une-interface-pour-ezpppwn-sur-ps4-1.png"
        }
    },
    "news_7": {
        "title": "[PS4] GoldHEN  v2.4b18.5 bêta publique disponible",
        "content": " \nLe développeur SiSTRo dévoile une nouvelle version de son payload magique GoldHEN qui est désormais  proposé en v2.4b18.5, mais attention il s'agit là d'une version bêta et non d'une version finale. \n \nEncore et toujours GoldHEN est le must-have de la PS4, cette nouvelle version apporte le support des tout derniers firmwares intégré dans les hack PS4. \n\n \nChangelog :\n \n- Ajout du support pour 7.0x, 7.5x, 8.0x, 8.5x, 9.0x, 9.5x, 11.0x, 11.5x\n- Ajout de la prise en charge des statistiques de jeu\n- Ajout de la mise à jour automatique de la date et de l'heure\n- Amélioration du serveur BinLoader (support ELF)\n \n \nTéléchargement : GoldHEN  v2.4b18.5 bêta publique\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208902/in-ps4-goldhen-v24b185-beta-publique-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[PS4] GoldHEN stage2 v1.05 disponible",
        "content": "Le développeur SiSTR0 marque une nouvelle fois l'histoire de la scène PS4, il dévoile en effet une nouvelle version du fichier stage2 pour GoldHEN et Ps4debug qui supporte désormais les derniers firmwares PS4.\n \nCe loader ne prend en charge que les payloads avec un point d'entrée au kernel. \n \nLa version personnalisée de stage2 recherche d'abord le payload dans le répertoire racine de la clé USB et, si elle est trouvée, elle est copiée sur le disque dur interne à ce chemin : /data/GoldHEN/payloads/goldhen.bin. Le payload interne est ensuite chargé et n'est plus nécessaire sur la clé USB externe.\n\n \nBien entendu cela fonctionne avec PPPwn, mais aussi avec GoldHEN et Ps4debug qui vont être rapidement proposé. \n \n \n \nTéléchargement : GoldHEN stage2 v1.05\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208876/in-ps4-goldhen-stage2-v105-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[XB360] X360 PluginManager v2.0.0 disponible",
        "content": " \nUne nouvelle mise à jour pour X360PluginManager a été publiée , l'outil nous permet de charger des plugins sur Xbox 360 via l' exploit BadUpdate.\n \nL'exploit BadUpdate ne prend pas en charge le chargement de certains plugins, du fait de son fonctionnement particulier, et pour diverses raisons liés à son lancement, et bien avec X360PluginManager il est possible d'en charger depuis le périphérique USB logé dans le premier slot. \n \nDans cette nouvelle version 2.0.0, l'interface graphique a été entièrement renouvelée, remplaçant AtgFramework par ImGui, et supprimant le lien direct avec le fichier de configuration : désormais la sélection des plugins à charger ou à désactiver se fait via une liste interactive avec des cases à cocher visibles dans l'interface.\n \nCette solution améliore non seulement la convivialité, mais rend également la gestion des plugins plus simple.\n \n \n\n \n \n \nInstallation :\n \n- Téléchargez et extrayez l'archive X360PluginManager.zipsur votre PC.\n- Modifiez le fichier X360PluginManager\\config.inien fonction de vos besoins.\n- Déplacez le dossier X360PluginManagervers la console.\n- Lancez X360PluginManager\\default.xex.\n \nAttention, les plugins ne peuvent être chargés ou déchargés qu'à partir du disque dur, pas à partir d'une clé USB, la racine du disque dur est affichée comme hdd:.\n \nChangelog : \n \n- Remplacement d'AtgFramework par ImGui pour améliorer l'interface utilisateur.\n- Suppression de l'utilisation du fichier de configuration pour sélectionner les plugins à charger ou à décharger, désormais géré via une liste de cases à cocher dans l'interface.\n \n \n \nTéléchargement : X360PluginManager v2.0.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208859/in-xb360-x360-pluginmanager-v200-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS3] PS3 4K Pro Lite 5.6.4 disponible",
        "content": " \nLe développeur LaunTeles continue de faire progresser sa solution PS3 4K Pro Lite qui est maintenant livrée depuis hier en version 5.6.4, comme vous le savez il s'agit là d'une interface utilisateur permettant d'amener de nouvelles fonctionnalités à la PS3, en plus de toutes celles déjà présentes dans un CFW par exemple.\n \n \n\n \n \n \nAu programme pas mal de nouveautés : \n \n- PS3 Pro est désormais le nom par défaut\n- Correction du bug Cbomb / CMOS Bomb (CFW uniquement)\n- Bypass pour la connexion au PSN™\n- Décryptage à la volée pour les ISO 3Key/Redump (HEN)\n- Bascule vers les Debug Settings (variantes CEX/DEX/AvTool)\n \n \nCompatibilité :\n \n- Firmware personnalisé (CFW) 4.84 à 4.92\n- Firmware hybride (HFW) 4.86 à 4.92\n \n \nChangelog 5.6.4 \n \n- Corrigé : Logos HEN.\n- Correction : Problème lorsque le dossier PS3XPLOIT est supprimé.\n- Ajouté : Bypass pour la signature dans PSN™ sur n'importe quelle version de firmware. (CFW uniquement)\n- Ajouté : Correctif CMOS Bomb pour toutes les versions de firmware. (CFW uniquement)\n- Ajout d'un serveur de mise à jour personnalisé.\n- Ajouté : Mise à jour du système de débogage pour tous les TargetIDs.\n- Ajouté : Affichage du firmware minimum installable lors de la mise à jour du système.\n- Ajouté : Contrôle du ventilateur dans ps2_gxemu.self. (CFW uniquement)\n- Ajout d'une catégorie de correcteurs de jeux dans le dossier Homebrew.\n- Ajouté : Gestionnaires de pochettes de jeux, de fichiers de configuration et de clés Libcrypt. (Premium uniquement)\n- Ajout de nombreux serveurs personnalisés pour les jeux en ligne.\n- Ajouté : Nouveaux jeux inédits.\n- Ajouté : Décryptage à la volée pour les ISO 3Key/Redump. (HEN)\n- Ajouté : Outils de sécurité. (HEN uniquement)\n- Ajouté : Les variantes Toggle Debug Settings (CEX/DEX/AVTool). (HEN)\n- Correction : Problème lors du basculement des éléments XMB™. (Premium Only)\n- Corrigé : Informations manquantes dans certains éléments du gestionnaire de données de jeu. (Premium Only)\n- Amélioré : Les dossiers contenant un grand nombre d'éléments affichent désormais un maximum de 1024 entrées pour éviter un chargement infini.\n- Amélioration : Mise à jour de la source HEN vers la dernière version.\n- Amélioré : Stabilité de HEN lors de l'utilisation de plugins personnalisés.\n- Amélioration : Les variantes de Sysconf ont été corrigées pour recharger la colonne Network. (Le serveur de médias y a été déplacé).\n- Global : PS3™ Pro est maintenant l'option et le nom par défaut.\n \n \nTéléchargement : PS3 4K Pro Lite 5.6.4\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208849/in-ps3-ps3-4k-pro-lite-564-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] Un outil PS5 pour les DLC PS4",
        "content": "Le développeur Pimas1483, utilisateur de Reddit.com, propose un nouvel outil à destination des détenteurs de PS5 permettant de profiter des jeux PS4, et notamment de leur DLC. \n \nSon outil, ou plutôt sa Toolchain, fonctionne au travers d'un fichier exe permettant en un clic de corriger les DLCs sur PS5 sur les FPKGs Ps4. Le programme permet de fusionner, en une seule opération, plusieurs DLC de FPKG, avec le dernier patch disponible. \n \n \n \n\n \n \nVous n'avez qu'à fournir le patch PATCH.PKG , un jeu de base en BASE.PKG et un dlc en DLC.PKG, l'outil fera le reste en utilisant toutes les bases existantes de CyB1K, Idlesauce et xSpecialFoodx.\n \n \n \n\n \n \nComme vous vous en doutez derrière il y a de nombreux outils, orbis-pub-cmd.exe, qui va convertir l'exécutable eboot.bin du format SELF au format ELF avec SelfUtil, il va appliquer les correctifs au contenu téléchargeable avec ps4-eboot-dlc-patcher, régénère le projet GP4 avec gengp4_patch.exe, tout ça pour créer un PKG avec le DLC intégré.\n \n \nTéléchargement : ps5-dlc-toolchain\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208844/in-ps5-un-outil-ps5-pour-les-dlc-ps4-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1208844/in-ps5-un-outil-ps5-pour-les-dlc-ps4-1.jpg"
        }
    },
    "news_12": {
        "title": "[PS4/PS5] En route vers un nouvel exploit kernel sur PS4 ou PS5",
        "content": "Un nouveau rapport vient d'être publié sur HackerOne et il a conféré une prime de 10 000 $ à un développeur répondant au nom de SlidyBat. Ce bug qui a été rapporté dans la branche PS4 / PS5 est probablement un exploit majeur, le fait de bénéficier d'une prime aussi importante est souvent la résultante d'un exploit kernel. \n \n \n\n \n \nCe développeur SlidyBat avait déjà été primé il y a une année pour la même somme, le développeur Zecoxao pense qu'il pourrait s'agir un exploit sur le firmware 11.60 sur la PS5, ou bien même un exploit sur le firmware bêta 12.00 qui n'a pas encore été publié. D'autres suputent qu'il pourrait s'agir du firmware 12.50 de la PS4, la difficulté est que contrairement à TheFl0w, SlidyBat ne dévoile pas ses rapports. \n \n \n \n\n \n \n \n \nTout est là : HackerOne.com\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208805/in-ps4ps5-en-route-vers-un-nouvel-exploit-kernel-sur-ps4-ou-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1208805/in-ps4ps5-en-route-vers-un-nouvel-exploit-kernel-sur-ps4-ou-ps5-2.png"
        }
    },
    "news_13": {
        "title": "[3DS/2DS] Red Viper 1.0.0 disponible",
        "content": "Il y a 30 ans jour pour jour, le Virtual Boy sortait au Japon. Quel meilleur moment pour sortir une grosse mise à jour de Red Viper, voici la version 1.0.0 de l'émulateur dédié à la console Virtual Boy de Nintendo, une série d'améliorations et de corrections de bugs, ces mises à jour font de Red Viper l'émulateur Virtual Boy le plus précis à ce jour.\n \n \n \n\n \n \nChangelog v1.0.0 : \n \n- Nouveau mode « Multicolore », permettant un remappage des couleurs plus polyvalent\n- Prise en charge du Circle Pad Pro\n- Logiciel de rendu pour réduire les problèmes visuels, activé dans Golf\n- Double mise en mémoire tampon pour masquer les trames indésirables et améliorer la précision du temps d'image, activée dans Red Alarm et Bound High\n- De nombreuses améliorations des performances\n- En particulier, la vérification des interruptions a été déplacée d'un système basé sur des sondages vers la prédiction exacte du moment où la prochaine interruption se déclenchera, améliorant ainsi les performances, en particulier dans l'introduction de Space Invaders.\n- Une ROM peut être fournie avec un Red Viper CIA, pour créer ce que l'on appelle communément un « forwarder »\n- Un code d'erreur s'affiche désormais lorsque le chargement d'une ROM échoue\n- Correction de « Rejeter » qui ne restaure pas correctement les paramètres pour New 3DS Speedup\n- Correction de problèmes graphiques occasionnels sur l'écran tactile lors de l'activation du menu d'accueil\n \nLe mot du développeur : \n \nLors de la sortie initiale de Red Viper, j'ai choisi la version 0.9.0, indiquant que, malgré quelques problèmes de compatibilité, la situation était presque terminée. J'ai décidé de passer à la version 1.0.0 une fois que tous les jeux officiellement sortis fonctionneraient à des vitesses jouables, sans bugs ni ralentissements majeurs. Les optimisations apportées par cette mise à jour permettent d'optimiser l'intro de Space Invaders et de corriger les bugs de rendu et les saccades audio dans Golf. C'étaient les dernières améliorations importantes (et je n'aimais pas le fait qu'elle se rapproche de la version 0.9.10), donc je suis content de l'appeler v1.0.0.Ce nouveau numéro de version ne signifie pas que j'ai terminé les mises à jour de cet émulateur : certains homebrews ne sont pas encore totalement compatibles, et il y a encore des fonctionnalités que j'aimerais implémenter. À bientôt !\n \n \nTéléchargement : Red Viper 1.0.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208798/in-3ds2ds-red-viper-100-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[PS4] PS4PKGinstaller v1.07 disponible (edit 25.07.25)",
        "content": " \nLe développeur CiborgEC vient de déployer une nouvelle version de PS4PKGinstaller qui est maintenant livré en v1.06. \n \n \n\n \n \nNouveautés : \n \n- Lors de l'installation d'un seul pack de jeu de base, vous pouvez choisir d'installer les mises à jour et les DLC (corrigé). \n- Les packs déjà installés s'afficheront. \n- L'arabe est en cours de développement (il est déjà proposé en EN, ESP, PT, FR, IT, DE), un fix est disponible ici : https://www.mediafire.com/file/pa5cfgewovwtwc1/CiborgEcPKGMAN-V1.06.2_Arabic_Fix.pkg/file\n \n \n\n \n \n \nTéléchargement : PS4PKGinstaller v1.07\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208797/in-ps4-ps4pkginstaller-v106-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[PSP/Vita/PS3] Xenity Engine 1.0.0 disponible après 3 ans de développement",
        "content": " \nAprès plus de trois ans de travail passionné, Fewnity publie la version 1.0.0 de Xenity Engine présenté au travers de son site, son moteur de jeu open‑source inspiré de Unity et multiplateforme destinée aussi bien aux développeurs rétro que modernes, il prenant en charge Windows, la PSP, la PS Vita et et la PS3 en natif. \n \n \n\n \n \nLes principales nouveautés signalées par Fewnity et confirmées par plusieurs sources sont :\n \n- Système GameObject/Component hérité de Unity : une architecture familière et flexible pour les développeurs\n- Support complet des plateformes (2D, 3D, audio 2D/3D, physique, réseaux, compilation à chaud), mis en lumière dans les notes officielles de la release\n- Éditeur convivial avec débogage, logging et profiling, notamment pour Windows et consoles grâce à Docker \n \n \n \n\n \n \n \nLa release, datée du 14 juillet 2025, comprend un fichier zip de 12,5 Mo, disponible sur GitHub, ModDB et IndieDB, ce nouveau moteur de jeu open‑source est taillé pour la PSP, la PS Vita, la PS3 et un PC sous Windows.\n \n \n\n \n \nIl s’agit d’un ambitieux projet marquant l'aboutissement de trois années d'efforts, parmi les projets d’exemple, on trouve des jeux de plateforme, un jeu de cuisine et un mini jeu de voitures, , parfaits pour prendre en main l’API.\n \n \n\n \n\n \n \nCe que cela signifie pour les développeurs :\n \n- Ouverture totale : sous licence MIT, chacun peut contribuer, forker et adapter Xenity selon ses besoins.\n- Rétro + modernité : la compatibilité avec les consoles Sony classiques permet de créer des titres homebrew puissants sans repartir de zéro comme avec certains petits frameworks \n- Montée en puissance rapide : compilation en temps réel, intégrations audio/physique, UI, débogage… un véritable coup de boost pour les développeurs ambitieux.\n \n \nComment démarrer ?\n \n- Rendez-vous sur la page GitHub de Fewnity/Xenity‑Engine.\n- Téléchargez le zip de la version 1.0.0 (release du 14 juillet 2025).\n- Consultez les instructions d’installation (Visual Studio 2022 requis, configuration Docker pour les consoles) disponibles dans la documentation \n- Testez les exemples fournis (plateforme, nano-voiture, cooking game) \n \nEn résumé, Xenity Engine 1.0.0 est une étape majeure pour la scène homebrew, combinant puissance moderne et nostalgie des consoles Sony. Si vous rêvez de développer un jeu “à l’ancienne” avec des outils contemporains, c’est le moment de plonger.\n \n \nTéléchargement : Xenity-Engine v1.0.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208768/in-pspvitaps3-xenity-engine-100-disponible-apres-3-ans-de-developpement-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1208768/in-pspvitaps3-xenity-engine-100-disponible-apres-3-ans-de-developpement-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1208768/in-pspvitaps3-xenity-engine-100-disponible-apres-3-ans-de-developpement-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1208768/in-pspvitaps3-xenity-engine-100-disponible-apres-3-ans-de-developpement-4.png"
        }
    },
    "news_16": {
        "title": "[WiiU] L'exploit coldboot &#34;Paid the Beak&#34; dévoilé pour la Wii U",
        "content": " \nUn nouvel exploit coldboot de la Wii U, appelé « Paid the Beak », vient d'être publié . Il exploite une faille dans SDBoot1 pour exécuter du code non signé. Cet exploit peut être utilisé pour réparer des bricks, entre autres.\n \n \n\n \n \nSDBoot1 est une fonction utilisée en usine pour réparer la console et configurer le système initial de la Wii U. Pour déclencher SDBoot1, l'indicateur « UNSTBL_PWR » doit être activé, ce que Nintendo a fait à l'aide d'un « jig de batterie » ; vous pouvez voir une build similaire dans l'image ci-dessus. \n \n \n\n \n\n \n \nDéveloppé par une équipe de codeurs comprenant DeadlyFoez , Rairii , Kelly et Jan-Hofmeier, cet exploit se base sur une vulnérabilité au travers du logement de la pile CR2032 de la Wii U et peut être émulé avec un Raspberry Pi Pico ou un PICAXE 08M2 . Cependant, l'exploit nécessite une carte SD d'une capacité inférieure ou égale à 2 Go, et il faudra donc disposer d'une \"Battery Jig\" , un petit accessoire qui s'insère dans le logement de la pile CR2032 de la Wii U.\n \n \n\n \n \nUne vidéo est disponible sur YouTube, elle montre le texte complet, les explications et le logiciel nécessaire qui sont disponibles sur ConsoleBytes.com . Le code est également disponible sur GitHub, il permet de générer le flag UNSTBL_PWR qui permet de lancer le coldboot. \n \n \n \n\n \n \n \n \nTéléchargement : paid the beak sur Wii U\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1666598119.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1208767/in-wiiu-lexploit-coldboot-paid-the-beak-devoile-pour-la-wii-u-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1208767/in-wiiu-lexploit-coldboot-paid-the-beak-devoile-pour-la-wii-u-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1208767/in-wiiu-lexploit-coldboot-paid-the-beak-devoile-pour-la-wii-u-3.png"
        }
    },
    "news_17": {
        "title": "[PS5] PS5 Save Mounter supporte de nouveaux firmwares",
        "content": "PlayStation 5 Save Mounter vient d'être mis à jour par n0llptr, pour rappel, il s'agit d'un outil proposé à l'origine par ChendoChap, un utilitaire d'édition est un assistant d'enregistrement. Vous pouvez créer, modifier, déchiffrer des sauvegardes de votre PlayStation, exactement comme un éditeur, pour par exemple pour gagner plus d'argent, des munitions ou augmenter les statistiques de vos personnages. \n \n \n\n \n \n \nA la base, il n'était proposé que pour la PS4, puis en début d'année 2025, les développeurs l'ont porté sur PS5, la version 1.4.5 apporte le support de nouveaux firmwares. Le développeur a en effet ajouté le support des firmware 5.50 et 7.20.\n \n \nTéléchargement : PS5 Save Mounter v1.4.5\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208750/in-ps5-ps5-save-mounter-supporte-de-nouveaux-firmwares-1.png"
        }
    },
    "news_18": {
        "title": "[Wii/GC] Swiss v0.6r1889 disponible",
        "content": " \nLe développeur Extrems vient de mettre en ligne une version importante de son outil Swiss, et il faut avouer qu'il n'a pas fait semblant, les nouveautés sont très nombreuses, la version précédente ayant été proposée il y a un peu moins de 2 mois. \n \nSi vous possédez un GC Loader HW1, les versions Swiss v0.6r1695 à v0.6r1867 contiennent un bug qui peut bloquer votre appareil. Veuillez cesser immédiatement d'utiliser ces versions !\n \n \n\n \n \nChangelog : \n \n- Mise à jour de la base de données de la collection [T-En].\n- Correction du problème avec le statut DTV forcé.\n- Afficher le mode vidéo effectif dans les paramètres.\n- Premier passage au regroupement de licences.\n- Mettre à jour FatFs vers R0.15b.\n- Synchronisation des modifications FatFs.\n- Tentative futile de démonstration de la fausseté.\n- Mettre à jour README.md\n- Amélioration de la prise en charge des exécutables en mode réel.\n- Assurez-vous que le cache verrouillé est désactivé.\n- Mettre à jour la base de données Redump.\n- Ajout du serveur USB Gecko wiiload.\n- Ajout de l'option pour attendre USB Gecko.\n- Ignorer le changement de type de sortie pour AVE-RVL.\n- Supposons que TDEV ait AVE N-DOL.\n- Effacement du flag du mode 60 Hz pour les jeux NTSC.\n- Synchronisation des flags du mode 60 Hz et progressif sur Wii.\n- Ignore l'invite du mode progressif pour le mode automatique 480p/576p.\n- Ajout d'une info-bulle pour forcer le filtre vertical.\n- Clarification de la compatibilité entre GCDigital et RetroTINK-4K.\n- Supprimez le référentiel devkitPro Apt du conteneur.\n- Empêche le blocage du chargeur GC HW1 lors de la tentative de navigation sur les périphériques FlippyDrive.\n \n \nTéléchargement : Swiss v0.6r1889\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208748/in-wiigc-swiss-v06r1889-disponible-1.jpg"
        }
    },
    "news_19": {
        "title": "[Switch] MissionControl v0.13.3 disponible",
        "content": " \nLe développeur ndeadly propose la 29 ème version de MissionControl qui a été mise en ligne il y a quelques jours, un peu plus de deux mois après la version précédente. Cette version prend en charge le firmware 20.2.0 et corrige un problème lié aux correctifs exef Bluetooth sur les firmwares 20.xx. \n \n \n\n \n \nChangelog :\n \n- Ajout de la prise en charge du firmware 20.2.0\n- Correction des offsets incorrects dans les correctifs exefs pour 20.xx affectant l'appairage du contrôleur Xbox Elite v2\n \n \nTéléchargement : MissionControl v0.13.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208747/in-switch-missioncontrol-v0133-disponible-1.jpg"
        }
    },
    "news_20": {
        "title": "[Vita] Vita Moonlight 0.13.1 disponible",
        "content": "Déployé à l'origine par xyzz, Vita Moonlight continue d'évoluer sous le clavier AorsiniYT, mais la qualité de développement reste la même le soft continue de proposer de la nouveauté. Pour rappel, ce logiciel est basé sur nVidia Gamestreams s'agissant d'un homebrew vous aurez besoin d'une PlayStation Vita avec HENkaku et VitaShell d'installés, d'un client FTP et surtout votre ordinateur devra être sous Windows et être équipé d'une carte graphique nVidia (minimum GTX 650).\n \nIl a introduit il y a quelques jours la branche 0.13 de ce logiciel, avec des évolutions majeures notamment avec cette nouvelle version 0.13.1, l'interaction d'une Dual Shock 4, son émulation a été améliorée, ainsi que le réveil via le LAN (Wake-on-LAN). \n \n \n\n \n \n \nPrincipales caractéristiques\n \nModes d'écran tactile unifiés\n- Vous pouvez désormais choisir entre trois modes d'écran tactile : DS4 Touchpad, Absolute Mouse et Tablet (Sunshine) dans le menu des paramètres.\n \nÉmulation du pavé tactile DS4\n- L'écran Vita peut agir comme un pavé tactile multitouch de style DualShock 4, compatible avec les gestes et les commandes avancées dans les jeux et Steam Input.\n \nIntégration du Wake-on-LAN (WOL) :\n- le Wake-on-LAN est désormais entièrement intégré au menu de gestion de l'hôte, ce qui vous permet d'allumer votre PC distant depuis la Vita en utilisant l'adresse MAC enregistrée et l'adresse de diffusion calculée automatiquement. (N'oubliez pas de réappairer l'hôte pour qu'il enregistre l'adresse MAC, sinon il vous indiquera qu'elle n'est pas enregistrée.)\n \nRefonte des raccourcis\n- Tous les raccourcis ont été divisés en fichiers sources individuels pour une meilleure organisation du code et une meilleure maintenabilité.\n \nAméliorations de base\n- Sensibilité du pavé tactile DS4\nLe mode pavé tactile DS4 est désormais plus sensible et précis pour une expérience plus fluide.\n- Gestion de l'adresse MAC de l'hôte\nL'adresse MAC de l'hôte est désormais enregistrée et chargée correctement à partir du fichier device.ini.\n- Débogage des paquets WOL\nAjout d'un script Python (wol_sniffer.py) pour recevoir et vérifier les paquets Wake-on-LAN sur le réseau, utile pour tester sans éteindre le PC.\n- Interface utilisateur et retour visuel :\nCorrections mineures de l'interface utilisateur et amélioration du retour visuel dans le menu de gestion des hôtes. La navigation dans le menu de gestion des hôtes a été améliorée (retour à la case « O/annuler ») et l'affichage de l'état est unifié et plus clair.\n- Correction des pressions fantômes sur les boutons :\nCorrection d'un problème où des pressions fantômes sur les boutons pouvaient se produire lors de la gestion des superpositions et des raccourcis. L'état des boutons est désormais correctement réinitialisé et restauré.\n \nSous le capot\n- Les combos comme L1+L2 et R1+R2 fonctionnent désormais correctement même lorsqu'ils sont utilisés avec l'écran tactile ou le backtouch.\n- En mode tactile absolu, les superpositions de boutons spéciaux n'interfèrent plus avec la saisie tactile, permettant un véritable toucher absolu et rendant tous les coins de l'écran utilisables.\n- De nombreuses corrections de bugs, nettoyages de code et refactorisations internes pour la stabilité et la maintenabilité.\n \n \n \n \nTéléchargement : Vita Moonlight 0.13.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208738/in-vita-vita-moonlight-0131-disponible-1.png"
        }
    }
}