{
    "news_1": {
        "title": "[Switch] Hekate v6.1.0 et Nyx 1.6.0 disponibles",
        "content": "Le développeur CTCaer propose une nouvelle version d'Hekate qui passe en 6.1.0 et de Nyx qui lui passe en 1.6.0. \n \n \n\n \n \nCorrection d'un problème où l'analyse de l'offset de secteur emuMMC échouait si la carte SD était plus grande que 1TB.\nChangements L4T et ARC :\nPermettre à la partition de démarrage d'être exFAT\nCela nécessitera une mise à jour de la pile de démarrage des différentes versions de L4T. C'est surtout important pour Lakka et pour les utilisateurs qui ne veulent pas formater.\nDes changements significatifs ont été apportés à Arachne pour l'optimisation de la mémoire vive afin d'augmenter les performances et la stabilité.\nPlusieurs timings ont été améliorés et corrigés pour T210/LPDDR4 et T210B01/LPDDR4X.\nLa stabilité a été améliorée pour des fréquences plus élevées pour T210/LPDDR4.\nCela affecte également de manière significative les modules de mémoire vive à haute densité, comme dans les configurations de 8 Go.\nDe plus, ils peuvent être améliorés avec le mode ram_oc_opt ac.\nCorrection d'un problème où la réduction du timing n'était parfois pas autorisée à 1600 MHz.\nUn nouveau paramètre ram_oc_opt= a été ajouté pour prendre en charge la configuration avancée de l'occlusion de la ram pour les T210 et T210B01.\nPrincipalement pour les utilisateurs de T210/LPDDR4 à cause des basses fréquences et d'autres qui aiment optimiser (T210B01/LPDDR4X).\nPlus d'informations dans le wiki.\nLa limite de tension maximale de ram_oc_vdd2 a été augmentée à 1237mV pour T210. T210B01 reste à la limite Jedec de 1175mV.\nCorrection d'un problème pour DDR200 sur T210 lorsque la fréquence de la RAM est oc one.\n \n \n \nChangements dans Nyx v1.6.0\nLa prise en charge du système de partition dynamique d'Android 13+ a été ajoutée et la taille de la partition système a été augmentée à 3 Go pour l'ancien système (Android 10-11).\nCorrection d'un problème où l'analyse de l'offset de secteur emuMMC échouait si la carte SD était plus grande que 1TB\nCorrection d'un problème avec certaines cartes SD affichant des informations incomplètes (par exemple ADATA)\nAmélioration de l'information sur les fusibles (correction du majeur/minor et ajout de l'information iddq analysée)\nLes noms de modèles des modules de RAM de 3ème génération d'Hynix et de Micron sont maintenant affichés correctement.\nLes informations Hw afficheront désormais les informations sur la RAM par puce au lieu d'une seule puce et de 2 canaux.\nLe calibrage automatique du joystick lors de l'initialisation a été assoupli pour corriger un problème de dérive avec les mods de joystick basés sur l'effet HAL.\nDe plus, cette correction a également été incorporée dans le mode USB de la manette de jeu Switch to PC.\nAjout d'un dumping de calibration 6 axes intégré pour tous les autres SKUs de la Switch et le type de stick pour la Lite pour une utilisation dans L4T.\nAjout d'informations sur la vitesse de bus maximale supportée par les cartes SD et consolidation de toutes les classes UHS en un seul champ.\nAjout d'informations sur certains clones d'écrans LCD et sur les nouvelles révisions officielles.\nLe ventilateur est maintenant contrôlé plus finement\n \n \nChangements dans BDK\nDRAM : La ram Hynix 3rd gen a été renommée avec le nom du modèle approprié.\nDRAM : Ajout d'informations supplémentaires sur la ram Micron de 3ème génération.\nDRAM : Ajout d'informations sur le MRR par puce.\nHWINIT : reordered sdmmc1 power disable\nINPUT : L'écran tactile Samsung a été renommé en TSP. BH2109 est la date de fabrication.\nSE : ajout des fonctions se_aes_cmac_128, se_aes_crypt_hash et se_aes_iv_updated_clear.\nACTMON : passage à l'échantillonnage moyen\nMINERVA : Changement du diviseur d'entrée pll pour 2200-2266 mhz et quelques autres corrections\nUTILS : sprintf rejette maintenant les caractères terminés par NULL pour %c\nUTILS : permet à strtol d'analyser les entiers non signés si la base est 16 et le nombre est positif\n \n \nTéléchargement : Hekate v6.1.0 et Nyx 1.6.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187051/in-switch-hekate-v610-et-nyx-160-disponibles-1.png"
        }
    },
    "news_2": {
        "title": "[Xbox] ENDGAME, nouvel exploit Xbox original sans jeux, ni DVD",
        "content": "\nUn nouvel exploit, universel, appelé \"ENDGAME\" est disponible pour la Xbox originale de Microsoft.\nCet exploit a été soigneusement conçu pour être compatible avec toutes les versions commerciales du noyau et du DashBoard publiées pour la Xbox d'origine.\n\nIl ne nécessite pas de jeu, ni même un lecteur de DVD fonctionnel, seulement une carte mémoire. \n\nLa découverte initial de l'exploit revient a @shutterbug2000 etant également le premier à démontrer l'exécution de code dans le DashBoard\n \nEt grâce à des recherches plus approfondies, ENDGAME a été développé par @gaasedelen en exploitant une vulnérabilité adjacente qui offrait un meilleur contrôle et facilitait une exploitation.\n\n\n \nPlus d'info ici : https://github.com/XboxDev/endgame-exploit\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-365714249.gif"
        }
    },
    "news_3": {
        "title": "[PS5] Des outils de création de PKG pour la PS5",
        "content": "Hier ont été dévoilé des outils de compilation de PKGs pour la PlayStation 5. Des outils pour Prospero (nom de code de la PlayStation 5) disponibles en version 1.21.0.10200 et qui seraient des outils officiels, donc probablement soumis au copyright Sony. \n \nEn plus de cela un éditeur de fichier Param pour Prospero (PlayStation 5) en version 1.21.761931406 a lui aussi était dévoilé permettant de créer des PS5 PARAM.SFO . \n \n \n\n \n \nTout cela s'apparente à ce qu'il s'était passé sur PS4 quand les outils devtools de Sony ont été dévoilé puis utilisés par la scène. \n \nLes outils sont proposés ici par DNNDHH : PS5-PKGs\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186985/in-ps5-des-outils-de-creation-de-pkg-pour-la-ps5-1.png"
        }
    },
    "news_4": {
        "title": "[Switch] Ultimate-Switch-Hack-Script 4.3.319 disponible (MAJ)",
        "content": "Cela faisait un moment que je n'avait pas posté de new sur mon Ultimate-Switch-Hack-Script qui, depuis près d'9 mois maintenant, est passé en version 4.3.318.Pour rappel, mon script permet par exemple de préparer une SD avec le contenu nécessaire au lancement d'un CFW, des homebrews, des modules et des overlays; de plus, il est possible de créer des profiles pour chaque élément se qui permet une configuration à la fois assez précise et qui peut être reproduite rapidement. Le script contient aussi de multiples fonctions permettant d'agir sur la nand (infos, dump, restauration, activation/désactivation de l'auto-rcm, montage d'une partie de la nand sur le PC grâce à Memloader...), il contient un lanceur de payload, on y trouve aussi NSC_Builder traduit en français, des outils pour flasher les différentes puces existantes, des outils de débrickage et encore bien d'autres choses, voir cette page pour voir une liste de fonctionnalités plus détaillée qui doit être elle aussi incomplète tant il y a de choses,mais le mieux reste de naviguer dans les menus du script et de voir se qu'il propose.Depuis la dernière new les évolutions sont très nombreuses, bien trop pour être notées ici. Le changement majeur de cette dernière version est la correction du gestionnaire de mise à jour qui avait des problèmes depuis que Github a arrêté le support de Subversion se qui m'a obligé à retravailler tout ça, cependant tout devrait refonctionner correctement maintenant même pour ceux ayant encore d'anciennes versions. Et comme d'habitude le support des derniers firmwares a été ajouté, les mises à jour des différents logiciels utilisés ainsi que des homebrews ont été effectuées et il y a eu des corrections de bugs et probablement d'autres choses que j'ai oublié de noter ici mais voir plus bas pour savoir comment consulter les changelogs complets.Edit: Passage en version 4.3.319, cette version corrige le sélecteur de langues et celui du thème pour qu'ils utilisent la même technique que le gestionnaire de mise à jour pour télécharger les fichiers et les dossiers dont ils peuvent avoir besoin. Je me permet de rappeler que mon script n'est qu'une aide pour le hack et même si les choses sont généralement expliquées durant l'exécution des fonctionnalités cela ne dispense pas de comprendre se que l'on fait, par exemple il y a la FAQ qui est un bon point de départ et qui contient pas mal d'informations et de liens vers différents tutoriels, ce sujet qui contient des informations sur les manipulations basiques ou encore ce sujet qui contient des infos pour les consoles équipées de puces SX Core/Lite ou Hwfly. Il y a aussi la documentation du script qui pourra parfois vous aiguiller sur les choses à faire ou sur les éléments contenus dans la préparation d'une SD, n'hésitez pas à la consulter et même à regarder les crédits qui peuvent contenir des informations intéressantes.Pour voir les évolutions de mon script en détail vous pouvez vous rendre sur cette page pour le changelog du script et sur cette page pour le changelogs des packs de CFW/homebrews/modules/overlays/cheats.La version base peut être téléchargée ici; pour la version complète vous pouvez cliquer ici mais je ne recommande pas de faire ainsi mais plutôt de passer par la version base et d'utiliser le gestionnaire de mises à jour intégré au script pour ajouter ou mettre à jour les différentes fonctionnalités car le téléchargement de la version complète ne récupère pas se qui est lié à des projets externes comme les sig_patches par exemple.Histoire de clarifier le comportement du gestionnaire de mises à jour du script je vais réexpliquer son fonctionnement, la demande intervenant en premier lieu juste après le premier message du script met seulement à jour les éléments de base du script comme les menus ou les programmes indispensables au bon fonctionnement de l'ensemble, ensuite chaque fonctionnalité est gérée indépendamment et si la mise à jour est acceptée sur une fonctionnalité, les éléments de base seront aussi mis à jour. Bon maintenant pour expliquer en pratique on va imaginer que vous utilisiez le script pour lancer des payloads et préparer une SD se qui représente deux fonctionnalités différentes, pour avoir la dernière mise à jour des deux fonctionnalités il faudra lancer chacune d'entre elle et accepter à chaque fois la mise à jour. Il y a aussi une fonction qui permet via le menu \"A propos\", de mettre à jour l'ensemble des fonctionnalités du script en même temps mais ceci peut prendre pas mal de temps car il y aura beaucoup de choses que le script devra vérifier/télécharger.Si vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.En cas de bugs, de propositions de fonctionnalités ou d’améliorations veuillez s'il vous plaît passer par le Github du projet ou bien par le sujet dédié à mon script sur le forum, de cette façon je peux traiter bien plus rapidement les informations/demandes.Enfin, vous avez cette page pour voir les nombreux crédits pour les outils utilisés dans mon script à un moment ou à un autre, comme d'habitude remercions tout ce beau monde pour leurs travaux, leurs participation au projet d'une manière ou d'une autre et également un grand merci aux quelques donateurs.",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1146702/in-switch-ultimate-switch-hack-script-43216-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS5] PSX 2 PS5 V1.0: Convertir vos jeux ps1 pour PS5",
        "content": "A la base prévu pour hier, voici la première version de mon script Python permettant de convertir vos jeux PS1 pour PS5.\n \nEn effet j 'annonçais ce week end que je publierai ce nouvel outil lundi, au final il débarque aujourd'hui avec un petit ajout qui explique ce petit retard.\n \n\n \nRéécrit en Python, ce petit outils va donc vous permettre de convertir vos iso PS1 afin de les lancer sur vos PS5 jailbreakéé (4.51 max).\n \nIl comprend quelques nouveautés comme les liens vers mon tweeter (icon Kaneda), mon Paypal (icon paramètre), ma vidéo tuto (logo youtube) et pour finir le plus important, les codes LibCrypt (La loupe).\n \nCe dernier lien (la loupe) pointe donc vers les codes LibCrypt qui vont vous permettre de débloquer certains jeux comme Dino Crisis ou Resident Evil 3 Nemesis (explications dans ma vidéo tuto ci dessous).\n \n\n \nLe petit ajout qui explique le retard de mon outil, est Merge_bin.bat que vous trouverez également dans le .rar de cette new. Ce petit batch vous servira à fusionner vos .bins en un seul .bin afin d'utiliser ensuite PSX 2 PS5 v1.0  mais également de créer le .toc.\n \nCe dernier fichier (.toc)  est important pour certains jeux comme Tekken, sans ce fichier votre jeu fonctionnera mais sans musique, d' où son utilité.\n \n\n \nUn petit don fais toujours plaisir et m' aide beaucoup: https://www.paypal.com/paypalme/markus00095\n \nTélécharger PSX 2 PS5 V1.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186961/in-ps5-psx-2-ps5-v10-convertir-vos-jeux-ps1-pour-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1186961/in-ps5-psx-2-ps5-v10-convertir-vos-jeux-ps1-pour-ps5-2.png"
        }
    },
    "news_6": {
        "title": "[PS5] Le PlayStation Portail a été hacké par TheFlow",
        "content": "TheFlow nous informe sur son profil X qu'il a réussi à cracker le PlayStation Portal, cet accessoire, plus qu'une console, de la PlayStation 5. \n \nIl n'a pas agit seul puisqu'il s'est aussi appuyé sur l'expérience de xyz et de ZetaTwo, qui rapporte avoir beaucoup appris auprès du dieu TheFlow, pour assurer le hack du périphérique.\n \nDévoilé il y a 3 mois, l'appareil n'aura résisté même pas un mois à TheFlow puisqu'il c'est le délai qu'il dit avoir consacré à la manoeuvre. \n \nFonctionnant autour d'une base Android, on pouvait se douter que le périphérique n'allait pas résister bien longtemps. \n \nTheFlow montre une photo d'un PlayStation Portal exécutant l'émulateur PPSSPP, le célèbre émulation de PSP. \n \n \n\n \n \nTheFlow n'a pas l'intention de dévoiler son travail, du moins pour le moment aucune date de divulgation n'est prévue, et selon lui il reste encore pas mal de travail à accomplir pour stabiliser l'ensemble.\n \nIl a rajouté que l'appareil dispose de 6 Go sur une carte SD et que Sony a implémenté un bout de code pour empêcher l'installation de APK, mais qu'il a réussi à la contourner facilement. \n \nComme on le voit, le PlayStation Portal va s'ouvrir au monde, ce qui est intéressant mais le périphérique reste encore cher et difficile à trouver car les stocks sont limités. \n \n \nTout est là : twitter.com/theflow0/\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186942/in-ps5-le-playstation-portail-a-ete-hacke-par-theflow-1.jpg"
        }
    },
    "news_7": {
        "title": "[PS4] GameBato mis à jour en version 1.40",
        "content": "Depuis le 21 Janvier 2024, arrivée de la version payante de GameBato, il y a très peu de mises à jour de l'outil, un peu comme si la disponibilité de la version payante avait cannibalisée le fait d'enrichir les options ou la stabilité de l'utilitaire. \n \nEn un mois, peu de proposition ont été faite, et la mise à jour 1.40 n'apporte pas grand chose comme nouveautés, un changelog en demi-teinte. \n \n \n\n \n \nChangelog 1.40 : \n \n- GameBaTo Navigator : Les utilisateurs peuvent désormais lire des médias, des bandes-annonces et des gameplays à partir de l'application.\n- Correction de quelques problèmes mineurs\n \n \nTéléchargement : GameBato 1.40\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186904/in-ps4-gamebato-mis-a-jour-en-version-140-1.png"
        }
    },
    "news_8": {
        "title": "[PS4/PS5] PS4-Xplorer 2.02 et PS5-Xplorer 1.02 disponibles",
        "content": "Le développeur Lapy vient de mettre à jour ses outils PS4-Xplorer et PS5-Xplorer, il s'agit comme vous le savez d'un des meilleurs managers/utilitaire créé sous Unity et qui permet d'effectuer diverses opérations comme couper, copier, coller, renommer, supprimer des fichiers ou des dossiers, ou encore d'explorer le stockage de la console PS4 et PS5.\n \n \n\n \n \nPas de grand changements à prévoir, quelques petites mises à jour ont été envoyées pour PS4-Xplorer 2.0 (2.02) et PS5-Xplorer (1.02) notamment pour prendre en charge les fichiers LOG à la demande.\n \nLe développeur tient à remercier crump_youtube, notnotzecoxao et DouglasSampaioz pour les tests, mais aussi LightningMods pour la mise à jour du HB Store. \n \n \nTéléchargement : PS4-Xplorer 2.02 / PS5-Xplorer 1.02\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186903/in-ps4ps5-ps4-xplorer-202-et-ps5-xplorer-102-disponibles-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS5] PCXSense 0.7 Bêta disponible",
        "content": "Le développeur Denellyne vient de mettre en ligne une nouvelle version de son utilitaire nommé PCXSense et il est distribué désormais en Beta v0.7.\n \nPCXSense vous permet d'utiliser votre propre Dualsense sur votre ordinateur sans tracas sur n'importe quel jeu de votre choix, mais il y a quelques fonctionnalités intéressantes que vous pourriez également apprécier, sur des émulateurs comme Yuzu et Cemu, les gâchettes adaptatives deviennent plus dures et plus courtes et sur Dolphin, cela fonctionne du gamecube. PCXSense est un projet qui permet d’utiliser votre manette DualSense sur votre ordinateur, en émulant le protocole XInput. \n \nPCXSense traduit les entrées de la manette DualSense en signaux compatibles avec XInput, ce qui vous permet de l’utiliser dans n’importe quel jeu sur votre ordinateur.\n \n \n\n \n \nFonctionnalités :\n \n- Interface graphique conviviale : PCXSense propose une interface facile à utiliser.\n- Prise en charge des vibrations : Vous pouvez ressentir les vibrations de la manette.\n- Modes Bluetooth et USB : Utilisez la manette en mode sans fil ou via USB.\n- Gachette Gamecube : Compatible avec les émulateurs Dolphin.\n- Gachettes Nintendo Switch : Fonctionne avec les émulateurs Yuzu et Cemu.\n- Vérification des mises à jour : PCXSense vous avertit lorsqu’une nouvelle mise à jour est disponible, mais ne la télécharge pas automatiquement.\n \nPour commencer, téléchargez VigemBus, puis rendez-vous dans la section Releases du projet PCXSense pour télécharger la dernière version. Décompressez le fichier et exécutez PCXSense.exe. L’application se mettra à jour automatiquement lorsqu’une nouvelle version sera disponible. Profitez de votre manette DualSense sur votre PC !\n \nChangelog 0.7 Bêta : \n \n- Prise en charge ajoutée pour Dualshock 4\n- Remappage des boutons ajouté\n- Mapping Start/Select vers le pavé tactile dans les profils de jeu\n- Fuite de mémoire corrigée\n- Optimisations…\n \nCes améliorations apportent des fonctionnalités supplémentaires et des corrections pour une meilleure expérience avec votre manette.\n \n \nTéléchargement : PCXSense Beta 0.7\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186818/in-ps5-pcxsense-07-beta-disponible-1.gif"
        }
    },
    "news_10": {
        "title": "[XBO/XBS] La mise à jour de février 2024 est disponible",
        "content": "Malgrés de grosses rumeurs sur le portage de jeux Xbox sur PlayStation ou du moins sur les futures activités de Xbox (nous verrons bien ce soir à 21h00), Microsoft continue d’innover et d’améliorer l’expérience des joueurs sur ses consoles Xbox, que ce soit sur Xbox One ou sur Xbox Series S et X. \n \nLa mise à jour a pour ambition d'apporter l'activation de commandes tactiles dans la lecture à distance, un nouvel outil d'étalonnage des manettes sans fil Xbox, et des filtrages et des tris améliorées. \n \n \n\n \n \nMise à jour de février pour Xbox :\n \n- Contrôles tactiles activés dans le jeu à distance Xbox : Vous pouvez désormais jouer à des jeux à distance sans votre manette Xbox grâce à des commandes tactiles personnalisées. Plus de cent jeux sont compatibles, dont Minecraft Dungeons, Psychonauts 2 et Sea of Thieves.\n- Outil de recalibration des sticks analogiques : L’application Xbox Accessories propose un outil de recalibration des sticks analogiques pour les manettes Xbox sans avoir besoin d’assistance technique.\n- Filtrage et tri améliorés dans “Mes jeux et applications” : Vous pouvez maintenant filtrer vos jeux par accessibilité, langues prises en charge et fonctionnalités techniques. Par exemple, si vous recherchez des jeux compatibles avec le jeu à distance tactile, filtrez par Fonctionnalités techniques > Activé au toucher.\n \nProchaine mise à jour majeure de la console Xbox :\n \n- Mode compact pour les joueurs Windows : Une nouvelle option permettra aux joueurs Windows de profiter d’une interface plus compacte.\n- Support japonais pour les claviers virtuels sur consoles : Les joueurs japonais auront bientôt accès à des claviers virtuels dans leur langue.\n- Outil de réparation des jeux : Un nouvel outil facilitera la réparation des jeux en cas de problèmes.\n- D’autres ajustements et améliorations sont également prévus.\n \nCette mise à jour sera déployée dans quelques heures ou jours sur vos consoles. \n \nTout est là : news.xbox.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186816/in-xboxbs-la-mise-a-jour-de-fevrier-2024-est-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[Switch] Ryujinx supporte désormais Linux sur Arm64",
        "content": "L'équipe en charge du développement de Ryujinx nous informe que leur émulateur Switch supporte désormais Linux sur arm64. Pou rappel, Ryujinx est un émulateur expérimental pour la Nintendo Switch, créé par gdkchan et écrit en C#. Son objectif est d’offrir une excellente précision et des performances optimales, une interface conviviale et des versions cohérentes testées sur plus de 4 050 titres, dont environ 3 400 sont considérés comme jouables.\n \n \n\n \n \nL’équipe de développeurs travaille sans relâche pour améliorer cet émulateur. Parmi les membres clés, on retrouve gdkchan (lead developer), Ac_K, marysaka, riperiperi, LDj3SNuD, emmauss, Moosehunter, et Yoshiyes (web designer / développeur).\n \nPour la petite histoire, le nom se prononce “Ree-You-Jinx” et est inspiré du dieu-dragon mythique Ryujin, avec le “NX” faisant référence au nom de code de la Nintendo Switch.\n \n\n \nRyujinx prenant désormais en charge Linux sur arm64 vous pourriez donc par exemple exécuter divers jeux sur Asahi Linux avec OpenGL.\n \n \nTéléchargement : Ryujinx\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186809/in-switch-ryujinx-supporte-desormais-linux-sur-arm64-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1186809/in-switch-ryujinx-supporte-desormais-linux-sur-arm64-2.jpg"
        }
    },
    "news_12": {
        "title": "[GBA] L'émulateur GBA Hades v1.0.0 disponible",
        "content": "Après trois ans de travail, Hadès est enfin disponible, un tout nouvel émulateur de la Game Boy Advance, à destination des PC Windows, MacOS et Linux. \n \n \n\n \n \n \nHades est encore en développement, mais de nombreuses fonctionnalités sont offertes dès la première version 1.0.0 :\n \n- Une émulation complète de la Game Boy Advance (à l'exception de la plupart des périphériques externes et des add-ons)\n- Précision décente\n- Prise en charge des manettes de jeu\n- Remappage des touches et des boutons\n- Sauvegardes rapides (également connues sous le nom de \"Save State\")\n- Prise en charge de l'horloge en temps réel (RTC)\n- Correction des couleurs et effets LCD\n- Chargement de jeux à partir de formats d'archive courants (.zip, .7z, .rar, etc.)\n \n \n\n \n \nLe développeur, Totushi, annonce vouloir concentrer ses efforts sur les performances, la précision et la prise en charge de plus d'effets vidéo et de nouveaux périphériques externes.\n \n \nVous pouvez télécharger : Hades v1.0.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186803/in-gba-lemulateur-gba-hades-v100-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1186803/in-gba-lemulateur-gba-hades-v100-disponible-2.png"
        }
    },
    "news_13": {
        "title": "[PS5] etaHEN v1.6B disponible",
        "content": "Le développeur LigthningMods a également mis à jour etaHEN qui est désormais affublé de la numérotation 1.6B.\n \nLà aussi de nombreuses corrections ont été apportées par le développeur puisqu'il a corrigé le support du firmware 4.02, il a amélioré le support du mode repos ou encore rectifié quelques problèmes liés à libhijacker ou encore au syscore hook.\n \n \n\n \n \nChangelog 1.6B : \n \n- Correction de la prise en charge de la version 4.02\n- Amélioration de la prise en charge du mode repos\n- Ajout du raccourci contrôleur pour itemzflow\n- Suppression d'une boîte de dialogue qui spammait si libhijacker cheats était activé lors de l'exécution d'une application PS5 FG\n- Correction d'un problème rare qui pouvait empêcher certaines applications d'être jailbreakées lorsqu'elles étaient demandées\n- etaHEN supprime désormais le hook syscore après le démarrage\n \n \nTéléchargement : etaHEN 1.6B\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186698/in-ps5-etahen-v16b-disponible-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] ItemzFlow v1.06 disponible",
        "content": "Le développeur LightningMods vient de dévoiler une nouvelle version d'ItemzFlow, son désormais célèbre manager passe en version 1.06 et apporte beaucoup de changements. \n \nParmis les nouveautés on remarque la possibilité de l'option de certaines informations, des corrections et des améliorations, mais aussi l'ajout d'une couverture pour les jeux qui n'en disposent pas, ou encore l'ajout d'une nouvelle langue. \n \n \n\n \n\n \n\n \n \nItemzflow a été mis à jour vers 1.06/1.6 \n \n- Les applications PS5 FG manquantes seront désormais affichées dans itemzflow pour être supprimées manuellement.\n- Ajout d'une option pour afficher les informations de PS5 FG\n- Itemzflow vérifie désormais l'espace libre avant de copier ou de déplacer des fichiers.\n- Ajout de nouvelles icônes de disque et ajout d'une couverture pour les jeux manquants\n- Ajout d'un paramètre permettant d'activer un raccourci contrôleur sur l'ensemble du système pour ouvrir Itemzflow\n- Correction de problèmes dans certaines catégories d'Itemzflow\n- Correction d'un problème qui étiquetait les applications PS5 comme des applications PS4 dans le menu d'accueil\n- Correction d'un problème entraînant l'affichage d'une mauvaise version de mise à jour de l'application PS5 par itemzflow\n- Correction d'un problème qui faisait que certains titres PS5 n'apparaissaient pas.\n- Ajout d'un fichier de langue chinoise\n- Amélioration de la création des bases de données SQL\n- Amélioration de la vitesse d'analyse de l'en-tête PNG\n- Ajout de quelques améliorations\n \n \nTéléchargement : ItemzFlow v1.06\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186696/in-ps5-itemzflow-v106-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1186696/in-ps5-itemzflow-v106-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1186696/in-ps5-itemzflow-v106-disponible-3.jpg"
        }
    },
    "news_15": {
        "title": "[PS5] Vers un payload pour utiliser la manette PS4 dans les jeux PS5",
        "content": "Vous le savez certainement si vous avez déjà essayé, la Dual Shock 4 est supportée sur la PlayStation 5, mais on ne peut pas dire que c'est à pleine capacité, en effet pour les titres PS5 qu'ils soient exclusifs ou non d'ailleurs, il vous faut une Dual Sense. \n \nIl est possible d'utiliser une manette PS4 sur la PS5, mais avec une limitation majeure, elle ne fonctionne qu'avec les jeux PS4 sur la PS5. Si vous tentez de jouer à un jeu PS5 avec une manette PS4, cela ne sera pas possible. Vous devrez alors utiliser la manette DualSense de la PS5.\n \n \n\n \n \nMais jusqu'à aujourd'hui car le développeur notzecoxao vient de dévoiler un premier payload qui permet d'utiliser une Dual Shock 4 dans un jeu PS5. Bien entendu cela nécessite quelques spécificités, notamment de pouvoir charger le payload, donc d'accéder aux debug settings. \n \nContexte du test : \n \n- Aller sur https://zecoxao.github.io/genuine\n- Lancez l'exploit mais ne lancez pas le payload\n- Accédez aux paramètres de débogage, paramètres du contrôleur, activer les contrôleurs pour PS4 dans les jeux natifs\n- Demandez-lui de redémarrer le système.\n- Assurez-vous que l'option est toujours activée après le redémarrage.\n- Essayez un jeu PS5 avec la Dualshock 4\n \nPour le moment il n'est pas certain que cela soit fonctionnel, mais cela laisse entrevoir cette possibilité pour les consoles disposant d'accès au debug settings, à commencer par les Test kits, puis peut être aux consoles retail. \n \nTout est là : notnotzecoxao\n \nA noter au passage que John Tornblom vient de publier ps5-payload-shsrv.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186682/in-ps5-vers-un-payload-pour-utiliser-la-manette-ps4-dans-les-jeux-ps5-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS4] PSFree backporté pour le firmware 7.02 de la PS4",
        "content": "Le développeur Kameleon vise à proposer le portage de PSFree sur les firmwares inférieurs au firmware 9.00. Il vient de mettre en ligne PSFree700, il s'agit là du portage de l'implémentation de PSFree pour le firmware 7.02.\n \nComme vous le savez probablement PSFree est le portage dans un exploit webkit de la vulnérabilité CVE-2022-22620, s'appuyant sur une classe UAF (Use After Free) permettant de profiter de lectures et d'écritures arbitraires dans le kernel.\n \nPour ceux que cela intéresse, la vulnérabilité permet l'implémentation de l'API History, afin de déboucher sur une mauvaise gestion de la mémoire, et ainsi il suffit de créer une page web contenant les objets spécifiques pour utiliser l'exploit. \n \nLe développeur Kameleon a combiné (ou backporté) la toochain utilisée avec l'exploit webkit PSFree d'abc et l'exploit kernel de ChendoChap afin de les porter sur le firmware 7.02 de la PS4.\n \n \n \n\n \n \nCela ouvre la voix à certaines possibilités, déjà de stabilité, de rapidité car l'exploit utilisé sur le firmware 7.02 qui est une adaptation de celui utilisé sur 6.72, mais aussi la possibilité pour certains de profiter d'un exploit car certains sont bloqués sur le firmware 7.02 et ne peuvent mettre à jour leur firmware en 9.00. PSFree reste bien entendu en version Bêta, mais selon le développeur Kameleon cela n'a que peu d'importance car l'exploit est très stable, de plus il s'est appuyé sur quelques testeurs, comme notamment therealtury94. \n \n \nTout est là : psfree700\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186647/in-ps4-psfree-backporte-pour-le-firmware-702-de-la-ps4-1.png"
        }
    },
    "news_17": {
        "title": "[PS4/PS5] etaHEN et Itemzflow bientôt mis à jour par LightningMods",
        "content": "Le développeur LightningMods nous informe qu'il est en train de travailler sur des nouvelles versions d'etaHEN et d'Itemzflow. Cette solution a révolutionné le monde de la PS5 et fait bouger celui de la PS4.\n \n \n\n \n \n \nLightningMods nous informe via son profil Twitter que dans la prochaine mise à jour d'etaHEN et d'Itemzflow, il existera une option pour ouvrir itemzflow si vous maintenez le bouton PS enfoncé via un raccourci à l'échelle du système pour rouvrir rapidement Itemzflow.\n \n \n \n\n \n \n \nIl y a fort à parier que cette nouvelle option (comme nous pouvons le voir sur la vidéo il s'agit de la version 1.6) ne soit qu'une partie des nouveautés qui seront introduites, il ne reste plus qu'à patienter un peu avant de pouvoir en profiter. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186645/in-ps4ps5-etahen-et-itemzflow-bientot-mis-a-jour-par-lightningmods-1.png"
        }
    },
    "news_18": {
        "title": "[PS4] Une nouvelle version de PSFree d'abc disponible",
        "content": "Le développeur abc propose une nouvelle version de PSFree qui aurait été optimisée pour démarrer beaucoup plus rapidement. \n \nPSFree est un exploit webkit qui permet un démarrage beaucoup plus rapide que les autres exploits disponibles sur PS4, surtout sur le firmware 9.00, et il permet en plus d'élargir le support du 6.00 au 9.60 contrairement aux autres exploits qui sont souvent limités à quelques firmwares.\n \nEncore mieux, PSFree est supporté sur PS5, mais il faut encore qu'un exploit kernel soit adapté, ce qui n'est pas encore le cas. \n \nEn attendant, les développeurs peuvent s'entraîner sur PS4, et optimise déjà PSFree, abc proposant une nouvelle version bénéficiant d'un démarre beaucoup plus rapide estimé en 2 secondes couplé avec GoldHEN 2.4b16.2.\n \n \n \n\n \n \n \n \nLes hosts vont devoir être remis à jour, mais cela en vaut clairement la peine. \n \n",
        "images": {}
    },
    "news_19": {
        "title": "[Multi] Dolphin fait son rapport après 3 mois",
        "content": "L'équipe en charge du développement de l'émulateur Dolphin est de retour avec un nouveau rapport après les fêtes de fin d'année, il est temps pour eux, sur le blog, de se remettre au travail.\n \n \n\n \n \nEt cette fois-ci, l'équipe aborde une série de changements qui couvrent à peu près tout ce que vous pouvez imaginer. Pour ceux qui souhaitent profiter des derniers homebrews avec DSP-HLE, Dolphin prend désormais en charge les derniers microcodes homebrew ! Pour les jeux de détail, une mise à jour mineure du microcode Zelda-HLE a été appliquée pour corriger un effet manquant depuis longtemps.\n \nDans des nouvelles plus importantes, pour ceux d'entre vous qui ont des problèmes d'espace disque lorsqu'ils utilisent Dolphin sur Windows depuis la dernière beta, un correctif est maintenant disponible. Et pour ceux qui recherchent l'image la plus claire possible, l'heuristique mipmap de Dolphin a été réduite pour permettre des mipmaps de plus haute résolution sur plus de textures. \n \n \nEt bien sûr, si vous voulez une image parfaite, les rapports d'aspect personnalisés permettront d'utiliser plus facilement les hacks pour écran ultra-large et bien plus encore ! Ajoutez à tout cela une énorme correction de bugs pour les anciennes révisions des Steam Decks, un autre chapitre de la saga Bounding Box, voir un classique d'une toute nouvelle façon, et encore un autre chapitre de pilotes GPU cassés, et vous avez un rapport d'avancement de Dolphin.\n \n \n\n \n \n \nTout est là : Dolphin\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186634/in-multi-dolphin-fait-son-rapport-apres-3-mois-1.jpg"
        }
    },
    "news_20": {
        "title": "[PS3] webMAN-Mod mis à jour par aldostools",
        "content": "Le développeur aldostools, Aldo Vargas, vient de publier une mise à jour de webMAN-Mod pour la PlayStation 3. \n \nwebMAN est un plugin développé par Deank qui permet de lancer des backups de jeux PS3, PS2, PS1, PSP ainsi que des Blu-ray ou des DVD, stocké sur disque dur (y compris en NTFS) ou sur le réseau local, au format JB ou ISO. M@tsumot0 et Aldostools ont proposé une version MOD de webMan, apportant notamment le support de 21 langages utilisant des fichiers externes, un installer/updater pour CFW Cobra et NonCobra, le spoof IDPS/PSID, la désactivation des syscalls du cfw, et de nombreuses autres évolutions qui se sont succédées.\n \n \n \n\n \n \nChangelog : \n \n- Mise à jour de ps3netsrv 20240210 \n- Ajout de la conversion des dossiers PS3 en ISO local.\n- Ajout du décryptage des ISO PS3 cryptées en ISO locales.\n- Glisser-déposer un dossier ou un ISO PS3 crypté pour une conversion automatique.\n- Ajout d'un outil makeiso basé sur ps3netsrv pour une utilisation plus facile.\n \n \nTéléchargement : webMAN_MOD_1.47.45_Installer.pkg / ps3netsrv_20240210.zip\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186632/in-ps3-webman-mod-mis-a-jour-par-aldostools-1.png"
        }
    }
}