{
    "news_1": {
        "title": "[Switch] Du code personnalisé dans le réveil musical Alarmo",
        "content": "Le développeur GaryOderNichts vient de prouver via une preuve de concept (un poc) qu'il est possible d'injecter et de faire tourner du code personnalisé dans le nouveau réveil musical Alarmo de Nintendo. \n \nMême si en soit cela n'a rien d'extraordinaire, il est tout de même intéressant de savoir qu'il est très facile de jailbreaker l'appareil, il est équipé d'un microcontrôleur STM32, la même puce que celle déjà présente dans la Game & Watch Zelda Edition. \n \n \n \n\n \n \nAprès avoir découvert la chose, et souder quelques fils aux broches de débogage, il a été facile d'enregistrer quelques registres, et d'injecter la mémoire à l'aide du programme \"OpenOCD\". \n \n \n \n\n \n \n \n \nLa limitation cependant réside dans le fait que le STM32 est protégé en lecture, ce qui signifie que la mémoire flash interne ne peut pas être lue pour l'examiner plus en détail.\n \nLe développeur a créé un blog ici : Looking-into-nintendo-alarmo\n \n \n\n \n \nEt l'ensemble de son travail est répertorié ici : GaryOderNichts/alarmo\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198155/in-switch-du-code-personnalise-dans-le-reveil-musical-alarmo-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1198155/in-switch-du-code-personnalise-dans-le-reveil-musical-alarmo-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1198155/in-switch-du-code-personnalise-dans-le-reveil-musical-alarmo-2.jpg"
        }
    },
    "news_2": {
        "title": "[Switch] Les vagues de ban commence sur le MigSwitch/MigFlash",
        "content": "Nintendo a sorti sont nouveau firmware 19.0.1 dans la nuit du 28 au 29 octobre et semble en vouloir plus que jamais au hacker qui ne respecte pas l'usage classique d'une Nintendo Switch.\nPour rappel, en fin d'année dernière, l'annonce fracassante d'un nouvelle acteur dans la scène switch a été faite. Ainsi, le premier linker a destination de la Nintendo Switch a vue le jour, le MigSwitch, développé désormais par la Team MigFlash, suite à des problèmes juridique.\nIl va s'en dire que ce linker allais forcément être utilisé de plusieurs manière, plus ou moins légal, et c'est dans un cadre légal qu'un internaute de discord y a été confronté, et il n'est pas le seul, ayant moi même eu une console bannis suite à l'usage légal d'un MigSwitch/MigFlash. \n \n\n \n\nEn effet, la console de cette utilisateur a été bannis des services en ligne de Nintendo pendant la mise à jour d'un jeu, jeu dumper de manière légal d'une de ces propres cartouche, et console pourtant toujours mise en \"mode avion\".\nLa Nintendo Switch enregistre tout un tas de logs, notamment un compteur de retrais de la cartouche, et ce n'est qu'une des nombreuses possibilités de détecter l'usage d'un MigSwitch/MigFlash et ce même avec un bouton.\nIl semblerais que Nintendo n'est pas choisis de super ban les consoles utilisant le MigSwitch/MigFlash, les autorisant donc à continuer les mises à jour firmware.\nCette news est avant tout là à titre de prévention, certain peuvent préférer l'usage d'un linker par simplicité ce qui est compréhensible. L'objectif et simplement d'avertir que le MigSwitch/MigFlash même dans un usage plus ou moins légal grâce au dump de cartouche réel peut entrainer un bannissement des services online de Nintendo.\n",
        "images": {
            "image_1": "https://i.ibb.co/WcZVtdK/image.png",
            "image_2": "https://i.ibb.co/pR5CXzW/image-1.png"
        }
    },
    "news_3": {
        "title": "[Switch] Les vagues de ban commence sur le mig switch",
        "content": "Nintendo a sorti sont nouveau firmware 19.0.1 dans la nuit du 28 au 29 octobre et semble en vouloir plus que jamais au hacker qui ne respecte pas l'usage classique d'une Nintendo Switch\nPour rappel, en fin d'année dernière, l'annonce fracassante d'un nouvelle acteur dans la scène switch a été faite\nAinsi, le premier linker a destination de la Nintendo Switch a vue le jour, le Mig Switch, développé désormais par la Team MigFlash suite a des problèmes juridique.\nIl en a s'en dire que ce linker allais forcément être utilisé de plusieurs manière, plus ou moins légal, et c'est dans un cadre légal qu'un internaute de discord a été confronté, il n'est pas le seul, ayant moi même eu une console bannis suite a l'usage légal d'un Mig Switch.\nEn effet, la console de cette utilisateur a été bannis des services en ligne de Nintendo pendant la mise à jour d'un jeu, jeu dumper de manière légal par une de c'est propres cartouche, et console pourtant bien toujours mise en mode avion.\nLa Nintendo Switch enregistre tout un tas de logs, notamment un compteur de retrais de la cartouche, ce n'est qu'une des nombreuses possibilités de détecter l'usage d'un Mig Switch et ce même avec un bouton.\nIl semblerais que Nintendo n'est pas choisis de super ban les consoles utilisant le Mig Switch, les autorisant donc a continué les mises à jour firmware.\nCette news est avant tout la a titre de prévention, certain peuvent préféré l'usage d'un linker par simplicité ce qui est compréhensible, l'objectif et simplement d'avertir que le Mig même dans un usage plus ou moins légal grâce au dump de cartouche réel\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1198083/in-switch-les-vagues-de-ban-commence-sur-le-mig-switch-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1198083/in-switch-les-vagues-de-ban-commence-sur-le-mig-switch-2.png"
        }
    },
    "news_4": {
        "title": "[PS4] PPPwnUI 3.32 d'Aldostools disponible",
        "content": "\nLe développeur Aldostools (Aldo Vargas) dévoile une nouvelle version de PPPwnUI modded qui passe en 3.32 qui intègre maintenant la dernière version du payload GoldHEN 2.4b18 de SiSTR0 et donc fort logiquement le support des firmwares 10.50, 10.51 et 10.70 qui vient avec cette nouvelle version .\n \n \n \n \n\n \n \n \nTéléchargement : PPPwnUI 3.32 moddée par Aldostools\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-635340006.png"
        }
    },
    "news_5": {
        "title": "[PS5] Byepervisor supporte désormais le firmware 2.70",
        "content": "Le développeur Echo Stretch continue de faire progresser le support de Byepervisor qui pour rappel est simplement destiné au firmware 2.50 à l'origine. \n \nVoilà désormais qu'il a réussi à monter, c'est à dire à apporter le support d'un firmware plus récent que celui proposé à la base, à savoir que le firmware 2.70 est désormais supporté. \n \nBien entendu, nous sommes encore loin de pouvoir l'utiliser sur un firmware plus récent comme les 3.xx ou 4.xx, ou encore les 7.xx, mais il fait progresser le support en souhaitant se concentrer également sur d'autres firmwares plus anciens. \n \n \n\n \n \nIl cherche maintenant à ouvrir les offsets des firmwares 1.05, 1.10, 1.11 et 1.13 pour lesquels il demande qu'on les lui fasse parvenir. \n \nLa liste des firmwares supportés : 1.12, 1.14, 2.00, 2.20, 2.25, 2.26, 2.30, 2.50, 2.70\n \n \nTout est là : EchoStretch/Byepervisor\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-974163764.jpg"
        }
    },
    "news_6": {
        "title": "[Switch] Nintendo sort l'inoffensif firmware 19.0.1",
        "content": " \nNintendo vient tout juste de sortir le firmware 19.0.1 pour les Nintendo Switch et Nintendo Switch Lite, mais il est déjà considéré comme inoffensif, c'est à dire qu'il ne change ni les clés, ni la structure interne des protections mise en place par le géant japonais pour contre les hacks de ses consoles. \n \nAinsi SciresM a déjà confirmé que la version d'Atmosphere 1.8.0 Pre-release est pleinement fonctionnelle sur le 19.0.1, du moins à première vue précise-t-il.\n \n \n\n \n \n \nAu chapitre des mêmes nouvelles, Vampitech, le développeur de NeXT confirme lui aussi que le firmware 19.0.1 n'affecte en rien le fonctionnement de sa solution, ce qui signifie là aussi que les changements de ce firmware doivent être assez légers. \n \nNintendo n'a livré aucun changelog avec ce firmware 19.0.1 qui arrive seulement quelques jours après la disponibilité le 07 octobre 2024 du firmware 19.0.0.\n \nLes rapports de Yellow's 8 se trouvent ici : yls8.mtheall.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197921/in-switch-nintendo-sort-linoffensif-firmware-1901-1.png"
        }
    },
    "news_7": {
        "title": "[PS5] L'exploit Byepervisor est en progression : offsets, compensations shellcore et dumps",
        "content": "Le développeur EchoStretch a réalisé un travail important sur Byepervisor, depuis quelques jours il travaille énormément dessus, il a commencé par vouloir apporter des compensations Shellcore, il a tout d'abord encouragé les détenteurs de consoles sous firmwares 1.12, 1.14, 2.00, 2.20, 2.25, 2.26 et 2.30 a tester certains de ces fichiers. \n \nSes modifications permettent d'exécuter la chaîne ROP sur les divers firmwares, le HEN d'origine étant dédié au firmware 2.50.\n \nMais EchoStretch a ajouté de nombreux offsets et il continue de le faire pour tenter d'apporter le HEN sur l'ensemble des firmwares inférieurs au 3.00, y compris le 2.70, il vient tout juste de mettre ceux du firmware 1.05, il a d'ailleur besoin de testeur sur 1.10, 1.11 et 1.13 pour avancer.  \n \n \n \n\n \n \n \nIl y a quelques heures cette nuit, il a dévoilé un screen montrant le dump en cours de ce qui serait le kernel de la PS5, cela reste à confirmer car seul le screen a été montré. Impressionnant !\n \n \nTout est là : EchoStretch/Byepervisor\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197878/in-ps5-lexploit-byepervisor-est-en-progression-offsets-compensations-shellcore-et-dumps-1.png"
        }
    },
    "news_8": {
        "title": "[Switch/PS4] Switchfin v0.5.3 disponible",
        "content": "Le développeur dragonflylee propose une nouvelle version de Swithfin, l'interface tierce dédiée à Jellyfin à destination de la Switch, des PC et de la PS4.  Si vous ne connaissez pas Jellyfin, il s'agit d'un serveur de contenus, un serveur multimédia open source et gratuit, offrant la possibilité de naviguer et lire les flux multimédia de toutes natures :\n \n- conteneurs : mkv, mov, mp4, avi\n- codecs vidéo : H.264, H.265, VP8, VP9, AV1\n- codecs audio : Opus, FLAC, MP3, AAC, AC-3, E-AC-3, TrueHD, DTS, DTS-HD\n- sous-titres : SRT, VTT, SSA/ASS, DVDSUB\n \n \n\n \n \nChangelog :\n \nAjout :\n- sauvegarder l'état de Windows lors de la sortie\n- supporter la saisie tactile sous linux (@xfangfang)\n- support du collage de texte pour la recherche (@xfangfang)\n- nouvelle option de mauvaise qualité\n- nouvelle option sous-titre de secours \n- support personnalisé de l'agent utilisateur dans le navigateur webdav\n- prise en charge du serveur http apache/nginx/rclone à distance (pour une télécommande)\n \nCorrection : \n- support du chargement de polices emoji personnalisées\n- onglet vide en cas d'échec de la recherche\n \n \nTéléchargement : Switchfin 0.5.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197877/in-switchps4-switchfin-v053-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[PS4] GoldHEN v2.4b18 de SiSTR0 disponible",
        "content": "Le développeur SiSTR0 vient de dévoiler une nouvelle version de son payload GoldHEN qui est désormais proposé en version v2.4b18 depuis quelques minutes. \n \nSelon ses mots il s'agit d'un version bêta, il affirme avoir très peu de temps libre mais il continue à travailler sur GoldHEN pour l'améliorer et ajouter de nouvelles fonctionnalités utiles à tous. \n\n \nCette nouvelle version supporte à la fois les anciens exploits WebKit et le nouveau pppwn, mais pour cela il faut un stage2 personnalisé, qu'il dévoile avec cette version. \n \n \nChangelog v2.4b18 :\n \n- Ajout du Cheat Downloader (Merci à ctn)\n- Ajout de la prise en charge des versions 10.50, 10.70 et 10.71\n- Amélioration de la prise en charge du mode repos\n- Correction de la sauvegarde de la configuration des serveurs réseau\n- Déplacement du serveur Klog vers le userland (meilleure prise en charge des déconnexions réseau)\n \nFirmwares supportés : \n \n5.05\n6.71 / 6.72\n9.00\n9.60\n10.00 / 10.01\n10.50\n10.70 / 10.71\n11.00\n \n \nIl tient au passage à remercier certaines personnes importantes : \n \n- TheFlow pour avoir publié son exploit (et pas seulement celui-ci) pour tout le monde.\n- flat_z pour avoir conçu et publié le HEN pour ps4 avec un writeup.\n- vortex pour avoir implémenté les premières versions du HEN.\n- golden pour avoir créé des projets qui m'ont aidé à comprendre beaucoup de choses.\n- OSM pour sa boîte à outils Orbis (Orbis Toolbox)\n- Hippie68 pour son travail sur le nouveau serveur FTP.\n- Al_Azif pour avoir fourni diverses ressources nécessaires.\n- SocraticBliss pour ses scripts RE.\n- Illusion pour ses patchs de jeux et plus encore.\n- bucanero pour son travail sur le gestionnaire de cheats.\n- Tous les développeurs de cheats qui ont partagé leurs travaux avec tout le monde.\n \nMerci aux testeurs qui ont eu beaucoup de patience :\n \n- Big_Wadger\n- EchoStretch\n- Opoisso893\n- mbcrumb\n- MODDED WARFARE\n- vapour\n \nEnfin, ses amis ctn et Kameleon pour leur soutien continu, pas seulement technique, et également à tous ceux qui ont soutenu mon projet sur Kofi.\n \n \nTout est là : GoldHEN v2.4b18\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-109866506.png"
        }
    },
    "news_10": {
        "title": "[PS5] PS5 Payload SDK 0.20 disponible",
        "content": "Le développeur John Tornblom dévoile une nouvelle mouture de son PS5 Payload SDK qui est désormais affublé de la numérotation 0.19. \n \nComme vous le savez, ce SDK a pour ambition de faciliter le portage et le développement de payloads qui pourront s'exécuter sur les consoles bénéficiant du loader ISO BD-JB ELF, mais aussi sur celles utilisant l'exploit \"ipv6 uaf\" basé sur le webkit.\n \n \n \n\n \n \n \nChangelog : \n \nC++ : déclare les symboles C dans l'espace de noms extern « C ».\nWindows : ajout de la commande prospero-deploy qui envoie des payloads à un loader elf\nWwindows : ajout de la commande prospero-cmake qui définit les valeurs par défaut avant d'appeler cmake\nindows : ajout des commandes prospero-clang et prospero-clang++ pour invoquer les compilateurs\nWindows : ajout de commandes prospero-lld qui est nécessaire pour les compilateurs qui compilent et lient dans la même commande\nKernel : ajout de la constante KERNEL_ADDRESS_TEXT_BASE pour contenir l'adresse de la base .text\nKernel : ajout de fonctions pratiques pour accéder à la mémoire arbitraire\nmeson : s'assurer que les payloads ne sont pas exécutées sur le système hôte lors de la configuration des projets\nmdbg : ajout de fonctions pratiques\n \n \nEdit 29.10.24\n \nTéléchargement : PS5 Payload SDK 0.20\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197860/in-ps5-ps5-payload-sdk-019-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[Switch] Dvr-patches supporte le firmware 19.0",
        "content": "Le développeur Exelix11 propose la mise à  jour c7b84de qui apporte le support pour le firmware 19.0 de dvd-patches. \n \nIl s'agit d'un moyen de diffuser la plupart des jeux qui normalement ne supportent pas l'enregistrement, il s'appelle dvr-patches et est hébergé comme un projet indépendant de Sys-DVR.\n \n \n \n\n \n \n \n \nDvr-patches est donc un ensemble de correctifs exefs permettant de diffuser des jeux incompatibles avec sysdvr. \n \n \n \n\n \n \n \n \nTéléchargement : Dvr-patches pour le firmware 19.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197847/in-switch-dvr-patches-supporte-le-firmware-190-1.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] Rekado supporte désormais Android 15",
        "content": "Le développeur MenosGrante vient de dévoiler une nouvelle version de Rekado, qui passe désormais en version 5.3\n \nPour rappel Rekado est un loader de payloads qui supporte Android, il permet donc de lancer Hekate, fusee et d'autres payloads depuis un périphérique Android sur la Switch, en général a l'aide d'un câble OTG. Il permet aussi de vérifier si une Nintendo Switch est patchée en utilisant les numéros de série ou en scannant un code barre sur la boite de la console.\n \nCette version est marquée comme une préversion, car le payload Atmosphere actuellement intégré est également une préversion et sera marquée comme version finale Atmosphere aura été stabilisé.\n \n \n \n \n\n \n \n \n \n \nCaractéristiques :\n \n- Ajout : Prise en charge complète d'Android 15.\n- Mise à jour : Liens brisés pour les instructions et le vérificateur de série.\n \nPayloads et dépendances :\n \n- Mise à jour : Payloads vers les dernières versions.\n \nLocalisation :\n \n- Mise à jour : Toutes les localisations terminées de Crowdin.\n \n \nTéléchargement : Rekado 2.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197846/in-switch-rekado-supporte-desormais-android-15-1.png"
        }
    },
    "news_13": {
        "title": "[PS5] Specter dévoile les slides de sa présentation",
        "content": "Le développeur Specter l'avait promis, il a réussi a cassé l'hyperviseur sur PS5, du moins une partie de celui-ci car comme nous avons vu son exploit basé sur deux vulnérabilités ne s'appuie que sur un coeur sur lequel la chaine ROP va tourner, l'hyperviseur étant toujours actif sur les autres coeurs.\n \n \n\n \n\n \n\n \n\n \n\n \n\n \n \nSon avancée, il l'a doit aussi à quelques autres développeurs, il tient à remercier ChendoChap pour la chaine ROP et le bug, Flatz pour les dumps de Kernel dumps et ses connaissances, Fail0verflow pour l'implémentation de l'exploit kernel UMTX et Kiwidog, Tihmstar, HardPwn pour leur contribution notamment pour le stuff des démos.\n \n \n\n \n\n \n \n\nAinsi comme promis il dévoile les slides de sa présentation, qui tiennent sur 94 pages, en réalité une trentaine, qui montre comment il a mis en application le contournement de l'hyperviseur sur le firmware 2.50.\n \n \n\n \n\n \n \nTous les slides de cette présentation en PDF se trouvent ici, ce que l'on peut dire c'est qu'encore une fois c'est grâce au concours de plusieurs personnes que ses avancées se font, et non pas grâce aux travaux d'une seule. \n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-5.png",
            "image_6": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-6.png",
            "image_7": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-7.png",
            "image_8": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-10.png",
            "image_9": "https://www.logic-sunrise.com/images/validation/in-285635555.png",
            "image_10": "https://www.logic-sunrise.com/images/validation/in-1799444927.png"
        }
    },
    "news_14": {
        "title": "[PS5] Specter publie son exploit Byepervisor &#34; Hypervisor &#34;",
        "content": " \nL'un des meilleurs développeurs, Specter, a présenté hier ses travaux sur l'hyperviseur de la PS5 sur les premiers modèles, il faut disposer d'un firmware 1.xx ou 2.xx pour profiter de ces avancées. \n \nActuellement il n'est utile que sur ces firmwares 1.xx et 2.xx, mais peut être que cela permettra de faire avancer le hack sur des firmwares plus récents. \n \nSpecter livre un fichier byepervisor.elf qui doit être chargé après UMTX, que ce soit via le webkit ou via l'exploit BD-J, ensemble la console va passer en mode repos, et redémarrer. \n \n \n \n\n \n \n \nL'idée dans le futur est : \n \n- Supporter plus de firmwares (offsets)\n- Faire en sorte que byepervisor.elf ne soit envoyé qu'une seule fois\n- Suspendre automatiquement le système \n- Patch vmcbs avec QA flags exploit pour dumper les données de l'hyperviseur.\n \n \n\n \n \nComme Specter l'a expliqué lors de sa présentation, ce sont deux vulnérabilités qui sont utilisées, elles sont indépendantes l'une de l'autre et l'une ou l'autre peut être utilisée. Un exploit est fourni principalement pour la préservation (/_old_jump_table_exploit), seule la chaîne d'exploitation principale doit être utilisée (QA flags exploit).\n \nLe premier exploit utilise une vulnérabilité où les tables de saut du code de l'hyperviseur sont partagées avec le kernel invité, et est contenu dans /_old_jump_table_exploit/. En détournant l'entrée de la table de saut pour l'hypercall VMMCALL_HV_SET_CPUID_PS4, l'exécution de code dans l'hyperviseur peut être réalisée. Nous exécutons une chaîne ROP qui désactive Nested Paging (NPT) et Guest Mode Execute Trap (GMET), ce qui nous permet de désactiver eXecute Only Memory (XOM) aka xotext dans les Page Table Entries (PTE) du kernel pour les dumper, ainsi que d'activer l'écriture dans les PTE pour hooker/patcher le kernel également.\n \nCette méthode nécessite un bon nombre de gadgets et de décalages d'offsets, ce qui est la principale raison pour laquelle cet exploit n'est pas le principal. De plus, il ne casse actuellement l'hyperviseur que sur le coeur sur lequel la chaîne ROP tourne, l'hyperviseur est toujours actif sur les autres coeurs et devrait être désactivé.\n \n \nTous les travaux sont ici :  Byepervisor\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197763/in-ps5-specter-publie-son-exploit-byepervisor-hypervisor-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197763/in-ps5-specter-publie-son-exploit-byepervisor-hypervisor-2.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] NeXT 3.31 disponible",
        "content": "Le développeur Vampitech propose une nouvelle version de NeXT qui est désormais proposé en v3.31. Cette version semble davantage semble que la 3.30 Pre-release qui n'était pas une version finale contrairement à la 3.31. \n \nD'ailleurs avec la 3.31 Tinfoil et les Forwarders fonctionnent correctement, le firmware 19.0.0 ayant modifié le keyset il est possible que d'autres éléments soient instables. \n \n \n\n \n \nChangelog 3.31 : \n \nSys-con > 1.4.3\nSigmapatches > 19.0.0 v2\n \nMerci Vampitech ! \n \n \nTéléchargement : NeXT 3.31\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197757/in-switch-next-331-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[Switch] SwitchWave v1.0.0 disponible",
        "content": " \nLe développeur averne, à qui nous devons déjà Fizeau, Fuse-NX, ou encore un fork de FFmpeg, nous propose un tout nouveau lecteur vidéo intégrant l'accélération matérielle s'appuyant sur une restitution en utilisant le codec FFmpeg ainsi que mpv. \n \n \n\n \n\n \n\n \n\n \n \nChangelog : \n \n- Accélération matérielle personnalisée pour FFmpeg, avec mise à l'échelle dynamique de la fréquence. Les codecs suivants peuvent être décodés :\n         - MPEG1/2/4\n         - VC1\n         - H.264/AVC (10+ bit non supporté par le matériel)\n         - H.265/HEVC (12+ bit non supporté par le matériel)\n         - VP8\n         - VP9 (10+ bit non supporté par le matériel)\n- Support graphique personnalisé pour mpv utilisant deko3d, supportant :\n         - Lecture à 4k60fps\n         - Rendu direct (décodage logiciel plus rapide)\n         - Shaders de post-traitement personnalisés\n- Backend audio personnalisé pour le mpv utilisant les API natives de Nintendo, supportant des dispositions jusqu'à 5.1 surround\n- Lecture en réseau via Samba, NFS ou SFTP\n- Prise en charge des lecteurs externes à l'aide de libusbhsfs  \n- Interface utilisateur riche et réactive, même sous charge\n \n \nInstructions : \n \n- Téléchargez la dernière version, et extrayez-la à la racine de votre carte sd (faites attention à fusionner les dossiers et à ne pas les écraser).\n- Les partages réseau peuvent être configurés via l'application, tout comme les paramètres mpv via l'éditeur intégré.\n- La plupart des paramètres d'exécution pertinents peuvent être ajustés dynamiquement pendant la lecture via le menu, ou à défaut, la console (manuel)\n \n \nTéléchargement : SwitchWave v1.0.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197737/in-switch-switchwave-v100-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197737/in-switch-switchwave-v100-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1197737/in-switch-switchwave-v100-disponible-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1197737/in-switch-switchwave-v100-disponible-4.jpg"
        }
    },
    "news_17": {
        "title": "[PS5] La puce EMC analysée par Shuffle2 au Security Analyst Summit",
        "content": "Le développeur Shuffle2 a présenté ses travaux lors du Security Analyst Summit, en amont il avait annoncé qu'il rendrait à dispositions certains documents utiles lors de ses recherches. \n \nSes travaux, comme nous en informe le site Wololo.net, se sont portés sur la puce EMC de la PS5, après sa présentation il a mis à disposition sur les réseaux sociaux un dump décrypté du firmware de cette puce, pour plusieurs révisions du firmware. \n \n \n\n \n \n \nLa conférence donnera un aperçu général de l'architecture système de la console Playstation 5, en mettant l'accent sur les puces efc/eap (« titania ») et emc (« salina »). Les exploits permettant l'exécution de code sur salina et titania seront détaillés, ainsi que la publication d'un outil qui implémente les exploits. Le processus d'exploration/découverte initiale sera également brièvement abordé.\n \nDu point de vue d'un chercheur en sécurité, les exploits sont intéressants car ils couvrent un bug difficile à repérer dans une machine d'état du micrologiciel et exploitent une mauvaise configuration matérielle pour contourner les mesures de protection de la mémoire. Les exploits/outils permettent de poursuivre les recherches sur le système.\n \n \n \nPirater la puce EMC de la PS5 ne donnera pas accès à un hack de la console, l'EMC est un processeur qui est utilisé pour les diagnostics, les débogages ou encore le contrôle des périphériques. \n \nL'EMC sur la PS4 était appelé MediaCon, il s'agit d'une puce qui gère l'interface de débogage via l'UART qui ne dépend pas du Syscon, de plus cette puce utilise son propre kernel FreeBSD. \nPour la forme, Zecoxao a republié quelques fichiers dumps ici.\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197701/in-ps5-la-puce-emc-analysee-par-shuffle2-au-security-analyst-summit-1.png"
        }
    },
    "news_18": {
        "title": "[XB360] J-Runner avec Extras v3.3.0 r4 disponible",
        "content": "Le développeur Octal450 vient de mettre à jour J-Runner en version v3.3.0 r4 avec notamment la correction de plusieurs problèmes mais aussi l'amélioration de l'interface utilisateur. Ainsi cette mise à jour inclut plusieurs améliorations et corrections de bugs pour améliorer l’expérience utilisateur. \n \n \n\n \n \nVoici quelques-unes des nouveautés :\n \n- Amélioration de la commande “Nouvelle session” : Cette fonctionnalité a été optimisée pour une meilleure performance.\n- Mise à jour du patch XL HDD : Des correctifs ont été apportés pour les disques durs XL.\n- Correction de la détection d’image pour le modèle Corona 4GB : Un problème de détection d’image a été résolu pour ce modèle spécifique.\n \nEn plus de cela, une nouvelle interface a été introduite pour la génération de clés GPU simplifiant le processus pour de nombreux utilisateurs. \n \nPour télécharger cette mise à jour, il est recommandé de ne pas utiliser le fichier JR-Auto-Update-Delta.zip, mais plutôt de télécharger et d’extraire J-Runner-with-Extras.zip pour obtenir l’exécutable.\n \n \nTéléchargement : J-Runner avec Extras v3.3.0 r4\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197699/in-xb360-j-runner-avec-extras-v330-r4-disponible-1.jpg"
        }
    },
    "news_19": {
        "title": "[Multi] Flycast v2.4 supporte RetroAchievements (Android, Xbox et Switch)",
        "content": " \nLe meilleur émulateur de Sega Dreamcast, de Sega Naomi et d'Atomiswave est de retour dans une nouvelle version, en effet Flycast est désormais proposé en v2.4.\n \nFork de Reicast, Flycast est un émulateur efficace qui continue d'être maintenu, les fonctionnalités sont nombreuses et la qualité de restitution font de cet émulateur l'un des meilleurs, que ce soit sur Nintendo Switch, PlayStation Vita, Android ou Xbox.\n \nLa nouvelle version 2.4 prend en charge RetroAchievements et des miniatures sont désormais affichées pour les états de sauvegarde. De plus, Force Feedback a été implémenté pour certains jeux d'arcade. En bas du changelog, vous trouverez également des jeux qui fonctionnent désormais.\n \n \n\n \n \n \nChangelog : \n \n- Prise en charge de RetroAchievements\n- Améliorations de l'interface utilisateur avec les miniatures de l'état de sauvegarde\n- Prise en charge du retour de force pour certains jeux d'arcade (F355, 18 Wheeler, Maximum Speed, Faster Than Speed, Initial D, Club Kart, King of Route 66, Tokyo Bus Guide, Sega Driving Simulator)\n- Discord Rich Présence (Windows, macOS, Linux)\n- Android : vibrations de la manette de jeu, pilotes Adreno personnalisés et de nombreuses corrections de bugs et améliorations\n- Optimisations Vulkan par Wunkolo\n- Divers correctifs par vkedwardli\n- De nombreuses améliorations par scribam\n \nJeux nouvellement supportées :\n \n- Beach Spikers\n- Capcom vs SNK 2000 Pro\n- Irides: Master of blocks\n- Mars TV\n- Metropolis Street Racer\n- Mortal Kombat\n- Quake III\n- Red Dog Superior Firepower\n- Shin Nihon Pro Wrestling\n- Soul Surfer\n- Virtua Cop 2\n \n \nTéléchargement : Flycast v2.4\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197687/in-multi-flycast-v24-supporte-retroachievements-android-xbox-et-switch-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] La conférence de Specter nommée Byepervisor se tiendra demain",
        "content": "Le planning d'intervention de la convention Hardwear.io a été dévoilé, après 3 jours de trainings qui viennent de s'écouler, voilà désormais les deux journées de conférence qui auront lieu demain et vendredi. \n \n \n \n\n \n \n \n \nEt bien vu que nous avons le planning, nous pouvons voir que la conférence Byepervisor se tiendra demain, présenté par le célèbre développeur Specter, son intervention est prévue entre 15h30 et 16h10, soit une présentation assez rapide sur \"Comment nous avons cassé l'hyperviseur de la PS5\". \n \n \n \n\n \n \n \n \nTout est là : hardwear.io\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197680/in-ps5-la-conference-de-specter-nomme-byepervisor-se-tiendra-demain-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197680/in-ps5-la-conference-de-specter-nomme-byepervisor-se-tiendra-demain-1.png"
        }
    }
}