{
    "news_1": {
        "title": "[Switch] Lockpick_RCM 1.19.12 avec support firmware 18.0.0",
        "content": "Le développeur Descots dévoile une nouvelle version de Lockpick_RCM qui intègre le support du firmware 18.0.0 qui vient d'être proposé par Nintendo. \n \nBien entendu il s'agit d'une version modifiée de celle développée par shchmue, Nintendo ayant tappé fort sur cet utilitaire en faisant un exemple, un exemple qui sert aussi pour les autres car les homebrews sont retirés les uns après les autres désormais. \n \n \n\n \n \nLockpick_RCM est un payload Nintendo Switch qui va avoir la charge de dériver les clés de cryptage pour pouvoir utiliser des logiciels de manipulation de fichiers Switch comme hactool, hactoolnet/LibHac, ChoiDujour... sans démarrer Horizon OS. \n \nComme le firmware 18.0.0 apporte une nouvelle génération master_key_11, il fallait remettre à jour le payload. Il y a de forte chance que tout ceci disparaisse rapidement pour DCMA. \n \n \nChangelog : \n \n- Un nouveau firmware est sorti et il apporte la génération master_key_11.\n \n \nTéléchargement : Lockpick_RCM 1.9.12\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188600/in-switch-lockpick-rcm-11912-avec-support-firmware-1800-1.jpg"
        }
    },
    "news_2": {
        "title": "[XB] Une faille majeure dans les services de jeu Xbox",
        "content": " \nMicrosoft vient d'annoncer avoir découvert une faille majeure dans les services de jeu Xbox, une mise à jour doit rectifier le tir et ainsi protéger les utilisateurs. \n \nTous les constructeurs sont touchés par ce genre de failles de sécurité, récemment nous avons vu le PlayStation Store être inutilisable, ou bien encore Nintendo il y a quelques mois qui subissait ENLBufferPwn, en publiant de nombreux correctifs pour chaque jeu en ligne. \n \nLà aussi cette vulnérabilité pourrait permettre à un pirate d'accéder à des parties protégées du code Microsoft, la firme de Redmond informe qu'une faille de sécurité a été détectée dans les services de jeu Xbox le 20 Mars 2024.\n \n \n\n \n \nSelon les dire de Microsoft \" Un programme parviendrait à exploiter cette vulnérabilité pour obtenir des privilèges système \" sans en dire davantage si ce n'est qu'il s'agit de la CVE-2024-28916, par contre cette faille touche l'ensemble des applications Xbox, Xbox Family Settings ou celles du Game Pass sur PC, console et mobile.\n \n \nQuels privilèges pourrait-il obtenir s’il parvenait à exploiter cette vulnérabilité ?\n \n- Un attaquant qui parviendrait à exploiter cette vulnérabilité pourrait obtenir des privilèges système.\n \nSelon les métriques CVSS, le vecteur d’attaque est local (AV:L) et les privilèges requis sont faibles (PR:L). Quelles sont les répercussions de cette vulnérabilité ?\n \n- Un attaquant doit disposer d’un accès local à l’ordinateur ciblé et doit être en mesure de créer des dossiers et des traces de performance sur l’ordinateur, avec des privilèges restreints attribués par défaut à tous les utilisateurs.\n \nComment obtenir l'application de mise à jour ?\n \n- Le Microsoft Store mettra automatiquement à jour les clients concernés. Les clients peuvent également obtenir la mise à jour immédiatement ; voir ici pour des informations sur les applications installées sur votre appareil.\n \n- Il est possible de désactiver les mises à jour automatiques du Microsoft Store. Le Microsoft Store n'installera pas automatiquement cette mise à jour pour ces clients.\n \n- Si vous souhaitez obtenir des mises à jour immédiatement, ou si les mises à jour automatiques ne sont pas activées, sélectionnez Obtenir des mises à jour. Vous pouvez ensuite mettre à jour les applications individuellement en sélectionnant Mettre à jour pour chaque application, ou vous pouvez sélectionner Mettre à jour tout pour installer toutes les mises à jour. Nous vous recommandons de sélectionner Mettre à jour toutes les applications afin de rester protégé.\n \n- Les clients qui utilisent le Microsoft Store for Business et le Microsoft Store for Education peuvent obtenir cette mise à jour par l'intermédiaire de leur organisation.\n \nComment puis-je vérifier si la mise à jour est installée ?\n \nLes versions 19.87.13001.0 et ultérieures du paquet d'applications de ses services de jeu contiennent cette mise à jour.\n \nVous pouvez vérifier la version du paquet dans PowerShell :\n \n \n\nget-appxpackage Microsoft.GamingServices\n \n\n \n\n \nSelon les métriques CVSS, une exploitation réussie pourrait provoquer un changement d’étendue (S:C). De quoi s’agit-il pour cette vulnérabilité ?\n \nUne vulnérabilité exploitée peut toucher les ressources en dehors de l’étendue de sécurité gérée par l’autorité de sécurité du composant vulnérable. Dans ce cas, le composant vulnérable et le composant impacté sont différents et gérés par des autorités de sécurité distinctes.\n \n \nTout est là pour le côté Microsoft : CVE-2024-28916\n \n \nCôté développeur, c'est Wh04m1001, Filip Dragovich, a qui l'on doit tout ce travail impressionnant. Il a dévoilé une vidéo de démonstration sur son profil Github, il propose régulièrement des failles, et celle là marquera les esprits. \n \n \n \n\n \n \n \nTout est là : Wh04m1001/GamingServiceEoP\n \nMerci The-return pour l'info\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188551/in-xb-une-faille-majeure-dans-les-services-de-jeu-xbox-1.jpg"
        }
    },
    "news_3": {
        "title": "[Switch] Le firmware 18.0.0 publié pour la Switch bloque Atmosphère pour quelques jours",
        "content": "Nintendo vient de mettre en ligne un nouveau firmware pour la Nintendo Switch et la Nintendo Switch Lite, il s'agit du firmware 18.0.0 qui a pour objectif d'amener la possibilité de mettre la Switch en veille après 15 minutes de lecture sur un téléviseur. \n \n \n\n \n \nCe n'est pas tout Nintendo a également rajouté la traduction coréenne sur les restrictions d'âge, ce qui va largement nous servir. \n \nPlus sérieusement pour le moment Atmosphère ne fonctionne plus, et comme l'a dit SciresM si vous le suivez, il est en voyage au Japon actuellement et ne sera de retour que la semaine prochaine.\n \nIl ne faut donc pas attendre de mise à jour d'Atmosphère avant une bonne semaine, là où normalement il réagit dans les 24 à 48H. \n \nSi les rapports de Yellow's8 vous intéressent : rapports yls8\n \n \nChangelog officiel du firmware 18.0.0. : \n \n- Ajout de \"15 minutes\" en tant qu'option pour \"Mise en veille automatique lors de la lecture sur la télévision\" dans les paramètres du mode veille.\n \n- Ajout du coréen comme langue prise en charge pour la vidéo d'introduction \"Nintendo Switch Parental Controls\".\n \n- Lorsque la langue de la console est réglée sur le coréen, la vidéo est accessible depuis Paramètres > Contrôle parental.\n \n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188488/in-switch-le-firmware-1800-publie-pour-la-switch-et-bloque-atmosphere-pour-quelques-jours-1.png"
        }
    },
    "news_4": {
        "title": "[PS4] PS4 Player 3D v1.00 disponible",
        "content": "Le développeur Lapy propose un tout nouvel homebrew pour les PS4 et les PS4 Pro qui disposent de firmwares sensibles, il s'agit de PS4 Player 3D qui est proposé en v1.00.\n \n \n\n \n\n \n \nLivré depuis 2 heures environ, cet homebrew permet la lecture de video 3D avec suport VR. Attention seul le format MP4 est supporté. \n \n \n\n \n \n \nPS4 Player 3D 1.00\n \n- Lecteur vidéo 3D avec support VR (non requis)\n- Copiez vos vidéos 3D dans un dossier nommé 3DVideos sur une clé USB ou dans /data.\n- L'application peut configurer automatiquement votre lecture si vous ajoutez l'une de ces chaînes au nom du fichier vidéo :\n \n_180 (pour les vidéos à 180º)\n_360 (pour les vidéos à 360º)\n_TB (pour les vidéos TOP BOTTON)\n_LR (pour les vidéos LEFT RIGHT)\n_EQU _CUB _EAC\n \nExemple : Delicious Fight_LR.mp4, Night Sky_360_TB\n \n \nTéléchargement : PS4 Player 3D v1.00\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188476/in-ps4-ps4-player-3d-v100-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1188476/in-ps4-ps4-player-3d-v100-disponible-2.jpg"
        }
    },
    "news_5": {
        "title": "[Switch] Le firmware 1.1.2 est là pour le Mig Switch",
        "content": "L'équipe en charge du développement du Mig Switch vient de mettre en ligne une nouvelle mise à jour pour son linker, il s'agit du firmware 1.1.2 qui permet aux développeurs de faire un peu leur mea-culpa. \n \nL'équipe fait sa repentance en disant \" Nous avons fait tout notre possible pour tester en profondeur nos produits Mig avant leur sortie, mais rien ne peut rivaliser avec une large base d'utilisateurs testant quotidiennement le Mig Switch dans toutes les conditions. Une fois de plus, un de nos chers utilisateurs nous a signalé un bug avec un certain type de carte microSD ne fonctionnant pas avec Mig Switch.\n \nAprès une enquête minutieuse, nous avons trouvé le problème et l'avons corrigé.\" \n \nC'est donc comme cela que l'équipe justifie l'arrivée de ce firmware 1.1.2 qui vient corriger ce problème sur les cartes microSD Kingston. \n \n \n \n \n \n\n \n \n \nChangelog :\n \n- Ajout du support pour les cartes microSD Kingston et plusieurs autres modèles et marques.\n \n \nTéléchargement : Firmware 1.1.2 pour le Mig Switch\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188471/in-switch-le-firmware-112-est-la-pour-le-mig-switch-1.png"
        }
    },
    "news_6": {
        "title": "[Oldies] La NES dispose d'un port d'extension exploitable",
        "content": "Cela peut paraitre assez improbable, mais la NES n'a pas encore livré tous ces secrets, ou du moins tout son potentiel car il existe un port d'extension sur la NES qui pourrait être utilisé. \n \nLa NES, la console 8 bits de Nintendo, dispose d'un port d'extension de 15 broches sous la console mais dont Nintendo n'a jamais publié d'accessoires l'utilisant. \n \n \n\n \n \nBien entendu certains se sont déjà amusé avec ce port, comme par exemple Trapper McFerron qui l'a utilisé pour envoyer des tweets depuis sa NES, ou encore Perkka2 qui a créé un générateur de son, mais aucun accessoire n'a jamais été conçu, jusqu'à la découverte du projet de RetroTime qui vient de concevoir plusieurs prototypes d'un accessoire nommé NES Hub. \n \n \n\n \n \nCette carte qui vient donc se raccorder dans cette extension de 15 broches permet de prendre en charge un contrôleur sans fil jusqu'à 4 périphériques, permet de prendre en charge de manière encore expérimentale les périphériques Famicom ou est une extension audio permettant la prise en charge des fonctions audio qui n'était pas présente sur la NES mais sur la Famicom. \n \n \n \n\n \n\n \n \nThéoriquement le NES Hub pourrait aussi permettre de raccorder le Family Computer Disk System sur une NES européenne. \n \n \n\n \n\n \n\n \nPour l'heure, le développement est encore en phase bêta, RetroTime prévoit de livrer quelques prototypes pour finaliser les fonctionnalités et la conception, ce genre d'accessoires pourrait aussi intéresser des professionnels du retrogaming comme 8bitmods. \n \n \n\nMerci HoYoHoYo pour l'info\n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188424/in-oldies-la-nes-dispose-dun-port-dextension-exploitable-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1188424/in-oldies-la-nes-dispose-dun-port-dextension-exploitable-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1188424/in-oldies-la-nes-dispose-dun-port-dextension-exploitable-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1188424/in-oldies-la-nes-dispose-dun-port-dextension-exploitable-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1188424/in-oldies-la-nes-dispose-dun-port-dextension-exploitable-5.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1188424/in-oldies-la-nes-dispose-dun-port-dextension-exploitable-6.jpg",
            "image_7": "https://www.logic-sunrise.com/images/news/1188424/in-oldies-la-nes-dispose-dun-port-dextension-exploitable-7.jpg"
        }
    },
    "news_7": {
        "title": "[PS3] AutoHEN 3.3.0 pour HFW 4.91 disponible",
        "content": "Le développeur Coro propose la mise à jour d'AutoHEN en version 3.3.0 destiné aux hybrid firmware 4.91. AutoHEN a été conçu pour installer le HEN 3.3.0 sur les HFW 4.91 et le HEN 3.2.2 sur les HFW 4.90.\n \nLa page propose aussi des liens alternatifs permettant d'installer aussi les HEN des firmwares 4.80, 4.82, 4.83 jusqu'à 4.91 selon les firmwares. \n \n \n \n\n \n \n \n \nAvec votre console PS3 allez directement sur ce lien (avec l'hybrid firmware d'installé) : \n \nhttps://ps3addict.github.io/autohen/\n \nAvec votre PC :\n \nhttps://ps3addict.github.io/\n \nTéléchargement : AutoHEN 3.3.0 pour HFW 4.91\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188422/in-ps3-autohen-330-pour-hfw-491-disponible-1.jpeg"
        }
    },
    "news_8": {
        "title": "[Switch] Le nouveau Yuzu/Suyu se nomme Sudachi",
        "content": "Comme vous le savez Nintendo est parti en croisade contre toutes les propositions qui touchent à la Nintendo Switch, un nouveau venu, Sudachi, qui dévoile ses progrès en matière d'émulation. \n \n \n\n \n \nLes développeurs dévoilent les premiers screens de l'émulation de Princess Peach Showtime avec Sudachi sous Vulkan, OpenGL GLSL et OpenGL GLASM, l'émulateur Sudachi est présenté comme un émulateur Nintendo Switch pour Android, Linux, macOS et Windows écrit en C++, auparavant il se nommait Yoozoo, mais comme vous pouvez vous en doutez tout cela est né des cendres de Yuzu. \n \n \n\n \n \nPour le moment seules les version Android et Windows sont proposées, et c'est déjà pas mal, mais les versions MacOS et Linux suivront probablement. De plus, le développeur propose Sudachi pour iPad et iPhone en utilisant le moteur de rendu Vulkan à travers un MoltenVK modifié, écrit en C++, Objective-C et Swift.\n \n \nTéléchargement : Sudachi v7715077\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188421/in-switch-le-nouveau-yuzusuyu-se-nomme-sudachi-1.png"
        }
    },
    "news_9": {
        "title": "[PS3] Le CFW 4.91.2 Evilnat Cobra 8.4 Bêta 1 disponible pour test",
        "content": "Le développeur Nathan Martin, alias Evilnat, a besoin de vous, il vient il y a  3 heures de libérer la première version Bêta de son nouveau custom firmware pour la PS3. \n \nVoilà donc le CFW 4.91.2 Evilnat Cobra 8.4 Bêta 1 qui est disponible, mais attention comme nous vous le disons il s'agit d'une première version bêta testeur, pas d'une version définitive du 4.91.2. \n \nPour le moment, seules les version PEX (CEX) et D-PEX (DEX) sont proposées, il a par exemple besoin de savoir si les bugs apparus aléatoirement dans les ISOS PS3/PS2/PSP/PS1 et Redump ont été résolus avec tous les correctifs qu'il a appliqué à cette version 4.91.2. \n \n \n \n\n \n \n \n \nSi vous souhaitez tester cette nouvelle version et bien entendu apporter votre pierre à l'édifice de la version finale, il faudra faire remonter tout bug au développeur. \n \nTéléchargement : CFW 4.91.2 Evilnat Cobra 8.4 Bêta 1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188390/in-ps3-le-cfw-4912-evilnat-cobra-84-beta-1-disponible-pour-test-1.jpg"
        }
    },
    "news_10": {
        "title": "[Switch] DayBreak-Converter lui aussi retiré pour DCMA",
        "content": "Le projet DayBreak Converter, de notre ami développeur et sunriseur MurasakiNX, à qui l'on devait aussi le projet NXPayload-Converter, a vu ses deux projets retirés pour DCMA. \n \nDayBreak-Converter était le fruit de NXPayload-Converter, une proposition sous forme de programme permettant de modifier les fichiers présents dans le firmware de votre console Nintendo Switch pour les rendre compatible avec DayBreak. \n \nDayBreak, intégré à Atmosphere, est un homebrew signé SciresM et qui permet d'installer un firmware directement sur sa console (upgrade ou downgrade dans certaines conditions) sans passer par les serveurs de Nintendo.\n \n \n\n \n \nDayBreak-Converter était un outil qui avait besoin du programme hactool.exe et du fichier prod.keys pour fonctionner, ce qui est certainement la cause du retrait pour DMCA.\n \nDe toute façon nous voyons bien que Nintendo s'attaque à tous les programmes, homebrews, logiciels qui touche aux prod.keys, voir à la Nintendo Switch. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188388/in-switch-daybreak-converter-lui-aussi-retire-pour-dcma-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] PCXSense v0.9.2 Bêta disponible",
        "content": "Le développement de PCXSense continue, l'alternative la plus efficace à DS4Windows qui a été arrêté par Travis Nickles (alias Ryochan), bien qu'il ne s'agisse pas d'un fork de celui-ci, l'efficacité de PCXSense est remarquable. \n \nEn quelques versions son développeur principal, Denellyne, a fait de lui une véritable solution optimisée pour permettre d'utiliser votre propre Dualsense sur votre ordinateur sans tracas sur n'importe quel jeu de votre choix, mais il y a quelques fonctionnalités intéressantes que vous pourriez également apprécier, sur des émulateurs comme Yuzu et Cemu, les gâchettes adaptatives deviennent plus dures et plus courtes, tandis que sur Dolphin, le logiciel émule les manettes GameCube. \n \nDans cette nouvelle version, le développeur a ajouté les vibrations sur chaque pression sur un bouton, et une option pour lancer automatiquement PCXSense du boot de votre système. Il rajoute que le code a été optimisé même si globalement celui-ci n'a pas réellement été modifié au niveau de son poids.\n \n \n\n \n \nChangelog : \n \n- Ajout d'une option permettant d'ajouter un grondement à chaque pression de bouton.\n- Ajout d'une option pour lancer PCXSense au démarrage\n- Code optimisé\n \nEdit 28.03.24\n \nTéléchargement : PCXSense 0.9.2 Bêta \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188387/in-switch-pcxsense-v09-beta-disponible-1.gif"
        }
    },
    "news_12": {
        "title": "[Switch] Les puces du Mig-Switch Dumper ne sont pas grattées",
        "content": "Lors de la livraison des Mig Switch de nombreux acheteurs de la première heure ont ouvert la partie plastique du linker pour découvrir l'intérieur de la bête, une procédure bien légitime qui s'est avérée surtout montrer que la Team Mig Switch avait fait le choix de gratter les puces pour en enlever les références. \n \nParfois cette procédure était bien faite, parfois un peu moins, et il s'est même produit que certains Mig Switch ne soit même pas grattés. \n \nLes premières livraisons du Mig-Switch dumper se sont fait attendre, l'équipe s'est même excusée du retard accumulé car nombreux sont ceux qui ont précommandé le dumper sans le voir arriver, suscitant quelques craintes sur le sérieux de l'opération.\n \n \n\n \n \nAu final, les premières livraisons du dumper viennent d'intervenir, et surprise à l'ouverture, toutes les références des puces sont lisibles parfaitement, le grattage n'a pas été effectué, une erreur ou une volonté de ne plus faire cette étape, quoiqu'il en soit nous pouvons voir désormais les deux principales puces qui sont intégrées. \n \n \n\n \n \nUne puce SoC FPGA ESP32-S2F fabriquée par Espressif Systems (environ 1 euro) et une puce FPGA ICE40UP5K-SG48I fabriquée par Lattice Semiconductor (environ 8 euros). \n \n \n \n\n \n \n \nBien entendu tout cela ne nous permet pas de dire que des clones vont apparaitre après demain, mais ce qui est sûr c'est que certains plus facilement se pencher dessus pour voir si cela est réalisable. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188385/in-switch-les-puces-du-mig-switch-dumper-ne-sont-pas-grattees-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1188385/in-switch-les-puces-du-mig-switch-dumper-ne-sont-pas-grattees-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1188385/in-switch-les-puces-du-mig-switch-dumper-ne-sont-pas-grattees-2.png"
        }
    },
    "news_13": {
        "title": "[PS3] webMAN MOD 1.47.46 disponible",
        "content": "Le développeur Aldo Vargas, alias Aldostools, vient de mettre en ligne une nouvelle version de son célèbre plugin webMAN MOD qui est désormais proposé en version 1.47.46. \n \nCette version intègre bien entendu le support de tous les firmwares compris entre le firmware 4.75 et le 4.91 que ce soit des CFW/HFW/CEX/DEX/PEX/D-PEX/DECR.\n \nCe n'est pas tout, il en a profité pour ajouter des fichiers de cache clairs au menu XMB, ajouté une notification sonore si le fichier copié fait plus de 1 Go (il sera possible de désactiver cette option), et mettre à jour la base de données des correctifs PS2.\n \n \n \n\n\n \n \nChangelog : \n \n- Ajout des fichiers de cache webMAN clairs au menu XMB \n- Ajout d'une notification sonore après copie > 1 Go ou après analyse de jeux (décochez BEEP dans /setup.ps3 si vous souhaitez le désactiver) \n- Mises à jour de la base de données de configuration PS2 avec correctifs par@mrjaredbeta,@agrippa,@kozarovv.\n- Mise à jour cumulative (comprend plus de 82 changements dans la suite d'outils après la version 1.47.45).\n \nTéléchargement : webMAN MOD 1.47.46\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188384/in-ps3-webman-mod-14746-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1188384/in-ps3-webman-mod-14746-disponible-2.png"
        }
    },
    "news_14": {
        "title": "[Multi] RetoArch 1.18.0 disponible",
        "content": " \nUn émulateur qui tient face au vent fort qui souffle en ce moment, RetroArch est de retour ! Attendue depuis des mois, cette nouvelle version 1.18.0 fait enfin réapparaitre l'un des plus célèbres émulateur multi-plate forme de jeux vidéo. \n \nPour l'heure le site internet n'a pas encore été mis à jour, cela ne devrait pas tarder, sachant que le code source de la version 1.18.0 est bien disponible sur le github. La mise à jour sera certainement disponible quand vous lirez ces lignes (si vous ne vous levez pas trop tôt), et elle apporte comme toujours un énorme lots de nouveautés. \n \n \n\n \n \nCela passe par de nombreux correctifs, des améliorations, des correctifs sur les traductions, l'ajout d'options de changements de disques, ou encore des optimisations sur le mode DRM. D'autres améliorations sur iOS/TVOS, Android et Linux sont aussi de la partie. \n \n \n\nChangelog 1.18.0 : \n \n\n \nAI: Fix narrator language when AI translation and menu languages are different\nDISK CONTROL: Add option to disable initial disk change\nDISK CONTROL: Visibility option for disk control notifications\nDRM: Fix mode vrefresh calculation. When using an interlaced/doublescan mode, the vertical refresh rate is mis-calculated.\nEMSCRIPTEN: Fix mouse Y parameter translation in rwebinput\nINPUT: Fix input state combos including R3 and false triggers of RETROK_UNKNOWN\nINPUT: Add a new turbo mode, \"Classic (Toggle)\"\nINPUT: Fix bind hold when axis does not rest at 0\nINPUT: Limit axis threshold setting to sensible values\nINPUT: Add Overlay Mouse, Lightgun, and Pointer\nINPUT/ANDROID: Fix mouse grab behavior on Android\nINPUT/LINUXRAW: Fix device name and hotplug reconnect\nIOS: Minor iOS JIT availability information\nIOS/TVOS: Pause application on applicationWillResignActive\nLIBRETRO: Add Doxygen-styled comments to parts of the libretro API\nLUA: Update Lua to version 5.3.6\nMENU: Add sublabels for input bind common entries\nMENU: Don't load history and favorites if size is 0\nMENU: Don't disable fast forward when entering menu\nMENU: Widget position, size, color, icon adjustments\nMENU: Fix savestate slots in Qt UI\nMENU: Reorder and reduce depth of User Interface menu\nMENU/OZONE: Fix sidebar wraparound, visibility after config load, crash after playlist delete\nMENU/OZONE: Fix sidebar and sublabel animations\nOSX/MACOS: Fix crash on non-Metal build\nOSX/MACOS: Add portable.txt as flag for portable install\nREMOTE RETROPAD: add display for analog axes, indication of inputs already pressed\nSAVES: Allow combining saves in content dir with save sorting\nSHADER: Added rolling scan line simulation based on the shader subframe feature. This is implemented with a scrolling scissor rect rather than in the shader itself as this is more efficient although may not work for every shader pass - we may need an option to exclude certain passes. The implementation simply divides the screen up by the number of sub frames and then moves the scissor rect down over the screen over the number of sub frames\nTVOS: Force asset re-extraction when cache is deleted\nTVOS: Add history and favorites to Top Shelf\nTVOS: Fix crash when history item does not have a label\nUWP: Enable HAVE_ACCESSIBILITY for UWP builds\nUWP: Allow UWP build to work with a modified version of Mesa Gallium D3D12\nVIDEO: Add subframe shader support for Vulkan/GLcore/DX10-11-12, enabling shaders to run at higher framerate than the content\nVIDEO: Fix restoring fullscreen/windowed setting when unloading override\nVIDEO/VULKAN: Fix HDR with Vulkan after reinit\nVIDEO/VULKAN: Remove the use of oldSwapchain\nVIDEO/GL2: Fix OpenGL ES version detection\nWEBDAV: Fixed SEGFAULT in WebDav task sync + type changes\nWEBOS: Fix build, add core location on webosbrew.org\nWIN32: Fix Alt+Enter not working when menubar is disabled\n \n \n\n \n\n \nTéléchargement : \n \nhttps://retroarch.com/?page=platforms\n \nhttps://github.com/libretro/RetroArch/releases\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188335/in-multi-retoarch-1180-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[Switch] Suyu see you, Gitlab supprime Suyu",
        "content": "Les retraits d’émulateurs et d'homebrews qui sont liés à la Nintendo Switch continuent. Sur demande de Nintendo et donc peu de temps après sa mise à disposition Suyu se voit donc être supprimé de Gitlab. \n \nSuyu était un émulateur Switch issu d'un fork de Yuzu, malheureusement suite à une demande de retrait de Nintendo pour DMCA le projet prend du plomb dans l'aile. \n \nD'un autre côté le discord n'autorise pas de nouveaux membres et la page de téléchargement de Gitlab a été supprimé.\n \n \n\n \n \nPour l'heure il reste encore quelques brides, comme un accès autohébergé qui permet encore de télécharger les releases, ou bien des sauvegardes alternatives mais officiellement le projet a bien été retiré de Gitlab. \n \nA noter que Linkynimes nous informe en parralèle que sont projet AtmoPack-Vanilla a lui aussi été retiré de Gitlab.\n \nTout est là (encore mais pour combien de temps) : \n \nhttps://gitlab.com/suyu-emu/suyu-releases\n \nhttps://gitlab.com/openretro/suyu\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188334/in-switch-suyu-see-you-gitlab-supprime-suyu-1.png"
        }
    },
    "news_16": {
        "title": "[Switch] Suyu v0.0.2 Bêta disponible",
        "content": "La toute première version officielle de Suyu vient de sortir en version Bêta 0.0.2. \n \nSuyu est un tout nouvel émulateur reprenant le code source de Yuzu et qui est proposé pour Windows, Linux, MacOS et Android. \n \n \n\n \n \nChangelog : \n \n- Rebrand complet\n- Génération d'icônes ICNS\n- Gestion des erreurs\n- Intégration initiale de Qlaunch (bugué/nécessite des tests supplémentaires, nécessite le firmware V17.0.0 ou plus récent)\n- Gitlab ci pour les builds automatisées\n- Exige que toutes les clés soient fournies par l'utilisateur, ainsi que le firmware\n- Amélioration du gestionnaire de modules complémentaires\n- Diverses corrections de crashs\n- Travail initial pour la prise en charge de MacOS\n- Correction de la lecture vidéo sur les périphériques AMD\n- Activation de plus de fonctionnalités sur les pilotes propriétaires AMD\n- Réimplémentation de l'API multijoueur\n- Suppression de toutes les données télémétriques\n- Nouvelles options/améliorations de l'interface utilisateur\n- Changements de qualité (QOL)\n \n \nTéléchargement : Suyu v0.0.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188276/in-switch-suyu-v002-beta-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[Wii/WiiU] WiiStation v3.2 disponible",
        "content": "Le développeur xjsxjs197 vient de mettre à jour WiiStation, comme vous le savez l'émulateur WiiSX-RX a changé son nom en WiiStation, pour rappel le programme permet d'émuler les titres de la PlayStation 1 (PS1 / PSX / PSone) sur les consoles Wii et Wii U, basé à son tour sur le port de PCSX-Reloaded et avec beaucoup plus de modifications que PCSX-ReARMed.\n \nCette mise à jour corrige quelques bugs, implémente de nouveaux détails et limite les erreurs, les freezes et le trop plein de mémoire. \n \n \n \n \n\n \n \n \n \nChangelog :\n \n- SPU : Correction du débordement de nombres à 16 chiffres.\n- psxbios : implémente encore plus de détails sur la carte mémoire.\n- Corrige le gel de la Formule 1 au premier écran de chargement.\n- Mise à jour vers la dernière libCHDr.\n- Pour éviter les erreurs où les jeux CHD occupent trop de mémoire, déplacez le tampon 4M de Lightrec vers la mémoire MEM2.\n \n \nTéléchargement : WiiStation 3.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188275/in-wiiwiiu-wiistation-v32-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[PS3] PyPS3tools et PS3DumpChecker supportent le firmware 4.91",
        "content": " \nNotre ami sunriseur et le développeur littlebalup a mis à jour son outil PyPS3tools et son outil PS3DumpChecker afin qu'ils supportent les hashs du firmware 4.91.\n \nCes deux scripts regroupent des outils python pour analyser les dumps de mémoire flash de PS3. Il a aussi mis à jour PS3 Dump Checker qui est un utilitaire de downgrade de PS3 développé à l'origine par Swizzy, permettant de checker et vérifier les dumps NAND ou NOR pour rajouter le support des CFW 4.91 (à partir du CoreOS du custom firmware 4.91 d'Evilnat) et de l'OFW 4.91. \n \n \n \n\nChangelog PyPS3tools : \n- Ajout des hashes Evilnat 4.91 CEX\n- Ajout du support 4.91\n \nChangelog PS3DumpChecker :\n- Mise à jour vers la build 504\n \n \nNota Bene\n- Personne ne pourra être tenu responsable pour tout faux négatif ou faux positif donné par cette application. La responsabilité de la validité des dumps est la votre, et uniquement la vôtre, pas celle de littlebalup, ou encore Logic-Sunrise.\n- Cet outil doit être considéré comme un moyen facile de faire une vérification rapide afin de voir s'il est nécessaire d'approfondir les recherches.\n- Merci de faire remonter tout éventuel bug, faux négatif ou faux positif à littlebalup afin de lui permettre d'améliorer ces applications.\n \nEn plus de tout cela, littlebalup a aussi proposé une version HFW du firmware 4.91 Dualboot mais aussi la version Hybride, l'idée étant de proposer un firmware qui dispose de la désactivation des contôles ECDSA, permettant l'installation d'un CFW éventuellement. \n \nComme vous le savez ces firmwares Dualboot permettent de jouer à des jeux originaux, mais aussi de profiter du HEN.\n \n \nTéléchargement : PyPS3tools / PS3DumpChecker / Littlebalup's 4.91 Dual Boot firmwares\n \nMerci Littlebalup\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188250/in-ps3-pyps3tools-et-ps3dumpchecker-supportent-le-firmware-491-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] GameBato augmente encore ses vitesses de téléchargement",
        "content": "Le développement de GameBato est toujours d'actualité, et la solution semble se maintenir dans son schéma économique partagée entre le gratuit et le payant. \n \nEt pour preuve, dans la dernière mise à jour, l'équipe en charge du développement a réussi encore à augmenter entre 35 et 120 % les vitesses de téléchargement en mode GameBato, ceci s'applique autant aux utilisateurs Premium que gratuits (Free).\n \nC'est le seul changement, du coup la numérotation ne change pas, il suffit de rouvrir l'application pour la mettre à jour, et ainsi appliquer les modifications. \n \n \n\n \n \n \nChangelog Mise à jour du patch !\n \n- Augmentation de la vitesse de téléchargement de 35% à 120% pour les téléchargements en mode GameBaTo.\n- Cela s'applique aux utilisateurs Premium et Free.\n- Réouvrir l'application pour qu'elle soit mise à jour et implémentée.\n- La version de l'application restera intacte.\n \nTout est là : GameBato\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188235/in-ps4-gamebato-augmente-encore-ses-vitesses-de-telechargement-1.png"
        }
    },
    "news_20": {
        "title": "[Switch] Un nouveau firmware pour le Mig Switch disponible",
        "content": "Seconde mise à jour de Mars 2024 pour le Mig Switch, l'équipe en charge du développement ne se tourne pas les pouces, et propose donc un nouveau firmware pour leur périphérique. \n \nBon, il ne s'agit pas d'une mise à jour importante, qui n'apportera pas de grosses nouveautés, mais elle vise à corriger un bug que certains utilisateurs du Mig ont découvert avec des caractères non latins ou spéciaux (chinois, symboles spéciaux, etc.).\n \nL'équipe russe tient à remercier les utilisateurs pour leurs retours et suggestions, ils aident aussi à améliorer le produit, à corriger les bugs, et sont bénéfiques pour tout le monde.\n \n \n\n \n \nChangelog : \n \n- Ajout de la prise en charge des noms de fichiers contenant des caractères Unicode\n \n \nTéléchargement : Mig Switch.com firmware 1.1.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188216/in-switch-un-nouveau-firmware-pour-le-mig-switch-disponible-1.png"
        }
    }
}