{
    "news_1": {
        "title": "[Vita] Apollo Save Tool v2.0.0 disponible",
        "content": "Le développeur Bucanero vient de mettre en ligne la version 2.0.0 d'Apollo Save Tool pour la PlayStation Vita. Les nouveautés sont nombreuses, et cette version 2.0.0 n'échappe pas à la règle, elle est riche en options et optimisations. Avec cette v2.0.0, vous pouvez désormais sauvegarder et restaurer vos sauvegardes Vita/PSP/PS1 sur le cloud en utilisant votre propre serveur FTP, mais le changelog est beaucoup plus détaillé. \n \n \n\n \n \nAjout :\n- Prise en charge du serveur FTP (enregistrement de la sauvegarde dans le cloud)\n- Compressez, téléchargez et sauvegardez les enregistrements sur un serveur FTP défini par l'utilisateur\n- Répertorier, télécharger et restaurer les sauvegardes à partir d'un serveur FTP défini par l'utilisateur\n- Sauvegarde des sauvegardes PS1, PSP et Vita\n- Ajoutez la prise en charge d'emplacements de stockage supplémentaires ( imc0, xmc0)\n \nMenu Paramètres :\n- FTP Server URLOption ajoutée\n- Ajout de l'option de sélection ( FTP/Online DB) pour les téléchargements de sauvegardes\n- Debug logOption persistante\n \nCorrections : \n- Correction .PSVde l'en-tête lors de l'exportation des sauvegardes PS1\n- Correction du processus de copie de sauvegarde sur le stockage utilisateur ( ux0:user/)\n \nDivers :\n- Mise à jour du moteur de correctifs Apollo vers la version 1.3.0\n- Correction du bug de recherche de code SW\n- Ajout de la fonction de hash djb2 \n- Ajout de la prise en charge des balises pour les options sélectionnées par l'utilisateur sur .savepatchles fichiers , par exemple,{ZZ}val=name;03E7=999 gold;...;270F=9999 gold{/ZZ}\n- Prise en charge de SaveWizard et des codes BSD avec plusieurs options\n- Bibliothèque cURL mise à jour vers la version 8.9.1\n \n \nTéléchargement : Apollo Save Tool v2.0.0\n \n  \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206533/in-vita-apollo-save-tool-v200-disponible-1.jpg"
        }
    },
    "news_2": {
        "title": "[Switch] MissionControl supporte désormais les firmwares 20.0.x",
        "content": "Le développeur ndeadly vient de mettre à jour sa proposition MissionControl afin qu'elle puisse supporte les firmwares 20.0.0 et 20.0.1, une implémentation que de nombreux logiciels et homebrews Switch vont devoir adopter. \n \nIl s'agit de la vingt-sixième version officielle de Mission Control, cette version apporte donc un support complet pour les firmwares 20.0.0 et 20.0.1, une implémentation d'un nouveau format de mouvement basé sur les quaternions trouvé dans les firmwares des contrôleurs récemment par Banz99 ainsi que diverses autres corrections de bugs et améliorations. \n \n \n\n \n \nChangelog : \n \n- Ajout de la prise en charge complète des firmwares 20.0.X\n- Ajout de l'implémentation d'un nouveau format de données de mouvement basé sur les quaternions.\n- Ajout de correctifs exefs pour HID afin de modifier les indicateurs de fonctionnalités prises en charge pour les manettes Pro sous licence tierces. Le remappage des boutons, le stick analogique et l'étalonnage des mouvements sont désormais activés.\n- Le type de manette émulée a été remplacé par une manette Pro sous licence. Cela empêche la console de lire les données NFC des manettes émulées, ce qui provoquait des blocages et des grincements dans certains jeux.\n- Sysmodule n'initialise plus les services btm/btm:sys au démarrage afin de laisser les sessions disponibles pour d'autres applications homebrew.\n- Ajout d'un mécanisme via les correctifs exefs Bluetooth pour implémenter des commandes personnalisées appelées via la fonction IPC WriteHidData2. Cela permet d'exposer les fonctions internes de la pile Bluetooth.\n- Ajout de commandes IPC au service mc pour exposer les appels d'envoi de commandes HCI arbitraires et l'appel de la fonction interne BSA_DmSetConfig.\n- Ajout d'un mécanisme permettant aux logiciels externes d'utiliser la redirection d'événements de rapport caché pour consommer les événements redirigés ou les renvoyer au système.\n \nTéléchargement : MissionControl 0.13.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206493/in-switch-missioncontrol-supporte-desormais-les-firmwares-200x-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS3] Le downgrade de la PS3 Superslim grâce à BadWDSD",
        "content": " \nLe développeur esc0rtd3w que l'on ne présente plus a réussi à downgrade avec l'exploit BadWDSD. Conçu surtout pour permettre l'overclock cet exploit va donc être la solution pour la Superslim.\n \nL'utilisateur NGX a confirmé d'abord être la troisième personne à réussir à overclocker une PS3 Superslim grâce à cet exploit, les résultats concernant les valeurs maximales d'overclocking sont surprenantes, des possibilités énormes grâce à BadWDSD. \n \n \n\n \n\n \n \n \nMais la grande information vient donc de esc0rtd3w qui a réussi à downgrade, il informe sur psx-place.com que cela est plus facile que d'habitude avec une puce Pico installée. Il a downgrade une NOR superslim du firmware 4.91 au 4.40, et il affirme qu'un autre utilisateur a réussi à downgrade du 4.92 au 4.82. \n \n \n \n\n \n \nD'après ses informations, cela ne fonctionne que sur les NOR pas sur les eMMC, il tient à remercier Kafuu pour son excellent travail. \n \nLe développeur Kafuu a défini la version 4.00 lors de la récupération avec les correctifs de sa PS3, ce qui pourrait sembler être le firmware min accessible, mais il faudra un peu de temps pour le confirmer. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206492/in-ps3-le-downgrade-de-la-ps3-superslim-grace-a-badwdsd-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1206492/in-ps3-le-downgrade-de-la-ps3-superslim-grace-a-badwdsd-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1206492/in-ps3-le-downgrade-de-la-ps3-superslim-grace-a-badwdsd-3.jpg"
        }
    },
    "news_4": {
        "title": "[Switch] hekate v6.3.0 &#38; Nyx v1.7.0 disponibles",
        "content": " \nLe développeur CTCaer propose les mises à jour d'Hekate et de Nyx suite à la sortie du nouvel Atmosphère. hekate v6.3.0 & Nyx v1.7.0 viennent d'être mis en ligne pour apporter le support de la toute nouvelle version de chacun d'entre eux. Ces nouvelles versions amènent énormément de nouveautés, la principale étant le support du firmware 20.0.0 et 20.0.1. \n \n \n\n \n \n \nModifications de hekate v6.3.0\n- Prise en charge de HOS 20.0.0\n- Configuration : pkg3La prise en charge des clés ajoutées, qui remplacent fss0exactement la fonctionnalité,\nfss0continuera de fonctionner pour des raisons de compatibilité, mais elle est désormais obsolète . Elle deviendra obsolète\nà terme . fss0Assurez-vous donc de mettre à jour vos configurations pour l'utiliser pkg3.\n- Les modèles ont été mis à jour pour utiliser cette fonctionnalité.\n- Configuration : Ajout pkg3kip1skipde la prise en charge des clés. Utilisateurs avancés uniquement. Consultez le fichier README.\n- Configuration : atmospherela clé est désormais renommée en kernelprocidpour correspondre à ce qu'elle fait.\n- Seuls les utilisateurs avancés qui n'utilisent pas fss0/pkg3 sont concernés par cela.\n- Configuration : fss0experimentalla clé a été renommée enpkg3ex\n- Correction de l'analyse de system_settings.inil'activation USB3. Merci.@new-waifupour le rappeler.\n- Correction d'un problème qui pouvait provoquer un écran noir au démarrage du stock dans certains cas rares (lié à kerneldr)\n- L4T : Mise à jour du micrologiciel SC7exit vers la dernière version\n- L4T : Ajout d' sld_typeune clé qui vous permet de désactiver l'affichage transparent ou d'utiliser la méthode coreboot obsolète\n \nModifications emuMMC :\n- Prise en charge de HOS 20.0.0\n- Comme toujours basé sur https://github.com/m4xw/emuMMC\n \nModifications de Nyx v1.7.0 :\n- Prise en charge de HOS 20.0.0\n- Le benchmark SD/eMMC affiche désormais les IOPS standard du 95e et du 5e percentile. Il utilise également les tailles de test A2 conformes aux spécifications.\n- De plus, la fenêtre a été rendue plus compacte afin que les informations situées en dessous restent visibles pour le partage de captures d'écran.\n- En raison des modifications, il est préférable de comparer les cartes SD sur le même benchmark mis à jour.\n- Les 95 % des meilleurs accès correspondent généralement aux performances attendues.\n- Les 5 % des pires accès indiquent des parties NAND dégradées ou des copies de NAND SLC/MLC vers TLC/QLC, des vidages de cache importants, une mauvaise gestion du contrôleur, des bugs de microprogramme, etc.\n- SD Info vérifie désormais si la prise en charge A2 de la carte est correcte. Vert : prise en charge complète, Jaune : améliorations nécessaires, Rouge : cassé.\n- Les informations SD afficheront désormais immédiatement les erreurs SDMMC avant de calculer l'espace libre dans la partition FAT\n- Correction d'un problème où emuMMC pouvait ne pas être trouvé pour la sauvegarde ou la restauration\n- Correction d'un problème où la sauvegarde d'emuMMC pouvait échouer\n- La détection de la capacité réelle de la RAM est désormais plus robuste\n- J'ai rendu Nyx un peu plus rapide.\n- Correction d'un problème où la taille de la partition Android réservée pouvait être mal calculée sur le curseur HOS restant\n- Correction d'un problème où une fenêtre ne pouvait pas être fermée avec le bouton B du Joy-Con\n- Le rechargement de Nyx vérifiera désormais si nyx.bin existe toujours et ne se rechargera pas, afin que l'utilisateur puisse à nouveau résoudre ce problème avec UMS\n- Divers correctifs et améliorations\n \nModifications du BDK :\n- DIRLIST : il utilise désormais l'ordre alphabétique au lieu de l'ordre ASCII\n- SDMMC : Ne pas autoriser les accès hors limites, car ils nécessitent un cycle d'alimentation pour effacer l'erreur\n- SDMMC : ajout de la prise en charge de l'analyse des registres d'extension de performances\n- UITLS : fonctions de comparaison qsort ajoutées pour int, char et char insensibles à la casse.\n- SE : Prise en charge du hachage SHA256 de taille 0\n- Les pilotes SE et DISPLAY n'utilisent plus le tas\n- Divers correctifs et améliorations\n \n \nTéléchargement : hekate v6.3.0 & Nyx v1.7.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206477/in-switch-hekate-v630-nyx-v170-disponibles-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] Atmosphère 1.9.0 (pre-release) disponible",
        "content": "Le développeur SciresM vient de mettre en ligne Atmosphère 1.9.0, il s'agit de la version Pre-release, qui n'est plus ni moins la 89ème version officielle d'Atmosphère. Atmosphère 1.9.0 est actuellement en pré-version et des problèmes peuvent survenir et doivent être corrigés avant la sortie complète.\n \nAtmosphère 1.9.0 est fourni avec hbl 2.4.4 et hbmenu 3.6.0.\n \n \n\n \n \nLes éléments suivants ont été modifiés depuis la dernière version :\n \n- Un support de base a été ajouté pour la version firmware 20.0.0.\n- La console devrait démarrer et Atmosphère devrait être pleinement fonctionnelle. Cependant, tous les modules n'ont pas été entièrement mis à jour pour refléter les dernières modifications.\n- Il ne devrait rien y avoir de visible pour l'utilisateur en résultant, mais cela sera résolu dans une future mise à jour d'Atmosphère.\n- La même action que celle de la version 18.0.0 est toujours en cours, et je suis convaincu qu'elle sera finalement résolue. Quelqu'un m'a dit y travailler.\n- Il n'y a plus (à ma connaissance) d'éléments 19.0.0 en suspens.\n- Remarque : en raison des modifications apportées aux logiciels Nintendo dans la version 20.0.0, il y a environ 10 Mo de mémoire en moins disponible pour les modules système personnalisés.\n- Nous ne pouvons voler qu'un maximum de 14 Mo du pool d'applets, contre 40 Mo auparavant.\n- Pour compenser cela, ams.mitml'utilisation du tas de a été réduite de 20 Mo.\n- Pour faciliter cela, un nouveau module d'aide ( memlet) a été ajouté, afin que la mémoire puisse être temporairement volée pendant le processus de construction du romfs.\n- Espérons que cela entraînera relativement peu de casse, mais il est possible que les mods utilisateur qui remplacent un nombre extrêmement important de fichiers dans The Legend of Zelda: Tears of the Kingdom ne fonctionnent plus.\n- Si vous êtes concerné par ce problème, vous verrez « Data abort (0x101) » lorsque vous tenterez de lancer le jeu avec des mods.\n- Si cela se produit, veuillez nous contacter sciresmsur Discord pour partager votre rapport d'erreur binaire. Cependant, certains problèmes peuvent être impossibles à résoudre.\n- Je m’excuse sincèrement si le problème est impossible à résoudre, mais j’ai été inévitablement contraint de faire des compromis ici, et je pense que c’est le meilleur équilibre à trouver.\n- exosphère a été mis à jour pour refléter le dernier comportement officiel du moniteur sécurisé.\n- mesosphère a été mis à jour pour refléter le dernier comportement officiel du noyau.\n- loader a été mis à jour pour refléter le dernier comportement officiel.\n- pm a été mis à jour pour refléter le dernier comportement officiel.\n- ncm a été partiellement mis à jour pour refléter le dernier comportement officiel.\n- erpt a été mis à jour pour refléter le dernier comportement officiel.\n- Atmosphère a été mis à jour pour utiliser GCC 15/newlib (dernières versions de devkitA64/devkitARM).\n- Un certain nombre d'améliorations ont été apportées au moteur de triche dmnt.\n- De nouvelles instructions ont été ajoutées et des instructions ont été mises à jour pour des fonctionnalités améliorées/nouvelles.\n- Veuillez consulter les documents pour plus de détails - merci@tomvita!\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \n \nTéléchargement : Atmosphere 1.9.0 (Pre-release)\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206476/in-switch-atmosphere-190-pre-release-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[Divers] Nintendo a largement modifié son contrat d'utilisation du compte Nintendo",
        "content": "Est-ce que Nintendo ne serait pas en train de préparer l'arrivée judiciaire de la Switch 2, du moins, de finaliser les prémices judiciaires en mettant à jour ses services en ligne et l'utilisation des comptes qui sont liés à ses matériels. En effet, Nintendo a mis à jour son Contrat de Licence Utilisateur Final (CLUF) en y ajoutant des informations pour le moins contestables.\n \nNintendo vient de modifier 10 des 21 sections du contrat, et les modifications apportées spécifiquement aux sections 2 (Licence) et 16 (Règlement des litiges, Arbitrage exécutoire, Renonciation aux recours collectifs) ont suscité des interrogations, voir de l'indignation. \n \nLa première des modifications contestables est que le recours collectif devient impossible, en effet, si un client devient utilisateur de compte Nintendo, il doit désormais renoncer à son droit de poursuivre Nintendo par le biais d'un recours collectif. Exit également les procès devant jury, ni d'y participer vua un recours collectif impliquant Nintendo, tout devra se faire de manière individuelle, c'est à dire que cela devient impossible, surtout aux USA. \n \nLes recours collectifs pour les Joy-cons n'ont finalement rien donné car Nintendo disposait déjà de ce type de clauses dans le CLUF, mais désormais cela est étendu. \n \n \n\n \n \nLa seconde partie qui est choquante, il semblerait que Nintendo se réserve le droit de bricker la console ou le matériel qui tente de décrypter, de downgrade, de modifier ou de copier tout ou partie du code, ou de non-respect des modifications non autorisées spécifiées des services de compte Nintendo, ce n'est plus un blocage temporaire du compte, mais carrément du matériel.\n \n \n2. License\n \n\" Sans limitation, vous acceptez de ne pas (a) publier, copier, modifier, procéder à une Rétro-ingénierie, louer, décompiler, désassembler, distribuer, proposer à la vente ou créer des oeuvres dérivées de toute partie des Services de compte Nintendo ; ( contourner, modifier, décrypter, neutraliser, altérer ou contourner de toute autre manière les fonctions ou protections des Services de compte Nintendo, y compris par l'utilisation de tout matériel ou logiciel qui entraînerait un fonctionnement des Services de compte Nintendo non conforme à leur documentation et à leur utilisation prévue ; © obtenir, installer ou utiliser des copies non autorisées des Services de compte Nintendo ; ou (d) exploiter les Services de compte Nintendo autrement que conformément à la documentation applicable et à l'utilisation prévue, dans chaque cas, sans le consentement écrit ou l'autorisation expresse de Nintendo, ou sauf autorisation expresse contraire de la loi applicable. Vous reconnaissez qu'en cas de non-respect des restrictions susmentionnées, Nintendo peut rendre les Services de compte Nintendo et/ou l'appareil Nintendo concerné définitivement inutilisables, en tout ou en partie. \"\n \n \nNintendo devra préciser ce dernier point, il est bien trop important, que le ban concerne le compte Nintendo ou son utilisation cela peut s'entendre, par contre que cela touche directement le hardware, c'est une autre histoire ! Il faudra aussi s'assurer qu'à la disponibilité de la Switch 2, nous ne devions pas utiliser un compte Nintendo imposant un DRM en ligne pour pouvoir l'utiliser, des craintes qui vont devoir être levées. \n \n \nTout est là : accounts.nintendo.com / nintendo.com/us/eula-update/\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206465/in-divers-nintendo-a-largement-modifie-son-contrat-dutilisation-du-compte-nintendo-1.png"
        }
    },
    "news_7": {
        "title": "[PS5] AirPSX 0.14 disponible",
        "content": "AirPSX, le payload PS5 qui permet la gestion à distance d'une PlayStation 5 jailbreakée via un environnement de bureau Web similaire à AirDroid, passe en version 0.14.\n \nDans cette nouvelle version le développeur a voulu rajouter de nouvelles fonctions audio, en apportant notamment le support de format bien connus. \n \nPour rappel, AirPSX est une projet similaire à AirDroid, mais adapté pour la PS5 via une interface web, offrant des fonctionnalités comme la gestion des fichiers, l’exécution de scripts, et bien plus encore.\n \n \n\n \n \n \nLe développeur précise qu’il n’est pas responsable des dommages causés à la console ou de l’utilisation abusive de l’outil. AirPSX est construit avec le framework web hxwell, le code source est écrit en Haxe, qui est transpilé en C++ et compilé à l’aide du PS5 Payload SDK.\n \nAvec cette version 0.14, la prise en charge des formats tels que png, mp3, mp4, flac,... a été ajoutée au gestionnaire de fichiers et vous pouvez désormais afficher ces formats directement depuis le gestionnaire de fichiers.\n \nTéléchargement : AirPSX 0.14\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206464/in-ps5-airpsx-014-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[Switch] NeXT 3.34 Edition Prisas avec support partiel du firmware 20.0.1",
        "content": "Le développeur Vampitech vient de mettre en ligne la pré-version 3.34 de sa solution tout en un NeXT, pour rappel NeXT est un pack qui supporte les CFW que ce soit Atmosphere ou SX OS, de plus sa gestion des applications est largement simplifiée par une interface utilisateur très fonctionnelle. \n \nAvec la 3.34, qu'il nomme Prisas Edition, le développeur a souhaité apporté le support partiel du firmware 20.0.1 afin de pouvoir le tester uniquement. Vous l'aurez compris cette version est expérimentale et n'est pas destinée à un usage intensif et quotidien, elle se destine surtout aux testeurs, d'ailleurs \"Prisas\" signifie \"Pressés\". \n \n \n\n \n \nChangelog : \n \n- Support partiel du firmware 20.0.1\n- Atmosphere 1.9.0 QA_TEST\n- Hekate 6.2.3 BETA\n- MissionControl 0.13.0 DEVELOP\n- À des fins de test ! Non destiné à un usage quotidien, ceci n'est pas une version finale\n \nPour information, tous les correctifs, modules homebrew et modules système les plus importants ont été testés avant leur sortie publique afin de vérifier la compatibilité et le bon fonctionnement de cet AIO avec le dernier firmware système disponible. Cependant, les modules homebrew et modules système ne sont pas toujours mis à jour par leurs développeurs à chaque sortie de NeXT. Par conséquent, gardez à l'esprit que l'utilisation de modules homebrew et modules système non mis à jour peut provoquer des blocages ou des plantages du système. \n \n \nTéléchargement : NeXT 3.34 PRISAS EDITION\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206455/in-switch-next-334-edition-prisas-avec-support-partiel-du-firmware-2001-1.png"
        }
    },
    "news_9": {
        "title": "[PS4 PRO linux] Registres AMDGPU gladius",
        "content": " \n \nJe fourni les registres de la carte graphique des PS4 PRO + des bzImages ayant ces options, sur ps4 pro belize et baikal\nLes ps4 fat/slim aeolia, belize et baikal peuvent les utiliser, mais ils ne pointent pas ces registres + fix gflops ( AMD Liverpool = PS4 fat/slim     AMD Gladius = PS4 pro )\n Cependant ces derniers bzImages ont aussi la possibilité de filmer un autre périphérique hdmi avec une ps4 fat/slim/pro aeolia/belize/baikal , et j'inclue des patchs gamer.\nJ'ai d'ailleurs filmé la video de la release , sur une ps4 pro belize linux + bzImages de la news + carte d'acquisition usb/hdmi branchée sur une deuxieme ps4 pro linux\n(la partie baikal a été testé par Lestat)\nDepuis la release en octobre 2022 des payloads linux ps4 pro (travail de rancido/mircoho + ma ps4 pro)https://www.youtube.com/watch?v=U_bMh4wf7sw\n\nun dump de la carte graphique a été effectué sur la ps4 pro de mircoho\n rancido (team psxita) a ajouté une fonction au chargeur Linux qui permet de vider la mémoire du GPU juste avant de redémarrer la PS4 et de lancer Linux.\nMircoho l'a ensuite utilisé sur sa Ps4 Pro et a généré un fichier cik, puis des tests ont été effectués.    Je n'ai récupéré que les valeurs que j'inclue dans cette release.\nCes bzImages ont les memes options kernel que mes releases de février 2024https://www.logic-sunrise.com/news-1187117-ps4-bzimages-aeoliabelize-51515-compiles-en-fulllto-et-thinlto.html\n( patchs gamer + options du kernel ps4 linux)https://ps4linux.com/ps4-aeolia-belize-full-thin-lto-kernel-saya/\n Passons maintenant à la release de mai 2025 :\n \nRegistres AMDGPU GLADIUS PS4PRO  http://e.pc.cd/MVey6alK5.15.15.src-codedwrench-KHEOPS-FullLTO-v2_aeolia-belize  http://e.pc.cd/37ey6alK5.15.25-rc1.src-codedwrench-KHEOPS-FullLTO-v2_belize  http://e.pc.cd/NXey6alK5.4.213.src.whitehax0r.KHEOPS_baikal  http://e.pc.cd/J7ey6alKEt un petit bonus, en béta :6.8.12.src-crashniels-saya_v0_aeolia-belize  http://e.pc.cd/WVey6alK6.8.12.src-crashniels-saya-FullLTO_v0_aeolia-belize  http://e.pc.cd/QyUotalK\n Pour le bzImage 5.4.213 baikal et les bzImages  6.8.12-aeolia-belize, je n'ai pas rajouté de fix blackscreen\nvous pouvez rajouter ce bootargs.txt (rajouté à coté du bzImage) pour fixer l'écran noir  http://e.pc.cd/NVey6alK\n Je tiens à remercier rancido (team psxita) , mircoho, codedwrench whitehax0r et crashniels pour leur source kernel de base, lestat triki1 VvSx87 Qba pasmatic LUFFY_YTB95 Arksama001 pour les differents tests, LoupBlanc pour le test de la capture video sous Obs-studio avec sa ps4 slim baikal\n  Team KHEOPS\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206440/in-ps4-pro-linux-registres-amdgpu-gladius-1.jpg"
        }
    },
    "news_10": {
        "title": "[Switch2] La carte mère et le die nvidia T239 analysés",
        "content": "De manière exceptionnelle Geekerwan a obtenu une carte mère Switch 2 et a fait une analyse complète des die shots du T239 avec l'aide de Kurnal. Ils ont obtenu la carte mère sur l'équivalent chinois d'eBay (Xianyu) pour environ 150 $.\n \nNous avons enfin la confirmation de certains éléments, le processus de gravure utilisé est le Samsung 8N, le die dispose de 8 coeurs A78C, partage 4 Mo L2, la partie GPU s'appuie sur 1536 Cuda cores et 6TPC au travers de l'architecture Ampère.\n \n \n\n \n \nLe die a été fabriqué à Taiwain par Samsung la semaine 21 de 2024, soit il y a un an, et on peut donc voir que ce T239 est très proche d'un die d'une carte graphique de la génération RTX série 3050, mais aussi avec certaines optimisations de la RTX 2050.\n \n \n\n \n\n \n \n\n \n \nLa vidéo de Geekerwan est tout simplement remplie de détails techniques, il analyse comment Nvidia a adapté le T239 entre les différentes architecture, décryptant la partie GPU, CPU et des Cuda Cores qui sont présents. \n \n \n \n\n \n \n\n \n \n \n \nQuelques détails techniques : \n \n- 207 mm² (Switch 2) contre 118 mm² (Switch)\n- Il est également plus grand que le GPU RTX 3050 Ti (mobile), le M2 d'Apple, le Ryzen 7840H (Z1 extreme) et le X elite de Qualcomm.\n- L'année de sortie du SoC est 2021, comme indiqué sur la matrice.\n- Ils ont également examiné la matrice du GPU RTX 3050, dont l'année de sortie était 2020.\n \nLe T239 en résumé :\n-  8 coeurs A78C, avec 4 Mo de cache L3 et 256 Ko de cache L2 sur chaque puce.\n- La surface de la puce A78C est la même que celle de la puce T234 de 8 nm, ce qui indique qu'il s'agit du même nœud de traitement.\n- Le suffixe C et AE n'a pas beaucoup de signification sur la conception du cœur lui-même, mais plutôt sur la classification ARM indiquant Compute et Automotive et comment les cœurs fonctionnent.\n- 6 TPC, 2SM/TPC, 1536 coeurs CUDA\n- La conception de l'Ampère, bien que sa disposition semble étrange car les TPC sont séparés.\n- La conception du GPU semble plus proche de celle d'Ada Lovelace.\n- En termes de surface du TPC, le T239 est 22% plus petit que le T234 d'orin.\n-  Il y a quelques différences dans la conception de la puce elle-même, elle n'est pas exactement 8nm et certains aspects sont plus proches de la fabrication du nœud de processus 10nm de Samsung.\n-  Ils soulignent les vitesses d'horloge précédemment « fuitées » et, comme DF, mentionnent que son équivalent le plus proche est la RTX 2050, bien qu'elle soit fortement downclockée.\n-  Comme DF, ils effectuent également une simulation des performances de la Switch 2 avec la RTX 2050 downclockée comme proxy.\n- Les performances de la Switch 2 sont alignées sur celles de la GTX 1050 Ti en mode docked et de la GTX 750 Ti en mode handheld dans les tests synthétiques de Steel Nomad Light.\n- Il est loin de la Xbox Series S et l'équivalent mobile le plus proche est l'A18 Pro d'Apple, M1 en mode docké, et la Steam Deck est un peu meilleure en mode portable.\n- Ils ont testé Cyberpunk 2077, Black Myth Wukong, Monster hunter Wild, KCD2...\n- Ils ont également pris une carte T234 (Orin) et ont testé les performances du CPU à travers des synthèses (geekbench 6)\n- En le downclockant à 1,1 GHz et 1 GHz, ses performances à cœur unique sont deux fois supérieures à celles de la PS4 et trois fois supérieures à celles de la Switch, l'équivalent portable le plus proche étant le i7-4700HQ.\n- L'équivalent mobile le plus proche en termes de performances multithread est l'A12 de l'iPhone, dont les performances single thread sont plus de deux fois supérieures à celles de la « Switch 2 »\n- Ils ont également utilisé un i7-10700KF downclocké pour approcher les performances du CPU de la Switch 2.\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206419/in-switch2-la-carte-mere-et-le-die-t239-analyse-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206419/in-switch2-la-carte-mere-et-le-die-t239-analyse-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1206419/in-switch2-la-carte-mere-et-le-die-t239-analyse-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1206419/in-switch2-la-carte-mere-et-le-die-t239-analyse-4.png"
        }
    },
    "news_11": {
        "title": "[XBO] Les projets Skeleton Key et Skeleton Key Mu sortent des cartons",
        "content": "Les payloads Skeleton Key et Skeleton Key Mu sortent des cartons, il s'agit de projets qui se destinent à la Xbox originale, il s'agit d'une collaboration communautaire de grande envergure. Ces payloads devraient faciliter l'accès aux améliorations Xbox et constituer une précieuse boîte à outils pour les fans expérimentés de la Xbox originale.\n \nDeux projets, Skeleton Key pour les clés USB, et Skeleton Key Mu pour les consoles modifiées, Skeleton Key fonctionnera sur de nombreuses clés USB. Vous pouvez également acheter une clé USB préchargée et un adaptateur USB auprès de nombreux revendeurs. Consultez plusieurs vitrines pour trouver un prix raisonnable. Les payloads seront toujours gratuits. Veuillez ne pas payer pour un logiciel gratuit !\n \n \n\n \n\n \n \n \nCe loader est basé sur les outils PrometheOS et peut lancer les applications suivantes :\n \n- Xbox Content Archive Tool (XCAT) Loader\n- Insignia Setup Assistant\n- Gamepad Tester\n- MemCheck\n- Rocky5's Softmod v1.2.2\n- Xbox Disk Over Network\n \nPour utiliser le payload Xbox Skeleton Key :\n \n1) Écrivez le contenu du dossier Skeleton Key sur une clé USB compatible. Ou copiez le contenu de Skeleton Key MU sur une carte mémoire Xbox avec une Xbox modifiée.\n2) Connectez la clé USB ou la carte mémoire à votre Xbox.\n3) Dans le tableau de bord Xbox; Accédez à l'option Mémoire, sélectionnez la Skeleton Key ou la Skeleton Key MU et appuyez sur A.\n \nUne image disque complète de cette boîte à outils est incluse dans la version. Elle peut être utilisée avec HDD Raw Copy ou d'autres outils pour écrire l'image sur votre clé USB compatible sans FatXplorer.\n \nLe lancement de Rocky5's Softmod v1.2.2 définira votre DNS sur automatique. Si votre console est configurée pour utiliser Insignia, vous devrez le remettre en manuel.\n \nTéléchargement : Projets Skeleton Key et Skeleton Key Mu\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206415/in-xbo-les-projets-skeleton-key-et-skeleton-key-mu-sortent-des-cartons-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206415/in-xbo-les-projets-skeleton-key-et-skeleton-key-mu-sortent-des-cartons-2.png"
        }
    },
    "news_12": {
        "title": "[PS4/PS5] Lapse Exploit d'abc disponible, nouvel exploit kernel sur PS4 et PS5",
        "content": "Le développeur abc est fier de nous présenter Lapse Exploit, un exploit kernel pour les firmwares 5.00 à avant le 12.50 pour la PS4 et du 1.00 avant le 10.20 pour la PS5, il faudra des correctifs pour la lecture / écriture sur le kernel PS4 8.0x. \n \n \n\n \n\n \n \n \nVous l'aurez compris il s'agit ni plus ni moins d'une bombe qui vient d'être lâchée par abc, un kernel exploit qui va rester dans l'histoire vu les firmwares qui sont supportés.\n \n \n \n\n \n \nCet exploit est corrigé sur le firmware 12.50 sur PS4 et sur 10.20 sur PS5, mais cela signifie qu'il est possible d'en profiter juste avant ces firmwares. \n \n \nTéléchargement : psfree-1.5rc1.7\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206406/in-ps4ps5-lapse-exploit-dabc-disponible-nouvel-exploit-kernel-sur-ps4-et-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206406/in-ps4ps5-lapse-exploit-dabc-disponible-nouvel-exploit-kernel-sur-ps4-et-ps5-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1206406/in-ps4ps5-lapse-exploit-dabc-disponible-nouvel-exploit-kernel-sur-ps4-et-ps5-3.png"
        }
    },
    "news_13": {
        "title": "[PS5] L'hyperviseur bientôt accessible sur les firmwares 3.xx et 4.xx",
        "content": "Petite bombe lâchée par Zecoxao il y a quelques heures, il vient de mettre un Tweet sur X informant que l'hyperviseur sera probablement bientôt une réalité sur les firmwares 3.xx et 4.xx de la PS5, de là à ce que les firmwares 4.xx deviennent des GoldHEN Firmware il n'y a qu'un pas. \n \nEn Septembre 2024, le développeur Flat_z nous confirmait que la structure sécuritaire des firmwares 3.21 avait bien trop évoluée pour permettre l'accès à l'hyperviseur au dessus de ce firmware, mais il semble que la donne à changer. \n \n \n\n \n \nReste à voir si la problématique du processeur principal a53io qui gère séparément les packages PS5 (PKG) sur PS5 sera toujours présente, et il faut là aussi casser ses protections ou trouver un moyen de le contourner pour lancer les fPKG.\n \n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206367/in-ps5-lhyperviseur-bientot-accessible-sur-les-firmwares-3xx-et-4xx-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1206367/in-ps5-lhyperviseur-bientot-accessible-sur-les-firmwares-3xx-et-4xx-2.jpg"
        }
    },
    "news_14": {
        "title": "[PS5/PS4] FPKGi pour PS4/PS5 v1.00.0 disponible",
        "content": "Le développeur ItsJokerZz vient de dévoiler la version 1.00.0 de FPKGi pour PS4 et PS5. FPKGi, une alternative à PKGi, projet open-source permet de télécharger et d'installer des fichiers .pkg modifiés, notamment pour les jeux backportés sur des firmwares compatibles. FPKGi est conçu pour être utilisé avec des serveurs personnalisés, permettant aux utilisateurs de peupler l'application avec leur propre contenu via des fichiers .json locaux ou en ligne. \n \n \n\n \n \n \nLes grandes nouveautés de cette version 1.00.0 : \n \n- Supprimer après l'installation \n- Le téléchargement ZIP PS5 Prise en charge + Ordre d'installation\n- Extraction du dump PS5\n- Compatibilité jailbreak améliorée\n- Fermer avec double pression sur le bouton cercle\n- Augmentation des éléments par page\n- Correctifs PS5\n \n \nChangelog 1.00.0 : \n \nAjouts : \n- « Supprimer après l'installation » pour PS5 : activation de la fonctionnalité « Supprimer après l'installation » pour les téléchargements PS5.\n- Prise en charge du téléchargement ZIP : ajout de la prise en charge du téléchargement, de l'extraction et de l'installation de fichiers ZIP.\n- Extraction de vidage PS5 : extraction de vidage PS5 introduite pour l'intégration d'itemzflow.\n- Ordre d'installation ZIP : les packages ZIP s'installent désormais par ordre alphabétique, en donnant la priorité aux numéros et aux symboles.\n- Compatibilité Jailbreak : Compatibilité améliorée en utilisant un jailbreak sur liste blanche sur PS5.\n- Double pression circulaire : Fermeture par deux pressions sur le bouton circulaire.\n \nAméliorations et optimisations : \n- Augmentation du nombre d'éléments par page : le nombre d'éléments par page est désormais passé de 25 à 30, avec une mise à jour de l'interface utilisateur et un nouveau logo.\n- Télécharger les informations Précision : Basculé vers ulongpour des données de téléchargement plus précises.\n- Restriction de contenu PS5 : le contenu PS5 ne peut plus être visualisé sur PS4.\n \nCorrections, résolutions et plus :\n- Correction des plantages de téléchargement direct sur PS5 : plantages résolus lors des téléchargements directs sur PS5.\n- Correction de langue : problèmes d’affichage résolus pour différentes langues.\n- Correction de l'installation de titres non UTF8 : correction de l'impossibilité d'installer des fichiers de titres de caractères non UTF8 (non anglais).\n- Prise en charge linguistique ajoutée : prend désormais en charge les langues asiatiques et l'arabe pour les titres de contenu, conformément à la vidéo YouTube de Miichael Crump\n \n \n\n \n \n \nTéléchargement : FPKGi v1.00.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206365/in-ps5ps4-fpkgi-pour-ps4ps5-v1000-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[3DS] L'émulateur 3DS Azahar est disponible en version finale 2121",
        "content": " \nLe développement de l'émulateur 3DS Azahar continue son chemin et ce chemin est truffé de nouveautés, issu d'un fork de Citra développé par PabloMK7 et Lime3DS, Azahar représente une évolution prometteuse dans le monde de l'émulation, surtout après l'arrêt du développement de Citra en mars 2024. Cet arrêt faisait suite à un accord juridique entre les développeurs de Citra (également responsables de l'émulateur Switch Yuzu) et Nintendo. Contrairement à Yuzu, qui a été frappé d'une injonction, Citra n'a pas été directement affecté par des restrictions légales, permettant ainsi à des projets comme Azahar de voir le jour.\n \n \n \n\n \n \n\n \n \n \nLes changements de cette version 2121 (qui n'est donc plus en release candidate depuis quelques heures) sont très nombreux, en résumé :\n \nNouvelles Fonctionnalités :\n- Téléchargement des DLC déjà possédés désormais pris en charge. (@PabloMK7)\n- Mode Turbo : Permet d'augmenter la vitesse d’émulation via un raccourci clavier (PC) ou un bouton à l’écran (Android).\n- Espace entre les écrans : Possibilité de configurer l’écart entre les écrans supérieur et inférieur. (@DavidRGriswold)\n- Augmentation du slider 3D : La valeur maximale passe de 100% à 255% (peut causer des anomalies graphiques).\n- Sauvegardes rapides (quicksave/quickload) : Ajout sur PC, comme sur Android.\n \nCorrections de Bugs :\n- Streetpass Mii Plaza : Correction d’un problème de détection des mises à jour.\n- Installation des DLC : Problème résolu pour certains DLC décryptés mal détectés.\n- Cache des shaders : Maintenant correctement associé à l’application en cours (évite les conflits).\n \nAudio : Correction d’un bug affectant certains jeux comme Brain Age: Concentration Training.\n \nHotkeys : Problèmes de sauvegarde et de fonctionnalité résolus.\n \nAméliorations Spécifiques aux Plateformes :\nPC (Desktop) :\n- Fusion de azahar-room dans l’exécutable principal (option --room).\n- Correction des captures d’écran en mode Hybrid Screen.\n \nLinux :\n- AppImage désormais en un seul fichier (non compressé).\n- Meilleure compatibilité Wayland.\n \nmacOS :\n- Désactivation temporaire de la barre de menus native (problèmes d’affichage).\n- Version minimale requise : macOS 13.4.\n \nAndroid :\n- Nouveau bouton pour accéder aux dossiers du jeu (sauvegardes, DLC, etc.).\n- Option pour étendre l’affichage vers la notch de l’écran.\n- Correction d’un bug d’affichage sous Android 9.\n \nAméliorations Techniques :\n- Optimisation des scripts de compilation et corrections mineures pour les développeurs.\n \n \nTéléchargement : Azahar 2121\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206326/in-3ds-lemulateur-3ds-azahar-est-disponible-en-version-finale-2121-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1206326/in-3ds-lemulateur-3ds-azahar-est-disponible-en-version-finale-2121-2.jpg"
        }
    },
    "news_16": {
        "title": "[PS3] Un mod Pico avec BadHTAB d'esc0rtd3w disponible",
        "content": "Le développeur esc0rtd3w a décidé d'optimiser l'exploit BadHTAB comme vous le savez se destine à la PlayStation 3 et qui fait suite à la découverte de XORLOSER. \n \nL'exploit utilise une technique hardware et software pour modifier le signal de la RAM vers la terre, alors qu'un payload lui se charge afin d'aller pointer les données HTAB tout en forçant leur entrée via un glitch. \n \nUn exploit très technique, mais qui fonctionne, malgré son taux de réussite assez faible de l'ordre de 30 %. L'idée d'esc0rtd3w a été de modifier le code original afin d'apporter des modifications au code Pico pour faciliter les tests, pour l'heure aucune modification n'a été apporté pour la partie PS3. \n \n \n\n \n \n\n \n \nLes modifications incluent :\n \n- Redémarrage automatique si un problème fait planter la PS3\n- UART0 activé pour pico\n- UART1 activé pour l'entrée sb_uart de la PS3\n- Surveillance du mode veille du bloc d'alimentation\n- Connecteur d'alimentation de surveillance\n- Surveillance d'état sur 4 LED\n \nJusqu'à présent en cas de bug de lancement, il fallait souvent débrancher la prise, ou faire un hard reset, avec cette version vous n'aurez plus à  débrancher le cordon d'alimentation ni à actionner l'interrupteur de la multiprise. Le redémarrage automatique est pris en charge lorsqu'une erreur est détectée. Cela nécessite sb_tx de la PS3 et la soudure du bloc d'alimentation 5 V « always on » au Vsys du Pico. Ainsi, le Pico reste allumé lorsque la PS3 s'éteint. Le sb_uart de la PS3 surveille les messages permettant de contrôler le comportement du Pico.\n \n \n\n \n \n\n \n \nIl reste quelques bugs à corriger, notamment des plantages de la PS3 empêchant le Pico de se rétablir automatiquement, nécessitant un redémarrage manuel. Les fils devront être soudés aux emplacements appropriés sur la PS3 et le Pico.\n \nIl a proposé plusieurs versions qu'il fait rapidement évoluer, les dernières modifications ont été réalisées pour : \n \n- Ajout d' une variable pour suivre les tentatives de mise sous tension\n- Réinitialiser les séquences si le nombre maximal de boucles est de 12 et que l'alimentation est allumée \n- Réinitialiser en mode veille pour vérifier si les tentatives de mise sous tension sont de 6 ou plus\n- Augmentater du temps de glitch de la LED en cas de problème réussi\n \nTout est là : Psx-place.com\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206325/in-ps3-un-mod-pico-avec-badhtab-desc0rtd3w-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1206325/in-ps3-un-mod-pico-avec-badhtab-desc0rtd3w-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1206325/in-ps3-un-mod-pico-avec-badhtab-desc0rtd3w-disponible-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1206325/in-ps3-un-mod-pico-avec-badhtab-desc0rtd3w-disponible-4.jpg"
        }
    },
    "news_17": {
        "title": "[PS5] Mise à jour kstuff pour le VR2 et la désactivation ASLR",
        "content": "Le développeur Echo Strech a dévoilé une nouvelle version du payload kstuff qui intègre quelques évolutions intéressantes, cela passe par la désactivation de l'ASLR, mais aussi des progrès sont réalisés pour le support du PlayStation VR2.\n \nAu sujet de la désactivation de l'ASLR, ASLR est la randomisation de la disposition de l'espace d'adressage (ASLR), il s'agit d'une technique utilisée pour augmenter la difficulté de réaliser une attaque par débordement de mémoire tampon qui nécessite que l'attaquant connaisse l'emplacement d'un exécutable dans la mémoire. Il s'agit donc dans kstuff de proposer son contournement, en désactivant cette protection, les adresses deviennent prévisibles. Ainsi cela permet de charger des payloads de manière plus stable, cela ouvrirait la possibilité à d'autres exploits de bas niveau. Il restera à voir si cela sera utile. \n \n \n\n \n \n \nLe support du PlayStation VR2 a été également intégré par Al-Azif, il s'agit encore d'une version expérimentale, en version bêta, cela montre la volonté d'améliorer les fonctionnalités du payload, et ainsi de proposer l'arrivée du VR2 au travers du payload. Lancé en 2023 à 599 euros, il a largement baissé, proposé parfois autour des 370 euros, il n'a pas réellement connu le succès escompté par Sony, mais il reste un accessoire permettant une expérience intéressante.\n \nEt Al-Azif a également apporté le support du firmware 3.10 en apportant les offsets nécessaires, et un nettoyage du code a été opéré afin de supprimer des opérations inutiles et accroitre la stabilité de l'exécution. \n \n \nTéléchargement : kstuff v1.5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206313/in-ps5-mise-a-jour-kstuff-pour-le-vr2-et-la-desactivation-aslr-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] Une première version d'Hekate pour le firmware 20.0.0 est là",
        "content": "Le développeur CTCaer vient de proposer, sur son Github, une première version d'Hekate pour le firmware 20.0.0.\n \nRappelons que le firmware 20.0.0 contient un bug qui pourrait être gênant et qu'il est probablement préférable d'attendre pour savoir si cette version est compatible avec le firmware 20.0.1.\n \n \n\n \n \n \nHekate, un custom bootloader largement utilisé pour la Nintendo Switch, vient d'être mis à jour par CTCaer. Hekate sert de point d'entrée pour de nombreux utilisateurs souhaitant explorer les capacités personnalisées de leur console Nintendo Switch. Depuis sa création, il a été utilisé pour lancer des homebrews, des backups de jeux, et d'autres logiciels personnalisés, offrant ainsi aux joueurs une expérience différente de celle prévue par Nintendo.\n \nCette version préliminaire, qui n'est pas accompagné de la mise à jour de Nyx, est compatible avec le firmware 20.0.0 mais également avec Atmosphère 1.9.0, il s'agit d'une version de test qui n'est pas à considérer comme une version stable et finale, pour l'utilisateur lambda il est préférable d'attendre la version officielle. \n \n \nTéléchargement : Hekate compatible firmware 20.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206292/in-switch-une-premiere-version-dhekate-pour-le-firmware-2000-est-la-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] PS5 BDJB Modified ISO v1.12 plus besoin de connexion internet",
        "content": " \nPlus besoin d'avoir une connexion internet, avec PS5 BDJB Modified ISO il est désormais possible de jailbreaker une PS5 sans avoir besoin d'une connexion internet ! Cette version modifiée proposée par Viktorious-x, basée sur le travail original de driverick, a été optimisée pour fonctionner en mode complètement hors ligne sur les firmwares  4.xx jusqu'à 7.xx. \n \nLe développeur utilise la version 7.61 du firmware, pour lui cette solution est une alternative à celles et ceux qui souhaitent débloquer leur console sans avoir besoin de la connecter à internet. \n \n \n\n \n \nProcédure gravure : \n \n- Téléchargez la dernière version ISO à partir du lien GitHub\n- Ouvrez  ImgBurn  (ou un autre logiciel)\n- Sélectionnez « Écrire le fichier image sur le disque »\n- Charger le fichier ISO modifié\n- Insérez le BD-R vierge et démarrez la gravure\n \nFonctionnement sur PS5 :\n- Insérez le disque gravé dans la PS5\n- Démarrer le lecteur Blu-ray\n- Sélectionnez un pipeline  (1er recommandé)\n- Veuillez patienter jusqu'à ce que le processus soit terminé\n- Lorsque vous y êtes invité,  fermez le lecteur de disque.\n- etaHEN se chargera automatiquement sur la page d'accueil (Si etaHEN n'apparaît pas , réinjectez-le via ItemzFlow)\n \n \n \n\n \n \n \nCette version modifiée de l' ISO PS5 BD-JB représente une avancée pour le jailbreaking hors ligne. Avec la prise en charge de plusieurs firmwares (du 4.xx au 7.xx et sa facilité d'utilisation, il permet d'accéder aux UMTX, loader ELF, serveur Web et autre etaHEN (avec kstuff) très facilement, la dernière version v1.11 apportant la prise en charge des fichiers .jar  dans le loader USB bin/elf.\n \n \nTéléchargement : PS5 BDJB Modified ISO v1.11\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206204/in-ps5-ps5-bdjb-modified-iso-v111-plus-besoin-de-connexion-internet-1.png"
        }
    },
    "news_20": {
        "title": "[XB/XB360] XCAT v1.07 disponible (maj 08.05.2025)",
        "content": "Les passionnés de préservation pour la Xbox et la Xbox 360 ont consacré d’importants efforts au développement de XCAT, un outil gratuit et automatisé permettant aux possesseurs de Xbox d’explorer leur console à la recherche de contenus disparus (DLC, mises à jour de jeux, applications homebrew, skins, etc.) et de les téléverser dans le cadre d’un projet collaboratif d’archivage. Grâce à XCAT, la communauté peut mutualiser ses ressources pour sauvegarder des fichiers rares encore présents sur certaines consoles, assurant ainsi leur conservation pour les générations futures.\n \nCompatible avec les Xbox modifiées (softmod ou hardmod), ce logiciel extrêmement léger (moins de 4 Mo) tient facilement sur une carte mémoire, et l'outil vient d'être mis à jour en v1.06. \n \nLe fonctionnement est simple : XCAT génère une empreinte unique (checksum) pour chaque fichier détecté. Ces identifiants sont ensuite comparés avec ceux des serveurs XCAT. Si un fichier est inédit, il est ajouté à une liste de téléchargement et récupéré directement depuis la console du contributeur. En revanche, si le fichier est déjà archivé, il n’est pas dupliqué. Ce système évite aussi les doublons causés par des différences de nom ou dénomination, puisque chaque fichier est identifié par son hash.\n \nLa préservation ne s’arrête pas à la récupération : une fois collectés, les contenus pertinents sont partagés avec la communauté. Par exemple, les éléments utiles pour jouer en ligne via Insignia (le successeur moderne du Xbox Live) sont transmis à son équipe et intégrés aux mises à jour des jeux concernés. Les autres fichiers (homebrew, skins, etc.) sont diffusés via les canaux dédiés.\n \n \nAvec cette version 1.06, l'équipe a mis l'accent sur la réinitialisation réseau en cas de perte de connexion.\n \n \n\n \n \nChangelog v1.06\n \nAjout : Réinitialisation automatique des paramètres réseau en cas d'échec de connexion. Les configurations existantes du dashboard ne seront ni perdues ni écrasées !\n \n \nTéléchargement : XCAT v1.06\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206200/in-xbxb360-xcat-v106-disponible-1.png"
        }
    }
}