{
    "news_1": {
        "title": "[Vita] DSVita v0.6.1 disponible",
        "content": "Le développeur Garak a publié une nouvelle version de DSVita v0.6.1, l'émulateur Nintendo DS pour PlayStation Vita, apportant des optimisations notables et des corrections de compatibilité.\n \nPrincipales améliorations : Nouvelles options pour l'émulation Arm7 : L'émulation HLE (High-Level Emulation) avait une compatibilité limitée, désormais, une option \"PartialSoundHLE\" permet un meilleur équilibre entre performance et compatibilité.\n \nGains de vitesse : Des jeux comme Mario Kart DS et Chrono Trigger bénéficient d’un boost de performance avec le nouveau mode.\n \nAméliorations 3D : Mise en œuvre de certaines fonctionnalités manquantes pour un meilleur rendu.\n \nUne vidéo de Mario Kart DS en action est disponible sachant que le développeur prévoit de réécrire le compilateur JIT pour émettre des instructions Thumb2 au lieu d’ARM32, ce qui pourrait améliorer encore les performances, mais cela prendra du temps, Mario Kart tourne à 15 FPS, il y a encore quelques optimisations graphiques à apporter sachant qu'il faudrait qu'il tourne au moins à 25 FPS. \n \n \n\n \n \n \n \nIl a dévoilé une v0.6.1 avec son changelog : \n \n- Ignorer les commandes GX invalides (corrige le freeze dans Final Fantasy XII: Revenant Wings)\n- Correction d'un débordement du buffer Wi-Fi RX\n- Légère amélioration de la vitesse 3D\n- Correction des transformations de textures 3D\n- Amélioration de la compatibilité HLE (Mario Kart DS, Castlevania: Dawn of Sorrow, Super Mario 64 DS, Need for Speed: Underground 2)\n- Quelques corrections de rendu 3D\n \n \nTéléchargement : DSVita v0.6.1\n \n \n \n",
        "images": {}
    },
    "news_2": {
        "title": "[PS3] rpcs3 v0.0.36 Alpha disponible",
        "content": "L'équipe de développement de RPCS3, l'émulateur open-source de PlayStation 3, vient de publier la version v0.0.36 Alpha, marquant une nouvelle étape dans l'amélioration continue de ce projet ambitieux. Cette nouvelle version, publiée il y a seulement 10 heures par AniLeo, apporte des améliorations notables dans plusieurs domaines.\n \n \n\n \n \nOptimisations graphiques :\n \n- Refonte de la gestion des swapchains Vulkan pour une meilleure stabilité \n- Amélioration du support hardware avec l'utilisation d'AVX-512 pour le hachage des shaders vertex \n- Optimisation de la mémoire cache des programmes RSX \n \nAméliorations de l'interface :\n \n- Ajout d'un bouton pour afficher/masquer les trophées cachés \n- Implémentation du défilement horizontal pour le clavier à l'écran (OSK) \n- Amélioration des icônes de jeu et des titres localisés \n \nCorrectifs techniques :\n \n- Résolution d'un problème pouvant causer des instructions illégales sur machines sans AVX-512 sous Linux \n- Correction de fuites mémoire et amélioration de la stabilité \n- Mise à jour des dépendances comme SDL 3.2.8 et libusb 1.0.28 \n \nÀ Noter : Comme pour toutes les versions Alpha de RPCS3, il s'agit d'une version de développement et non d'une build stable. Les développeurs rappellent qu'il est préférable de toujours télécharger la dernière version disponible sur le site officiel rpcs3.net/download.\n \nConfiguration Requise : RPCS3 reste un émulateur exigeant nécessitant une configuration PC performante :\n \n- CPU Intel Core i7 (ou équivalent) à 4GHz recommandé\n- Carte graphique récente (NVIDIA GTX ou équivalent)\n- Mémoire DDR4/5 en quantité suffisante\n \nPerspectives :\n \nCette mise à jour confirme la dynamique constante du projet, avec des contributions régulières de l'équipe principale et des contributeurs externes. Le développement de RPCS3 se poursuit activement depuis 2011, faisant de lui l'émulateur PS3 le plus abouti à ce jour.\n \nTéléchargement : rpcs3 v0.0.36 Alpha\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205069/in-ps3-rpcs3-v0036-alpha-disponible-1.png"
        }
    },
    "news_3": {
        "title": "[PS5]  Le projet PS5-FakeXen tente de faire tourner Linux sur la PS5",
        "content": "Un développeur, un certain sleirsgoevy, a récemment publié le code source de PS5-FakeXen, un projet expérimental conçu pour exécuter Linux sur la PlayStation 5 en exploitant son hyperviseur. Initialement pensé comme une solution complexe contournant une sécurité supposée (GMET), il s’est finalement avéré que des méthodes plus simples existaient.\n \nL’idée derrière FakeXen est que le projet reposait sur l’hypothèse que l’hyperviseur de la PS5 utilisait GMET (Guest Mode Execution Trap), une protection bloquant l’exécution de code non authentifié. Pour contourner cela, le développeur a créé un environnement \"Fake Xen\" (un hyperviseur factice) afin de tromper le système et permettre l’exécution d’un kernel Linux modifié.\n \n \n\n \n \nCependant, après analyse, il s’est avéré que Sony n’avait pas activé GMET, rendant cette approche inutilement complexe. D’autres méthodes plus directes permettent désormais de faire tourner Linux sur la console.\n \nFonctionnement technique :\n \nKernel Linux : Basé sur la version 6.12.8, compilé avec le support Xen PV (paravirtualisation).\n \n\"Frankenkernel\" : Un faux kernel BSD contenant les \"gadgets\" nécessaires pour initialiser l’environnement.\n \nDebugging : Intègre un stub GDB pour analyser le kernel en temps réel.\n \nMatériel requis :\n \n- Sur QEMU : Lancement via make qemu (nécessite un CPU puissant).\n- Sur la PS5 : Requiert une connexion UART (soudure sur les pads de test \"Titania\").\n \nAvertissements & Limites :\n \n- Pas stable : Peut planter sans maxcpus=1 dans les paramètres du kernel.\n- Non sécurisé : Possiblement vulnérable à des exploits depuis l’espace utilisateur.\n- À but éducatif : Le code est publié \"tel quel\", surtout pour l’archive, au cas où Sony corrigerait l’hyperviseur plus tard.\n \nCe projet reste avant tout un Poc, montrant comment les chercheurs testent différentes approches pour comprendre les protections de la console. Aujourd’hui, des méthodes plus simples existent, mais PS5-FakeXen pourrait servir de solution de secours si Sony verrouille son hyperviseur dans le futur.\n \n \nTout est là : PS5-fakexen\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205068/in-ps5-le-projet-ps5-fakexen-tente-de-faire-tourner-linux-sur-la-ps5-1.png"
        }
    },
    "news_4": {
        "title": "[XB360] BadBuilder v0.21 Alpha disponible (maj 31.03.25)",
        "content": "Le développeur Pdawg-bytes propose une mise à jour de son outil BadBuilder qui est maintenant updaté en v0.2 toujours en version Alpha. Il s'agit là de la seconde version de BadBuilder qui va permettre de simplifier la création d'une clé USB compatible avec l'exploit BadUpdate, ainsi vous pourrez exécuter du code non signé et des applications homebrews sur votre Xbox 360 si vous disposez de tout ce qu'exige BadUpdate.\n \nBadBuilder va formater la clé USB, il va créer les dossiers, télécharger les fichiers nécessaires, ou les mettre à jour, enfin l'outil permet de spécifier manuellement les chemins de fichiers dynamiquement. \n \n \n\n \n \nNouveautés : \n \nQuelques bugs ont été corrigés et d'autres modifications ont été apportées pour un fonctionnement plus fluide. \n \nTout le reste est repris de la version précédente : si vous rencontrez des problèmes, veuillez les signaler en créant un nouveau ticket. Le programme est fourni sous forme de build à fichier unique, mais assurez-vous que .NET 8.0 Desktop Runtime est installé avant de l'exécuter.\n \nChangelog : \n \n- Correction du bug \" Failed to set the drive partition information \" sur les disques MBR.\n- Correction d'un bug où la copie d'une archive existante dans le répertoire de travail provoquait un plantage si aucun téléchargement n'était requis.\n- Formateur FAT32 mis à jour pour inclure un calcul de taille FAT plus précis.\n- Ajout des versions ARM64 et x86\n \n \nTéléchargement : BadBuilder v0.2 Alpha\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205040/in-xb360-badbuilder-v02-alpha-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[Multi] PS Multi Tools v15.2.2 disponible",
        "content": "Le développeur SvenGDK vient de mettre à jour PS Multi Tools en v15.2.2, comme vous le savez probablement cet utilitaire s'adresse à tout ceux qui dispose d'une console Sony, de la PSP à la PS5 en passant par toutes les générations. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale. \n \n \n\n \n \nChangelog de PS Multi Tools v15.2.2 :\n \nCorrections :\n- Stabilité générale et légère augmentation des performances\n- Informations d'ouverture fixes et liens d'aide dans le navigateur Web par défaut\n- Ignorer les majuscules/minuscules lors de la recherche de packages dans PKGBrowser\n- Inclut les correctifs de la mise à jour précédente v15.2.1\n- Correction du téléchargement des correctifs de jeu PS5\n- Éléments de menu PS3 mal placés (aucun élément dans le menu « Bibliothèque »)\n \nPS5 :\n- Mise à jour etaHEN par LightningMods v1.9b -> v2.0b\n- Mise à jour d'Itemzflow par LightningMods v1.08 -> v1.09\n- Ajout de l'ISO IPV6 BD-J incluant etaHEN v2.0b par LightningMods\n- Mise à jour de kstuff par sleirsgoevy & EchoStretch v1.2 -> v1.3\n- Mise à jour ELFLdr par john-tornblom v0.18.1 -> v0.19\n- WebSrv mis à jour par john-tornblom v0.21 -> v0.22\n \nMise à jour supplémentaire v15.2.3 disponible :\n- Corrige l'habillage du texte dans la plupart des fenêtres\n- Nouvelle option pour extraire une archive téléchargée une fois le téléchargement terminé\n- L'expéditeur de charges utiles PS4/PS5 répertorie désormais les charges utiles téléchargées à partir du dossier  Téléchargements et vous permet de les sélectionner pour les envoyer\n \n \n \nTéléchargement : PS Multi Tools v15.2.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205039/in-multi-ps-multi-tools-v1522-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[PS5] Itemzflow v1.09 disponible",
        "content": "Le développeur LightningMods vient de mettre en ligne une nouvelle version de son manager (gestionnaire de jeux) Itemzflow, il s'agit de la v1.09 qui se destine à la PS5. \n \nComme vous le savez Itemzflow offre plusieurs fonctionnalités supplémentaires pour chaque jeu, comme par exemple un dumper, la possibilité de patcher, de réparer et plus encore.  \n \n \n\n \n\n \n \nChangelog : \n \n- Ajout de la prise en charge des firmwares 5.xx et 6.xx\n- Ajout de la possibilité de télécharger et de prévisualiser les mises à jour de jeux vendus au détail à partir du CDN de Sony\n- Ajout des paramètres de la boîte à outils etaHEN aux paramètres d'itemzflow (réinjecter la boîte à outils ou désactiver le démarrage automatique)\n- Le plugin de triche Illusions a été renommé plugin de correctifs XML Itemzflow\n- Ajout d'un auto-décrypteur expérimental facultatif au dumper itemzflow\n- Itemflow installera désormais les correctifs XML et le plugin de désactivation des erreurs s'ils n'existent pas (inclut uniquement les derniers plugins au moment de cette version)\n- Correction de quelques bugs avec le menu des formateurs d'itemzflows (comme l'affichage d'une case vide lorsqu'aucun correctif n'est trouvé)\n- Ajout de la police pour 3 langues différentes telles que le chinois\n- Correction d'un bug déclenché en essayant de copier sans jeu sélectionné\n- Ajout d'une barre de progression d'installation pour les PKG installés via le paramètre d'installation PKG d'itemzflows\n- Remarque : cette version ne fonctionne qu'avec etaHEN 2.0b. Toute autre version affichera des erreurs ou un écran noir.\n \n \n \nTéléchargement : Itemzflow v1.09\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205036/in-ps5-itemzflow-v109-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205036/in-ps5-itemzflow-v109-disponible-2.jpg"
        }
    },
    "news_7": {
        "title": "[PS5] IPV6 BD-J ISO mis à jour par LightningMods",
        "content": "Le développeur LightningMods a également mis à jour IPV6 BD-J ISO afin d'inclure la nouvelle version d'etaHEN.\n \nCette version est disponible sous forme d'ISO et peut être lancée via l'exploit Blu-ray BD-J, compatible avec les firmwares PS5 3.00 à 4.51 (tous les firmwares compris sur 3.xx et 4.xx pour faire simple). Pour utiliser l'ISO, il faut la graver sur un disque Blu-ray et le lancer via le menu Média de la PS5. Une alternative existe via l'outil UMTX, mais nécessite une configuration réseau spécifique (DNS primaire : 61.210.38.117, secondaire : 0.0.0.0)\n \n \n\n \n \n \nTéléchargement : IPV6-BDJ-etaHEN / lien direct bdj-ipv6-hen.iso\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204957/in-ps5-ipv6-bd-j-iso-is-a-jour-par-lightningmods-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS5] etaHEN 2.0b officiellement disponible",
        "content": " \nDepuis quelques semaines certains ont la possibilité de tester etaHEN 2.0b, mais ça y est le développeur LightningMods le propose enfin officiellement au grand public. \n \netaHEN 2.0b est désormais officiellement disponible, il amène de nombreuses nouvelles fonctionnalités qui ont été ajoutées depuis la version 1.9b. \n \nEn voici quelques-unes : \n \n- prise en charge des firmwares 5.xx et 6.xx\n- ajout d'un menu pour les codes de triche dans la boîte à outils d'etaHEN\n- ajout d'un bouton pour télécharger les cheatcodes\n \n \n\n \n\n \n\n \n \n \nChangelog 2.0b complet : \n \n- Ajout du support (et mise à jour de kstuff) pour les firmwares 5.xx et 6.xx\n- Ajout d'un menu dans la boîte à outils etaHEN pour les cheatcodes (/data/etaHEN/cheats)\n- Ajout d'un bouton pour télécharger des cheatcodes via le menu des cheatcodes lorsqu'aucun jeu n'est ouvert ou qu'aucun cheatcode n'a été trouvée pour le jeu\n- Ajout de fonctionnalités de spoofing comme l'installation de fpkgs de firmware supérieur sans spoofing réel de la version du système\n- Ajout de la possibilité de désactiver le démarrage automatique de la boîte à outils via la boîte à outils elle-même ou le config.ini dans /data/etaHEN (la réactivation sans redémarrage nécessite Itemzflow 1.9+). Vous pouvez aussi créer le fichier toolbox_auto_start sur votre clé USB pour désactiver la boîte à outils sans modifier le config.\n- Mise à jour de l'injecteur de la boîte à outils pour éviter les blocages lors du chargement sans kstuff\n- Toutes les payloads internes comme ps5debug et kstuff sont maintenant chargées par etaHEN lui-même au lieu d'être envoyées via l'exploit\n- Ajout de The Direct Package Installer V2 (version WebGUI) dans le menu des services\n- L'option PS5Debug dans la boîte à outils etaHEN peut maintenant être chargée à la demande et sans redémarrage (la désactivation nécessite un redémarrage)\n- PS5Debug a été mis à jour en version 1.0b2\n- PS5Debug a été désactivé pour les firmwares 5.xx en attendant un correctif\n- Ajout de la compression LMZA pour que la payload puisse tenir sur les appareils IoT avec peu de stockage comme les ESPs\n- DPI est désormais désactivé par défaut et remplacé par DPIv2\n- Correction d'un petit problème faisant apparaître un \"=\" en trop dans le menu Remote Play\n- Mise à jour du message de chargement de la boîte à outils\n- Correction de l'option /data dans les sandbox d'applications pour les firmwares 3.xx/5.xx/6.xx. Un grand merci à #bestpig\n- Ajout d'un auto-décripteur expérimental optionnel pour le dumper d'Itemzflow\n- Correction d'un problème empêchant le chargement des plugins depuis une clé USB\n- Correction du mode repos (il faut désactiver le démarrage automatique de la boîte à outils AVANT d'entrer en mode repos)\n- Ajout de FPKGi à la liste blanche (Whitelisted)\n \n \nTéléchargement : etaHEN 2.0b\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204956/in-ps5-etahen-20b-officiellement-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1204956/in-ps5-etahen-20b-officiellement-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1204956/in-ps5-etahen-20b-officiellement-disponible-3.jpg"
        }
    },
    "news_9": {
        "title": "[XB360] X360PluginManager v1.1.0 disponible",
        "content": "L'outil X360PluginManager a été mis à jour en version 1.1.0, cet utilitaire permet de charger des plugins sur la console Xbox 360 via l'exploit BadUpdate. \n \nL'exploit BadUpdate ne prend pas en charge le chargement de certains plugins, du fait de son fonctionnement particulier, et pour diverses raisons liés à son lancement, et bien avec X360PluginManager il est possible d'en charger depuis le périphérique USB logé dans le premier slot. \n \n \n \n\n \n \n \n \nChangelog v1.1.0 : \n \n- Autorise le chargement des plugins à partir du premier périphérique USB.\n \n \nInstallation :\n \n- Téléchargez la dernière version à partir des versions .\n- Décompressez X360PluginManager.zipquelque part.\n- Adaptez- X360PluginManager\\config.inile à vos besoins.\n- Déplacez le X360PluginManagerrépertoire vers votre console.\n- Lancement X360PluginManager\\default.xex.\n \n \nTéléchargement : X360PluginManager v1.1.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204927/in-xb360-x360pluginmanager-v110-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS3] CCAPI 4.92 CEX disponible",
        "content": "Enstone vient de mettre à jour son logiciel CCAPI (Control Console API), qui permet pour rappel de connecter une console PS3 à un autre appareil, comme un PC ou un smartphone, en s'appuyant sur l'API TMAPI (Target Manager), comme cela est possible via une console DEX. \n \nIl convient de faire attention, CCAPI peut provoquer un soft brick sur les slims et super slim en HEN, CCAPI se destine aux consoles disposant d'un CFW. Pour rappel, CCAPI (Control Console API) est une application qui nous permet de connecter un PC à la  PS3 via TMAPI comme il est possible de le faire avec les consoles DEX. Pour rappel, CCAPI établit une interface entre votre PS3 et votre PC, facilitant le lancement de commandes, comme la modification de l'IDPS (ou du PSID) de la console. Il vous permet aussi de connaître les températures en direct, ou encore d'établir des mods RTE, tout cela en wifi ou via le câble réseau. \n \n \n\n \n \nCette nouvelle version rev13 de CCAPI permet d'amener le support des CFW 4.92 CEX. Attention à ne pas utiliser sur HEN ni sur PEX 4.92.\n \n \nTéléchargement : CCAPI 4.92 CEX (Rev13)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204892/in-ps3-ccapi-492-cex-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[Switch] Sudachi mis à jour en v1.0.15",
        "content": "Le développeur Jarrod Norwell nous propose une mise à jour importante de Sudachi, \nSudachi est un émulateur Nintendo Switch pour Android, Linux, macOS et Windows écrit en C++ et basé sur Yuzu, Sudachi est proposé pour Windows, MacOS et Android.\n \nAu chapitre des nouveautés, l'ajout de certaines fonctionnalités ont été implémentées, des optimisations ont été apportées, et l'utilisation \"d'artefacts\" améliore la gestion de projet. \n \n \n \n\n \n \n \nChangelog : \n \n- Ajout du support pour XCX:DE en supprimant ssl:s\n- Actuellement, le menu et une petite partie du jeu ont été testés\n- Modification de la façon dont MoltenVK est obtenu pour macOS afin d'obtenir des versions plus récentes\n- Les artefacts sont maintenant utilisés et peuvent être mis à jour plus fréquemment\n- Passage de SDL2 à SDL3 apportant ses améliorations\n- Correction des problèmes liés aux caps en inversant temporairement la réécriture\n- Correction de plusieurs erreurs de compilation sur macOS\n- Mise à jour de vcpkg vers la dernière version\n \n \nTéléchargement : Sudachi v1.0.15\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204884/in-switch-sudachi-mis-a-jour-en-v1015-1.png"
        }
    },
    "news_12": {
        "title": "[PS5] Kstuff testé pour les firmwares 7.xx, mais cela ne fonctionne pas",
        "content": "Le développeur EchoStretch vient de dévoiler la toute première version de Kstuff pour les firmwares 7.xx de la PS5. Pour le moment, il ne s'agit que d'une version de test, qui ne fonctionnera correctement que les firmwares 7.00 et 7.01 mais c'est déjà ça, en attendant la suite. \n \nCette version de Kstuff supporte tous les firmwares 7.xx, cependant elle ne passera pas les offsets présents dans offsets.sysentvec, c'est pourquoi il dévoile cette première version test afin de progresser sur son support. Il va commencer aujourd'hui les diagnostics pour corriger les erreurs au fur et à mesure. Il le dit très clairement les firmwares au delà du 7.01.01 ne sont pas encore accessibles, mais que cela va être corrigé.\n \n \n\n \n \nIl convient encore d'être un peu patient, cela va se décanter, en attendant nous ne pouvons que remercier tout ceux qui sont impliqués dans les recherches. \n \n \n \n\n \n \nkstuff sur PS5 7.01 bd-j en test \n \n \nMalheureusement, après plusieurs tests en profondeur, cela ne fonctionne pas, ils n'abandonnent pas pour autant. \n \nhttps://x.com/StretchEcho/status/1904583904008560946\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204857/in-ps5-kstuff-teste-pour-le-firmware-7xx-1.png"
        }
    },
    "news_13": {
        "title": "[XB360] BadBuilder v0.1 Alpha disponible",
        "content": "Le développeur Pdawg a créé le logiciel BadBuilder qui est destiné à ceux qui disposent d'une Xbox 360 et qui souhaite mettre en oeuvre l'exploit BadUpdate. \n \nA quoi sert BadBuilder ? \n \nIl s'agit d'un outil proposé dans une première version 0.1 Alpha qui va permettre de simplifier la création d'une clé USB compatible avec l'exploit BadUpdate, ainsi vous pourrez exécuter du code non signé et des applications homebrews sur votre Xbox 360 si vous disposez de tout ce qu'exige BadUpdate.\n \nAinsi BadBuilder va se charger de formater la clé USB au format FAT32, jusque là rien d'exceptionnel, mais surtout BadBuilder va télécharger automatiquement les fichiers nécessaires à l'exploit BadUpdate, le logiciel va détecter et télécharger la dernière version des fichiers disponibles, et réutilisera ceux qui sont déjà présents s'il s'avère qu'il n'est pas nécessaire de les mettre à jour.\n \nBadBuilder permet aussi de spécifier manuellement les chemins de fichiers spécifiquement et dynamiquement c'est à dire qu'il va recréer les liens si nécessaires dans les archives, et sur la clé.\n \n \n\n \n \nBadBuilder v0.1 [ALPHA] :\n \nIl s'agit de la première version de BadBuilder. Si vous rencontrez des problèmes, veuillez les signaler en créant un nouveau ticket. Le programme est fourni sous forme de build à fichier unique, mais assurez-vous que .NET 8.0 Desktop Runtime est installé avant de l'exécuter.\n \n \nExtraction et copie de fichiers :\n \n- Extrait automatiquement tous les fichiers nécessaires.\n- Prépare la clé USB pour l'exploit BadUpdate en copiant tous les fichiers requis.\n \nPrise en charge des homebrews :\n \n- Permet d'ajouter des applications homebrew en spécifiant leur dossier racine.\n- Recherche automatiquement le .xexfichier de point d'entrée ( ) dans le dossier.\n- Si plusieurs .xexfichiers sont trouvés, BadBuilder vous demandera de sélectionner le bon.\n- Copie tous les fichiers nécessaires et corrige l'entrée .xexà l'aide du XexTool téléchargé.\n \n \nTéléchargement : BadBuilder v0.1 Alpha\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204856/in-xb360-badbuilder-v01-alpha-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[PS5] Sony sort le firmware 25.02-11.00.00 pour la PS5",
        "content": "Contrairement à la PS4 où nous ne savons pas grand chose, le nouveau firmware pour la PS5 vient avec un changelog un peu plus détaillé. Les améliorations portent essentiellement sur des améliorations des activités et du contrôle parental.\n \nLa mise à jour apporte donc une meilleure visibilité des activités, qui sont désormais affichées en entier sur leurs cartes avec les spoilers automatiquement masqués. \n \nLa prise en charge d'Unicode 16.0 a été introduite, de nouveaux émojis sont donc désormais accessibles, et une fonctionnalité du contrôle parental a été ajoutée. Un nouveau paramétrage permet de limiter la communication et le contenu généré par l'utilisateur. \n \nIl est possible aussi de conserver les paramètres par défaut en \"personnalisant\" l'affichage. Comme pour la version PS4, Sony annonce avoir amélioré la convivialité de certains écrans. Sony a aussi ajouté une possibilité pour les utilisateurs de s'inscrire de manière centralisé au programme bêta.\n \n \n\n \n \nVersion : 25.02-11.00.00 :\n \n- Nous avons simplifié la visualisation des détails des activités.\nLes détails de l’activité sont désormais entièrement affichés sur les cartes.\nDes spoilers potentiels seront toujours cachés.\n- Les emojis Unicode 16.0 sont désormais pris en charge. Vous pouvez les utiliser dans vos messages.\n- Lorsque vous définissez votre niveau de restriction de contrôle parental sur 16 à 19 ans ou plus , l' option Communication et contenu généré par l'utilisateur sera désormais définie sur Restreindre par défaut. Si vous avez précédemment défini le niveau entre 16 et 19 ou plus , vos paramètres précédents ne seront pas modifiés et s'afficheront comme Personnalisé .\n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et la convivialité de certains écrans.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204848/in-ps5-sony-sort-le-firmware-2502-110000-pour-la-ps5-1.png"
        }
    },
    "news_15": {
        "title": "[PS4] Sony sort le firmware 12.50 pour la PS4",
        "content": "Alors que la PlayStation 4 semblait en fin de vie, Sony a discrètement déployé un nouveau firmware 12.50. Cette mise à jour surprise relance les spéculations sur un possible soutien prolongé à la console, malgré la domination de la PS5.\n \nAméliorations techniques, correction de bugs mineurs, optimisations du système ou bien mise à jour de sécurité. Contrairement aux anciennes grosses mises à jour, cette version semble être une optimisation technique plutôt qu’une révolution.\n \nSony met en avant un changelog assez limité, la firme japonaise annonce avoir amélioré les messages et la convivialité de certains écrans, ce qui est très peu pour se faire une idée réelle de ce qu'apporte ce firmware. \n \n \n \n\n \n \nVersion : 12.50 :\n- Nous avons amélioré les messages et la convivialité de certains écrans.\n \nDu reste, il faut attendre un peu pour voir ce que réellement va apporter ce firmware. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204846/in-ps4-sony-sort-le-firmware-1250-pour-la-ps4-1.jpg"
        }
    },
    "news_16": {
        "title": "[Multi] Nintendo bloque les hombrews sur Alarmo avec le firmware 3.0.0",
        "content": " \nNintendo vient de publier une mise à jour firmware pour son réveil Alarmo, jusque là rien de bien surprenant, cependant ce firmware 3.0.0 a pour ambition de fermer les failles de sécurité critique. \n \nSous couvert d'introduire de nouvelles fonctionnalités, si cela était réellement possible, Nintendo bloque les modifications sur son réveil. Nintendo prétend avoir amélioré la personnalisation des alarmes, en ajoutant la possibilité de définir des sonneries différentes chaque jour de la semaine, ou encore d'ajuster la durée des sons relaxants jusqu'à 60 minutes. \n \nEncore une fois le plus gros changement est lié au fait qu'un nouveau 2ndloader a été introduit, imposant la vérification du code de démarrage lors de l'allumage, et la vérification de la signature numérique du firmware chargé via USB, tout cela empêchant l'exécution de code non signé ou non officiel. \n \n \n\n \n\n \n \n \n \nBref, en attendant de voir si cela peut être contourné, il faudra désormais trouver un réveil en firmware 2.0.0 maximum, ce firmware 3.0.0 venant pour le moment du moins bloquer tout recours à des modifications. \n \nPour bloquer les updates il faut désactiver la connexion Wi-Fi ou bien bloquer les DNS via votre modem-routeur. \n \nSource : GaryOderNichts\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204820/in-multi-nintendo-bloque-les-hombrews-sur-alarmo-avec-le-firmware-300-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1204820/in-multi-nintendo-bloque-les-hombrews-sur-alarmo-avec-le-firmware-300-2.png"
        }
    },
    "news_17": {
        "title": "[PS5] Le payload PS5 Kstuff mis à jour en 1.2",
        "content": "Le développeur EchoStretch a mis à jour son solution payload PS5 Kstuff en version 1.2. \n \nPour rappel, kstuff est un payload pour PS5 créé à l'origine par Sleirsgoevy qui permet d'exécuter des faux packages PS4 (des FPKG) et certaines applications homebrew sur PS5. Cette nouvelle version apporte le support de tous les firmwares 6.xx, que ce soit le 6.00, 6.02 ou 6.50.\n \n \n\n \n \n \nChangelog : \n \n- Prise en charge les firmwares 3.00-6.50 \n- Les firmwares 6.XX nécessite un hôte/elfldr avec des offsets mis à jour\n \nTéléchargement : Kstuff 1.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204800/in-ps5-le-payload-ps5-kstuff-mis-a-jour-en-12-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] Nxdumptool supporte désormais MacOS",
        "content": "Le développeur Sheldon10095 propose une mise à jour de Nxdumptool de DarkMatterCore, connu anciennement sous le nom de gcdumptool, le programme permet de dumper vos jeux Nintendo Switch, les DLC et aussi les mises à jour. \n \n \n\n \n \nL'utilitaire permet également de transférer, analyser et vérifier l'intégrité des jeux, et la nouvelle version supporte MacOS, ce qui n'était pas le cas jusqu'à présent. \n \n \nChangelog : \n \n- Support de MacOS\n- Initialisation USB mise à jour pour vérifier explicitement certains chemins libUSB courants sur macOS (Intel et Apple Silicon) et inviter l'utilisateur à installer libUSB via la partie homebrew s'il n'est pas trouvé. \n \n \nTéléchargement : nxdt_rw_poc.elf / nxdt_rw_poc.nro / prerelease\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204799/in-switch-nxdumptool-supporte-desormais-macos-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS5] Kstuff sur 6.xx et 7.xx très bientôt sur Lua et Blu-ray",
        "content": "Zecoxao vient d'annoncer que grâce à de généreux contributeurs, les clés sur les firmwares 6.xx et 7.xx sont tombées, comme cela s'est produit jusqu'à présent, quelques jours en suivant kstuff a été porté. \n \nIl annonce donc que TOUS les firmwares 6.xx et 7.xx vont bénéficier de kstuff très prochainement, dans les prochains jours, et que pour en bénéficier il faudra le faire via l'exploit Lua ou bien l'exploit Blu-ray.\n \n \n\n \n \n \nPour le moment, il n'est pas encore question d'exploit webkit utilisable, de fait pour ces firmwares il ne sera pas 'encore' possible de lancer kstuff via le navigateur. \n \n \nTout est là : x.com/notnotzecoxao\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204790/in-ps5-kstuff-sur-6xx-et-7xx-tres-bientot-sur-lua-et-blu-ray-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] Jailbreak UMTX2 pour PS5",
        "content": "Le projet UMTX2 est le fruit du travail de plusieurs développeurs et chercheurs en sécurité informatique, qui ont fait le choix de mettre en commun leurs connaissances afin de proposer une solution commune hébergée officiellement sur https://github.com/idlesauce/umtx2 \n \nUMTX2 est un nouvel outil de jailbreak qui exploite la vulnérabilité UMTX  pour permettre l'exécution de code non autorisé sur la console PS5 de Sony, le code d'exploitation est largement basé sur l'implémentation Lua développée par les développeurs Shahrilnet et n0llptr, disponible dans le référentiel remote_lua_loader.\n \n \n\n \n \n \nLe Jailbreak UMTX2 dispose de quelques caractéristiques propres : \n \n- Support des firmwares 1.00-5.50 : UMTX2 est compatible avec une large gamme de firmwares PS5, le rendant accessible à de nombreux utilisateurs. Au dessus du firmware 5.50, il n'existe pas de webkit exploitable, donc pour le moment il n'est pas possible de le porter sur 6.xx et 7.xx. \n- Menu payloads : le projet comprend un menu de gestion des payloads, ce qui facilite l'exécution de code personnalisé sur la console.\n- Intégration PSFree 150b : UMTX2 utilise PSFree 150b d'abc , un exploit webkit connu pour exécuter des exploits sur PS5 de manière stable. \n- Chargement automatique du chargeur ELF : Le projet inclut le chargement automatique du chargeur ELF développé par  @john-tornblom , qui vous permet d'exécuter des fichiers ELF sur la console.\n- Compatibilité avec les payloads plus anciens : UMTX2 inclut également le  loader ELF 9020, qui assure la compatibilité avec les payloads plus anciens (non disponible en mode Webkit uniquement).\n- Mode Webkit uniquement : pour les utilisateurs qui souhaitent envoyer des payloads et dumper le cache de l'application sans effectuer un jailbreak complet, un mode Webkit uniquement est disponible.\n \nHébergement : \n \nhttps://umtx2.pages.dev/\n \nhttps://idlesauce.github.io/umtx2/\n \n \nTéléchargement : \n \nhttps://umtx2.ps5browser.pages.dev/umtx2.pages.dev.pkg\n \nhttps://umtx2.ps5browser.pages.dev/umtx2.github.pkg\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204770/in-ps5-jailbreak-umtx2-pour-ps5-1.jpg"
        }
    }
}