{
    "news_1": {
        "title": "[Switch] Les patchs signatures du 17.0.0 sont là",
        "content": "Dans la nuit sont tombés les patchs signatures pour le firmware 17.0.0. En raison de changements majeurs dans la conception et le fonctionnement du module FS, la mise à jour des patchs signatures pour le firmware 17.0.0 a pris du temps. \n \nMais voilà les nouveaux patchs signatures sont désormais bel et bien disponibles, la mise à jour de sys-patch a également été proposée dans la foulée. \n \n \n\n \n \n \nSys-patch (ITotalJustice) : https://github.com/ITotalJustice/sys-patch\n \nIPS_Patch_Creator (MrDude) : https://github.com/mrdude2478/IPS_Patch_Creator/releases\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1409470731.png"
        }
    },
    "news_2": {
        "title": "[Switch] switch_AIO_LS_pack 5.5.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.5.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.5.0:\nMise à jour du firmware inclue vers la version 17.0.0.\nMise à jour d'Atmosphere et de Sys-patch vers la dernière version de ceux-ci.\nSuppression de Incognito-RCM, de PPlay et des overlays de SimpleModManager.\nMise à jour de la documentation.\nMise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.20.02:\nCorrection d'un bug de détection d'un modèle de console.\n\nNote: Pour traiter les problèmes particuliers de lancement de la sysnand en firmware 17.0.0 c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.\nSauf pour la correction de bugs je pense que le homebrew AIO_LS_pack_Updater est arrivé plus ou moins à sa version final, cependant si vous avez des idées pour l'améliorer autres qu'une interface graphique n'hésitez pas à m'en faire part (consultez le readme du Github du projet pour voir les choses que je voudrais faire mais que je n'arrive pas à faire pour l'instant ou les choses que je pourrais faire mais la flemme, c'est dans la todo list), si vous êtes développeur et que vous voulez proposer des pull requests elles seront les bienvenues si elles respectent l'esprit du projet (du C si le C++ n'est pas indispensable, par exemple on évitera de faire appel à des modules en C++ pour la traduction que j'aimerai d'ailleurs faire en pur C car là elle utilise un vecteur qui est du C++ se qui me plaît déjà moyennement).\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_3": {
        "title": "[PS4] PS2-FPKG v0.7 Beta un tool indispensable",
        "content": "Vous qui aimez la PlayStation 2, vous qui aimez la PlayStation 4, voilà le meilleur des deux mondes, un outil qui renait un peu de ses cendres puiqu'il aura fallu attendre 3 années depuis la dernière mise à jour. \n \nPS2-FPKG développé par Jabu permet pour rappel de convertir les jeux au format ISO ou BIN PlayStation 2 à destination de la PlayStation 4. \n \nAvec de nombreuses options à la clé, cet outil permet de personnaliser le FPKG avec notamment la possibilité de modifier l'icône de jeu, l'écran de démarrage, il supporte la création de multidisques jusqu'à 5 ISO, de sélectionner votre propre texte / lua, ou encore le choix de l'émulateur à utiliser. \n \n \n \n\n \n \n \nIl est facile à utiliser, il suffit de :\n \n- Exécuter ps2-fpkg.exe\n- Sélectionner l'image ISO/BIN du jeu PS2 dans \"Disc1\".\n- Personnaliser quelques paramètres\n- Cliquez sur \"Create fPKG\" et choisissez un emplacement de stockage\n- Installez le fPKG créé sur votre PS4 et jouez.\n \nRemarque : pour les jeux sur CD (.bin), cliquez sur OUI lorsque l'on vous demande d'ajouter le secteur LIMG. Les jeux sur CD ne fonctionneront pas sans ce secteur. L'application sélectionnera automatiquement un fichier de configuration qui corrige généralement certains problèmes avec le jeu, mais seulement s'il en trouve un dans sa base de données.\n \n \nListe complète des changements dans la v0.7-Beta :\n \n- Tout a été réécrit à partir de zéro avec un code plus propre, plus rapide et moins merdique\n- Certains onglets ont de nouveaux noms, certaines options ont été déplacées, un dialogue FirstRun a été ajouté, etc.\n- Le code de création de pkg n'affiche plus d'erreur si le chemin de sortie contient des espaces (cette erreur était un échec épique depuis longtemps dans la v0.6).\n- L'application affiche maintenant un formulaire d'erreur avec des informations complémentaires lorsque la création de pkg échoue\n- Les patchs widescreen sont maintenant ajoutés en tant que trophy_data afin qu'ils n'entrent plus en collision avec d'autres scripts lua\n- Les scripts lua de fonctionnalités diverses comme l'avance rapide, la couleur personnalisée de la barre lumineuse et quelques autres ont été déplacés dans feature_data\n- Toutes les icônes/splashs du jeu sont maintenant converties nativement par l'application, il n'y aura plus d'erreur sur les systèmes qui n'aimaient pas ImageMagic\n- Il est maintenant possible d'activer/désactiver \"Reset on Disc Change\" lors d'un changement de disque.\n- Il est maintenant possible de désactiver MTVU, ce qui devrait aider certains jeux qui ne fonctionnent pas correctement avec l'émulation VU1 Multi-Threaded (comme Crash Nitro Kart, Gradius V, Timesplitters etc.)\n- Ajout d'une option pour désactiver le transfert VIF1 instantané, ce qui devrait corriger des jeux comme MK Shaolin Monks, Soul Calibur 2 et quelques autres.\n- L'application montre maintenant si elle a trouvé la configuration txt/lua/ps3 pour le disque sélectionné\n- Il est maintenant possible de sélectionner un scanline shader dans les options graphiques.\n- Il est maintenant possible de choisir si l'on veut avoir un MultiTap connecté\n- Il est maintenant possible de baisser le volume du jeu dans les paramètres\n- Ajout d'options de débogage/test et d'une visionneuse de configuration intégrée (lancez l'application avec l'argument cmd -test)\n- Beaucoup d'autres choses dont je ne me souviens plus, car tout a été réécrit.\n \n \nTéléchargement : PS2-FPKG v0.7 Beta\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181483/in-ps4-ps2-fpkg-v07-beta-un-tool-indispensable-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] Save Transfer Wizard v1.0.0 disponible",
        "content": "Le développeur Rajesh propose un nouvel outil à destination de la PlayStation 5, enfin pas directement, il s'agit d'un utilitaire PC qui va vous permettre de transférer facilement les sauvegardes entre votre PS5 et votre PC. \n \nLivré avec une interface sobre, il en dispose néanmoins des fonctions avancées, il vous permet de copier, télécharger, supprimer des sauvegardes via la connexion FTP. \n \n \n\n \n \n \nLa PlayStation est connue pour accepter le transfert de sauvegarde uniquement en étant connecté au compte utilisateur, mais avec un tel outil plus besoin de passer par le PSN, ce qui est particulièrement intéressant à un moment où les fPKG PS4 arrivent en masse. \n \n \n\n \n \nFonctionnalités\n- Outil FTP simple\n- Peut transférer des sauvegardes dans les deux sens\n- Parcourir et télécharger des sauvegardes\n- Plate-forme Windows\n \nLimites :\n- Ne fonctionne que sur Windows\n- Ne peut pas resigner les sauvegardes\n- Nécessité d'activer le FTP dans la console\n- Actuellement, les sauvegardes ne sont récupérées qu'à partir de \\Utilisateur\\home\\savedata\n \nTélécharger la sauvegarde du jeu :\n- Activer le FTP dans PS5\n- Saisir l'IP et le numéro de port de la console\n- Cliquer sur \"Obtenir des utilisateurs\".\n- Sélectionnez le profil de l'utilisateur dans la liste déroulante\n- Sélectionnez la sauvegarde que vous souhaitez télécharger\n- Cliquez sur \"Télécharger\".\n- Les sauvegardes seront téléchargées Desktop\\SaveTransfer\\Import\n \nUploader la sauvegarde du jeu :\n- Activer le FTP dans PS5\n- Saisir l'IP et le numéro de port de la console\n- Cliquer sur \"Obtenir des utilisateurs\".\n- Sélectionner le profil de l'utilisateur\n- Cliquer sur le bouton Upload\n- Parcourir le dossier et télécharger\n \nSupprimer la sauvegarde du jeu :\n- Activer FTP dans PS5\n- Saisir l'IP et le numéro de port de la console\n- Cliquer sur \"Obtenir des utilisateurs\".\n- Sélectionnez le profil de l'utilisateur dans la liste déroulante\n- Sélectionnez la sauvegarde que vous souhaitez supprimer\n- Cliquez sur Supprimer et confirmez\n- La sauvegarde sera supprimée.\n \n \nTéléchargement : Save-Transfer-Wizard v1.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181453/in-ps5-save-transfer-wizard-v100-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS5] La première version de PS5 Wee Tools disponible",
        "content": "Le développeur Andy_maN vient de mettre en ligne la première version de PS5 Wee Tools, comme vous le savez il s'agit d'un outil gratuit qui permet de réaliser sensiblement les mêmes choses que Nor Tool proposé par Better Way Electronics. \n \nIl s'agit d'un script python qui pour l'heure est assez limité dans son nombre d'options, il permet tout de même de connaitre les informations sur le dump de la NOR, comme le MD5, l'ID de la carte, le modèle, le SKU, la région, le numéro de série, l'id Kiban, le firmware actuel / minimum / usine, l'adresse MAC (LAN/Wifi) ou encore permet d'autres options pour activer/désactiver IDU (mode kiosque) et le type de modèle (avec lecteur optique ou numérique).\n \nCette version permet aussi bien entendu de réaliser des dumps, des extractions de partitions ou encore des contrôles basiques de validation. \n\n\n\n \nPS5-wee-Tools v0.1a\n- Nor dump info:\nMD5, Board ID, Model, SKU, Region, SN / Mobo SN\nKiban ID, FW (current/min/factory), MACs\n- Flags: kiosk mode (idu), model (disc/digital)\n- Extract NOR's partitions\n- Build dump from extracted files\n- Basic validation\n \n \nTéléchargement : PS5-wee-Tools v0.1a\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-607636849.png"
        }
    },
    "news_6": {
        "title": "[PS5] Qui est le développeur qui a trouvé les offsets du firmware 4.50 de la PS5",
        "content": "A la surprise générale, ce n'est ni Specter, ni sleirsgoevy, ni ChendoChap, ni TheFlow a qui l'on doit l'ouverture du firmware 4.50, voyons ensemble pourquoi et qui a réalisé cet exploit. \n \nComme nous pouvons le voir dans l'exploit sleirsgoevy, le crédit de l'ouverture du firmware 4.50 revient à un développeur nommé cheburek3000, qui est ce développeur ?\n \n \n \n\n \n \n \nUn petit nouveau ? \n \nOui et non, comment a-t-il fait son oeuvre, essayons d'y voir un peu plus clair. \n \nLe développeur cheburek3000 est peu connu de la scène, il semble être russe, et a proposé à la scène un outil nommé Meme_Dumper en Février 2023. C'est d'ailleurs la seule proposition qu'il a faite, du moins sous ce pseudo. \n \n \nComment a-t-il réussi ? \n \nIl semble s'être appuyé sur proper0gdb pour trouver les offsets ça c'est une chose mais en plus il semble avoir apporté une nouveauté. \n \nIl y a un aspect technique qui n'avait jusqu'alors pas été utilisé, le développeur sleirsgoevy l'a remercié pour l'accès à la mémoire physmem, une nouveauté qui jusqu'alors n'avait pas été envisagé ou trouvé. \n \nIl s'est probablement servi de son outil Meme_dumper qu'il a proposé en Février 2023, et que peu de développeur ont su exploité. \n \nEn trouvant les offsets du firmware 4.50 avec Meme_dumper, il prouve que son outil est plus qu'indispensable. \n \n \n \n\n \n \n \nSon outil Meme_Dumper permet à défaut d'accéder à la mémoire par l'adresse virtuelle, d'y accéder par l'adresse physique, qui est mappée sans aucune protection !\n \nAvec cette idée en tête, cet outil va faire tourner un serveur, qui va vous déverser presque toute la mémoire, qui serait normalement protégée de l'userland et du kernel.\n \nCette nouvelle procédure ouvre la voix à la découverte des offsets pour tous les autres firmwares exploitables, et peut être plus encore. Une solution qui a été proposée il y a plusieurs mois, mais qui aujourd'hui porte ses fruits ! \n \n \n \n \nFTPS5 1.3 parfaitement fonctionnel sous firmware 4.50 sur PS5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181346/in-ps5-qui-est-le-developpeur-qui-a-trouve-les-offsets-du-firmware-450-de-la-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1181346/in-ps5-qui-est-le-developpeur-qui-a-trouve-les-offsets-du-firmware-450-de-la-ps5-1.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1181346/in-ps5-qui-est-le-developpeur-qui-a-trouve-les-offsets-du-firmware-450-de-la-ps5-2.jpg"
        }
    },
    "news_7": {
        "title": "[Wii/NC] Swiss v0.6r1548 disponible",
        "content": "Le développeur Extrems propose une mise à jour de son outil Swiss afin d'apporter des corrections indispensables. \n \nComme vous le savez probablement Swiss est le digne successeur de SD-boot, il permet de lancer les homebrews GameCube mais aussi les backups stockés sur carte SD ou un disque dur, SDGecko, WODE, Wiikey Fusion et bien d'autres solutions. \n \n \n \n\n \n \n \nChangelog :\n \n- Une régression avec le SD2SP2 a été corrigée par la libogc2.\n- Mise à jour de la base de données No-Intro.\n- Changements pour corriger la panique pour le loader M.2.\n- Mise à jour de la base de données Redump.\n \nTéléchargement : Swiss GC\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181340/in-wiinc-swiss-v06r1548-disponible-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS5] Le firmware 4.50 supporté pour le hack ps5-kstuff (fPKG PS4)",
        "content": "Finalement c'est possible ! Voilà que les offsets du firmware 4.50 viennent à l'instant de tomber, cela signifie tout simplement que ps5-kstuff vient d'être porté pour fonctionner sur le firmware 4.50, rien que ça ! \n \nCela signifie aussi que les consoles PS5 qui vont pouvoir faire tourner le hack PS4 vont être beaucoup plus nombreuses que seules les consoles disposant d'un firmware 4.03. \n \n \n\n \n \nLes efforts commencent à payer, nous devons à priori les offsets du firmware 4.50 à cheburek3000. Dans quelques heures, tout cela va donc être mis à jour pour fonctionner sur 4.50.\n \nPour parler simplement, les fPKG PS4 peuvent désormais être installés et lancés sur le firmware 4.50 de la PS5 ! \n \n \nTout est là : ps5-kstuff offsets firmware 4.50\n \n \nLe développeur sleirsgoevy a mis à jour sa page host ici, et remercie cheburek3000 pour la technique d'accès au physmem et les offsets du firmware 4.50 : \n \nhttps://sleirsgoevy.github.io/ps4jb2/ps5-403/index.html\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181301/in-ps5-le-firmware-450-supporte-pour-le-hack-ps5-kstuff-1.jpg"
        }
    },
    "news_9": {
        "title": "[Switch] Yuzu aussi a progressé en septembre 2023",
        "content": "Les développeurs de la Team Yuzu montrent aussi les progrès qu'ils ont fait durant le mois de septembre 2023. Il faut dire que durant l'été est souvent une période plus calme, la conséquence des vacances et des longues journées à bronzer . \n \nDepuis un certain temps, il est possible de charger les Miis par défaut dans les jeux supportés sur yuzu. Cependant, la mise en oeuvre du service Mii par Yuzu ne disposait pas du support nécessaire pour la base de données Mii.\n \nLa base de données Mii est un fichier enregistré sur la Switch pouvant contenir jusqu'à 100 Mii. Sans la prise en charge appropriée de cette base de données au sein du service Mii, il était impossible de charger vos Mii personnalisés.\n \n \n \n\n \n \n \nGrâce à un travail important, la Team Yuzu annonce qu'après avoir entrepris de porter une rétro-ingénerie complète sur le service Mii, que Yuzu supporte la possibilité de charger leurs propres personnages Mii dans n'importe quel jeu en plaçant le fichier de base de données de leur console dans %appdata%/yuzu/nand/system/save/8000000000000030/MiiDatabase.dat.\n \nUne fois le service Mii terminé et derrière lui, Narr retourna rapidement à la tâche consistant à faire fonctionner l'applet MiiEdit de manière transparente sur yuzu. Grâce à l'aide au dépannage de byte[] , il a finalement réussi à le faire fonctionner. La dernière pièce du puzzle consistait à compléter la prise en charge de la base de données Mii pour l'applet, et avec cet ajout crucial, la fonctionnalité Mii de yuzu est désormais plus robuste que jamais. Les utilisateurs peuvent désormais créer, modifier et stocker leurs Mii en toute transparence à l'aide de la nouvelle applet MiiEdit via Tools> Open Mii Editor, et les jeux peuvent générer automatiquement un Mii aléatoire pour les joueurs sans planter.\n \nAu délà de ça, Yuzu bénéficie désormais d'améliorations graphiques, sous Pikmin 4 , Mortal Kombat 1 et Sonic Forces sous Vulkan.\n \n \n \n\n \n \n \nAméliorer l'expérience Android est aussi l'un des objectifs de la team, qui a apporté de nombreuses corrections, mais la partie audio aussi a été optimisée, améliorant ausi la restitution des musiques et des voix, notamment dans New Super Mario Bros U Deluxe. \n \nD'autres changements sous le capot, comme pour VSync, Vulkan, ou encore l'amélioration du support implémenté du système de vérification simple NCA (Nintendo Content Archive), qui vérifie que les noms des fichiers NCA correspondent à leur contenu pour se prémunir contre la corruption du système de fichiers.\n \nL'équipe aborde encore quelques progrès notamment sur les drivers des GPU Adreno 700, 725 et 730, le pilote officiel Qualcomm a reçu quelques mises à jour, mais il continue d'être absolument terrible, il n'est encore pas envisageable ni recommandé de l'utiliser. \n \nL'article est disponible ici : yuzu-emu.org\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181299/in-switch-yuzu-aussi-a-progresse-en-septembre-2023-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] La version PS5 de Wee Tools en préparation",
        "content": "Le développeur Andy_maN est clairement en feu, il propose une nouvelle version de son script python PS4 Wee Tools, l'outil de manipulation de la mémoire NOR et Syscons de la PS4. \n \nIl propose en effet la version 0.9.2 de son outil avec des nouveautés importantes. \n \n \n\n \n \nChangelog 0.9.2 :\n \n- NOR : patch légitime rapide (glisser-déposer 2 dumps sur run.bat)\n- SC : autopatch fonctionne désormais avec n'importe quel* syscon\n- SC : correction d'un bug de la méthode B\n- SC : le patch manuel fonctionne désormais avec les flatdata\n- SC : affiche le compteur de lignes\n* pour ceux qui veulent tenter leur chance\n \n \nTéléchargement : PS4 Wee Tools 0.9.2\n \n \nMais énorme nouveauté, nous venons d'apprendre depuis quelques minutes qu'une version PS5 de Wee Tools est en préparation !\n \n \n\n \n \nLe développeur demande de lui livrer des dumps PS5 et des informations, alors si vous avez des dumps, il ne faut pas hésiter car la scène va passer à la vitesse supérieure avec l'arrivée de ce genre d'outils sur PS5.\n \nPour le moment, PS5 Wee Tools prend juste la forme d'un teasing en image de la version 0.1.0 qui permet quelques actions comme la possibilité de connaitre l'IDU, le modèle de PS5, l'extraction des partitions de la mémoire flash, ou encore de réaliser un dump de fichiers.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181263/in-ps5-la-version-ps5-de-wee-tools-en-preparation-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1181263/in-ps5-la-version-ps5-de-wee-tools-en-preparation-2.png"
        }
    },
    "news_11": {
        "title": "[Switch] Ryujinx progresse en septembre 2023",
        "content": "Le rapport de Septembre 2023 de Ryujinx vient de faire son apparition sur les serveurs de la Team en charge de son développement.\n \nAu programme, comme toujours un article profonds qui explique comment le programme progresse.\n \nSeptembre a été un mois inhabituellement calme pour la publication de jeux, le plutôt décevant remaster de Baten Kaitos , aux côtés d'un Mortal Kombat 1 douteux, avec des énormes chuttes de framerate. \n \nAinsi la mémoire tampon est très mal gérée dans ce jeu, qui a du mal à atteindre les 60 FPS.\n \n \n \n\n \nDes optimisations du jeu ont permis d'obtenir jusqu'à 46 % d'améliorations de restitution vidéo, mais il en faudra bien plus pour que le jeu soit parfaitement jouable, notamment des patchs du développeur. \n \nLe plus gros gagnant du mois est sans aucun doute R-Type Final 2, qui se voit passer de 8 FPS à 60 FPS (+750 % d'amélioration). \n \n \n\n \n \nD'autres jeux comme Super Bomberman R 2, sont directement jouables, si vous voulez en savoir davantage veuillez lire l'article ci-dessous. \n \n \nLien : blog.ryujinx.org/progress-report-september-2023\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2018076885.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-827943228.png"
        }
    },
    "news_12": {
        "title": "[3DS] MSET9 v1.1 disponible",
        "content": "Le développeur Zoogie propose une nouvelle version de MSET9 qui passe en v1.1.\n \nL'exploit principal MSET est du kernel ARM9 pour les firmwares 11.4 à 11.17 pour toutes les consoles de la famille Nintendo 3DS, il passe en v1.1. \n \nAu programme, le script mset9.py a été retravaillé, merci ToxicAven ! Et surtout nous bénéficions désormais d'une réduction de certains fichiers inutiles.\n \n \n \n\n \n \nTéléchargement : MSET 1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181207/in-3ds-mset9-v11-disponible-1.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] switch_AIO_LS_pack 5.4.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.4.0.Pour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.Le homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables. Depuis cette news les évolutions sont les suivantes:- Changelog pour la version 5.3.0:Mise à jour du firmware inclue vers la version 16.1.0.Ajout du homebrew SimpleModDownloader.Mise à jour de Hekate, d'Atmosphere, de Goldleaf et de DBI vers la dernière version de ceux-ci.Mise à jour des fichiers de patches pour NXThemesInstaller.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.20.00:Certains petits fichiers utilisés par l'application sont téléchargés en mémoire plutôt que sur la SD, ceci augmente la vitesse de traitement et réduit l'usage de la SD.Correction d'un bug qui faisait que l'installation du forwarder du homebrew était activée quoi qu'il arrive si l'installation du forwarder du Homebrew Menu était activée.- Changelog pour la version 5.4.0:Mise à jour de Hekate, d'Atmosphere, de NXThemesInstaller, de NXMP, de Status-monitor-overlay, de Lockpick-RCM, de ma version de Incognito-RCM et de ma version de TegraExplorer vers la dernière version de ceux-ci.Mise à jour des fichiers de patches pour NXThemesInstaller.Mise à jour du logo Switch pour le futur firmware 17.0.0.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.20.01:Correction d'un bug au niveau de la détection de mises à jour.Ajout dune protection durant l'extraction du pack pour éviter que l'extraction ne soit tentée si le fichier dans le zip n'a pas de nom car cela pourrait supprimer le contenu de toute la SD.Pour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.Note: Pour traiter les problèmes particuliers de lancement de la sysnand en firmware 17.0.0 j'ai donc mis à jour le pack en 5.4.0 plut tôt que prévu vu que le firmware 17.0.0 'est pas encore pleinement compatible avec toutes les fonctionnalités, cette version intégrant donc la nouvelle version 1.6.1 d'Atmosphere avec le pack on peut régler le souci facilement. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.Sauf pour la correction de bugs je pense que le homebrew AIO_LS_pack_Updater est arrivé plus ou moins à sa version final, cependant si vous avez des idées pour l'améliorer autres qu'une interface graphique n'hésitez pas à m'en faire part (consultez le readme du Github du projet pour voir les choses que je voudrais faire mais que je n'arrive pas à faire pour l'instant ou les choses que je pourrais faire mais la flemme, c'est dans la todo list), si vous êtes développeur et que vous voulez proposer des pull requests elles seront les bienvenues si elles respectent l'esprit du projet (du C si le C++ n'est pas indispensable, par exemple on évitera de faire appel à des modules en C++ pour la traduction que j'aimerai d'ailleurs faire en pur C car là elle utilise un vecteur qui est du C++ se qui me plaît déjà moyennement).N'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets.Si vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_14": {
        "title": "[PS4] LightningMods montre encore ses progès sur ItemzFlow sur PS5",
        "content": "Le développeur LightningMods propose des nouvelles sur les étapes de construction de la version PS5 de son utilitaire ItemzFlow, son gestionnaire d'homebrews.\n \nItemzFlow sur PS5 s'appuie sur le fonctionnement récent découvert sur le firmware 4.03, donc pour le moment tant que ce dernier n'a pas été étendu sur d'autres firmwares, il sera impossible de l'utiliser, mais nous pouvons compter sur les efforts de certains pour y parvenir. Qui aurait cru il y a encore quelques semaines que cela allait arriver. \n \nLe développeur n'a pas précisé combien de modifications ont été nécessaires jusqu'à présent pour que Itemzflow fonctionne sur la PS5, ni quand il prévoit de le publier, mais il est clair que le projet est régulièrement mis à jour en dehors du github, afin que soit gardé privé les modifications apportées. \n \n \n \n\n \n\n \n \n \nLe développeur se sert de son expérience PS4 pour modifier les paramètres sur PS5 \" Il a fallu quelques inversions mais cela sera utile plus tard dans le store\", ou encore \" Oui, je suis allé plus loin et je viens de mettre à jour vers le firmware 4.03 puisque je fais des homebrews alors pourquoi pas, j'ai également automatisé la création du PKG donc après sa compilation, il crée le PKG en utilisant liborbispkg \".\n \n \n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-520974720.png"
        }
    },
    "news_15": {
        "title": "[Switch] Atmosphère 1.6.1 Pre-release disponible",
        "content": "Le développeur SciresM dévoile déjà une nouvelle version d'Atmosphère, il y a une heure le développeur a en effet proposé la version 1.6.1, toujours en pre-release. \n \n \n\n \n \n \nGrâce à l'équipe de @switchbrew, Atmosphère 1.6.1 est livré avec hbl 2.4.3, et hbmenu 3.5.1.\n \nCe qui suit a été modifié depuis la dernière version :\n \n- Une solution améliorée au problème qui faisait que les consoles qui avaient précédemment reconstruit leur partition SYSTEM se bloquaient lors de la mise à jour vers la version 17.0.0 a été ajoutée.\n- En particulier, le démarrage d'atmosphère détectera automatiquement le problème et débridera toutes les consoles qui sont tombées dans cet état.\n- Quelques améliorations ont été apportées à haze :\n- Les performances ont été grandement améliorées :\n- Le support de GetObjectPropList a été ajouté, ce qui réduit le nombre de requêtes de ~8x.\n- Haze effectue maintenant le rendu sur le GPU, libérant le CPU pour répondre aux requêtes de manière plus opportune.\n- Un problème a été corrigé dans la façon dont Haze configure bMaxPacketSize0, ce qui améliore le support de l'USB3.\n- Améliorations générales de la stabilité du système afin d'améliorer l'expérience de l'utilisateur.\n \n \nTéléchargement : Atmosphère 1.6.1 Pre-release\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181015/in-switch-atmosphere-161-pre-release-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[PS5] Les développeurs Sleirsgoevy et Specter multiplient les efforts sur PS5",
        "content": "L'obsession des développeurs Sleirsgoevy et Specter est de pouvoir offrir un portage du hack du firmware 4.03 de la PS5 vers d'autres firmwares, mais cela ne semble pas aussi évident que de le dire car trouver les failles n'est pas simplement de trouver quelques offsets. \n \nDepuis la publication de son long article, Sleirsgoevy a poussé quelques commits intéressants sur son référentiel github, et celui le plus marquant est celui qui fait référence à l'ajout d'un script python permettant de porter Propser0gdb et PS4 fPKG (aussi appelé PS5 kstuff) vers d'autres firmwares PS5 que le 4.03.\n \n \n \n\n \n \n \nLes deux mondes se croisent, le développeur Sleirsgoevy est en train de tenter de batir une version personnalisée du loader de ELF de Specter appelé \"FrakenELF\", les deux solutions étaient assez éloignées l'une de l'autre, il a falloir adapter les propositions. \n \nIl s'agit en quelque sorte d'une solution alternative, permettant au code de chercher un accès différent, si ce qu'il rencontre n'est pas directement compatible avec lui, ainsi l'idée serait d'utiliser le débogueur prosper0gdb en lui ajoutant le support de frankenELF pour tenter de trouver les offsets à modifier sur les autres firmwares. \n \n \nprosper0gdb : miscallenous\n- suppression des offsets inutilisés de la liste des offsets, pour réduire la recherche\n- réécriture du code de fuite de doreti_iret pour une meilleure efficacité\n \nps5-kstuff : ajout d'un outil de portage WIP\nActuellement, il trouve la plupart des décalages basés sur les données (pas très intéressants) et le décalage doreti_iret, les autres décalages sont à faire. \n \n \nTout est là : ps4jb-payloads\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180962/in-ps5-les-developpeurs-sleirsgoevy-et-specter-multiplient-les-efforts-sur-ps5-1.png"
        }
    },
    "news_17": {
        "title": "[Switch] ezRemote client, sys-CLK, SwitchThemeInjector, NxThemes Installer...",
        "content": "Que de nouveautés côté homebrews pour la Nintendo Switch, de nombreux programmes ont été mis à jour par leur auteur, ezRemote client, sys-CLK, SwitchThemeInjector, NxThemes Installer, ou encore Status Monitor Overlay, ont tous été mis à jour, faisons le tour du propriétaire.\n \n \nSwitch Ezremote Client\n \n \n\n \nezRemote Client est une application de gestion de fichiers qui vous permet de connecter la Switch à des serveurs FTP, SMB, WebDAV distants pour transférer et gérer des fichiers. Il remplace les applications \"Switch SMB Client\" et \"Switch FTP Client\".\n \nQu'est-ce qui est différent ?\n \n- Pour les opérations sur un seul fichier, il n'est plus nécessaire de \"marquer\" le fichier/dossier avec le bouton \"Y\" avant que les éléments de menu ne soient activés.\n- Ajout de la fonction couper, copier, coller pour les fichiers locaux\n- Ajout d'un éditeur de texte\n- Ajout de la prise en charge du serveur WebDav.\n- Une seule application pour accéder à FTP, SMB et WebDav\n- Testé avec les serveurs WebDAV suivants :\n(Recommandé) RClone - Pour héberger votre propre serveur WebDAV. Vous pouvez utiliser le serveur WebDAV de RClone comme proxy vers plus de 70 services d'hébergement de fichiers publics (par exemple Google Drive, OneDrive, Mega, Dropbox, NextCloud, etc.)\nDufs - Pour héberger votre propre serveur WebDAV.\nSFTPgo - Pour un serveur WebDAV hébergé localement. Peut également être utilisé comme frontal webdav pour le stockage en nuage comme AWS S3, Azure Blob ou Google Storage.\n \nTéléchargement : ezRemote client v1.00\n \n \n \nLe sysmodule sysclk\n \nEnorme mise à jour pour Sys-clk qui est proposé désormais en v2.0.0-rc (release candidate), la version précédente était la v1.0.3. Ce sont 69 changements dans les fichiers, 14 commits qui ont été apportés, mais voici les principales modifications :\n \n- sys-clk n'intègre plus les tables de fréquences, et les obtient désormais du HOS au démarrage.\n- Les fréquences réelles/instantanées et la consommation de la batterie peuvent maintenant être imprimées dans les rapports overlay, manager, logs et csv.\n- La prise en charge du firmware 17.0.0 a été ajouté.\n- Si vous remarquez des bugs ou des comportements bizarres (en particulier sur HOS < 7.0.0), vous pouvez créer un problème sur le repo, ou envoyer un message dans le Discord RetroNX.\n \n \nTéléchargement : sys-clk 2.0.0-rc\n \n \n \n \nSwitch Theme Injector et NX Themes Installer\n \n \n\n \n \nLes deux programmes ont été mis à jour par Exelix11, SwitchThemeInjector passe en 4.7.1 et NXThemesInstaller en 2.7.1, c'est surtout le support du firmware 17.0 qui a été ajouté , et quelques corrections et patchs.\n \nTéléchargement : Switch Theme Injector 4.7.1 et NX Themes Installer 2.7.1\n \n \n \nStatus Monitor Overlay\n \nConcernant Status Monitor Overlay, les problèmes survenus sur la version 17.0.0 du firmware ont été résolus, dans la version précédente, les températures du SoC et du PCB affichaient toujours la valeur 0 et les informations sur le type de chargeur, la tension maximale et le courant maximal du chargeur étaient incorrectes. Ces problèmes appartiennent désormais au passé.\n \nLes températures du SoC et du PCB affichent désormais des valeurs décimales, offrant un affichage plus précis de la température. La nouveauté est le temps estimé restant jusqu'à ce que la Switch s'éteigne, qui est désormais affiché à côté de la consommation d'énergie de la batterie dans les modes Full, Mini et Micro. Pour une meilleure lisibilité, l'affichage de la RAM en mode micro a été modifié de Mo à Go et affiche également une décimale. Également en mode micro, la consommation d'énergie n'est indiquée qu'avec une seule décimale ; Ceci s'applique également à l'affichage du niveau du ventilateur dans tous les modes.\n \nSur le firmware 17.0.0, audsnoop n'est plus disponible. Cela signifie que l'utilisation du DSP ne sera désormais plus affichée dans l'onglet \"Autre -> Divers\".\n \nProblèmes de firmware 17.0.0 résolus :\n- Températures du SoC et du PCB affichant 0\n- Type de chargeur, tension maximale du chargeur et courant maximal du chargeur affichant des valeurs erronées\nModifications générales :\n- Les températures des SoC et des PCB sur tous les FW affichent désormais des décimales.\n- À côté de la consommation de batterie dans les modes Full, Mini et Micro, vous pouvez désormais voir également le temps estimé restant avant l'arrêt du Switch (merci à rkuchkarov pour le PR #56)\n- Dans Micro, au lieu de Mo pour la RAM, vous verrez désormais Go jusqu'à une décimale\n- Dans Micro, la consommation électrique n'affiche désormais qu'une seule décimale\n- Le niveau du ventilateur n'affichera désormais qu'une seule décimale dans tous les modes\n- Divers affiche désormais également les horloges NVENC et NVJPG (merci à Averne pour le PR #57)\n- Étant donné que la version 17.0.0 audsnoop n'est pas disponible, l'utilisation du DSP n'est pas affichée dans l'onglet Autre -> Divers.\n \n \nTéléchargement : Status Monitor Overlay 0.9.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180929/in-switch-ezremote-client-sys-clk-switchthemeinjector-nxthemes-installer-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1180929/in-switch-ezremote-client-sys-clk-switchthemeinjector-nxthemes-installer-2.jpg"
        }
    },
    "news_18": {
        "title": "[PSP] PKGi PSP v1.0.0 disponible",
        "content": "Alors là c'est très intéressant de voir que la PSP attire toujours un peu de monde, le développeur Damian Parrino plus connu de nous sous le pseudonyme de Bucanero, nous propose la mise à jour de PKGi pour la PSP en version v1.0.0.\n \nClairement cela va faire revivre la PSP, après l'arrivée de Pandora Batterie pour la PSP Go, PSP Apollo Save Tool, voilà donc qu'il a mis à jour la v0.8.0 qu'il a proposé il y a environ 2 semaines. \n \nVitesse de téléchargement multipliée par 2 (jusqu'à 500 Ko/s), de nombreuses nouvelles fonctionnalités : installez .pkg au format ISO/CSO/Digital, prise en charge de la PSP Go, recherche, décryptage et installation de thèmes, mise à jour des fichiers DB en ligne, prise en charge du proxy réseau https ... \n \n \n \n\n \n \n \nPKGi PSP v1.0.0 :\n \nAjout\n- Installation du paquet comme ISO/CSO/Digital\n- Détection du stockage interne de PSP Go (ef0/ms0)\n- Mise à jour des fichiers de la base de données à partir des URL (option Refresh)\n- Activation de l'option Recherche (clavier à l'écran)\n- Ajout de la catégorie PSX\n- Vérification et notification de la nouvelle version de PKGi\n \nCorrection :\n- Installation et décryptage des thèmes dans /PSP/THEME/\n \nDivers\n- Amélioration de la vitesse de téléchargement (jusqu'à 500 Kb/s)\n- Prise en charge des paramètres de proxy réseau\n \n \nTéléchargement : PKGi PSP v1.0.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180914/in-psp-pkgi-psp-v100-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] GameBato Store v1.22 disponible",
        "content": "Le store GameBato, qui permet pour rappel de profiter à ses pleines capacités de votre PS4 ou PS4 Pro sous firmware 5.05, 7.55 ou 9.00, est désormais proposée en version v1.21.\n \nLes nouveautés sont encore une fois nombreuses et il est intéressant de voir à quoi les développeurs ont pensé pour faire évoluer leur solution. \n \n \n\n \n \n \nChangelog 1.21 :\n \n- Ajout d'un système de vérification pour déterminer les paquets corrompus pendant le téléchargement. Les utilisateurs peuvent être informés de la corruption d'un paquet plus tôt au cours du téléchargement, de sorte qu'ils peuvent supprimer le téléchargement de la liste et réinsérer le paquet dans leur liste de téléchargements.\n- Amélioration de la vitesse de navigation dans l'application. Appuyez également sur le bouton R1 et maintenez-le enfoncé pour naviguer plus rapidement dans les sections de l'application.\n- Correction d'un problème qui désinstallait l'application GameBaTo lorsque l'utilisateur essayait d'ajouter un téléchargement en mode console qui était déjà présent alors qu'il était arrêté dans le centre de notification de la console.\n- Correction d'un problème qui faisait que les téléchargements des utilisateurs qui avaient oublié d'utiliser Quitter pour fermer l'application tombaient à un pourcentage inférieur ou se réinitialisaient à zéro pour cent.\n- Correction d'un problème entraînant le blocage du processus de sortie dans l'écran de dialogue Closing GameBaTo.\n- Correction d'un débordement de chiffres dans les statistiques d'espace de stockage du disque dur affichées dans la section Téléchargements. \n- Effacement des fichiers temporaires lorsque l'utilisateur ferme l'application.\n- Correction de nombreux problèmes mineurs.\n \n- Et n'oubliez pas d'utiliser Exit à l'intérieur de l'application lorsque vous voulez fermer l'application. La fermeture forcée de l'application peut entraîner l'effacement de la liste des téléchargements en cas de panique de l'appareil.\n \n \n \nTéléchargement : gamebatoapp.ir\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180843/in-ps4-gamebato-store-v121-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] Le dashboard ItemzFlow en développement pour la PS5",
        "content": "Le développeur LighningMods précise notre news sur l'arrivée des homebrews sur PS5, l'animation que nous avons pu voir il y a quelques jours, était celle du fonds d'écran d'Itemzflow Game Manager, un manager de jeux qui est déjà proposé depuis quelques mois sur la PS4. \n \nAvant l'arrivée des jeux sur le dashboard officiel appelé XMB, il fallait passer par un dashboard proposé sous forme d'homebrew, notamment sur PS3, le projet avait été porté sur PS4 pour bénéficier d'un store. \n \nIl permet aussi d'autres opérations comme le dump de jeux, la lecture de fichiers multimédia ou encore de bidouiller un peu les paramètres de la console. \n \n \n\n \n \nPour la PS4, ItemzFlow avait nécessité plusieurs mois de développement pour bien comprendre le ShellUI de la PS4, et bien sur PS5 ce sera la même chose.\n \nBien entendu, pour le moment, le logiciel ne supporte que le contenu PS4, et toutes les options ne sont pas encore là, il faudra probablement un temps assez conséquent pour que l'ensemble des fonctionnalités soient portées. \n \n \n \n",
        "images": {}
    }
}