{
    "news_1": {
        "title": "[Multi] Le AMD Zen 2 Secure Processor Bootrom compromis",
        "content": "Une nouvelle avancée sur la scène PlayStation et Xbox, peut être qu'une nouvelle étape vient d'être franchie en effet les bootroms du processeur sécurisé (SP, alias PSP) d'AMD pour les architectures ZEN et ZEN2 ont été leakés.\n \nIl y a quelques semaines des chercheurs en sécurité ont démontré qu'il était possible de compromettre le Trusted Platform Module (TPM) d'AMD. \n \nAMD l'a même confirmé, des vulnérabilités présentes dans ses APU peuvent compromettre la sécurité de l'architecture ZEN et ZEN2, l'AMD SP étant l'un des niveaux de sécurité le plus haut de ces architectures. \n \n \n\n \n \nLà ce sont les bootroms de Zen2 qui ont été leakés, ces APU présentes dans la PS5 et les Xbox Series. Le bootrom en lui-même n'est pas une vulnérabilité, cependant son accès permet un peu à l'image de ce qui se passe sur la Nintendo Switch, d'accéder à des niveaux de sécurités élevés. \n \n \n\n \n \nSpecterDev a confirmé qu'il s'agit d'une pièce intéressante du puzzle PS5, même si elle sera très probablement \"très difficile à inverser\", elle permettra d'attaquer la sécurité des consoles au travers par exemple de faulTPM. \n \nLe bootroom : https://github.com/anonpsp/bootroms/\n \nTout est là : reversing-the-amd-secure-processor-psp / reversing-the-amd-secure-processor-psp-part-2-cryptographic-co-processor-ccp",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173857/in-multi-le-amd-zen-2-secure-processor-bootrom-compromis-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173857/in-multi-le-amd-zen-2-secure-processor-bootrom-compromis-2.png"
        }
    },
    "news_2": {
        "title": "[XBO/XB Series] XBSX2 v2.0.0 disponible",
        "content": "Le développeur SirMangler vient de mettre en ligne une nouvelle version de son émulateur XBSX2, l'émulateur de PlayStation 2 (le portage de PCSX2) pour les consoles Xbox One et Xbox Series X/S.\n \nIl s'agit là d'une mise à jour majeure, riche en fonctionnalités, et qui va durer dans le temps selon le développeur. Il a ajouté un support intégral de Direct3D de DirectX12, et il est basé sur la dernière version de PCSX2. Pour rappel, l'émulateur XBSX2 vous permet non seulement de jouer à des titres PS2 avec toute la puissance native de l' émulateur PCSX2 , mais vous permet également de profiter des résolutions échelonnées (+4K) jamais vues sur une console Xbox.\n \n \n \n \n\n \n \n \nInclut :\n \n- Support complet de D3D12\n- Standalone de PCSX2 pour Xbox !\n- RetroAchievements\n- Système de triche et de correctifs entièrement fonctionnel\n- Préconfiguré pour le jeu en ligne\n- Basé sur la dernière révision de PCSX2 à ce jour.\n \nProblèmes connus dans cette version :\n \n- La configuration 'Software' en tant que paramètre par jeu provoque un crash du jeu.\n- La boîte de dialogue de l'échelle OSD se ferme parfois de manière aléatoire lors de la saisie manuelle de nombres.\n- Un grand merci à Reverie et TRW pour leurs tests approfondis, ainsi qu'à TRW pour les changements supplémentaires et le nettoyage de l'interface utilisateur.\n \nTéléchargement : XBSX2 v2.0.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173828/in-xboxb-series-xbsx2-v200-disponible-1.jpg"
        }
    },
    "news_3": {
        "title": "[Switch] Atmosphère 1.5.4 pre-release disponible et optimisé pour Zelda ToK",
        "content": "Le développeur SciresM vient de mettre en ligne une nouvelle version d'Atmosphere il y a 2 heures, il s'agit de la version 1.5.4 et il s'agit d'une pre-release c'est à dire qu'il en dévoilera une version définitive plus tard quand elle sera considéré comme stable et exempt de bugs. Cette nouvelle version apporte quelques optimisations pour The Legend of Zelda : Tears of the Kingdom.\n \n \n\n \n \n \nIl s'agit de la 73eme version officielle d'Atmosphère, sachant qu'elle intègre HBL en 2.4.3 et hbmenu 3.5.1.\n \nSi des bugs sont signalés avec la préversion d'Atmosphère, ils seront corrigés et la version sera mise à jour.\n \nLa version 1.5.4 passera en version release après un court laps de temps sans rapport de bug urgent.\nEn particulier, Atmosphère 1.5.4 contient une nouvelle fonctionnalité expérimentale pour supporter les mods layeredfs/romfs pour The Legend of Zelda : Tears of the Kingdom, qui peut avoir des bugs que je n'ai pas découverts lors de mes propres tests.\n \nLes éléments suivants ont été modifiés depuis la dernière version :\n \n- Une nouvelle fonctionnalité expérimentale a été implémentée pour éviter les plantages lors de la construction de romfs pour certains jeux avec des nombres de fichiers obscènes.\n- Cela inclut à la fois Fire Emblem : Engage (~190000 fichiers), et The Legend of Zelda : Tears of the Kingdom (~300000).\n- La solution a consisté à ajouter une fonctionnalité à ams.mitm/pm pour voler dynamiquement la mémoire du pool d'applications (et du système) en fonction des besoins lorsque les jeux ont des mods romfs.\n- Aucune mémoire n'est prélevée, et cette fonctionnalité ne coûte rien lorsque le jeu ne comporte pas de mods (ou que les overrides sont désactivés).\n- The Legend of Zelda : Tears of the Kingdom est actuellement le pire des jeux, nécessitant ~48 Mo de mémoire pour construire une image romfs pour jouer avec des mods.\n- Pour l'instant, la mémoire est répartie comme suit : 32 Mo (base ams.mitm heap), 10 Mo (volés au pool d'applications), 8 Mo (volés dynamiquement au pool système).\n- Cela fait 50 Mo, ce qui permet un peu d'overhead dans le pire des cas (pour éviter un plantage dû à l'épuisement du heap pour d'autres allocations dans ams.mitm).\n- Zelda est remarquablement sensible au vol de mémoire du pool d'application, ne tolérant pas plus de 16 Mo sur 1.0.0 et 12 Mo sur 1.1.0. J'ai choisi de voler 10 Mo, pour être sûr, pour l'instant.\n- Il est possible que cela ne fonctionne plus lors d'une prochaine mise à jour du jeu, mais je le corrigerai si et quand cela se produira. Il n'y a pas de solution parfaite ; le jeu nécessite tout simplement trop de mémoire pour supporter les mods sans problème, et je suis obligé de faire des compromis.\nComme d'habitude, si vous rencontrez un jeu qui épuise la mémoire d'ams.mitm (en le faisant planter) lors du chargement de mods layeredfs, veuillez contacter SciresM#0524.\n\"Je me porte la poisse en disant cela, mais il est vraiment difficile d'imaginer un jeu pire que The Legend of Zelda : Tears of the Kingdom, mais si cela se reproduit, je ferai tout pour le réparer comme d'habitude.\n- Améliorations générales de la stabilité du système afin d'améliorer l'expérience de l'utilisateur.\n \n \nTéléchargement : Atmosphère 1.5.4 pre-release\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1893040938.jpg"
        }
    },
    "news_4": {
        "title": "[Switch] Zelda Tears of the Kingdom en 8 K et 60 FPS sur PC",
        "content": "Les deux géants de l'émulation Switch, que sont les émulateurs Yuzu et Ryujinx font tout pour optimiser le nouveau Zelda Tears of the Kingdom. Il faut dire que le titre, un peu comme une sorte de Pokemon, permet d'avoir une visibilité beaucoup plus large que d'habitude, et ainsi attirer plus d'utilisateurs. \n \nLes deux équipes viennent d'ailleurs de publier leur rapport du mois d'avril, mettant en avant le nouveau jeu de Nintendo. \n \nCes rapports s'ils vous intéressent se trouvent ici : Yuzu /  Ryujinx\n \n \n\n \n \nAinsi Ryujinx revient sur des optimisations apportées à The Legend of Zelda: Breath of the Wild.\n \nLes joueurs se sont littéralement empressés de vouloir tester l'ancien jeu de Zelda afin de mieux découvrir le nouveau, Tears of the Kingdom\nLes besoins en émulation se sont donc ressentis et de nouvelles optimisations ont donc été apportées sur les jeux d'ombres, les textures ou encore sur Vulkan.\n \nMême constat chez Yuzu, les améliorations sur les Zelda sont légions, on peut parle de The Legend of Zelda: Breath of the Wild mais aussi de The Legend of Zelda: Link's Awakening.\n \n \n \n\n \n \n \nMais si vous êtes là c'est aussi pour parler de l'émulation de Zelda Tears of the Kingdom qui est possible en 8 K et 60 FPS. Pour parvenir à cela il faut disposer d'un PC monstrueux.\n \nC'est sur Yuzu que cela a été démontré, un utilisateur de Youtube a dévoilé que le jeu tourne parfaitement dans cette résolution. Pour cela il a utilisé :\n \n- 1 processeur Intel Core i9-13900k 5.8ghz lga1700 qui coûte à lui seul 600 euros\n- 1 carte graphique nVidia GeForce RTX 4080 – Founders Edition à 1500 euros\n- 64 Go de Ram  G.Skill Trident Z RVB DDR4 4000 MHz en 2x32 Go soit 250 euros environ de plus \n \nPlus de 2300 euros juste pour ces 3 composants, autant vous le dire qu'il vous faudra au moins 3000 euros pour faire tourner Zelda dans cette résolution. Un peu cher l'émulation, mais quand on aime... \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173786/in-switch-zelda-tears-of-the-kingdom-en-8-k-et-60-fps-sur-pc-1.png"
        }
    },
    "news_5": {
        "title": "[Multi] PS Multi Tools v13 disponible",
        "content": "Voilà plusieurs semaines que le développeur SwenGDK nous fait saliver avec l'arrivée d'une nouvelle version de PS Multi Tools, et bien voilà que la v13 est proposée au téléchargement depuis quelques heures. \n \nComme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n \n\n \n \nv13 Changelog\n \nChangements généraux\n- PS Multi Tools v13 a été entièrement réécrit en WPF et utilise désormais le .NET Framework 4.8.1 (WinForms & .NET Framework 3.5 auparavant).\n- L'ancienne bibliothèque \"ps-menu\" est maintenant appelée \"psmt-lib\" et est maintenant une bibliothèque partagée qui peut être utilisée dans vos outils également (très limité auparavant).\n- PS Multi Tools fonctionne maintenant sans avoir besoin de vérifier les mises à jour - si aucune mise à jour n'est disponible, il conservera votre \"psmt-lib.dll\" actuel.\n- MyPS et Bug Sender supprimés, veuillez utiliser GitHub pour signaler les bugs.\n \nChangements PS1\n- Amélioration du support de la console PS1\n- Le gestionnaire de sauvegarde supporte maintenant les fichiers \".bin\" et lit le code du jeu à partir de ceux-ci. L'art du jeu peut maintenant être affiché. (.iso [pas encore] & .bin sont maintenant supportés)\n- Outil de fusion des fichiers BIN\n- Mises à jour et nouveaux téléchargements\n \nChangements PS2\n- Amélioration de la prise en charge de la console PS2\n- Inclut maintenant les outils et les téléchargements PSX DVR\n- Le gestionnaire de sauvegarde est maintenant capable d'afficher plus d'informations sur le jeu, y compris l'art du jeu.\n- Conversion de BIN/CUE en ISO\n- PSX DVR XMB Games et Homebrew Installer\n- Mises à jour et nouveaux téléchargements\n \nChangements PS3\n- Amélioration de la prise en charge de la console PS3\n- Le gestionnaire de sauvegarde prend désormais en charge les fichiers \".iso\" et \".pkg\". (Les dossiers de sauvegarde avec PS3_GAME, .iso & .pkg sont maintenant pris en charge)\n- Le gestionnaire de sauvegarde est maintenant capable de jouer la bande sonore du jeu sélectionné.\n- Les outils et opérations ISO sont maintenant disponibles (Créer, Extraire, Diviser & Patch)\n- Supporte maintenant les fichiers \".tsv\" de NPS (Les fichiers doivent être placés dans le dossier \"Database\" mais vous pouvez aussi charger le dernier dans l'application).\n- Ceci débloquera les téléchargements pour : Jeux, Mises à jour, Démos, DLC, Thèmes, Avatars\n- Créer des fichiers \".rap\" (clic droit sur un élément à télécharger)\n- Nouvel éditeur PARAM.SFO\n- Extracteur/déboucheur de PUP\n- Extracteur/déboucheur dev_flash\n- Lecture de soi pour lv0, lv1ldr, lv2ldr, isoldr, appldr, EBOOT.BIN\n- Décryptage, extraction, cryptage et hexadécimation de \"Core_os\".\n- Correction de Tar pour 3.72+\n- RCO Dumper\n- PS2 Classics (pas encore prêt)\n- Mises à jour et nouveaux téléchargements\n \nPS4\n- Prise en charge de la console PS4 ajoutée pour la première fois\n- Le gestionnaire de sauvegarde est capable de charger des fichiers \".pkg\" et d'afficher des informations à leur sujet, y compris l'art du jeu et la bande sonore.\n- USB Writer pour les fichiers \".img\" - utile pour le \"exfathax.img\".\n- Editeur PARAM.SFO pour PS4\n- Payload Sender pour envoyer des payloads \".bin\n- PKG Sender (sera changé en \"PS4 PKG Manager\") pour envoyer et installer des fichiers \".pkg\", il sera également capable de voir et désinstaller les pkgs installés sur la PS4\n- Simple PUP Unpacker pour les PUPS .DEC\n- PS Classics (pas encore prêt)\n- Téléchargement des hôtes d'exploitation pour 4.05 - 9.00\n- Téléchargements d'émulateurs\n- Téléchargements de firmware (System & Recovery)\n- Téléchargements Homebrew\n- Téléchargements d'outils Windows\n \nPS5\n- Prise en charge de la console PS5 ajoutée pour la première fois\n- Le gestionnaire de sauvegarde est indisponible jusqu'à ...\n- Mast1c0re Sender pour envoyer des charges utiles \".elf\" et des jeux PS2 \".iso\" (y compris \".conf\")\n- Informations sur les exploits disponibles\n- Téléchargement d'exploits pour 3.00 - 4.51, y compris le BD-JB ELF Loader v1.6.1\n- Téléchargements homebrew (FTPS5, Mast1c0re Network ELF & Game Loader)\n \nChangements PSP\n- Amélioration de la prise en charge de la console PSP\n- Le gestionnaire de sauvegarde prend désormais en charge le chargement des fichiers \".cso\" (les dossiers de sauvegarde avec PSP_GAME, .iso, .cso sont désormais pris en charge)\n- Compression des fichiers \".iso\" en \".cso\"\n- Conversion des fichiers \".iso\" en \".PBP\" ou \".PBP\" en \".iso\"\n- Extraction de fichiers \".PBP\n- Mises à jour et nouveaux téléchargements\n \nChangements pour la PS Vita\n- Prise en charge améliorée de la console PS Vita\n- Le gestionnaire de sauvegarde prend désormais en charge le chargement des dossiers de jeux et des fichiers \".pkg\" cryptés/décryptés par PSV et affiche des informations à ce sujet, y compris l'art du jeu.\n- Supporte maintenant les fichiers \".tsv\" de NPS (Les fichiers doivent être placés dans le dossier \"Database\" mais vous pouvez aussi charger le dernier dans l'application).\n- Ceci débloquera les téléchargements pour : Jeux, Mises à jour, DLC, Thèmes, Démos\n- Extracteur RCO\n- Décryptage et extraction des fichiers \".pkg\".\n- psvimgtools (pas encore prêt)\n- Générateur de fichiers EML (pas encore prêt)\n- Mises à jour et nouveaux téléchargements\n \n \nTéléchargement : PS Multi Tools v13\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1289622330.png"
        }
    },
    "news_6": {
        "title": "[PS5] PS5 BD-JB ELF Loader v1.6.1 disponible",
        "content": "Le développeur John Tornblom est de retour avec une nouvelle version de PS5 BD-JB ELF Loader, son programme passe en effet en version 1.6.1. \n \n \n\n \n \nAu programme de cette nouvelle version qui débarque mi-mai, il s'agit d'une version stable, qui apporte des exemples de support pour le chargement/déchargement automatique de modules sprx utilisant des tableaux init/fini.\n \nA noter qu'il a mis à jour également le PS5 SDK. \n \n \nTéléchargement : PS5 BD-JB ELF Loader v1.6.1 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173753/in-ps5-ps5-bd-jb-elf-loader-v161-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[3DS/Switch] PKHeX 23.05.11 disponible",
        "content": "Les petits gars en charge du développement de PKHeX viennent de mettre en ligne une nouvelle version de leur outil à destination de la Nintendo 3DS, Switch, et Gamecube. \n \nComme vous le savez avec PKHeX les utilisateurs peuvent manipuler divers fichiers de sauvegarde .sav,.dsv,.dat,.gci,.raw et .bin. PKHeX peut également lire et écrire les fichiers .pk, qui sont des fichiers Pokémon individuels, et les fichiers .pgt,.pcd,.pgf,.wc, qui sont des fichiers Mystery Gift.\n \nCette nouvelle version apporte de nombreux changements !\n \n \n\n \n \n \n11/05/23 - Nouvelle mise à jour :\n \nMise en conformité :\n- Modification : La création d'un nouveau PKM à partir d'un gabarit va définir les mouvements actuels de la même manière que les jeux.\n- Modification : Les souches de Pokérus 0 & 8 sont maintenant autorisées en raison d'erreurs d'implémentation officielles dans les Gen2 & Gen3.\n- Correction : Les rencontres traversant Mesagoza (emplacement 8) ne sont plus autorisées (distance verticale).\n- Correction : Les comptes HOME TSV=0 sont maintenant autorisés à exister, et le XOR antishiny pour les cadeaux PID fixes se comporte maintenant correctement.\n \nCorrections : \n- Ajout : Les commandes de filtrage de l'éditeur par lots peuvent maintenant référencer d'autres valeurs de propriétés (alias \"copie de propriétés\") comme les commandes de modification.\n- Pour copier une propriété, il suffit de la spécifier comme suit .Stat_ATK=*Stat_DEF\n- Pour filtrer sur la base de la valeur d'une autre propriété, procédez de la même manière.\n- Ajout : Les mouvements qui ont changé de type élémentaire au fil des générations indiqueront désormais leur type dans le contexte du fichier de sauvegarde.\n- Ajout : Le visualiseur d'image du joueur Gen9 affiche maintenant les photos de profil dans l'éditeur de l'entraîneur. Merci @pasqualenardiello !\n- Ajout : Le LGPE Gen7 peut maintenant débloquer tous les modes via l'éditeur d'entraineur.\n- Ajout : L'éditeur de blocs de la Gen5 affiche maintenant les deux objets roamer (Thundurus et Tornadus).\n- Correction : Les indicateurs d'échelle de la Gen9 reflètent désormais les seuils d'échelle du patch >=1.1.0. Merci iD3M0N1C !\n- Correction : Gen5 C-Gear Skin ne conserve plus le verrouillage de fichier sur les fichiers d'image de skin importés.\n- Correction : Les cartes mémoires Gen3 peuvent maintenant être détectées comme le dernier fichier de sauvegarde, ainsi que comme source de sauvegarde pour le pkmdb.\n- Correction : Les Pokémon ombre non purifiés Gen3 ne sont plus marqués sans ruban s'ils ont une jauge d'ombre de 0 (prêts à être purifiés).\n- Modification : Le mode de mise à l'échelle de la sous-forme est passé à \"Hériter\" -- ajouté un paramètre d'affichage pour revenir à la mise à l'échelle de la forme (à partir de Dpi).\n \n \n \nTéléchargement : PKHeX 23.05.11\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173721/in-3dsswitch-pkhex-230511-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[Switch] DeepSea 4.6.0 disponible",
        "content": "Le développeur Team-Neptune propose une nouvelle version de DeepSea qui comme les petits copains apportent le support de la dernière version d'Atmosphere. \n \nPour rappel, DeepSea est un Pack AIO regroupant tout en un pack, l'objectif est de facilité l'accessibilité pour les utilisateurs d'Atmosphère.\n \n \n\n \n \nCette version ajoute la prise en charge du dernier firmware Nintendo 16.0.3 : \n \n- Mise à jour d'Atmopshere vers 1.5.3\n- Mise à jour de Hekate vers 6.0.4\n- Mise à jour de AiO Switch Updater vers 2.21.4\n- Mise à jour de emuiibo vers 1.0.0\n- Mise à jour de MissionControl vers 0.9.2\n- Mise à jour de nx-ovlloader vers 1.0.7\n- Mise à jour de Status-Monitor-Overlay vers 0.9.0\n- Mise à jour de sys-clk vers 1.0.3\n \n \nTéléchargement : DeepSea 4.6.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173720/in-switch-deepsea-460-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[Switch] NeXT 3.01 disponible",
        "content": "Le développeur mistervampi vient de mettre en ligne une nouvelle version de NeXT, il faut dire qu'il fallait bien apporter le support du dernier firmware 16.0.3.\n \nPour rappel NeXT est un tout en un qui supporte les CFW que ce soit Atmosphere ou SX OS, de plus sa gestion des applications est largement simplifiée par une interface utilisateur très fonctionnelle. Similaire à DeepSea ou encore RetroReloaded, NeXT intègre de nombreux payloads, et sa plus grande des possibilités est de pouvoir facilement gérer Atmosphere et SX OS au travers d'une interface graphique riche. \n \n \n\n \n \nChangelog : \n \n- Prise en charge de la version 16.0.3 \n- Compatibilité totale avec toutes les consoles Switch moddées Soft / Hard\n \nMises à jour : \n \n- Nouveau Bootmenu basé sur Heakate\n- Atmosphère => 1.5.3\n- Sigpatches => 1.5.3\n- Tesla OVL\n- Emuiibo\n- Lan Play\n- AIO Switch Updater\n- DBI\n- Nombreuses mises à jour majeures \n- Paquet à très haute compression\n \nFYI : Tous les patches/hombrew/sys-modules les plus importants ont été testés avant cette sortie publique afin de vérifier la compatibilité et le bon fonctionnement de cette AIO avec le dernier firmware système disponible. Mais dans certains cas, les modules hombrew/sys ne sont pas mis à jour par leurs développeurs au moment de chaque sortie de NeXT. Il faut donc garder à l'esprit que l'utilisation de certains modules hombrew/sys non mis à jour peut entraîner un blocage ou un plantage du système. \n \n \nTéléchargement : NeXT 3.00\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173710/in-switch-next-300-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] PS5 NOR Modifier 1.0 disponible",
        "content": "Le développeur TheCod3r vient de publier son outil PS5 NOR Modifier, sous ce nom se cache un outil qui vous aide à mettre à jour le  fichier flash NOR de la PS5, vous l'aurez compris cet outil se destine avant tout à des réparateurs.\n \nTheCod3r n'en est pas à son coup d'essai puisqu'il a largement contribué à la scène PS4 et PS5 notamment lors de lecteur blu-ray HS. Dernièrement il a travaillé sur le fait de reclasser une console PS5 disposant d'un lecteur HS en modèle numérique afin d'empêcher les erreurs qui y sont liées. \n \n \n \n\n \n \nPS5 NOR Modifier vous permet de modifier votre fichier PS5 NOR pour le convertir entre les éditions numériques et sur disque pour enregistrer votre PS5 lorsque votre lecteur de disque tombe en panne ou lorsqu'aucun lecteur de disque n'est disponible.\n \nGrâce à ce logiciel gratuit, vous pouvez ramener votre console de la tombe en convertissant une édition disque en édition numérique, ainsi qu'en changeant le numéro de série et la variante signalée afin de remplacer votre rom flash SPI lorsqu'elle meurt ! Ceci est particulièrement utile lorsque vous ne disposez pas non plus d'un lecteur de disque correspondant, en convertissant un disque en une édition numérique afin de permettre de futures mises à jour (restauration de la fonctionnalité en ligne en gardant votre PS5 à jour). Si votre rom flash SPI meurt (très courant), vous pouvez maintenant modifier le vidage à partir d'une autre console et conserver la fonctionnalité du lecteur de disque. Vous n'avez plus besoin de convertir en version numérique lorsque votre rom flash SPI meurt!\n \nCaractéristiques:\n \n- Lisez le numéro de série de vidage du BIOS signalé, la version signalée (disque ou numérique) et la variante de carte (modèle CFI-XXX).\n- Modifiez le numéro de série indiqué dans le vidage du BIOS.\n- Alternez entre les versions disque et numérique.\n- Changer de variante de carte.\n- Traitement en un clic, pas besoin d'expérience en ligne de commande ou de compétences en édition HEX.\n- Rapide, léger et facile à utiliser.\n- Application autonome, aucune installation requise.\n- Entièrement portable. Transportez l'application sur une clé USB et exécutez-la instantanément.\n \nTéléchargement : ps5-nor-modifier-v1-0-0-0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173693/in-ps5-ps5-nor-modifier-10-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[Switch]DBI 563 disponible",
        "content": "Rashevskyv, le développeur de DBI propose une nouvelle version de son logiciel, la version 563. DBI pour DB Installer est un gestionnaire et installateur de fichiers NSP/NSZ/XCI et XCZ via SD, USB. Il fonctionne tout aussi bien en standalone ou bien en créant son propre serveur http local. Il permet aussi de gérer et supprimer les fichiers orphelins les tickets (mise à jours par exemple). Hormis une tendance très minimaliste exacerbée, DBI est apprécié pour ses fonctionnalités et une partie backend de Windows qui permet de faciliter les transferts.Grâce au multi-threading, l' installation du NSP a été accélérée d'environ 40 %, désormais plus d'informations sont affichées pendant le processus d'installation et certaines erreurs de sortie ont été corrigées lorsque la console est en mode dock. Les dumps de plus de 4 Go peuvent désormais également être dumpés sur des périphériques FAT32 grâce au fractionnement. Le menu de sauvegarde des données a été repensé et un code QR s'affiche au démarrage du serveur FTP.\n \n\n \nChangelog 563 :- Potentiellement corrigé l'installation de nouveaux jeux\n- Menu Outils ajouté :\n    Nettoyer les fichiers orphelins - déplacés du menu principal\n    Supprimer le contrôle parental - supprimer le contrôle parental\n    Supprimer l'utilisateur... - supprimer les utilisateurs de la console\n    Exécuter un jeu aléatoire\n    Synchronisation de l'heure NTP - synchroniser l'heure avec le serveur NTP\n    Vérifier les mises à jour du titre - déplacé du menu principal\n- Définir comme entrée d'avatar dans le menu contextuel des images\n \nTéléchargement: DBI 563\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173684/in-switchdbi-563-disponible-1.jpg"
        }
    },
    "news_12": {
        "title": "[Vita] HexLauncher Custom v2.0 disponible",
        "content": "La version fortement modifiée de HexFlow Launcher et gestionnaire de sauvegarde avec interface utilisateur 3D pour les consoles PlayStation Vita et PlayStation TV, l'HexLauncher Custom passe en version 2.0 et autant le dire les changements sont très nombreux. \n \nA commencer par RetroFlow (activez-le dans les paramètres), SwitchView/GridView, JIT rolling cache, pas moins de 8 fonds d'écran, 10 langues, l'ajout d'un nouveau style pour \"Bouton de catégorie : haut/bas\", et de très nombreuses corrections. \n \nCette application utilise Adrenaline Manager au lieu du lanceur d'adrénaline de RetroFlow , car de nombreuses personnes ont signalé des problèmes avec le lanceur d'adrénaline.\n \nCette version 2.0 vient corriger de nombreux bugs de la version 1.2.1 et 1.2.2, en effet parfois, si le rolling cache est activé, il efface le cache au lieu de mettre à jour la ligne. L'écran \"écrire dans le cache\" ne devrait s'afficher que lorsque vous installez une nouvelle application ! Si vous avez eu ce bug, le démarrage de l'application devrait maintenant être beaucoup plus rapide. C'est ~3.9 secondes avec 500 jeux mais si vous activez RetroFlow, cela ajoute ~2 secondes.\n \n \n\n \n \n \n\nChangelog v2.0\n\n\nLA GRANDE MISE À JOUR DE RETROFLOW !\n \nAperçu rapide :\n \nRetroFlow (activer dans les paramètres), SwitchView/GridView, JIT rolling cache, 8 backgrounds, 10 langues\n \nEnfin, un réglage a été ajouté : RetroFlow ON/OFF !!! A toutes les catégories de RetroFlow 6.0 sauf : PSM,\nScummVM, MAME/MAME+, NeoGeo, et FBA... Cependant, veuillez noter qu'il supporte plusieurs catégories \"plus récentes\" de RetroFlow.\ncatégories RetroFlow \"plus récentes\" : RetroArch PS1, Pico-8, Dreamcast. Supporte la PS1/PSP sans RetroFlow\n(Adrenaline Manager) mais ne supporte pas (encore) les PSP Categories Lite.\n \nIl lira les dossiers de données créés par RetroFlow, mais ne créera ni ne supprimera aucun dossier ou fichier, sauf lors des téléchargements de pochettes.\ndossiers ou fichiers, sauf lors des téléchargements de pochettes. Si vous utilisez RetroFlow pour la première fois, il est recommandé\nd'installer la dernière version de RetroFlow, de l'exécuter au moins une fois et de suivre les instructions d'installation.\ninstructions d'installation. Cette application utilise Adrenaline Manager au lieu d'Adrenaline\nLauncher de RetroFlow, car de nombreuses personnes ont des problèmes avec Adrenaline Launcher.\n \nLe cache restera magiquement toujours à jour grâce à la génération de commutateurs JIT (\"Rolling Cache\")\nC'est probablement la principale raison d'utiliser cette application plutôt que RetroFlow.\n \nCorrection d'un bug majeur de la v1.2/v1.2.1 où parfois, si le rolling cache est activé, il efface le cache au lieu de mettre à jour une ligne....\ncache au lieu de mettre à jour une ligne... Vous saurez que vous avez ce problème si l'écran \"writing to cache\" s'affiche à chaque fois.\ns'affiche à chaque fois - ce n'est pas censé être le cas. Espérons que ce problème sera corrigé dans cette version. L'écran\nL'écran \"écrire dans le cache\" ne devrait s'afficher que lorsque vous installez une nouvelle application ! Si vous avez eu ce bug,\nle démarrage de l'application devrait maintenant être beaucoup plus rapide. C'est ~3.9 secondes avec 500 jeux mais si vous activez\nRetroFlow, cela ajoute ~2 secondes.\n \n \nJ'ai enfin publié l'affichage en grille, disponible dans le menu de démarrage avec \"Allow View #5/#6\", parce qu'il a enfin été suffisamment optimisé pour ne pas causer de lag.\na finalement été suffisamment optimisé pour ne pas causer de lag massif.\n \nTéléchargement des couvertures RetroFlow \"Loose match\"... Beaucoup de gens voulaient vraiment cela à cause de\nconventions de nommage de RetroFlow sont très strictes. Exemple : vous pouvez télécharger une pochette pour un\njeu qui s'appelle simplement \"Super Metroid\"... le téléchargement se fera par défaut sur la pochette des USA.\n \nAmélioration des téléchargements de pochettes par le menu de démarrage : saut des entrées qui ont déjà des pochettes. Ajout d'un\n\"Screen.waitVblankStart()\" pour que vous puissiez voir brièvement quelles couvertures sont ignorées.\nFonctionne maintenant pour toutes les catégories, y compris les bières maison qui ont une couverture de type vita (vous devriez les remplacer si c'est le cas).\nles remplacer si c'est le cas). Le téléchargement est devenu synchrone au lieu d'asynchrone : cela semble beaucoup plus rapide.\nLes téléchargements massifs de pochettes pour PSP/PS1 utiliseront désormais le scanner d'identité, comme c'est le cas dans le menu triangle.\nCorrection d'un cas où il n'y avait pas d'erreur en cas d'absence de wifi.\n \nProtection de cur_quick_dir, une variable utilisée pour les overrides et partout où le code\nSystem.doesFileExist(...) (cur_quick_dir est beaucoup plus rapide mais moins stable).\n \nAmélioration drastique de la fonction d'augmentation et de diminution de la catégorie (c'est à dire : pour\nlorsque vous appuyez sur la touche carré). Elle permet désormais de cacher correctement une catégorie CUSTOM existante mais vide.\n \nAjout d'un nouveau style pour le \"Bouton de catégorie : Haut/Bas\"\n \nCorrection de l'espacement N64 en vue plate (expérimental)... ajout de la fluidité en vue zoomin et en vue gauche.\nCrédit à Axce pour l'idée mais son code n'a pas été utilisé. Actuellement en train d'expérimenter la meilleure\nla meilleure façon d'ajouter de la fluidité aux vues autres que la vue zoomin/gauche.\n \nLa catégorie CUSTOM peut être utilisée de la même manière que les \"collections\" dans RetroFlow, par exemple pour contenir toutes vos applications de type \"utilitaire\".\npour contenir toutes vos applications de type \"utilitaire\". Cependant, elle a besoin d'être mise à jour pour supporter les entrées de RetroFlow... la mise à jour est actuellement en cours de test.\nest actuellement en cours de test. Lorsque ce sera fait, vous pourrez ajouter des choses à la catégorie CUSTOM via le menu triangle.\nle menu triangle.\n \nCorrection d'une situation où, si c'était la première fois que l'on démarrait, les overrides ne fonctionnaient pas du premier coup.\n \nInclut également la correction d'un bug mineur de la v1.2.1 où certaines catégories pouvaient ne pas s'afficher correctement lors du premier démarrage.\nau premier démarrage.\n \nAjout d'un nouveau bouton en bas du menu de démarrage \"Exit\", comme une sorte de placeholder :\nil sera remplacé par \"Utilities\" ou \"System Apps\" le cas échéant.\n \nL'application RetroFlow actuelle peut ne pas enregistrer les couvertures téléchargées à partir de cette application si vous avez\nl'analyse au démarrage est désactivée dans l'application RetroFlow actuelle. Les couvertures téléchargées dans RetroFlow apparaîtront toujours ici\nà chaque fois grâce au cache mobile.\n \nIl y a un bug concernant RetroFlow et \"Return to Last-Played Game\"... si vous avez 2\nRetro avec les mêmes noms de fichiers dans des catégories DIFFÉRENTES, il se peut que le choix se porte sur le mauvais jeu si la catégorie\ndernière catégorie jouée était \"All\"/\"CUSTOM\"\n \nSi vous utilisiez une version expérimentale, le fichier \"ux0/data/HexFlow/debugfile.dat\" peut être supprimé.\n \nChangement du titre de l'application en \"HexFlow Custom\". Si l'ancien titre subsiste, il se peut qu'il ait été enregistré comme un \"renommage\".\ncomme un \"renommage\". Vous pouvez le réinitialiser en défilant jusqu'à HexFlow Custom... en appuyant sur le triangle... en sélectionnant\n\"renommer\"... et en le mettant à blanc, ce qui réinitialisera le titre.\n \nAjout d'une meilleure protection au code Category_Plus(), Category_Minus(), et categoryButton ;\noù vous ne pouviez pas changer de catégorie si vous aviez piraté \"categoryButton\" dans config.dat pour en faire une valeur invalide, et où la première fois que vous changiez de catégorie, la valeur de \"categoryButton\" devenait invalide.\nvaleur invalide et où la première fois que vous appuyez sur le bouton de catégorie, il n'est pas enregistré si vous avez piraté \"showCat\".\nsi l'on pirate \"showCat\" dans config.dat pour qu'il ait une valeur invalide (pour une meilleure compatibilité).\n \nCorrection (avec un peu de chance) de la situation où une nouvelle installation pouvait être retardée lors du premier lancement si l'option Recently Played était activée.\n \nAméliorations mineures : Seuls les dossiers d'applications avec 9 caractères importés, supprime les\nles doublons ou les dossiers sauvegardés manuellement / renommés.\n \nMise à jour des traductions italiennes, crédit DaRk_ViVi\n \nNouveaux bugs :\n \nLorsque vous quittez le menu triangle, la modbox va légèrement dérailler pendant environ 1/60ème de seconde ou moins dans certaines catégories.\nseconde ou moins dans certaines catégories. Vous le manquerez facilement même si vous le cherchez.\n \nSi vous avez 2 entrées RetroFlow avec le même nom de fichier de base, alors \"retourner à la dernière lecture\",\nla catégorie \"récemment écouté\" et la catégorie \"personnalisé\" peuvent afficher le mauvais fichier. Pour cette raison, la catégorie\npour cette raison, la catégorie \"personnalisée\" ne prend pas facilement en charge les entrées RetroFlow. Il faudra\nune énorme refonte pour la faire fonctionner correctement La \"refonte\" permet également à cette application d'utiliser les \"Collections\" - l'une des applications les plus intéressantes de RetroFlow.\n\"Collections\" - l'une des grandes nouveautés de la version actuelle de RetroFlow 6.0... Cette\nCette \"refonte\" est déjà faite mais est actuellement en test de bogues.\n \nindex.lua est le code source\n \n\n \n\n\n \n \n\nTéléchargement : HexFlow-Launcher-Unofficial-Custom 2.0\n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-137760304.png"
        }
    },
    "news_13": {
        "title": "[PS4] Saturn2Ps4 v1.1 pour 5.05, 6.72 et 9.00",
        "content": "Voici la mise à jour de mon script permettant de convertir un jeu Saturn pour PS4 qui passe donc en version 1.1, apportant quelques nouveautés.\n \n\n \nEn effet, grâce à ce nouveau script il vous sera possible de profiter des vos jeux Sega Saturn sur votre PS4 5.05, 6.72 et 9.00. Vous pourrez ainsi jouez à un grand nombre de titre Saturn en plein écran si vous le désirez, garder à l esprit par contre que certains titres ne seront pas compatibles et que d'autres fonctionneront plus ou moins bien...\nA savoir également qu'il vous faudra le goldhen 2.3 minimum pour faire fonctionner cet émulateur Saturn.\n \n\n \n \nDans les nouveautés vous trouverez comme  le screen ci dessus, les traductions espagnole et italienne du script (merci aux traducteurs NanospeedGamer et PepeCobain), une nouvelle option qui permet de désactiver le Widescreen et avoir un écran en 4/3 mais aussi 2 nouveaux formats de jeux saturn pris en compte, MDS/MDF et CCD/IMG/SUB.\n \nPour savoir comment utiliser mon script il vous suffit de regarder ma vidéo tuto ci dessous:\n \nVidéo tuto:\n \n\n \nChangelog:\n \n\nV1.0:\n- Version initiale\n \nV1.1:\n- Ajout de la langue Espagnole traduction par NanospeedGamer\n- Ajout de la langue Italienne traduction par PepeCobain\n- Prise ne charge des formats CCD/IMG/SUB et MDF/MDS\n- Ajout d' une option pour désactiver le widescreen (écran 4/3)\n- Correction d' un bug dans l'injection du config .INI\n \n \n\n \nTélécharger Saturn2PS4 v1.1\n \nUn petit don pour me soutenir est toujours le bienvenue ^^:https://www.paypal.com/paypalme/markus00095\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173651/in-ps4-saturn2ps4-v11-pour-505-672-et-900-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173651/in-ps4-saturn2ps4-v11-pour-505-672-et-900-1.jpg"
        }
    },
    "news_14": {
        "title": "[Switch] Suite au DMCA, Picklock RCM remplace Lockpick RCM",
        "content": "Comme vous le savez Nintendo a décidé de passer la seconde sur Github, le géant a carrément demandé le retrait de Skyline, un émulateur Switch, celui de Boot Manager RetroReloaded Pro développé par RetroGamer74, et NeXT par du développeur mistervampi a également été annulé, mais ce n'est pas tout, il y a aussi Lockpick RCM. \n \n \n\n \n \nLe blocage définitif du Github de Lockpick et de tous ses forks possibles marque les esprits, mais il semble que pour Lockpick RCM, il y a une forme de rébélion, puisqu'il est déjà de retour, la même application a été uploadée sur le service d'hébergement Github par le développeur Slluxx (alias Calvin), et comme une provocation il y a même un commentaire \" You aint taking this down \", que l'on pourrait traduire par \" Vous n'allez pas l'enlever \" ou \" Vous n'allez pas le supprimer \". \n \nPicklock_RCM est un payload Nintendo Switch qui dérive des clés de chiffrement à utiliser dans les logiciels de gestion de fichiers Switch tels que hactool, hactoolnet/LibHac, ChoiDujour sans démarrer Horizon OS. En raison des changements imposés par le firmware 7.0.0, l'homebrew Lockpick ne peut plus dériver les dernières clés. \n \nClairement c'est un risque que prend Calvin Slluxx en dévoilant Picklock RCM, nous verrons bien si Nintendo arrive à réagir rapidement.\n \n \nTéléchargement : Picklock_RCM v1.9.10\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173561/in-switch-suite-au-dmca-picklock-rcm-remplace-lockpick-rcm-1.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] switch_AIO_LS_pack 4.12.0",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 4.12.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\nMise à jour de Atmosphere et de Hekate vers la dernière version de ceux-ci.\nMise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 4.12.0:\nCompilé avec la dernière version de la Libnx.\n\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\nN'hésitez pas à faire vos retours, ils seront les bienvenues.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-4.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] Hekate v6.0.4 disponible",
        "content": "Le développeur CTCaer dévoile une nouvelle version de hekate qui passe en version v6.0.4, Nyx lui est toujours proposé en v1.5.3. Contrairement à d'habitude ces versions n'apportent pas beaucoup de changements. \n \n \n\n \n \nA priori le seul intérêt de cette version d'Hekate est d'apporter le support du nouveau firmware officiel 16.0.3, et c'est déjà pas mal.\n \n \nTout est là : Hekate 6.0.4\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173486/in-switch-hekate-v604-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[PSP] Baryon Sweeper mis à jour en Mai 2023 pour unbrick plus de PSP",
        "content": "Notre ami sunriseur Smada nous informe que le logiciel Baryon Sweeper a été mis à jour dans une version \"Mai 2023\". \n \nPour les plus jeunes d'entre vous, Baryon Sweeper est un logiciel né d'un travail collaboratif de plusieurs hackers de la scène en Janvier 2021. \n \nA l'origine c'est le développeur Khubik qui avait partagé un guide vidéo sur la façon d'utiliser Baryon Sweeper, en conjonction avec une batterie Pandora \"nouveau style\", pour débrick une PSP 3000.\n \n \n \n\n \n \n \nQu'est-ce que Baryon Sweeper ? \n \nLa batterie Pandora  était probablement la version la plus importante de la scène de hack PS : un simple hack de la batterie PSP, permettant à la console de passer en mode service. Et à partir de là bricoler l'appareil, notamment pour installer et exécuter des custom firmwares, ou flasher un firmware propre sur une PSP brickée. Mais Sony a mis à jour le processus de mode de service de la PSP avec de nouvelles révisions matérielles, rendant la batterie Pandora inutile sur les nouveaux modèles PSP Slim (PSP 2000) et tous les modèles PSP Brite (PSP 3000). .\n \nBaryon Sweeper est un outil qui rend enfin possible un processus de type Pandora sur la plupart des PSP. C'est cependant un peu plus lourd que le processus Pandora, et bien c'est ce logiciel qui a été mis à jour, imitant les outils de récupération officiels de Sony. \n \n \n\n \n \n \nC'est grâce au travail de Davee qui a récupéré la semaine dernière de nouvelles clés permettant ainsi l'unbrick sur pour les modèles PSP 3000 04g, 07g, et 09g.\n \nPour mettre à jour le mieux est d'utiliser pysweeper ( https://github.com/khubik2/pysweeper)en remplaçant le fichier keys.json, en attendant que khubik2 mette à jour les clés contenu dans Baryon Sweeper directement. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173457/in-psp-baryon-sweeper-mis-a-jour-en-mai-2023-pour-unbrick-plus-de-psp-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] Atmosphère 1.5.3 disponible",
        "content": "SciresM est en réaction permanente face à Nintendo, et propose déjà une nouvelle version d'Atmosphère, à croire qu'il est en mode veille et que chaque mise à jour firmware déclenche en lui une version de son célèbre logiciel. \n \nQuoiqu'il en soit voilà la version 1.5.3 d'Atmosphere avec bien entendu le support du firmware officiel 16.0.3, mais ce n'est pas tout, il en profité pour mettre à jour beaucoup d'autres éléments de sa solution.\n \nCette version 1.5.3 est la soixante-douzième version officielle d'Atmosphère, cette version est fournie avec hbl 2.4.3, et hbmenu 3.5.1.\n \n \n\n \n \n \nCe qui suit a été modifié depuis la dernière version :\n \n- Le support du firmware officiel 16.0.3 a été ajouté.\n- Atmosphère a été mis à jour pour utiliser GCC 13/newlib (dernières versions de devkitA64/devkitARM).\n- Remarque : Cette mise à jour introduit un problème connu, sur lequel nous travaillons actuellement.\n- Comme vous vous en souvenez peut-être dans le changelog de la version 1.4.1, Fire Emblem : Engage nécessite d'énormes quantités de mémoire pour pouvoir utiliser les mods layeredfs dans le jeu.\n- La dernière version de GCC/newlib augmente légèrement la taille de l'overhead malloc, ce qui rend l'augmentation de mémoire précédente insuffisante.\n- Une solution générale à ce problème est en cours d'élaboration, ce qui devrait, je l'espère, résoudre le problème d'une manière qui ne me portera pas la poisse pour l'avenir.\n- Un certain nombre de problèmes mineurs ont été corrigés et des améliorations ont été apportées :\n- Un problème a été corrigé qui faisait que le remplacement de la police système ne fonctionnait pas sur la version 16.0.0+.\n- Un problème mineur de précision a été résolu dans la gestion par mesosphere de certaines plages de mémoire ; ce problème n'aurait eu aucun impact visible pour l'utilisateur final.\n- Améliorations générales de la stabilité du système afin d'améliorer l'expérience de l'utilisateur.\n \n \nTéléchargement : Atmosphère 1.5.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173454/in-switch-atmosphere-153-disponible-1.jpg"
        }
    },
    "news_19": {
        "title": "[Switch] Nintendo sort le firmware officiel 16.0.3",
        "content": "Nintendo vient de dévoiler cette nuit un nouveau firmware à destination de la Nintendo Switch, le firmware officiel 16.0.3 vient en effet d'être mis en ligne par le géant japonais. \n \nQuoi en attendre, pas grand chose, ce firmware ne contient à nouveau que des corrections de bugs, en particulier dans le module système FS. Atmosphère et les patchs de signature ont déjà été mis à jour et sont donc pleinement fonctionnels. \n \nLes rapports Yellow's8 sont là : yls8.mtheall.com\n \n \n\n \n \n \nSystem Titles :\n \nSeuls SystemVersion et BootImagePackages ont été mis à jour.\n \nPaquets d'images de démarrage\n \nSeul le paquet2 a été mis à jour. Le noyau n'a pas été mis à jour. Tous les KIPs autres que FS ont été reconstruits (la seule différence est le hachage de la construction GNU).\n \nFS\nLes fonctions Mutex lock et unlock ont été ajoutées à certaines fonctions SaveData qui en étaient auparavant dépourvues.\nEn particulier, il s'agit de nn::fs::save::SaveDataFileSystemCore::HasOpenedFiles et nn::fs::save::SaveDataFileSystemCore::HasOpenedEntries.\n \n \nOfficiellement la communication parle d'une amélioration de l'expérience utilisateur. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173452/in-switch-nintendo-sort-le-firmware-officiel-1603-1.png"
        }
    },
    "news_20": {
        "title": "[Vita/PSTV] Vita3K version 0.1.8 et Android Release 5",
        "content": "Vita3K est le tout premier émulateur open-source pour la PlayStation Vita compatible avec Windows, Linux, macOS et Android. Cet émulateur n'a pas pour but de permettre l'activité illégale mais de restituer au mieux la PlayStation Vita sur PC. \n \nLes versions PC Windows, Linux, macOS et Android sont mises à jour, et passe de la version 0.1.6 à la version 0.1.8, le développeur évoquant avec humour le fait qu'il n'aime pas le 7. \n \n\n \nChangelog Vita3K Android Release 5 : \n \n- Ajout d'un moteur de rendu OpenGL ES (expérimental) (nécessite OpenGL ES 3.2)\n- Nouvelles méthodes de mappage de la mémoire (Double buffer et Page table)\n- Correction des boutons de recouvrement L2/R2\n- Amélioration de la gestion du tactile : le swipe tactile et la reconnaissance multitouch devraient maintenant fonctionner correctement\n- Ajout d'un bouton optionnel pour basculer entre l'écran tactile avant et arrière de la PS Vita\n- Ajout de capacités de débogage\n- Amélioration de la mise à l'échelle des DPI\n- Mise à jour de SDL vers 2.26\n- Mise à jour de ffmpeg vers 5.1.3\n \nReconstruction de la version PC de Vita3K :\n \n- io : Corrige la valeur de retour de savedata, corrige l'avertissement \"Not enough memory\" sur Minecraft (ExtremeExploit)\n- modules : Corrige une corruption de pile lors de l'appel à mktime sous Linux (ExtremeExploit)\n- gui : Quelques améliorations de la qualité de vie (bookmist et Zangetsu)\n- gui : Ajout d'une section supporter (Zangetsu)\n- lang : Amélioration de nombreuses traductions (Croden, nishinji, HuanJiCanShang)\n- audio : Fixe le nombre de retour d'échantillons de ngs, rend les danses de persona 3 et 5 jouables (Macdu)\n- audio : Correction de la valeur de retour de sceNgsVoiceGetStateData, rend Trails of Cold Steel 2 jouable (Macdu)\n- io : Standardisation des chemins de recouvrement, permet à Killzone d'atteindre le menu (Macdu)\n- renderer : Implement surface sync, vulkan only, permet aux écrans de Project Diva X d'être rendus correctement et corrige la luminosité de Ys Memories of Celceta (Macdu)\n- moteur de rendu : Ajout de quelques textures manquantes et support des swizzles, support de BC4, et correction de la décompression PVRT2, utilisé par Killzone (Macdu)\n- En ce qui concerne le mapping mémoire, le double buffer devrait être moins efficace que les autres méthodes (native buffer et page table), mais il devrait aussi être moins dépendant du pilote. D'après mes tests, il semblerait que le native buffer fonctionne sur le GPU Adreno et que la page table ne fonctionne pas, alors que l'inverse se produit sur le GPU Mali. Je ne suis pas sûr.\n \n- Note : Si vous mettez à jour depuis une version précédente, le tampon natif ne fonctionnera pas : Si vous mettez à jour à partir d'une version précédente, le niveau de log sera réglé sur trace. Si vous n'avez pas l'intention de l'utiliser, il est recommandé de le désactiver (Paramètres->Emulateur) pour améliorer les performances.\n \n \nTout est là : vita3k.org\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173441/in-vitapstv-vita3k-version-018-et-android-release-5-1.png"
        }
    }
}