{
    "news_1": {
        "title": "[PS4] PS4 Wee Tools v0.9.5 disponible",
        "content": "En ce dernier jour d'octobre, le développeur Abkarino propose une nouvelle version de son outil PS4 Wee Tools qui est désormais livré en v0.9.5.\n \nLa solution gratuite de donwgrade PS4 dispose donc de nouvelles fonctionnalités.\n \n\nNouveautés :\n \n- NOR : patcher Southbridge\n- NOR : patcher Torus (WiFi+BT)\n- NOR : analyse et récupération de partition\n- NOR : mode rapide/expert pour la récupération des partitions\n- NOR : bascule du flag toogle actif\n- NOR : patch légitime rapide (drag&drop 2 dumps sur run.bat)\n- SCFlasher : Effacement sûr de syscon\n- SC : nettoyage complet\n- SC : autopatch fonctionne maintenant avec n'importe quel* syscon\n- SC : correction de la méthode B\n- SC : le patch manuel fonctionne maintenant avec flatdata\n- SC : affiche le compteur de lignes\n- Mise à jour de la librairie Util\n- Correction des bogues d'Utils\n- Optimisation du code\n \n\n \n\n \n\n \n \n \nPS4-Wee-Tools v0.9.5 disponible :\n- Mode rapide/expert pour la récupération des partitions\n- Patcheur Southbridge\n- Patcheur Torus (WiFi+BT)\n- Mise à jour de la librairie Util\n \nLe patcheur Torus (wi-fi+bt) est désormais inclus. Peut-être que pour quelqu'un ce sera quelque chose de \"nouveau\" mais toutes ces fonctionnalités sont très simples et en fait elles pouvaient être réalisées avec les versions précédentes de wee-tools comme le précise l'auteur. Cette option vous permet simplement de gagner du temps. \n \n \n \nTéléchargement : PS4-Wee-Tools v0.9.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2077743693.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1537784304.png"
        }
    },
    "news_2": {
        "title": "[PSP] Apollo Save Tool v1.2.0 disponible",
        "content": "Le développeur Bucanero propose la version 1.2.0 d'Apollo Save Tool pour la PSP. C'est une bonne nouvelle pour celles et ceux qui disposent encore d'une PSP exploitable.\n \nLe logiciel évolue une nouvelle fois avec de nombreuses nouveautés, et le changelog est impressionnant. Pour rappel, il s'agit d'une application qui vous permet de gérer les fichiers de sauvegarde de jeu sur PlayStation Vita et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur la PSP.\n \n \n \n\n \n \nAjout :\n- Prise en charge du stockage ef0 (mémoire interne de la PSP Go)\n- Ajout de la lecture de la musique de fond AHX\n- Ajout d'un clavier à l'écran\n- Ajout d'un téléchargeur d'URL (outils réseau, supporte https, http, ftp, ftps)\n- Détection automatique des paramètres des boutons X/O\n- Compression des fichiers .ISO en .CSO\n- Décompression des fichiers .CSO en .ISO\n- Ajout d'une base de données de clés de sauvegarde pour les jeux PSP\n- Nouveaux codes de triche pour PSP\n> Persona (ULUS10432)\n- Nouveaux correctifs anti-copie pour PSP\n> InviZimals : Shadow Zone (UCES01411, UCES01581, UCUS98760)\n> InviZimals : The Lost Tribes (UCES01525)\n> SOCOM : Fire Team Bravo 2 (UCUS98645)\n- Prise en charge des sommes de contrôle personnalisées\n> InviZimals : Shadow Zone (UCES01411, UCES01581, UCUS98760)\n> InviZimals : The Lost Tribes (UCES01525)\n \nCorrection :\n- Online DB : correction du cache des fichiers\n- Serveur web simple : liens de dossiers corrigés\n- Correction de l'horodatage des journaux de débogage\n \nDivers :\n- Mise à jour du moteur de patch apollo-lib en v0.5.5\n- Ajout de rappels d'hôtes (nom d'utilisateur, mac lan, mac wlan, nom du système, psid, identifiant de compte)\n- Ajout de la fonction de hachage murmu3_32\n- Ajout du décryptage de MGS5 PS3/PS4\n- Ajout de la somme de contrôle Castlevania:LoS\n- Ajout du checksum Rockstar\n- Correction de SaveWizard Code Type C\n- Correction de right() sur les plateformes little-endian\n \n \nTéléchargement : Apollo Save Tool v1.2.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181846/in-psp-apollo-save-tool-v120-disponible-1.png"
        }
    },
    "news_3": {
        "title": "[Switch] DeepSea 4.9.0 disponible",
        "content": "Le développeur Team-Neptune vient de mettre à jour sa solution All-in-one DeepSea, pour rappel, DeepSea est un Pack AIO regroupant tout en un pack, l'objectif est de facilité l'accessibilité pour les utilisateurs d'Atmosphère.\n \nBien entendu cette version apporte le support du firmware 17.0.0 mais vient proposer la mise à jour des derniers homebrews et utilitaires disponibles pour la Nintendo Switch.\n \n \n\n \n \nChangelog : \n \n- Cette version ajoute le support du firmware 17.0.0\n- Mise à jour d'Atmosphere vers la version 1.6.2\n- Mise à jour de Hekate vers la version 6.0.7\n- Mise à jour de MissionControl vers 0.10.0\n- Mise à jour de Status Monitor à la version 0.9.2\n- Mise à jour de DeepSea Assets à la version 1.0.9\n- Ajout Goldleaf\n- Suppression de Tinwoo\n \n \nTéléchargement : DeepSea 4.9.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181844/in-switch-deepsea-490-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[Switch] Rekado 5.2 disponible",
        "content": "Le développeur MenosGrante vient de dévoiler une nouvelle version de Rekado,\nPour rappel Rekado est un Lanceur de Charge utile dit \"Payloads\" via Android, il permet donc de lancer Hekate, fusee et autre payloads depuis un périphérique Android sur la Switch, en général a l'aide d'un câble OTG.\nIl permet aussi de vérifier si une Nintendo Switch est patcher en utilisant les numéros de série ou en scannant un code barre sur la boite de la console.\n\nChangelog\nLocalisation:  Toutes les localisations terminées de Crowdin\nDeveloppement: Prise en charge complète d'Android 14.\nPayloads: Mise à jour vers les dernières versions.\n \n\nLien de téléchargement : Rekado 5.2\n",
        "images": {
            "image_1": "https://www.tomsguide.fr/content/uploads/sites/2/2019/08/switch-serial-number.png"
        }
    },
    "news_5": {
        "title": "[Switch] Haku33 supporte désormais le Firmware 17.0.0",
        "content": "L'équipe StarDustCFW vient de mettre en ligne la version 5.7/6.0 de Haku33.\nPour rappel Haku33 permet de réinitialiser la Nintendo Switch pour qu'elle soit le plus clean possible lors de sont utilisation en ligne ou pour de la revente d'occasion. En effet ce programme open source a pour fonction d'éliminer les fichiers critiques de la console pour effectuer une réinitialisation matérielle de la console, ne laissant que l'essentiel pour démarrer.\nChangelog : \n- Ajout d'une exception pour éviter de supprimer le fichier d'index.\n- La réinitialisation de ce fichier provoque un softbrick pour les consoles 17.0.0 ou supérieures.\n- Il s'agit d'une modification apportée par Nintendo à la manière dont les sauvegardes système sont gérées dans la version 17.0.0.\n- Jusqu'à la version 17.0.0, cette liste n'était pas utilisée pour les sauvegardes système,\nmais après la mise à jour, elle est utilisée pour cela et fait que la console ne trouve pas les fichiers importants pour démarrer le système d'exploitation (explication complète ici -> SciresM 17.0.0 Save File Management).\n- Ainsi que le format du fichier imkvdb.arc (pour les plus avertis) Ici\n- La solution vient de SciresM avec Atmosphere 1.6.1 qui détecte le problème et reconstruit les données perdues pour que le système redémarre.\n- Bien qu'il existe d'autres solutions plus manuelles (signer un fichier depuis une autre console et l'insérer) qui n'impliquent pas l'exécution de CFW, celle-ci est la plus simple et la plus sûre de toutes, et l'exécution de CFW elle-même ne vous fait pas bannir, donc tant que vous n'exécutez que Atmosphere pour corriger l'erreur, il ne devrait pas y avoir de risque de bannissement par la suite.\n- Après le changement effectué par Nintendo à partir de la 17.0.0, Haku33 va manipuler le système pour supprimer toutes les sauvegardes en une seule fois de manière sécurisée, et en n'utilisant pas de 3 party too\n\nLien de téléchargement : Haku33 6.0\n",
        "images": {
            "image_1": "https://user-images.githubusercontent.com/2240909/101447359-0b0d5980-3960-11eb-93fd-a1c191946814.jpg"
        }
    },
    "news_6": {
        "title": "[Switch] Moonlight-Switch 0.13.4 disponible",
        "content": "Le développeur XITRIX vient de dévoilé une nouvelles version de Moonlight-Switch, la 0.13.4, sous cette homebrew ce cache un portage de la célèbre application d'nVidia, Moonlight qui pour rappel est une implémentation open source de GameStream de NVIDIA, tel qu'utilisé par NVIDIA Shield, l'adaptation officiel est sous Windows, Mac et Linux.\nBasé sous Moonlight-NX de Rock88 cette version utilise le nouvelle UI Graphique borélis développé par natinusala.\n \n\nInstallation\n\n- Télécharger la dernière Moonlight-Switch version .\n- Mettez br_moonlight.nro sur sdcard:/switch/moonlight;\n- Lancez hbmenu sur la redirection de titre (pour un accès PLEIN RAM);\n- Lancez le clair de lune.\n \nChangelog\n- Mise à jour de la version de Moonlight-Core\n- Support Firmware 17.0.0\n \nLien de téléchargement : Moonlight-Switch 0.13.4\n",
        "images": {
            "image_1": "https://pbs.twimg.com/media/E39DcZ8WEAEgl5E?format=jpg&name=large",
            "image_2": "https://pbs.twimg.com/media/E39DcbXXwAE0tIn?format=jpg&name=large",
            "image_3": "https://pbs.twimg.com/media/E39DcbTXoAUCAfQ?format=jpg&name=large"
        }
    },
    "news_7": {
        "title": "[Switch] AtmoPackUpdater 2.0.0 disponible",
        "content": "Bonjour à tous. Après 5 mois sans mise à jour j'ai sorti la dernière version de AtmoPackUpdater en version 2.0.0\nEn effet dernière mise à jour car je ne maintiendrai plus l'application jugeant qu'elle est terminée. Cependant si des bugs sont reportés des correctifs verront le jour.\n\n\n \nChangelog : \n-Ajout des traducteurs dans l'onglet À propos\n-Implémentation directe de l'installation de la mise à jour du système dans AtmoPackUpdater (#18).\n-Ajout d'un choix pour le chemin de sauvegarde des homebrews\n-Ajout d'un onglet pour les packs customisés\n-Si vous voulez faire une config avec un pack customisé veuillez modifier le fichier situé dans /config/AtmoPackUpdater/config.json comme ci-dessous\n\n{\n    \"auto-update\" : false,\n    \"custom-pack\" : [\n          {\n               \"name\": \"Nom du pack\",\n               \"url\": \"Url en téléchargement direct du pack\"\n          }\n     ]\n}\n\nTéléchargement : AtmoPackUpdater 2.0.0\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181821/in-switch-atmopackupdater-200-disponible-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] Hombrew Menu 3.6.0 dès maintenant disponible!",
        "content": "La nouvelle version du Hombrew launcher, qui apporte de nombreuses améliorations, est disponible depuis le 28 octobre 2023.\n \n\nEffectivement, la nouvelle version 3.6.0 a été publiée sur le GitHub de SwitchBrew. Cela faisait presque 2 ans qu'il n'y avait pas eu de nouveautés sur le Homebrew launcher.\n \n\n \nCe que la mise à jour apporte : \n- Prend en charge la gestion de la température pour le firmware 17.0.0\n- Correction du problème avec l'affichage de la force wifi\n- Comme Dpad ainsi que bas/haut, des boutons supplémentaires ZL/ZR ont été ajoutés pour se déplacer\n- Construit avec la dernière version de libnx\n \nSource : https://github.com/switchbrew/nx-hbmenu/releases\n\n \n \n",
        "images": {
            "image_1": "https://hackintendo.com/wordpress/wp-content/uploads/2020/12/nx-hbmenu.jpg"
        }
    },
    "news_9": {
        "title": "[PS5] Des modifications de Sleirsgoevy sur ps4jb-payloads",
        "content": "Le développeur Sleirsgoevy continue son travail sans relâche sur ps4jb-payloads, autant sur la partie compatibilité logicielle et optimisations du code que sur la partie découverte, et ajout de nouvelles fonctionnalités à l'exploit. \n \nAinsi depuis quelques jours, il a rajouté pas mal d'évolutions sur ps4jb-payloads et ps5-kstuff, et nous voyons bien que son intérêt est d'élargir le portage sur d'autres firmwares que les seuls 4.03 et 4.50. \n \nAinsi il essaye de revoir comment fonctionne l'exploit et son processus, en tentant de compenser en dur les nombreuses fonctions qui le compose. Ce travail est long et fastidieux, il consiste à trouver manuellement les offsets et fonctions dans chaque partie du code, un travail rendu encore plus complexe à cause de XOM. \n \nAfin de faciliter ce travail de recherche le développeur a apporté un script qui permet de trouver plus facilement ces ouvertures, plutôt que de devoir les chercher manuellement. \n \n \n\n \n \nPar exemple, nous pouvons voir qu'il a récemment intégré la prise en charge de la recherche des décalages mmap_self pour n'importe quel firmware donné. Cela permettrait à son décrypteur SELF de fonctionner sur n'importe quel firmware, même s'il existe déjà une alternative de Specter pour cela, cela pourrait être très utile. \n \nD'autres éléments très techniques, comme l'ajout d'un outil make_fself qui prend la forme d'un script vient lui aussi d'être porté hier en python3 par Sleirsgoevy, et il l'a modifié pour qu'il fonctionne comme un module. \n \nCe travail sur les dérivations et l'ajout d'outils sous forme de scripts va certainement porter ses fruits pour élargir la palette de firmwares compatibles avec les fPKG, reste plus qu'à être patient. \n \nTout est là : ps4jb-payloads\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181791/in-ps5-des-modifications-de-sleirsgoevy-sur-ps4jb-payloads-1.png"
        }
    },
    "news_10": {
        "title": "[PS4/PS5/Switch] DS4Windows 3.2.18 disponible",
        "content": "Le développeur Travis Nickles, connu aussi sous le pseudo Ryochan, nous propose de découvrir une nouvelle version de DS4Windows. Cette version apporte quelques corrections notamment sur les fonctions gyroscopiques de la DualSense Edge, mais aussi la mise à jour de certaines bibliothèques et certains registres. \n \nComme vous le savez probablement DS4Windows est une interface efficace pour paramétrer une manette sur PC, il est basé sur un fork de Jays2Kings. Pour en profiter cela passe par un câble micro-USB, mais il est aussi possible de s'en servir sans fils avec quelques adaptateurs Bluetooth 2.1 (ou supérieur). \n \n \n\n \n \n \n \nChangelog 3.2.18 :\n \n- Correction de la vérification du registre HidHide lorsque la clé n'existe pas\n- Correction des index des déclencheurs Gyro Mouse Joystick pour certains déclencheurs. Les déclencheurs DualSense Edge en particulier\n- Mise à jour des bibliothèques SharpOSC\n- Correction du réglage par défaut de l'application pour l'option JoyCon LinkMode\n- Ajout d'une traduction en turc. Contribution de onuralpyilkin\n- Changement du helpURL pour le message d'avertissement SendInput\n \n \n \nTéléchargement : DS4Windows 3.2.18\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181790/in-ps4ps5switch-ds4windows-3218-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] NXMP version 0.8.2 disponible",
        "content": "Les développeurs proconsule et darkxex vienne de sortir une nouvelle version a leurs projet NXMP, pour rappel NXMP est un lecteur vidéo pour Nintendo Switch basé sur MPV.\nNXMP supporte les formats vidéo les plus populaires, il supporte les flux HTTP, FTP, SFTP, Samba, NFS et il supporte également les décodeurs Enigma2. A partir de la version 0.7.0, NXMP propose le décodage HW pour H264, HEVC, VP8, VP9, MPEG2 jusqu'à 4K HDR@30fps.\n\nChangelog : \n \nAjout :  - Ajout de l'i18n initial (Plus de 50% du texte est prêt pour l'i18n, soyez patient, bientôt ce sera 100%)\n- Traduction native italien-espagnol-japonais-deutsch-français-chinois(simplifié)-coréen\n- L'ordre des fichiers par défaut peut être modifié dans le menu Paramètres\n- Messages d'erreur sur l'échec de la connexion au partage de réseau\n- Écran de chargement\n- Choix de sortie entre le menu HB et la page d'accueilModification : - Mise à jour d'ImGui vers la dernière version\n- Passage de SDL à GLFW pour le contexte de la fenêtre\n- Changement de la structure du thème inivfs \n- SQLite utilisant des appels natifsCorrection : - Correction de l'image fantôme de la vidéo\n- Correction de la couleur des sous-polices\n- Correction de l'ouverture/fermeture de la base de données\n- La prise en charge des thèmes est de retourProblème connu :\n- Le temps de chargement de NXMP a augmenté en raison de l'importation d'un plus grand nombre de glyphes de polices.\nNotes de version : \nLe fichier config.ini a maintenant une ligne de configuration pour définir l'emplacement de la base de données.\nIl pointera vers l'emplacement par défaut /switch/nxmp/nxmp.db\ndbpath = /switch/nxmp/nxmp.db\nVous pouvez définir n'importe quel emplacement\nUn grand merci à Djakku et Jorge E. García \"nWo\" pour leur aide précieuse dans la réalisation de cette version.\n\nLien de téléchargement : NXMP 0.8.2\nReadme contenant les configurations : NXMP\n",
        "images": {}
    },
    "news_12": {
        "title": "[Switch/PC/Android] Nouvelle version disponible de NooDS (rolling release)",
        "content": "Le développeur Hydr8gon vient de sortir une nouvelle version de son émulateur NooDS\nL'objectif de NooDS est d'être un émulateur Nintendo DS rapide et portable. Ce n'est pas tout à fait là en terme de vitesse, mais il offre la plupart des autres fonctionnalités que vous pouvez attendre d'un émulateur DS. Il prend même en charge la rétrocompatibilité GBA ! Je fais ça pour le plaisir et comme expérience d'apprentissage, et aussi parce que je suis un grand fan de la DS. Ce n'est peut-être pas encore un concurrent digne des autres émulateurs DS, mais je pense que je pourrai y arriver un jour. Sinon c'est bien aussi ; comme je l'ai dit, je m'amuse juste !\nCe projet n'a donc pas de changelog à chaque mis à jour, mais au bout de plusieurs versions consécutives des nouvelles seront données pour rappeler l'existence du projet et ainsi pousser les utilisateurs à tester ce dernier et faire des retours au développeur.\n\nLes dernières modifications : \n- Android : ajout à contrecœur de la prise en charge des espaces de stockage délimités\n \nNooDS est disponible pour Linux, macOS, Windows, Switch, Vita et Android. Les builds automatiques sont fournis via GitHub Actions ; vous pouvez les télécharger à partir de la page des versions\n",
        "images": {
            "image_1": "https://d1eh9yux7w8iql.cloudfront.net/product_images/1525772372.19.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] DBI v628 disponible",
        "content": "Voilà la sortie d'une nouvelle version de DBI, Rashevskyv, le développeur de DBI propose en effet la v628 de son logiciel. DBI, pour DB Installer, est un gestionnaire et installateur de fichiers NSP/NSZ/XCI et XCZ via SD, USB. Il fonctionne tout aussi bien en standalone ou bien en créant son propre serveur http local. Il permet aussi de gérer et supprimer les fichiers orphelins des tickets (mise à jours par exemple).\n \nHormis une tendance très minimaliste exacerbée, DBI est apprécié pour ses fonctionnalités et une partie backend de Windows qui permet de faciliter les transferts. Avec cette nouvelle version, les jeux peuvent désormais être transférés d'une console à une autre via USB. De plus, les contrôles de mise à jour (en DBI) pour certains jeux peuvent être désactivés via la config.\n \n \n\n \n \nChangelog 628 : \n \n- Possibilité de transférer des jeux via un câble USB de console en console. Sur le maître, accédez à Parcourir les jeux installés > sélectionnez les jeux > (+) > Partager via USB. Sur l'esclave, lancez Install title depuis le backend DBI et connectez les consoles avec un câble.\n- Ajout d'une entrée dans la config :\n[Titres désactivés pour vérifier les mises à jour]\n010072400E04A000 ; Pokemon Cafe Mix\n \nLes titres spécifiés seront exclus des contrôles de mise à jour.\n \n \nTéléchargement : DBI v628\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181769/in-switch-dbi-v628-disponible-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] etaHEN v1.1b Bêta disponible (maj)",
        "content": "Le développeur LightningMods est fier d'annoncer l'arrivée de etaHEN, un payload tout-en-un pour la PlayStation 5.\n \nCe plugin est tout simplement similaire à GoldHEN sur PlayStation 4 de SiStr0, il intègre plusieurs fonctionnalités, notamment un serveur FTP, un serveur klog, PS5-kstuff (pour le firmware 4.03 et 4.50) ...\n \n \n\n \n \nIl existe deux versions distinctes de etaHEN, une avec des cheats et des aides, l'autre sans. Pourquoi tout simplement parce que les cheats apportent une forme d'instabilité dans l'application. \n \n \n\n \n \nCaractéristiques :\n \n- kstuff pour le support de fself et fpkg (4.50 et 4.03 uniquement)\n- Debug Settings \n- Call Jailbreak IPC (jailbreak des applications Homebrew)\n- Bloqueur de mise à jour - Update blocker (démonte la partition de mise à jour)\n- libhijacker \n- cheats/correctifs Illusions\n- Serveur FTP sur le port 1337\n- Serveur Klog sur le port 9088\n- elf loader sur le port 9027\n \nFonctionnalités à venir :\n \n- Fichier de configuration HEN pour les paramètres\n- réactiver le loader natif PS5 Homebrew\n- Plus de correctifs pour l'espace utilisateur\n- Intégration Itemzflow\n- (peut-être) Liste blanche de jailbreak pour Homebrew\n- loader de plugins\n \nProblèmes connus :\n \n- etaHEN avec des astuces plante si une application homebrew demande à être jailbreakée\n \n \nTéléchargement : etaHEN Beta 1.1b\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181767/in-ps5-etahen-v100-beta-disponible-1.png",
            "image_2": "https://playstation-3.logic-sunrise.com/images/news/1181767/in-ps5-etahen-v100-beta-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] Flycast v2.2 disponible avec de nombreuses améliorations",
        "content": "Il y a déjà 8 mois sortait la version 2.1 de Flycast, et bien le développeur flyinghead vient de mettre en ligne sa remplaçante au travers de la v2.2 qui apporte de nombreuses nouveautés et optimisations. \n \n \n \n \n\nDavantage connu sur PlayStation Vita, Flycast est, s'il faut le rappeler, un émulateur Dreamcast open source de qualité, qui permet une restitution idéale de la console 128 bit de Sega lancée en 1998. Cette console connue comme celle qui aura succédée à la célèbre Saturn, aura sonné le glas du hardware Sega car elle a été mal accueillie par le public avec un peu plus de 8 Millions d'unités vendues durant les 2 années et demi de commercialisation. Les ventes sont arrêtées le 31 Mars 2001.\n \n \n\n \n \nNouveautés :\n- Naomi F355 multiboard\n- Émulation Sega SystemSP\n- Support de la carte RFID de Virtua Fighter 4. Serveur d'émulation VF.Net\n- Ecran tactile Naomi (Manic Panic Ghosts, Touch de Uno 1 & 2, Touch de zunou)\n- Hopper pour Kick'4'Cash, Shootout Pool et Club Kart Prize\n- Imprimante F355 Deluxe et Touch de Uno 1 & 2\n- Simulateur de conduite Sega\n- Stockage Android Scoped\n- SH4 option under/overclock\n- Série Mushiking\n- Serveur de classement mondial Naomi Alien Front\n- Émulation de haut niveau du réseau NetDIMM 3.7\n- Manette de course, manette de pêche, maracas, manette Densha de Go, manette Pop'n'Music (@AltoRetrato)\n- Routage vidéo en temps réel pour les streamers (@vkedwardli)\n- Emulation de puce RFID SystemSP : Dinosaur King, Love & Berry\n- Option Dreamcast 32 MB RAM (@cepawiel)\n \nCe qui a été amélioré :\n- Prise en charge des jeux Windows CE sur architecture x86 32 bits\n- Raccourcis clavier pour la sauvegarde et le chargement de l'état\n- Force feedback info netcast vers le plugin FFB de Boomlangnz : F355, 18 Wheeler, Club Kart, King of Route 66\n- Utilisation d'une manette de jeu avec les jeux d'arcade au pistolet laser\n- Option VMU A1 par jeu\n- Amélioration de la détection des jeux Windows CE\n- Prise en charge des polices de caractères latines-1 et asiatiques dans le BIOS HLE\n- Prise en charge du centrage vidéo (San Francisco Rush 2049, Street Fighter III - 3rd strike, Metropolis Street Racer)\n- Réseau Daytona USA\n- Compatibilité Eldorado Gate 4 à 7\n- Implémentation du dithering en mode d'émulation Full Framebuffer\n- Mise à jour des dépendances, amélioration de la construction, et plus encore grâce à @scribam\n- Et beaucoup, beaucoup, beaucoup de corrections de bugs grâce à @kihato et à tous les rapporteurs de bugs.\n \n \nTéléchargement : Flycast v2.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181728/in-switch-flycast-v22-disponible-avec-de-nombreuses-ameliorations-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1181728/in-switch-flycast-v22-disponible-avec-de-nombreuses-ameliorations-2.png"
        }
    },
    "news_16": {
        "title": "[WiiU] DNSpresso un nouvel exploit Wii U grâce au client DNS",
        "content": "Le développeur GaryOrnichts vient de dévoiler un nouvel exploit kernel qui exploite une vulnérabilité du client DNS de la Wii U. DNSpresso  est le nom de cet exploit qui s'appuie sur le DNS qui est utilisé pour déterminer l'adresse IP associée à un nom de domaine.\n \n \n \n\nLe réseau de la Wii U est une version modifiée de NicheStack , développée par InterNiche Technologies. La vulnérabilité CVE-2020-25928 n'a été connue qu'il y a deux ans, une faille de la mémoire tampon pouvant conduire à l'exécution de code à distance.\n \n \n\n \n \nPour bien expliquer, un paquet DNS modifié doit être envoyé, qui est chargé dans un tampon de taille fixe, bien que la taille réelle ne soit pas vérifiée . Il s’est avéré que Nintendo avait déjà corrigé ce bug lui-même, mais pas complètement. Vous pouvez trouver l'article complet sur le blog de GaryOrnichts .\n \nLe writeup est là : exploiting-dns-response-parsing-on-wii-u\n \n \nL'exploit peut tout à fait être hébergé localement, ou bien être accessible ici directement : http://85.215.57.182/\n \nTout est là : DNSpresso\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181727/in-wiiu-dnspresso-un-nouvel-exploit-wii-u-grace-au-client-dns-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1181727/in-wiiu-dnspresso-un-nouvel-exploit-wii-u-grace-au-client-dns-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS5] PS4 SDK Spoofer et PS5 Jar Loader (5.00 à 7.61)",
        "content": "Deux sujets intéressants à aborder pour ceux qui s'intéressent à la PlayStation 5 qui il faut l'avouer commence à devenir attractives surtout depuis l'arrivée des fPKG PS4, le premier est PS4 SDK Spoofer et le second est PS5 Jar Loader. \n \nPS4 SDK Spoofer\n \nQuelques développeurs se sont penchés sur un spoof permettant de faire fonctionner certains fPKG PS4 sur PS5 qui par défaut ne fonctionnent pas, ainsi Zecoxao et quelques autres testeurs ont permis de créer PS4 SDK Spoofer, qui va permettre de lancer ces fPKG qui jusqu'à présent n'étaient pas fonctionnel. Bien entendu pour le moment cela reste limité aux seuls firmwares permettant de lancer les fPKG PS4 sur PS5 à savoir les firmwares 4.03 et 4.50, le temps de trouver les offsets sur les autres.\n \n \n\n \n \nSon spoof fonctionne directement via son exploit : \n \nhttps://zecoxao.github.io/ps5jb/\n \n \n \nPS5 Jar Loader\n \nUne autre nouveauté sur PS5, l'arrivée du support des firmwares 5.00 à 7.61 sur PS5 Jar Loader. Dans la toute dernière version de PS5 Jar Loader de John Tornblom, il est donc possible d'utiliser les dernières évolutions en matière de hack PS5 sur les firmwares 5.00 à 7.61, on y voit donc le lien avec les dernières trouvailles de TheFlow sur l'exploit Bluray sur PS5.\n \n \n\n \n \n \nBien entendu il ne s'agit là de ne pas utiliser un exploit mais d'avantage d'une preuve de concept d'exécution de fichier JAR sur une PS5 avec un firmware compris entre 5.00 et 7.61.\n \n \nTéléchargement : ps5-jar-loader.iso /  hello-world-native-remote.jar\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181711/in-ps5-ps4-sdk-spoofer-et-ps5-jar-loader-500-a-761-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1181711/in-ps5-ps4-sdk-spoofer-et-ps5-jar-loader-500-a-761-2.png"
        }
    },
    "news_18": {
        "title": "[Switch] Jouer à Simpsons : Hit and run sur Switch",
        "content": "Plutôt récemment, le développeur ZenoArrow a publié une adaptation remastérisé du jeu Simpsons : Hit and Run sur Nintendo Switch.\n \nDéveloppé par Radical Entertainment et sorti à l'origine en 2003 sur GameCube, PlayStation 2, Xbox et Windows, ce jeu open world basé sur la série populaire de dessins animés \"Les Simpson\" avec des missions, exploration, et une bonne dose d'humour!\n \n \n \n \n \n\n \n \nPour le télécharger : https://github.com/ZenoArrows/The-Simpsons-Hit-and-Run\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181709/in-switch-jouer-a-simpsons-hit-and-run-sur-switch-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS5] Sony sort le firmware 8.20 et il est déjà décrypté",
        "content": "Un peu dans l'urgence Sony vient de proposer un tout nouveau firmware que personne n'attendait de trop. Le plus souvent la sortie d'un firmware PS5 s'accompagne d'un firmware PS4, là rien, étrange ? \n \nNon pas vraiment car ce firmware 8.20 intègre des nouveautés !\n \n \n\n \n \nPS5 – 23.02-08.20.00\n \n- La musique  dans le centre de contrôle est désormais beaucoup plus facile à utiliser. Avec sa disposition en deux colonnes, vous pouvez facilement parcourir différentes catégories, listes de lecture et chansons.\n- Vous pouvez éviter de diffuser involontairement votre environnement lors de la diffusion de jeux avec votre PlayStation VR2.\n- Accédez à  Paramètres  >  Accessoires  >  PlayStation VR2 et activez  Bloquer la vue transparente sur le téléviseur  pour empêcher l'image transparente de la caméra de s'afficher sur votre téléviseur lorsque vous utilisez votre PS VR2.\n- Si vous dites « Quoi de neuf ? » via la commande vocale sur n’importe quel écran, vous pouvez désormais rechercher les nouvelles fonctionnalités PS5.\n- Actuellement, la commande vocale (aperçu) n'est disponible qu'en anglais pour les joueurs disposant de comptes PlayStation Network aux États-Unis et au Royaume-Uni.\n- Améliorations des messages et la convivialité sur certains écrans\n \nCe firmware ne vient probablement pas corrigé de bugs car aucune mention d'amélioration de stabilité n'est intégrée, mais comme toujours, il est plus prudent d'attendre un peu, surtout que certains développeurs travaillent dur pour trouver les failles.\n \n \nIl est à noter que ce firmware a déjà été décrypté : \n \nhttps://twitter.com/notnotzecoxao/status/1717698725655548103\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181679/in-ps5-sony-sort-le-firmware-820-et-il-est-deja-decrypte-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] Atmosphère 1.6.2 disponible",
        "content": "Le développeur SciresM dévoile une toute nouvelle version d'Atmosphère qui est maintenant proposé en version 1.6.2 depuis quelques heures. \n \nIl s'agit là de la 67 ème version d'Atmosphère sachant qu'elle intègre hbl 2.4.4 et hbmenu 3.6.0.\n \nPas de révolution à en attendre car la version 1.6.0 apportait déjà le support du firmware 17.0.0, mais quelques changements dans erpt, jpegdec et pm. \n \n \n\n \n \nChangelog 1.6.2 :\n \nLes éléments suivants ont été modifiés depuis la dernière version :\n \n- La prise en charge du firmware 17.0.0 est terminée.\n- erpt a été mis à jour pour prendre en charge la dernière version.\n- jpegdec a été mis à jour pour prendre en charge la dernière version.\n- pm a été mis à jour pour prendre en charge la dernière version.\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \n \nTéléchargement : Atmosphère 1.6.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181678/in-switch-atmosphere-162-disponible-1.png"
        }
    }
}