{
    "news_1": {
        "title": "[Switch] SaltyNX 1.2.6 et FPSLocker 2.1.5 disponibles",
        "content": " \nLe développeur Masagrator a une nouvelle fois travaillé ses propositions pour la Nintendo Switch, il dévoile en effet SaltyNX 1.2.6 et FPSLocker 2.1.5, deux nouvelles moutures de ses outils qui lui permettent d'offir de la nouveauté et des corrections de bugs. Pour rappel, SaltyNX est un processus en arrière-plan qui permet l'injection et la modification de code. Il est utilisé par divers outils tels que ReverseNX-Tool, ReverseNX-RT, et Status Monitor en conjonction avec NX-FPS, UnityGraphics, et plusieurs mods de Smash. SaltyNX est basé sur shinyquagsire23 et inclut de nombreuses améliorations l'expérience utilisateur (QoL) ainsi que le support des plugins.\n \n \n\n \n \nSaltyNX 1.2.5 :\n \nAjout d'une option pour forcer le jeu à se mettre en veille personnalisée dans le menu d'accueil (nécessite FPSLocker 2.1.3+).\n \nSaltyNX 1.2.6 :\n \n- Lire les paramètres ancrés à partir du fichier ini au lieu du vidage EDID (il s'agit d'une étape nécessaire pour introduire un overclocking approprié de l'affichage ancré à l'avenir).\n- Nécessite FPSLocker 2.1.5+ pour la prise en charge, les anciens paramètres seront remplacés par le vidage EDID brut\n- Passe à la lecture de l'EDID avec la libnx déjà corrigée\n \nTéléchargement : SaltyNX 1.2.6\n \n \n \nFPSLocker 2.1.5: \n \n- Stocke les paramètres ancrés dans un fichier ini au lieu d'un vidage EDID (il s'agit d'une étape nécessaire pour introduire un overclocking approprié de l'affichage ancré à l'avenir)\n- Utilisez SaltyNX 1.2.6+ pour un support approprié\n- Imprime le nom de configuration de votre écran dans les paramètres Docked\n- Pour ceux qui souhaitent savoir quelle configuration correspond à quoi lors de l'exploration des fichiers, j'ai ajouté la clé « tvName ». Sa valeur est modifiable et sera conservée. N'utilisez pas d'espaces ; ils seront supprimés lors de vos prochaines modifications.\n \nFPSLocker 2.1.4/3:\n \n- Amélioration des lectures « Taux de rafraîchissement maximal signalé » dans les paramètres d'affichage ancré.\n- Ajout « Arrêter le jeu non focalisé » dans les paramètres avancés (pour fonctionner correctement, il nécessite SaltyNX 1.2.5+).\n- Certains jeux ne sont pas suspendus lorsque votre Switch est dans le menu d'accueil (par exemple, Tales of Graces f). Activer cette option déplace le thread responsable de l'affichage des images dans une boucle infinie lorsque vous êtes dans le menu d'accueil. L'activation de cette option peut entraîner divers problèmes selon le jeu ; veillez donc à ne pas l'utiliser à la légère.\n \n \n \nTéléchargement : FPSLocker 2.1.5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206958/in-switch-saltynx-126-et-fpslocker-215-disponibles-1.png"
        }
    },
    "news_2": {
        "title": "[Multi] ScummVM v2.9.1 disponible",
        "content": " \n5 mois après la version précédente, voilà que débarque une nouvelle mouture de ScummVM qui est maintenant proposé en v2.9.1. Comme d'habitude, plusieurs moteurs et plateformes ont reçu leur juste part de corrections de bugs et d'améliorations : AGI, AGS, Asylum, BAGEL, Bladerunner, Hopkins, MADS, NGI, SCI, SCUMM, Sky, Sword1, Tetraedge, Tinsel, Tucker, TwinE et TWP.\n \nLes porteurs sont également partis à la chasse aux bugs, la Nintendo 3DS dispose désormais d'une interface graphique correctement affichée si elle est configurée pour utiliser uniquement l'écran supérieur.\n \nAndroid propose désormais une option permettant de sauvegarder et de restaurer votre fichier de configuration et vos sauvegardes de jeu. La grande majorité des anciens appareils Android bénéficieront de performances accrues grâce aux optimisations ARM NEON, désormais activées par défaut. De plus, le jeu Beneath a Steel Sky ne plante plus dès l'intro !\n \nLe portage Atari a bénéficié de quelques correctifs internes au backend, à l'interface utilisateur et au son. \n \n \n\n \n \n \nFaisons le tour du changelog pour comprendre les améliorations de cette version 2.9.1 :\n \n \n \nAGI:\n \nAjout de la prise en charge de la première version de la carte de Noël 1986 avec des publicités pour le matériel Tandy.\nCorrection de nombreux bugs graphiques et amélioration de la réactivité dans Mickey's Space Adventure, Winnie l'ourson dans la forêt des rêves bleus et Troll's Tale.\nLes parties sauvegardées dans Mickey's Space Adventure sont désormais restaurées sur la planète sur laquelle elles ont été sauvegardées au lieu de la Terre.\n \nAGS :\n \nAjout du support officiel pour Old Skies et Rosewater.\nAjout de la prise en charge de la variation de vitesse du clip sonore, utilisée dans certains jeux pour ralentir la musique de fond ou d'autres effets audio.\nCorrection de certains changements de volume audio qui n'étaient pas déclenchés dans certaines situations (par exemple, baisse automatique du volume de la musique pendant le commentaire du développeur ou lorsqu'un personnage parle, dans la série Blackwell).\nEntrées de détection ajoutées/mises à jour pour divers jeux AGS.\n \nAsile:\n \nCorrection d'un crash dans le menu principal du Sanitarium, lors du déplacement du curseur vers la partie supérieure de l'écran.\n \nBAGEL:\n \nCorrection d'un crash lors de l'insertion de la carte de crédit dans la machine à sous.\n \nBlade Runner :\n \nMise à l'échelle 2x fixe et prise en charge plein écran dans la démo non interactive.\nCorrection des fuites de mémoire qui pouvaient entraîner des problèmes de mémoire insuffisante sur certains ports.\nCorrection d'un problème de recherche de chemin qui pouvait provoquer un verrouillage logiciel dans certains cas rares.\n \nHopkins :\n \nCorrection d'un crash lors de l'utilisation de l'ascenseur pour accéder à d'autres étages.\n \nFOU :\n \nCorrection de l'inventaire Rex Nebular et des interfaces utilisateur de la zone verbale qui ne se mettent pas à jour.\n \nIGN :\n \nChargement optimisé des ressources de jeu, améliorant les performances sur Android.\n \nSCI:\n \nCorrection du crash du CD KQ6 lors d'une conversation avec Rotten Tomato depuis la fenêtre d'inventaire en mode haute résolution. (Bug ScummVM 2.9.0)\nCorrection du problème de saut de l'écran titre sur Amiga KQ4. (Bug ScummVM 2.8.0)\nCorrection du crash de QFG4 v1.0 dans la Guilde des voleurs (bug ScummVM 2.1.0).\nCorrection d'un bug de messages disparaissant toutes les 18,2 minutes dans BRAIN1, LSL5 et SQ1. (Bug du jeu original)\nCorrection du bug d'introduction de SQ5 qui n'apparaissait pas sur les machines plus rapides qu'un 386. (Bug du jeu original)\nCorrection du blocage de LSL1 à l'entrée du casino. (Bug du jeu original)\nCorrection d'un crash de LSL6 à l'entrée de l'hôtel. (Bug du jeu original)\nCorrection du problème de disparition du tramway LSL6-HIRES après le redémarrage du jeu. (Bug du jeu original)\nCorrection du problème d'affichage du curseur d'aide LSL6. (Bug du jeu original)\nCorrection du blocage du QFG1 EGA lors d'un trébuchement sur un fil de déclenchement. (Bug du jeu original)\nCorrection du blocage du KQ1 en cas de noyade dans une grotte. (Bug du jeu original)\nCorrection du problème de blocage du téléphone au cinquième jour de GK1 dans toutes les versions du jeu, quelle que soit la vitesse. (Bug du jeu original)\nCorrection d'un motif de tramage bleu incorrect dans les images vectorielles EGA. (Tous les outils SCI depuis SCI Decoder en 1992)\n \nRACINE :\n \nRestauration du comportement de ScummVM 2.7.0 permettant à tous les titres EGA DOS v2-v4 (c'est-à-dire Maniac Mansion à Monkey1) d'être à nouveau joués avec la palette Amiga, en utilisant l'option de jeu en mode Rendu.\nCorrection de la plupart des pistes iMUSE silencieuses dans le Booty Store, dans Monkey2.\nCorrection d'un problème de précision concernant le positionnement de certains personnages dans SCUMMv2 et versions antérieures. Ce problème survenait par exemple lors d'une interaction avec le fidèle à l'aéroport de Zak McKracken (toutes les versions sauf celle de FM-TOWNS).\nCorrection du mode multijoueur de Moonbase Commander qui faisait planter les invités au démarrage du jeu.\nCorrection des pops dans les effets sonores de Sega CD Monkey1.\nSauvegarde fixe sur une sauvegarde existante dans COMI.\nCorrection des messages MIDI excessifs envoyés pendant la réduction du volume de la musique iMUSE (par exemple dans l'intro de Sam & Max), ce qui pouvait entraîner un discours ralenti et brouillé lors de l'utilisation d'un matériel MIDI plus ancien et réel.\nCorrection d'un crash d'iMUSE lors du chargement d'une ancienne sauvegarde avec un fondu sonore en cours.\nCorrection de l'amélioration Jolly Roger pour Monkey1 ; l'activation de cette amélioration empêcherait ce drapeau d'apparaître alors qu'il ne devrait plus être visible, mais le correctif était incomplet dans certaines versions de disquettes VGA.\nCorrection de l'amélioration de la fumée de cigare de Smirk dans Monkey1 FM-TOWNS.\n \nCiel:\n \nCorrection d'un crash dans l'intro de Beneath a Steel Sky sur certaines plateformes, comme Android.\n \nÉpée 1 :\n \nProblème d'équilibre audio corrigé lors de l'utilisation de l'option exécutable Windows.\n \nTétraedge :\n \nPrise en charge améliorée du rendu OpenGL par rapport au rendu logiciel, empêchant le moteur de générer des erreurs sur Android et certaines autres plates-formes.\n \nClinquant:\n \nCorrection du problème de menu de sauvegarde/chargement du Disque-monde devenu inaccessible.\n \nTucker :\n \nCorrection du saut des cinématiques lorsque la touche Échap est mappée.\n \nFicelle:\n \nCorrection d'un crash lors du redémarrage d'un jeu à partir du lanceur une deuxième fois.\nCorrection du problème d'appui sur la barre d'espace en mode normal qui ne déclenche pas l'action Utiliser/Parler.\nMouvement fixe du pingouin méca.\nProblèmes liés au son résolus.\n \nTWP:\n \nAjout d'un message d'erreur lors de la tentative de lecture de Thimbleweed Park sur des plates-formes ne prenant pas en charge OpenGL avec des shaders.\nPort 3DS :\n \nCorrection du problème de rendu incomplet de l'écran supérieur dans certains cas.\n \nPort Android :\n \nAjout d'une fonctionnalité permettant aux utilisateurs de sauvegarder et de restaurer leur configuration et leurs sauvegardes.\nPrise en charge NEON activée par défaut, ce qui se traduit par de meilleures performances pour la grande majorité des anciens appareils Android.\nNous avons contourné un bug dans ARMv7a Android 6.0 et versions antérieures, qui pouvait entraîner l'absence de certaines options de jeu, par exemple.\nAugmentation de l'allocation de pile pour le thread Java Android, bénéficiant aux moteurs de jeu qui utilisent beaucoup la pile.\n \nPort Atari :\n \nEnvoi fixe des messages MIDI SysEx.\nCorrection d'un crash et d'un son déformé avec certains paramètres audio.\nProblèmes de performances résolus avec les jeux SCI32 comme Phantasmagoria ou KQ7.\nDivers correctifs et optimisations de l'interface utilisateur graphique / du backend.\nPort iOS/iPadOS :\n \nCorrection de l'échec de la vérification de l'existence de la police sonore Fluidsynth avec les systèmes de fichiers sandboxés.\n \nPort macOS :\n \nCorrection du problème de démarrage de ScummVM lorsque les paramètres du moniteur ne sont pas définis sur « Millions de couleurs », sur les anciennes versions de macOS.\nPrise en charge fixe des CD audio lors de la lecture à partir de disques originaux sur Snow Leopard et versions antérieures.\n \nPort Windows :\n \nPrise en charge FLAC restaurée dans le port Windows 9x.\n \n \n \nTéléchargement : ScummVM\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206957/in-multi-scummvm-v291-disponible-1.jpg"
        }
    },
    "news_3": {
        "title": "[Switch] Sphaira 0.11.1 disponible",
        "content": " \nLe développeur ITotalJustice a dévoilé il y a quelques jours une version majeure de Sphaira, la version 0.10.0 qui a successivement été mis à jour en 0.10.1 puis 0.10.2 et 0.10.3. Rappelons que le développeur propose sa solution de remplacement du hbmenu intégrant des fonctionnalités inédites pour la Switch, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \n \n\n \n \nChangelog 0.10.0 : \n \n- Mise à jour pt.json  \n- Mise à jour zh.json  \n- Ajout des options de mise en page (liste, icônes, grille) à tous les menus basés sur une grille (homebrew, jeux, appstore).\n- Elimination des bulles.\n- Correction de la build pour gcc 15.\n- haze (mtp) s'exécute désormais sur son propre thread, plutôt que sur le thread principal.\n- Ajout des options d'activation de l'installation sysmmc / emummc, pour permettre l'installation à basculer selon la configuration.\n- [menu des jeux] le chargement des données de contrôle s'exécute sur son propre thread, il ne bloque pas le thread principal. permet un défilement fluide comme le menu d'accueil de Nintendo.\n- [menu des jeux] sur fw20+, sphaira analyse manuellement les données de contrôle, plutôt que d'utiliser ns. l'analyse manuelle prend 20 à 40 ms, ce qui est plus rapide que ms qui peut prendre 50 à 500 ms.\n- [Menu des jeux] Sur FW19 et versions antérieures, si les données de contrôle ne sont pas dans le cache NS, Sphaira les analyse manuellement, car il est deux fois plus rapide que NS. Vous pouvez constater cette rapidité en chargeant le - menu de la carte de jeu : il analyse tout manuellement et charge la carte de jeu plus rapidement que le menu d'accueil.\n- optimisation du chargement des méta-thèmes.\n- [gc menu] essaie de charger les données de contrôle à partir du cache ns avant le chargement manuel.\n- Correction de l'échec de l'installation lors de la configuration si prod.keys n'est pas trouvé. Merci à Marulv pour son aide au débogage de ce problème.\n- N'échouera pas si le contrôle nca ne peut pas être analysé pendant l'installation, car cela peut dépendre d'un ticket pas encore installé.\n- [menu jeux] ajouter le vidage de jeu.\n- [menu jeux] ajouter un transfert de jeu USB (switch 2 switch).\n- Ajout de la prise en charge des emplacements de téléchargement personnalisés (http, ftp, webdav, etc.).\n- [menu des jeux] ajout de la prise en charge du vidage du jeu vers un emplacement de téléchargement personnalisé.\n- [navigateur de fichiers] ajoute la prise en charge du téléchargement de fichiers/dossiers vers des emplacements de téléchargement personnalisés.\n \nChangelog 0.10.1 : \n \n- Correction du dump de la carte SD dû à la non-création du chemin de sortie.\n \nChangelog 0.10.2 : \n \n- Ajout de la langue ukrainienne par@rashevskyvdans #139\n- Correction du problème de mise à jour du menu hb à la sortie en raison d'une comparaison de chaîne défectueuse.\n \nChangelog 0.10.3 : \n \n- Correction d'un crash potentiel lors de la tentative de chargement d'une icône nro si elle avait une entrée d'actif non valide.\n- Patchs Pt par ninstar\n- Correction de la gestion des noms de fichiers Unicode dans usb_install_pc.py par DCNick3\n \nTéléchargement : Sphaira 0.10.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206897/in-switch-sphaira-0103-disponible-1.jpg"
        }
    },
    "news_4": {
        "title": "[Multi] PS Multi Tools v15.5 disponible",
        "content": " \nLe développement de PS Multi Tools continue et son développeur SvenGDK nous propose de découvrir la version 15.4 de son outils multifonctions. \n \nConcernant les nouveautés de cette version, il a ajouté notamment Avatar Changer v1.00 de Lapy, ou encore les dernières mises à jour d'Itemzflow, etaHEN, Kstuff ou WebSRV. \n \n \n\n \n \nPas de grandes nouveautés côté PS4, mais par contre du neuf pour la PS3 avec des fonctionnalités de renommages facilitées, la dernière version MultiMAN Mod 04.85.01, de webMAN Mod 1.47.48i ou encore de nombreuses fonctions liés à Evilnat Cobra 8.5 PEX 4.92. \n \n\n \n\n \n\nInternal Changes :\nReplaced Rijndael with Aes\nReplaced MD5CryptoServiceProvider (currently unused)\nAdded new ISOEncryption property for PS3 backups\nCleaned up Utils\nNew ISO Tools icons\nReplaced remaining WebClient with HttpClient in\nPKGBrowser\nPPPwner\nPKGExtractor\nPSVPFSTools\nPSXMainWindow\nPSXAdvancedEditor\nThe PS3 & PS5 Backup Library now loads the backup files in a Task instead of BackgroundWorker\n \nPS3 Updates :\nNew Batch Rename Utility\nRename multiple files or folders with a single click\nFilter by renaming only folders or files\nFilter by renaming only ISO/PKG files or both\nSelect a predefined scheme or use your own\nAvailable scheme words: \"GAMETITLE\", \"GAMEID\", \"REGION\" without/with \"[]\" or \"()\" around the words\nCustom examples:\n[GAMEID] GAMETITLE (REGION)\nGAMETITLE-[GAMEID] (REGION)\nRenaming folders may not always work, an admin prompt will appear to force renaming\nThe Backup Library now shows if a locally loaded PS3 ISO is encrypted/decrypted\nAdded new context menu option to decrypt a selected encrypted PS3 ISO (ISO Tools -> Decrypt)\nPS3 ISO Tools GUI updated\nAdapted to system theme and re-arranged all controls\nNew option to decrypt an ISO file\nAll operations now show a waiting cursor and disable the interface until the operation is done\nAdded new downloads\nMissing KEY & DKEY downloads\nMultiMAN MOD 04.85.01\nRetroArch CE (WebMAN MOD) Edition download\nEvilnat Cobra 8.5 [PEX] 4.92 CFW\n[PEX]\n[PEX] [OC]\n[PEX] [noBD]\n[PEX] [noBT]\n[PEX] [noBD]+[noBT]\nUpdated webMAN MOD download 1.47.46b -> 1.47.48i\nUpdated ps3netsrv download 20240210 -> 2025050\nUpdated prepISO, PS2 Classics Launcher, PS2Config, PSP Minis Launcher & PSP Remasters Launcher to latest 1.47.48 release\n \nPS5 Updates :\nAdded new downloads\nAdded Avatar Changer v1.00 by Lapy\nUpdated Downloads\nItemzflow by LightningMods v1.09 -> v1.10\netaHEN by LightningMods v2.0b -> v2.1b\nkstuff by sleirsgoevy & EchoStretch (3.XX - 7.XX) v1.4 -> v1.5\nkstuff-Toggle by EchoStretch v0.1 Beta -> v0.2 Beta\nWebSrv by john-tornblom v0.22 -> v0.23.1\n \nFixes :\nFixed a possible crash in the PARAM.SFO Editor when checking/unchecking Bootable in the PSP tab\nFixed getting the output of PS3 ISO tools\nFixed the ISO Tools context menu in the PS3 Backup Library\nFixed possibility to Play/Stop the soundtrack of ISO backups in the PS3 Backup Library\n\n \n\n \n\n \nEdit 23.05.25\n \nTéléchargement : PS Multi Tools v15.5 \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206843/in-multi-ps-multi-tools-v154-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS5] PS5 BDJ HEN Loader v2.0b disponible",
        "content": "Comme nous venons de le voir, le développeur Viktorious-x a intégré la version 2.0b de PS5 BDJ HEN Loader dans la version 1.16 de PS5 BDJB Modified ISOs, mais de quoi s'agit-il ? \n \nPS5 BDJ HEN Loader permet le chargement automatique d'etaHEN et/ ou de Kstuff depuis le lecteur blu-ray de la PS5, et cela sans avoir à quitter manuellement le lecteur de disque. \n \nC'est une évolution importante car tout se fera automatiquement, même s'il arrive que l'écran d'accueil reste bloqué après la fermeture du lecteur de disque. Dans ce cas, attendez que la notification « Lecteur de disque a été arrêté » s'affiche, cela peut prendre quelques secondes.\n \nDans le même ordre d'idée, il peut arriver que le lecteur de disque plante à la fermeture, vous pouvez alors rencontrer un kernel panic ou un message indiquant qu'un problème est survenu avec ce jeu ou cette application. Dans ce cas, cliquez simplement sur OK et tout devrait se charger correctement.\n \n \n\n \n \nConfiguration \n \nIl existe plusieurs configurations que vous pouvez utiliser :\n \n1. Par défaut : etaHEN sera chargé à partir du disque et vous n'avez rien à modifier.\n2. etaHEN uniquement : Copiez un fichier etaHEN.bin à la racine d'une clé USB (priorité 1) ou dans le répertoire /data/ (priorité 2) sur la PS5, et il sera chargé à la place de celui du disque .\n3. Kstuff uniquement : identique à ci-dessus, mais avec kstuff. Copiez kstuff.elf à la racine d'une clé USB (priorité 1) ou dans le répertoire /data/ (priorité 2) de la PS5, et il sera chargé à la place de etaHEN .\n4. Combinaison : placez etaHEN.bin et kstuff.elf à la racine d'une clé USB (priorité 1) ou dans le répertoire /data/ (priorité 2) de la PS5, puis un fichier no_kstuff à la racine de la clé USB ou dans /data/etaHEN/ . EtaHEN sera alors chargé, suivi de kstuff.\nIl est également possible qu'etaHEN et kstuff soient placés à des emplacements différents. Par exemple, etaHEN peut être sur la clé USB et kstuff dans le répertoire /data/.\n \n \nChangelog 2.0b :\n \n- Une fonction de fermeture automatique du lecteur de disque est désormais disponible pour tous les firmwares. Plus besoin de quitter le lecteur, tout se fera automatiquement.\n- De plus, a été ajouté la possibilité de charger etaHEN et/ou Kstuff depuis plusieurs chemins. - Publication du code source du projet \n- Viktorious_x intégrera également cela dans sa prochaine version iso  \n- Compilé avec ps5-payload-sdk v0.30 pour le ps5-jar-loader v4.1.1 de hammer-83.\n \n \nTéléchargement : PS5 BDJ HEN Loader v2.0b\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206769/in-ps5-ps5-bdj-hen-loader-v20b-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[PS5] PS5 BDJB Modified ISOs v1.16 disponible",
        "content": "Le développeur Viktorious-x propose une nouvelle version de sa solution PS5 BDJB Modified ISOs qui est maintenant livré en v1.16.\n \nDe nombreux changements ont été introduits dans cette version comme la mise à jour de BDJ Hen Loader de BenNox_D, cela permet d'ajouter la fermeture automatique pour tous les firmwares ou encore de nouvelles options permettant de charger etaHEN ou Kstuff à partir de plusieurs chemins. \n \nUmtx1 a gagné en stabilité, bien qu'il se lance un peu plus lentement cela permet d'accroitre son taux de réussite, et Websrv a été mis à jour, il est possible de trouver tout cela dans le changelog ci-dessous. \n \n \n\n \n \n \nChangelog v1.16 : \n \n \n- Ajout du chargeur BDJ Hen Loader mis à jour par BenNox_ D\n \nVoici les nouvelles fonctionnalités de ceci :\n \n- Ajout de la fermeture automatique pour tous les firmwares, après avoir exécuté un pipeline contenant etahen, il se fermera automatiquement au lieu de devoir le fermer manuellement - par BenNox_ D\n \n- Ajout de l'option permettant de charger etaHEN et/ou Kstuff à partir de plusieurs chemins par BenNox_ D\n \n- Umtx1 est devenu un peu plus lent, mais il est désormais plus stable.\n \n- Corrections de bugs/stabilité\n \n- Websrv mis à jour vers la version 0.23.1 - par John Tornblom\n \nComme tout cela est assez expérimental, veuillez comprendre que des kernel panics peuvent survenir.\n \n \nTéléchargement :  PS5 BDJB Modified ISOs v1.16\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206768/in-ps5-ps5-bdjb-modified-isos-v116-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[PS4/PS5] Kstuff Toggle 0.2 Beta et Homebrew Dump Runner v0.01 d'EchoStretch",
        "content": "Il y a quelques heures, le développeur EchoStretch a mis en ligne Homebrew Dump Runner mais également une nouvelle mouture de la Kstuff Toggle. \n \nHomebrew Dump Runner \n \nSous ce nom se cache un nouvel utilitaire permettant \" d'exécuter des jeux et des homebrews sur votre PS5 à l'aide des payloads Kstuff, Websrv et Homebrew Launcher \" .\n \n \n \nInstallation et lancement\n \nCopiez votre dossier homebrew dans :\n/data/homebrew/\n/mnt/usb#/homebrew/ (remplacez #par votre numéro USB, par exemple, usb0, usb1, etc.)\n \nDans le dossier homebrew , ajoutez :\n \ndump_runner.elf\nhomebrew.js\n \nInstallez le Homebrew Launcher et envoyez le payload Websrv à votre console :\nWebsrv v0.23.1\n \nOuvrez le loader Homebrew.\n \nUne fois la clé USB branchée, votre jeu homebrew devrait apparaître.\nSélectionnez un jeu homebrew et lancez-le.\n \n \n\nTéléchargement : Homebrew Dump Runner 0.01\n \n \n \n\n\n \n \nKstuff Toggle \n \nLa seconde information est qu'EchoStretch dévoile la version 0.2 de Kstuff Toggle, toujours proposé en Bêta. \n \nChangelog v0.2 : \n \n\nOption 1: Juste sysentvec\nOption 2: Juste sysentvec_ps4\nOption 3: Les 2\n\n \nTéléchargement :  kstfuff toggle v0.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206756/in-ps4ps5-kstuff-toggle-02-beta-et-homebrew-dump-runner-v001-dechostretch-1.png"
        }
    },
    "news_8": {
        "title": "[Switch] mais aussi SaltyNX, FPSLocker, et SwitchLayoutEditor",
        "content": " \nSecond tour des nouveautés qui concernent la Switch, nous le devons aux développeurs masagrator et FuryBaguette qui propose respectivement les mises à jour de FPSLocker, SaltyNX et SwitchLayoutEditor, l'idée est là aussi d'apporter avant tout le support de la branche firmware 20.0.0, cela intègre bien entendu le tout dernier firmware 20.0.1. \n \nFPSLocker / SaltyNX\n \nLe développeur masagrator a mis à jour FPSLocker et SaltyNX, ils partagent d'ailleurs le même changelog.\n \n \n\n \nChangelog : \n \n- Réduction de la taille de Core32 de 15 % et de Core de 35 %, ce qui nous permet de faire en sorte que sysmodule prenne 64 Ko de RAM en moins\n- Autorisation de la modification de la quantité de tampons dans les jeux Vulkan (nécessite FPSLocker 1.2.2+)\n- Correction d'un problème avec certains jeux surdéclarant des images (120 au lieu de 60), comme Hades\n- Correction d'un problème où très peu d'unités Erista présentaient des saccades d'image constantes et les temps de chargement augmentaient depuis la version 1.2.0\n \nTéléchargement : FPSLocker / SaltyNX\n \n \n \nSwitchLayoutEditor\n \nL'éditeur SwitchLayoutEditor qui pour rappel a pour but de simplifier et de rendre plus accessible la création de thèmes (et de layouts) pour la Nintendo Switch a aussi été upgradé. \n \n \n\n \n \nCette nouvelle version implémente les modifications nécessaires à la prise en charge des différences de disposition pour le firmware 20.0. Si vous avez utilisé l'une des versions précédentes pour créer des dispositions 20.0, il est possible qu'elles ne fonctionnent pas correctement. \n \nTéléchargement : SwitchLayoutEditor v16\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206743/in-switch-mais-aussi-saltynx-fpslocker-et-switchlayouteditor-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1206743/in-switch-mais-aussi-saltynx-fpslocker-et-switchlayouteditor-1.png"
        }
    },
    "news_9": {
        "title": "[Switch] NXMP, SwitchThemeInjector, NXThemesInstaller, SysDVR à jour",
        "content": " \nPremier tour des nouveautés des homebrews et logiciels mis à disposition pour la Nintendo Switch, les développeurs ont travaillé leur solution pour y apporter des mises à jours. \n \nSysDVR 6.2.1 \n \nLe développeur exelix11 offre la v6.2.1 de SysDVR, cette version prend en charge l'arrêt et le démarrage dynamiques du module système SysDVR sans redémarrage de la console. Cette fonctionnalité devrait permettre de réduire l'impact des nouvelles limites de mémoire ajoutées au firmware 20.0.\n \nCette fonctionnalité est disponible à la fois dans les paramètres homebrew et pour une utilisation par les gestionnaires de modules système tiers via le fichier toolbox.json .\n \nTéléchargement : SysDVR 6.2.1\n \n \n \n\n \n \n \nSwitchThemeInjector et NXThemesInstaller \n \nIl a également mis à jour SwitchThemeInjector et NXThemesInstaller, là aussi l'ambition étant d'apporter avant tout le support du firmware 20.0.0. Cette version des outils de thème apporte la prise en charge du nouveau firmware 20.0 ainsi que la prise en charge du remplacement des icônes de toutes les nouvelles icônes d'applet.\n \nÉtant donné que le nouveau firmware modifie certains aspects de la disposition du menu d'accueil, le programme d'installation tentera de corriger automatiquement les anciens thèmes. Grâce aux retours de quelques personnes ayant testé les versions bêta et à les tests des dispositions les plus populaires sur Themezer, le développeur affirme que la plupart des thèmes devraient fonctionner correctement, avec seulement quelques différences mineures au niveau de l'interface utilisateur.\n \nTéléchargement : SwitchThemeInjector 4.8 et NXThemesInstaller 2.8\n \n \nNxmp\n \nEnfin, sachez que le développeur Proconsule a lui de son côté mis à jour Nxmp, le lecteur vidéo pour Nintendo Switch basé sur MPV https://mpv.io/ et sur la solution open source de Cpasjuste pplay. \n \n \n\n \n \nChangelog 0.9.2 \n \nAjout :\n- Prise en charge des fichiers PDF\n \nCorrections :\n- correction sur la recherche de fichier d'archive (utile pour la lecture d'un fichier vidéo dans une archive)\n- correction sur la lecture d'archives depuis USB\n- liste de lecture à partir de la carte SD locale et des clés USB\n- paramètres sélection/enregistrement de la langue\n \n \nTéléchargement : Nxmp 0.9.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206742/in-switch-nxmp-switchthemeinjector-nxthemesinstaller-sysdvr-a-jour-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206742/in-switch-nxmp-switchthemeinjector-nxthemesinstaller-sysdvr-a-jour-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS4] PS4 Syscon Tools v2.2.0 disponible",
        "content": "Le développeur AbkarinoMHM que l'on ne présente plus dévoile une nouvelle version de son outil PS4 Syscon Tools qui est maintenant proposé en version 2.2.0. La versin précédente avait été livrée il y a presque un an, les nouveautés sont donc importantes. \n \nLa puissance de ce petit outil n'est déjà plus à démontrer, créé avec EgyCnq et permet de manipuler, dumper, flasher la puce Syscon de la PS4 (Renesas RL78/G13). \n \n \nPour s'en servir au mieux, il vous faudra la partie logicielle représentée par cet outil PS4 Syscon Tools mais aussi la partie hardware avec de quoi flasher le Syscon, un Teensy++ 2.0 ou Teensy 4.0.\n \n\n \nChangelog 2.2.0 :\n \n- Mise à jour du cadre .net de .net framework 8.0 à .net framework 9.0.\n- Déplacement de la fonction Write Full Syscon Flash du mode d'utilisation normal au mode avancé.\n- Déplacement de la fonction Write Syscon NVS/SNVS Only du mode avancé au mode normal.\n- Mise à jour et amélioration de la détection du matériel PS4 Syscon Flasher.\n- Correction de certains problèmes en détectant et en ouvrant PS4 Syscon Flasher pour chaque fonction au lieu de le détecter et de l'ouvrir une seule fois au démarrage de l'application.\n- Ajout de vérifications minimales du firmware du PS4 Syscon Flasher, de sorte que si votre flasher a un firmware ancien/non supporté, il vous demandera de le mettre à jour en premier.\n- Nettoyage du code.\n- Ajout d'un programme d'installation pour qu'il installe PS4 Syscon Tools ainsi que les bibliothèques .NET framework 9.0 nécessaires à son fonctionnement.\n- Mise à jour de la version 2.1.0 beta à 2.2.0.\n \n \nTéléchargement : PS4 Syscon Tools v2.2.0\n \n \n \n \n",
        "images": {}
    },
    "news_11": {
        "title": "[Switch] LibHac privé de liberté sous DMCA de Nintendo",
        "content": "Libhac est une bibliothèque utilisée pour le déchiffrement du contenu de la Nintendo Switch. Cette bibliothèque seule est inutile sans les clés, qui, à juste titre, n'ont pas été intégrées. \n \nMalgré cela, Nintendo a envoyé une notification DMCA à GitHub demandant la suppression de toutes les instances de Libhac.\n \n \n\n \n \nPour rappel, LibHac est une bibliothèque .NET qui réimplémente certaines parties du système d'exploitation Nintendo Switch, également connu sous le nom d'Horizon OS.\n \nL’une des autres fonctions principales de la bibliothèque est l’ouverture, le décryptage et l’extraction des formats de fichiers de contenu courants utilisés par Horizon.\n \nLa plupart des contenus sont importés et exportés via une IStorageinterface standard. Cela signifie que la lecture de types de fichiers imbriqués et de chiffrements peut être facilement effectuée en reliant différents lecteurs de fichiers.\n \n \n \nLa notification DMCA est disponible à l' adresse suivante : Retrait pour DMCA de LibHac\n \nC'est un vrai coup dur de Nintendo encore une fois qui agit toujours pour limiter l'utilisation hors charte, tous les forks, et ils sont nombreux, subissent le même sort. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206714/in-switch-libhac-prive-de-liberte-sous-dmca-de-nintendo-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] MissionControl 0.13.1 disponible",
        "content": "La 27ème version officielle de MissionControl vient d'être mise en ligne par son développeur ndeadly, une petite semaine après la version précédente, cette version vient corriger des bugs, car certaines régressions ont été détectées. \n \nAinsi suite au changement du type de manette signalé en Manette Pro sous licence, le logiciel ne prenait pas en charge les vibrations ni le niveau de batterie. Les correctifs HID ont été mis à jour pour ajouter les indicateurs manquants et restaurer la fonctionnalité pour les manettes émulées via Mission Control. \n \n \n\n \n \nLa définition de nouveaux indicateurs pour le type de contrôleur Pro sous licence peut également activer des fonctionnalités manquantes sur les contrôleurs Pro tiers sous licence (par exemple, l'affichage du niveau de batterie) si le contrôleur les implémente. Ne vous attendez pas à des miracles (le vibreur ne fonctionnera pas sur un contrôleur sans moteurs).\n \n \nChangelog 0.13.1 : \n \n- Ajout d'indicateurs de fonctionnalités aux types de contrôleurs Pro sous licence pour activer les rapports de batterie et la prise en charge des vibrations\n- Correction de certains offsets incorrects dans les correctifs exefs Bluetooth 20.0.X affectant l'implémentation IPC personnalisée\n \n \nTéléchargement : MissionControl 0.13.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206671/in-switch-missioncontrol-0131-disponible-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS4-PS5] Saturn 2 PS4/PS5 V 1.3",
        "content": "Voici une nouvelle version de mon outil Saturn 2 PS4/PS5 qui passe en version 1.3 qui va vous permettre de convertir vos jeux Saturn pour PS4 et PS5.\n \n\n \nVous trouverez dans cette version 1.3 quelques petites nouveautés,  le code a été totalement réécrit en python avec l ajout d'une interface graphique, j' ai également ajouté un switch entre la version PS4 et PS5 (icon PS4 et icon PS5), de plus une option pour créer un son sur le menu et un lecteur AT9 (Merci Darkprogrammer pour le lecteur AT9) ont été ajoutés.\n \nCet outil a été testé et fonctionne sur tous les firmwares jailbreakés PS5 et à partir du 5.05 sur PS4...\nVous aurez le choix entre 3 émulateurs Saturn, à vous de tester et trouver le meilleur pour votre jeu Saturn.\n \nMerci aux testeurs:\n \n\n- Arksama  firmware 2.50 et 4.03\n- New rival firmware 2.50\n- Oswald phantom firmware 3.00\n- Ribery95 firmware 4.03\n- Hyndrid firmware 4.03\n- Markus95 firmware 4.03 et 6.50\n- Mega gonzales firmware 4.50\n- Scott Darby firmware 4.51\n- Ahmad firmware 5.10\n- PS56.02 firmware 6.02\n- Eye Full Blood firmware 7.20\n- Jonas Bartholdi firmware 7.61\n- Link firmware 7.61\n \n\n \nPour le fonctionnement et l installation je vous laisse regarder ma vidéo tuto, j' y explique le fonctionnement, ainsi que la mise en place des dépendances OBLIGATOIRES à son bon fonctionnement.\n \n\n \nTélécharger SATURN_2_PS4/PS5_v1.3\n \nPour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:\nhttps://www.paypal.com/paypalme/markus00095\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206655/in-ps4-ps5-saturn-2-ps4ps5-v-13-1.png"
        }
    },
    "news_14": {
        "title": "[PS5] Le A53MM/A53IO (MP4) peut désormais être dumpé",
        "content": "Contrairement à d'habitude, nous ne parlerons pas ici de hack ou d'exploit, mais simplement de dump, cela fait écho à ce que Zecoxao disait il y a quelques jours sur les possibilités d'accès à la puce A53MM/A53IO (MP4) qui a pour ambition de gérer séparément les packages PS5 (PKG) sur PS5, et qui limite donc les possibilités de lancement. \n \nIl est donc désormais possible de dumper le firmware MP4, cette faculté a été opérée sur un firmware 4.50, mais cela est accessible sur les firmwares 1.00 à 7.61 qui disposent un userland et un exploit kernel. \n \n \n\n \n \nLe développeur Zecoxao propose d'ailleurs le dump MP4 ici.\n \n \n \n\n \n \n \nBien entendu, en l'état le dump de cette puce n'est pas très utile, il faudra creuser pour voir s'il existe une possibilité de modifier son code, ou bien cela pourrait faciliter son contournement, là encore le temps nous le dira. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206619/in-ps5-le-a53mma53io-mp4-peut-desormais-etre-dumpee-du-firmware-100-au-761-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206619/in-ps5-le-a53mma53io-mp4-peut-desormais-etre-dumpee-du-firmware-100-au-761-2.png"
        }
    },
    "news_15": {
        "title": "[PS5] PS5 BDJB Modified ISOs v1.15 disponible",
        "content": "Les versions s'enchainent pour PS5 BDJB Modified ISOs, la proposition de Viktorious-x évolue une nouvelle fois, la dernière fois que nous vous avions parlé de ce logiciel c'était début mai avec la version 1.12. Entre temps, le développeur a livré la v1.13, et désormais la v1.14 et compte bien offrir la v1.15 ce week-end. \n \n \n\n \n \nLes changements entre toutes ces versions sont importants, rappelons que cette version modifiée de l'ISO PS5 BD-JB représente une avancée pour le jailbreaking hors ligne. Avec la prise en charge de plusieurs firmwares (du 4.xx au 7.xx et sa facilité d'utilisation, il permet d'accéder aux UMTX, loader ELF, serveur Web et autre etaHEN (avec kstuff) très facilement.\n \n \nLa version 1.13 : \n \n- Mise à jour de etaHEN vers la version 2.2b\n- Corrections de bugs/stabilité\n- Il semblerait que etaHEN 2.2b soit un peu instable, donc si vous ne voulez pas l'utiliser la v12 dispose d'etaHEN 2.1\n \n \nLa version 1.14 :\n \n- umtx1 modifié pour être significativement plus rapide (20-30 secondes maintenant)\n- Retour à etaHEN 2.1 car etaHEN 2.2b avait des problèmes de stabilité\n- Améliorations de l'interface utilisateur du menu par DriveRick\n \nEdit 15.05.2025 :\n \nTéléchargement : PS5 BDJB Modified ISOs v1.15\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206618/in-ps5-ps5-bdjb-modified-isos-v114-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[PS4] PS4HEN VTX 2.15 release 1.0346 disponible",
        "content": "Le développeur Echo Stretch a mis à jour sa solution PS4HEN VTX 2.15 en proposant la release HEN-1.0346, les versions se succèdent depuis hier, une première version ayant apporter le support pour les firmwares 11.02, 11.50 et 11.52, la dernière amenant le support des 12.00 et 12.02.\n \n \n \n\n \n \nChangelog \n \nHEN-1.0345\n- Ajout d'une build HEN pour les firmwares 12.00 / 12.02\n \nHEN-1.0336\n- Seulement le HEN\n- Support ajouté pour les firmwares 11.02, 11.50 et 11.52\n \n \nTéléchargement : PS4HEN VTX 2.15 release 1.0346\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206615/in-ps4-ps4hen-vtx-215-release-10346-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[PS5] Direct Package Installer support la PS5",
        "content": "Nouveauté importante dans Direct Package Installer, son auteur marcussacana vient en effet de rajouter le support initial de la PS5. \n \nComme vous le savez l'outil Direct Package Installer vous permet de prévisualiser et d'envoyer des PKG sur votre PS4 via Remote Package Installer à partir de liens directs.\n \nS'appuyant sur le serveur de GoldHEN ou de Remote Package Installer, Direct Package Installer est compatible avec des services d'hébergement comme Alldebrid, Realdebrid, Google Drive, Mediafire, PixelDrain ou encore beaucoup d'autres. \n \nLe support initial de la PS5 semble marquer la volonté de basculer les possibilités offertes de Direct Package Installer sur PS5. \n \n \n\n \n \n \nChangelog 8.3.0 : \n \n- Prise en charge initiale de la PS5 \n- Ajout de la prise en charge d'etaHEN DPIv2\n- Ajout de la prise en charge de la détection automatique de l'IP PS5\n \n \nTéléchargement : Direct Package Installer avec support la PS5 (v8.3.0)\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206603/in-ps5-direct-package-installer-support-la-ps5-1.png"
        }
    },
    "news_18": {
        "title": "[PS4] Le portage 8.00 à 9.60 de PSFree est réalisé à 99 %",
        "content": "Selon le développeur Al Azif, le portage de l'exploit PSFree sur les firmwares compris entre le 8.00 et 9.60 sur PS4 est réalisé à 99 %. Selon lui il ne manque désormais que les chaînes JOP, il nous informe qu'il les a un peu mélangé en uilisant plusieurs parefeu simultanément. \n \nDeux solutions, soit il repart de zéro, soit il utilise d'autres implémentations, mais l'objectif est désormais en ligne de mire, ce n'est qu'une question de jours.\n \nIl dit qu'il ne pourra pas tout terminer avant le week-end prochain, car il a du travail cette semaine, tout est configué pour les consoles, et les firmwares, il ne restera qu'à ajouter un loader de payloads. \n \nIl tient déjà à remercier abc pour la publication des implémentations et toutes les personnes impliquées. Les crédits, la licence et le lien de don sont conservés tels que publiés par abc, et il rajoute calmboy2019 au crédit pour avoir testé toutes les modifications.\n \n \n \n\n \n \n \nEnfin il confirme que le DNS bénéficiera d'une mise à jour importante prochainement, avec quelques nouveautés, il pense avoir trouvé un moye de le rouvrir, une solution client sans utilité générale, mais il pense que ça fonctionnera.\n \nLes pare-feu affectés par les exploits utilisés sont répertoriés dans le fichier Lisez-moi sous forme de tableaux faciles à lire. Lapse fonctionnera, mais PSFree ne fonctionnera pas comme point d'entrée.\n \nLa Todo List se trouve dans le lien ci-dessous . \n \n- Intégrer le chargeur de charge utile (Test sur 8.00-8.03)\n- Réécrire les chaînes JOP dans rop/ps4/850.mjs, rop/ps4/900.mjs, etrop/ps4/950.mjs\n- J'ai mis au rebut ceux que j'avais...\n- lapse.mjs: Définissez simplement les bits pour les privilèges JIT\n- view.mjs:Suppose la PS4, prend également en charge la PS5\n- Ajouter la prise en charge de la PS5\n \n \n \nTéléchargement : PSFree 1.5.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206602/in-ps4-le-portage-800-a-960-de-psfree-est-realise-a-99-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS5] Flat_z envisage un Hen v2",
        "content": "Sur le discord de regroupement de l'ensemble des utilisateurs expérimentés de hack PlayStation, le développeur Flat_z a émis l'idée de proposer une nouvelle version du Hen pour la PlayStation 4 mais aussi pour la PlayStation 5.\n \nDans un message évocateur, le développeur informe avoir trouvé un autre moyen, plus facile, que les possibilités actuelles, il dit que sa solution permettrait d'apporter les fpkgs sur PS5, et que les jeux PS4 fonctionneront plus rapidement.\n \n \n\n \n \nDu calme, pour le moment il ne s'agit qu'une théorie, rien de concret n'est réellement sorti, pas de Poc ou de piste certaine, mais il annonce avoir fait du rétro-engineering sur une partie du code. Il a rajouté qu'il doit maintenant prendre le temps de voir si cela fonctionne sur chaque firmware. \n \n \n\n \n \nBien entendu, ce n'est que les prémices de ce qui pourrait au moins être une évolution des solutions actuelles, wait and see. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206572/in-ps5-flat-z-envisage-un-hen-v2-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206572/in-ps5-flat-z-envisage-un-hen-v2-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] Goldleaf et uLaunch ont été mis à jour par XorTroll",
        "content": " \nLe développeur XorTroll propose les mises à jour de uLaunch et de Goldleaf, l'idée est d'apporter des améliorations et de nouvelles fonctionnalités, mais pas que ça. \n \nLa nouvelle version 1.2.0 de uLaunch apporte à cette version la correction de la prise en charge d'Atmosphère 1.9.0 et des firmwares 20.0.0/20.0.1. uLaunch est une alternative personnalisée à l’interface originale de la Nintendo Switch, qlaunch.\n \nDéveloppée par XorTroll, elle propose un menu paramétrable mêlant jeux et homebrews, ce qui tranche avec l’austérité de l’interface proposée par Nintendo, bien trop épurée.\n \nLe changelog de la v1.2.0 est énorme.\n \n \nChangelog for v1.2.0 :\n \n \nGénéralités\nAvant toute chose, comme toujours : de nouveaux textes de langue ont été ajoutés pour refléter les changements ci-dessous, et d'autres corrections internes mineures ont été effectuées (qui ont probablement très peu d'impact sur l'expérience de l'utilisateur).\n \nCompilé avec les derniers changements de libnx et Atmosphère 1.9.0, supportant jusqu'au firmware 20.0.1\n \nCorrection de problèmes où certains fichiers de thème n'étaient pas correctement mis en cache et ne se chargeaient donc pas.\n \nDésormais, les processus d'applets de uLaunch (uMenu, alias le menu HOME visible, et uLoader, alias tout homebrew lancé sous forme d'applets depuis uMenu) sont chargés par défaut au-dessus de l'applet album.\n \nAuparavant, uMenu s'exécutait par défaut sur eShop et uLoader sur le contrôle parental... ce qui était un choix plutôt arbitraire fait il y a des années.\n \nLe code de uSystem a été adapté pour que uLoader, uMenu et les autres applets utilisées s'exécutent sur le même type d'applet (maintenant uMenu, uLoader et l'album normal s'exécutent tous sur le processus de l'applet album) car cela aurait causé des problèmes dans les versions précédentes.\n \nIl s'agit peut-être d'une spéculation, mais faire tourner notre matériel sur album serait probablement plus sûr que d'utiliser quelque chose comme eShop.\n \nLa chaîne par défaut (si tous les fichiers de langue n'ont pas été chargés) est maintenant <inconnu> au lieu d'une chaîne vide.\n \nLes applications invalides, précédemment sélectionnées comme homebrew takeover sont réinitialisées (si vous avez sélectionné une application comme homebrew takeover et que vous avez ensuite supprimé l'application, uLaunch se plantait auparavant en essayant de lancer homebrew par dessus, mais maintenant un tel paramètre invalide est automatiquement nettoyé).\n \nLa configuration est maintenant unique par emuMMC ou sysMMC ! Cela signifie que emu/sysmmC auront des configurations indépendantes (oui, cela signifie des thèmes différents !)\n \nuLaunch convertira automatiquement les paramètres globaux en paramètres sys/emu : ils seront les mêmes, copiés depuis les paramètres globaux, mais à partir de maintenant, tout changement ne sera effectué que sur la MMC courante (sys/emu) !\n \nUn bug mineur de cache d'entrée de homebrew a été corrigé, maintenant si un homebrew est mis à jour pendant que uLaunch est actif (homebrew qui se met à jour automatiquement, envoyé via le NetLoader de hbmenu) il sera mis en cache en conséquence (avant cela, le chargement du cache échouait et l'entrée s'affichait comme \" ???\" invalide).\n \n \nuMenu\nLorsque l'on appuie sur B dans un dialogue, le bouton d'annulation est brièvement mis en évidence avant de disparaître, afin de montrer plus clairement que le dialogue a été annulé.\n \nLe problème qui faisait que les applets d'ouverture de uMenu (le clavier, la page utilisateur, etc.) affichaient les graphiques de l'applet précédente en arrière-plan est enfin corrigé !\n \nAjout de la prise en charge de la réaffectation des boutons et de la mise à jour des contrôleurs ! Il s'agit désormais d'options supplémentaires dans le menu spécial \"Contrôleurs\".\n \nLa suspension des applets a maintenant un effet de fondu similaire à celui de la suspension des applications, ce qui est très joli IMO \n \nDes corrections similaires ont été effectuées lors du lancement d'applets via uMenu (clavier, contrôleur) où auparavant un fond sombre était affiché, maintenant (comme avec le menu HOME normal) l'écran uMenu est affiché de manière floue en arrière-plan (des petits détails qui rendent tout plus joli !).\n \nLors du lancement des applets, un effet de fondu est effectué avec la couleur du thème sous-jacent (clair ou foncé) pour faire une transition plus agréable entre les thèmes colorés et le style minimaliste clair/foncé que les applets utilisent de toute façon \n \nAjout d'une journalisation supplémentaire pour le dépannage futur des temps de chargement.\n \nCorrection mineure lors de l'affichage du clavier : maintenant le curseur est correctement initialisé à la fin (s'il y avait du texte initial, comme lors du changement de pseudo de la console)\n \n \n \nMenu principal\nLes menus sont désormais chargés paresseusement (ils ne sont chargés que lorsque vous y accédez), ce qui pourrait améliorer les performances (marginalement ?).\n \nLe démarrage de uLaunch n'affiche pas le lockscreen (si activé), il va directement au menu de démarrage comme d'habitude\n \nCertains textes de l'interface utilisateur (titre et auteur/version dans le menu principal) ne dépassent plus leurs limites s'ils sont trop longs (un nouveau système d'animation simple est utilisé pour les afficher)\n \nLe plantage du module audio lors de la suspension de certains jeux est enfin corrigé ! Pour les détails techniques, consultez le README du repo concernant la construction.\n \nL'heure et la date ne sont re-rendues que lorsque les valeurs changent réellement (encore une fois, amélioration marginale des performances ?)\n \nLes jeux qui ont besoin d'une mise à jour sont maintenant traités correctement (parfois ils peuvent être lancés et parfois non, les deux cas sont distingués maintenant).\n \nUne animation simple mais habituelle est présente dans le texte de l'heure, où les points \" :\" entre les minutes et les secondes clignotent occasionnellement (également dans le menu de l'écran de verrouillage).\n \nLes entrées homebrew spéciales (hbmenu et uManager à partir de maintenant) ne peuvent pas être ajoutées à nouveau, puisqu'elles sont faites pour être toujours présentes dans le menu (c'est pour cela qu'elles sont spéciales)\n \nUn message d'erreur dédié est affiché lorsqu'un thème ne se charge pas (et que le thème par défaut a été chargé à cause de cela), ou lorsqu'un thème est obsolète (mais qu'il a quand même été chargé)\n \nCorrection du SFX joué en permanence lorsque l'on spamme L/R pour déplacer des pages dans le menu (maintenant le SFX n'est joué que lorsqu'il est déplacé)\n \nCorrection d'un comportement graphique gênant lorsque l'on spamme +/- pour redimensionner le menu\n \nSi l'on sélectionne un jeu qui est le homebrew takeover, l'option pour définir comme homebrew takeover n'est plus affichée (parce que c'était inutile)\n \nMaintenant, appuyer sur le bouton HOME à l'intérieur d'un dossier le ramène d'abord au début, puis une seconde pression le ramène à la racine du menu HOME (auparavant, il retournait directement au menu racine).\n \nLa disposition des menus est maintenant unique par utilisateur et par sys/emuMMC ! uLaunch copiera automatiquement le menu actuel (global) pour tous les utilisateurs, et à partir de là, toute modification du menu sera unique pour l'utilisateur \n \nCorrection d'un bug où renommer un dossier ne mettait pas à jour le texte du nom du dossier sur l'icône du dossier.\n \nLes icônes de jeu ne sont plus mises en cache par uLaunch lui-même : la console a déjà son propre système de cache, et le simple fait de s'appuyer dessus (comme le fait le menu HOME normal) a toujours été plus rapide que de charger nos icônes mises en cache depuis la carte SD (c'est juste qu'il m'a fallu quelques années pour le remarquer) ; une autre conséquence est que, lorsque l'on change de langue dans la console, les icônes reflètent correctement la langue correspondante (ce qui ne fonctionnait pas toujours comme prévu auparavant)\n \nLes icônes des comptes/utilisateurs ne sont plus mises en cache (pour plus ou moins la même raison que pour les jeux) ; ainsi, lors de la création d'un nouvel utilisateur / de la modification de l'icône d'un utilisateur, le changement est correctement reflété dans le menu \n \n \nMenu des paramètres\nLe paramètre qui vérifie les mises à jour du système ne se bloque plus lorsqu'il attend une connexion (un délai d'attente l'empêche maintenant).\n \nLes mouvements entre les menus de réglages ont été réécrits, ils sont maintenant beaucoup plus fluides (vous pouvez aussi vous déplacer avec ZL/ZR et le D-pad gauche/droit)\n \nDe nouveaux paramètres uLaunch ont été ajoutés :\n \nVersion de uLaunch\n \nService audio utilisé par uLaunch\n \nRéinitialisation de l'application utilisée pour la prise de contrôle du homebrew (il n'y avait aucun moyen de le faire auparavant)\n \nLancer homebrew comme application par défaut (désactivé par défaut, ne prend effet que si une application de reprise est sélectionnée)\n \nDeux nouveaux sous-menus sont introduits... pour la prise en charge des périphériques audio Bluetooth ! Un sous-menu pour (dé)connecter/désapparier les appareils déjà appariés, et un autre pour rechercher de nouveaux appareils.\n \n \nThèmes\nNouveau numéro de version du thème : 3\n \nuLaunch est conçu pour essayer de rendre les thèmes aussi rétrocompatibles que possible, donc les thèmes précédents devraient fonctionner sans problème\nL'extension pour les thèmes est maintenant .ultheme au lieu d'un simple .zip (c'est toujours un fichier ZIP dans le contenu, cependant)\n \nuLaunch lui-même renommera automatiquement les thèmes .zip valides dans le répertoire themes \n \nuDesigner supportera le chargement des thèmes .zip et .ultheme, mais les sauvegardera sous .ultheme à partir de maintenant\n \nLes EntryIcons et OverIcons doivent être fournies en tenant compte du fait que les icônes de menu ont une taille de 384x384 dans le pire des cas (il était auparavant recommandé d'envisager une taille de 256x256).\n \nLes entrées de texte peuvent être configurées pour avoir une largeur maximale et animer leur affichage dans le cas contraire (voir la correction du texte de l'interface utilisateur ci-dessus) :\n \nUtilisation des options clamp_width, clamp_speed et clamp_delay\nUn nouveau SFX pour le menu des réglages a été ajouté : SettingMenuMove.wav\n \nDe nouveaux SFX pour le menu principal ont été ajoutés : MenuIncrement.wav et MenuDecrement.wav\n \nMaintenant, une version du thème par défaut avec DSi/Wii/3DS BGM/SFX sera incluse dans la version ! Vous pouvez maintenant la télécharger et expérimenter le thème par défaut d'une manière plus immersive \n \nThème par défaut\nLa partie supérieure du menu principal a été réorganisée pour afficher les titres des jeux de manière plus pratique.\n \nLes icônes ont été déplacées vers la partie droite\n \nLes couleurs d'arrière-plan (uniques pour l'application, le dossier, le homebrew, etc) ont été changées pour des couleurs plus attrayantes visuellement.\n \nMise à jour des EntryIcons, OverIcons et QuickIcons pour refléter la taille maximale de 384x384 des icônes. Pour certaines d'entre elles, le design / les couleurs de l'icône de base ont été changés pour des couleurs plus appropriées \n \nuSystem\nCode amélioré pour la détection du contenu ajouté ou supprimé\n \n \n \nTéléchargement : uLaunch 1.2.0\n \n \n \n \n\n \n \nEt en plus de cette nouvelle version de uLaunch, il a mis à jour Goldleaf en version 1.1.0 : \n \n \n \n \nChangelog v1.1.0\n \nGénéral\nMise à jour pour la dernière version de Plutonium (bibliothèque d'interface utilisateur) :\n \nLors de l'annulation d'un dialogue, l'option \"annuler\" est focalisée avant la fermeture (pour indiquer visuellement qu'il a été annulé).\n \nLa résolution par défaut est toujours de 1080p en interne (voir les conséquences ci-dessous)\n \nGoldleaf\nCorrection d'un problème où les couleurs d'arrière-plan personnalisées n'étaient pas correctement analysées par Goldleaf.\n \nGoldleaf est maintenant en 1080p ! Diverses modifications pertinentes de l'interface utilisateur ont été apportées dans cette version :\n \nLa palette de couleurs n'est plus générée aléatoirement au démarrage : il y a maintenant une palette de couleurs bleu clair/foncé par défaut (bien que vous puissiez toujours la personnaliser vous-même) ainsi que la couleur or du projet.\n \nDe nouvelles icônes sont utilisées partout (car j'ai dû en trouver de nouvelles qui avaient de bonnes résolutions)\n \nLes paramètres de Goldleaf ont (légèrement) changé : les noms des paramètres sont (légèrement) différents maintenant, et la personnalisation des couleurs est faite d'une manière plus organisée (consultez le README pour tous les détails)\n \nLe menu mémoire/espace a été réorganisé et occupe l'espace d'une manière plus attrayante sur le plan visuel.\n \nLes textes trop longs sont désormais bridés, afin qu'ils ne dépassent pas les limites prévues.\n \nLa taille des répertoires n'est désormais calculée que si un paramètre (désactivé par défaut) est activé, car cela entraînait des ralentissements lors de la sélection de grands répertoires à d'autres fins.\n \nLors de l'exportation/déversement du contenu, les noms contenant des caractères FS invalides (« : », « / » ou « ») sont désormais remplacés pour éviter les problèmes lors de la création du PSN exporté.\n \nSuppression de l'ancien système de gestion des crashs, qui ne fonctionnait que la moitié du temps et rendait les choses ennuyeuses : les crashs sont gérés comme un homebrew normal (avec l'écran de crash habituel du système), et des informations détaillées sur ce qui a causé le crash sont enregistrées dans le fichier journal de Goldleaf.\n \nLes icônes sont désormais des ressources partagées en interne (auparavant, pour chaque élément de menu/endroit où il était utilisé, une nouvelle copie de l'icône était chargée en mémoire), ce qui devrait réduire l'empreinte mémoire et améliorer quelque peu les performances.\n \nAjout de dialogues de confirmation au dialogue de mise hors tension/redémarrage, pour éviter que des pressions ZL/ZR non désirées ne provoquent des arrêts/redémarrages non désirés.\n \nL'utilisation du navigateur web n'est plus autorisée si Goldleaf n'est pas lancé en tant qu'application (sinon, cela ne fonctionnera pas et provoquera un plantage).\n \nLes dossiers ont désormais deux icônes différentes, ce qui permet de distinguer visuellement les répertoires vides des répertoires non vides.\n \nCorrection d'un bug où le message après l'exportation d'un ticket/certificat n'était pas affiché du tout (une longue boîte vide était seulement affichée)\n \nL'icône du menu « image » s'affiche désormais également pour les images PNG/WEBP (même si elles ne peuvent pas être définies comme icônes utilisateur).\n \nMise à jour de la reconnaissance de la génération de clés jusqu'aux derniers firmwares 20.0.0/20.0.1\n \nPour les tickets utilisés, le titre du jeu est affiché à la place de l'ID de l'application dans les éléments du menu des tickets (l'ID peut toujours être visualisé en sélectionnant un ticket donné).\n \nAjout d'un traitement spécial lors de la suppression d'un compte qui est également lié (la suppression nécessite qu'il soit d'abord dissocié, ce qui est maintenant fait automatiquement).\n \nAjout de messages spéciaux de description des résultats pour les codes de résultats dédiés (ceux qui n'ont pas de description précédente ou ceux pour lesquels la description de base n'était pas vraiment informative pour les utilisateurs).\n \nCorrection du calcul de l'ETA lors de la copie de répertoires (qui affichait des valeurs absurdes lors de la copie de plusieurs petits fichiers) de manière à ce qu'il affiche des valeurs quelque peu cohérentes.\n \nL'icône de l'utilisateur est à nouveau exportée après avoir été modifiée.\n \nCorrection d'un bogue qui empêchait la journalisation de se dérouler correctement dans certains menus.\n \nLes systèmes de fichiers montés sont désormais correctement éliminés lorsque l'on quitte Goldleaf.\n \nPresser Y lorsqu'un fichier est focalisé dans le navigateur de fichiers affichera également ses options (comme presser A, donc Y a le même comportement pour les fichiers et les répertoires)\n \nL'ancien système de contenu a été complètement remplacé par un tout nouveau menu de liste de jeux :\n \nIl ne prend plus en compte/liste le contenu du système NAND, car c'était une fonctionnalité inutile (et lente).\n \nLa lenteur du chargement des contenus a été réduite grâce à l'utilisation d'un code threadé à chargement paresseux et à la mise en cache de nombreux éléments.\n \nLes jeux et leur contenu sont désormais directement consultables, au lieu de devoir choisir des espaces de stockage.\n \nDes informations utiles pour le débogage et le développement sont également affichées (dernier événement enregistré et drapeaux d'affichage).\n \nLe calcul de la taille est désormais plus simple et direct.\n \nLe montage des données de sauvegarde a été corrigé pour les jeux qui utilisent les données de sauvegarde de l'appareil au lieu des données de sauvegarde par utilisateur (comme Animal Crossing : New Horizons).\n \nSi aucun utilisateur n'a encore été sélectionné, la tentative de montage des données de sauvegarde demandera directement de sélectionner un utilisateur, et le montera en cas de succès.\n \nLe menu des tickets a été déplacé dans le menu principal\n \nLe menu de mise à jour a été fusionné avec le menu « about » : vous pouvez maintenant vérifier les mises à jour en appuyant sur A sur la page « about ».\n \nCorrection d'un bug de dump replace-all où les chaînes anglaises disaient \"g_Clipboard\" au lieu de \"clipboard\".\n \nLes informations sur les tickets affichent désormais également la gamme de versions de génération de clés (pas seulement sur les informations d'installation de NSP).\n \nLes fichiers *.bin vides ne peuvent plus être lancés (ou plutôt, Goldleaf ne peut plus essayer de les lancer)\n \nLes transitions et les mouvements dans les menus ont été rendus légèrement plus rapides (pour plus de commodité) et avec plus d'icônes/messages dédiés pour chaque menu.\n \nLa visionneuse de texte a été légèrement améliorée, permettant de se déplacer horizontalement pour lire de longues lignes, et ne rendant que la partie visible de chaque ligne.\n \n \n \nTéléchargement : Goldleaf 1.1.0\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206571/in-switch-goldleaf-et-ulaunch-ont-ete-mis-a-jour-par-xortroll-1.png"
        }
    }
}