{
    "news_1": {
        "title": "[Switch] Moonlight Switch v1.1.0 disponible",
        "content": " \nLe développeur Xitrix vient de dévoiler une nouvelle version de Moonlight Switch, Moonlight Switch est un portage de Moonlight Game Streaming Project pour la Nintendo Switch.\n \n \n\n \n\n \n\n \n\n \nChangelog : \n \n- Correction de l’écran gris : Cette mise à jour résout le problème de l’écran gris qui pouvait survenir lors de l’utilisation de Moonlight-NX.\n- Correction des mouvements de souris incorrects : Les problèmes liés aux mouvements de la souris ont également été corrigés.\n- Défilement amélioré : L’interface utilisateur et le défilement sur un PC en streaming (défilement avec deux doigts) ont été améliorés.\n- Ajout d’un combo pour le bouton Guide : Par défaut, il s’agit de la combinaison Minus+Plus.\n- Personnalisation de la cartographie des boutons : Vous pouvez maintenant personnaliser les boutons et les touches de combinaison pour chaque jeu.\n- Fermeture du jeu en cours : Vous pouvez désormais fermer le jeu en cours et lancer un autre jeu même si un jeu est déjà en cours.\n- Nombreuses corrections et améliorations de l’interface utilisateur.\n- Ajout du paramètre Rumble Force\n- Améliorations de la prise en charge du multitouch\n- Correction de l'entrée gyroscopique\n- Correction du réglage du volume du pilote Audren\n- Correction des boutons du clavier USB\n- Correction de l'entrée de la souris USB\n- Prise en charge initiale d'iOS\n- Décodage iOS HW\n- Déclencheurs analogiques pour les appareils supportés\n- Recherche automatique d'hôtes rapide\n- Résolution native - résolution universelle qui démarre le flux avec les paramètres actuels de l'écran\n- Ouverture de la surcouche par un glissement du coin gauche pour pouvoir utiliser l'application en mode tablette (sans joystick)\n- Logos rafraîchis\n \n \nPour installer Moonlight-NX v1.1.0, suivez ces étapes :\n \n- Téléchargez la dernière version de Moonlight-NX.\n- Placez le fichier moonlight.nro dans le dossier sdcard:/switch/moonlight.\n- Lancez le menu Homebrew (hbmenu) pour accéder à la redirection des titres (pour un accès complet à la RAM).\n- Lancez Moonlight-NX.\n \n \nGuide d’installation :\n \n- Consultez d’abord le guide officiel de configuration.\n- Connectez votre PC et la Nintendo Switch au même réseau WiFi.\n- Dans Moonlight-NX, appuyez sur le bouton “Add new host” et entrez l’adresse IP de votre PC.\n- Associez Moonlight-NX à votre PC.\n \n \nTéléchargement : Moonlight-NX v1.1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191535/in-switch-moonlight-switch-v110-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191535/in-switch-moonlight-switch-v110-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1191535/in-switch-moonlight-switch-v110-disponible-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1191535/in-switch-moonlight-switch-v110-disponible-4.jpg"
        }
    },
    "news_2": {
        "title": "[PS5] PS Multi Tools v14.1.5 disponible",
        "content": "Le développeur SvenGDK propose une nouvelle version de PS Multi Tools, il vient de libérer la version 14.1.5 qui comme à son habitude apporte son lot de nouveautés. \n \nComme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n\n \n \n\n \n \nAvec la version 14.1.5, le développeur a proposé les évolutions suivantes : \n \n- Mise à jour PPPwn_cpp avec les derniers changements. \n- Correction d'un crash possible lors de l'installation de npcap\n- Ajout de plus d'options PPPwn\n- Nouvelle option \"Télécharger la dernière version de GoldHEN sur une clé USB\"\n \nTéléchargement : PS Multi Tools v14.1.5 \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191527/in-ps5-ps-multi-tools-v1415-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1191527/in-ps5-ps-multi-tools-v1415-disponible-2.png"
        }
    },
    "news_3": {
        "title": "[PS5] PCXSense v0.9.4 disponible",
        "content": "Suite à l'abandon du développement de DS4Windows, l'alternative la plus efficace est PCXSense, un logiciel permettant d'exploiter les DualShock 4 et DualSense sur votre PC.\n \nPCXSense est un projet open-source qui permet de traduire les entrées du contrôleur DualSense en signaux XInput, le rendant ainsi compatible avec n’importe quel jeu sur PC.\n \nLe logiciel dispose d'une interface graphique conviviale et facile à utiliser, cela est facilité aussi par la prise en charge du retour haptique, sachant que vous pouvez connecter votre DualSense via Bluetooth ou USB.\n \n \n \n\n \n \n \nLes manettes Gamecube sont également prises en charge (utile pour les émulateurs comme Dolphin), mais aussi celles de la Nintendo Switch, utiles pour Yuzu ou Cemu. \n \nPCXSense vérifie automatiquement les mises à jour et les installe sans intervention supplémentaire de votre part, et vous pouvez personnaliser votre expérience avec des profils personnalisés, le contrôle de la barre lumineuse...\n \nLe projet a encore des fonctionnalités à implémenter, telles que la prise en charge des Joycons et du pavé tactile. Si vous rencontrez des problèmes ou si vous souhaitez contribuer, n’hésitez pas à consulter le dépôt GitHub de PCXSense.\n \nCette version vise à corriger quelques bugs, et des plantages lié aux noms de profils noms, mais aussi quelques problèmes liés à l'utilisation de Cemu, Dolphin et Yuzu. \n \n \nTéléchargement : PCXSense Beta 0.9.4\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191524/in-ps5-pcxsense-v094-disponible-1.gif"
        }
    },
    "news_4": {
        "title": "[Switch] NX Venom le pack pour overclocker sous Atmosphère",
        "content": " \nNX Venom est un pack qui intègre tout un tas d'outils et de ressources qui vont vous permettre de pousser les performances de votre console, avec notamment l'appui de l'overclock. \n \nBien entendu overclocker votre console n'est pas sans conséquence, cela présente un risque pour vos données, sachant que Horizon OS n'a pas été prévu pour cela, et qu'il est conseillé de faire cela uniquement dans emuMMC. \n \n \n\n \n \nVoici quelques détails importants :\n \nInstallation : \n- Faites une sauvegarde et supprimez tout sauf les dossiers Nintendo et emuMMC sur la carte SD.\n- Décompressez NX Venom à la racine de la carte SD.\n- Utilisez un lecteur de carte ou allez dans Hekate → Outils → Outils USB.\n- Utilisez l’application homebrew All-in-One Switch Updater pour les mises à jour.\n- L’installation de logiciels supplémentaires et de correctifs pour les jeux se fait via le menu UberHand (cliquez à droite) → Installateur de logiciels.\n \nUtilisation :\n- Ouvrez le menu UberHand (ou quittez le Status Monitor) en appuyant sur ZR + ZL + Bas.\n- Utilisez la superposition sys-clk-oc pour gérer l’overclocking.\n- Utilisez le EOS Wizard pour modifier les paramètres du kip de chargement.\n- Utilisez judicieusement les paramètres d’overclocking recommandés pour le mode portable et l’autonomie de la batterie :\n- CPU : 1020 - 1428\n- GPU : 768 - 921\n- RAM Max : 2133 - 2400 (pour Mariko) et 1862 - 2131 (pour Erista)\n \nMises à jour récentes (version 4.4.5) :\n- 1305 MHz est désormais disponible uniquement si la planification GPU est activée (pour les consoles Mariko).\n- Ajout d’une étape de tension DVB supplémentaire (pour les consoles Erista).\n- CPU UV2&3 permet d’atteindre 2295 MHz (pour les consoles Erista).\n- Prise en charge de Switchcraft 1.2.1 dans SC Wizard.\n- Option de planification GPU ajoutée (désactivée par défaut)2.\n \n \nTéléchargement : NX Venom v4.5.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191520/in-switch-nx-venom-le-pack-pour-overclocker-sous-atmosphere-1.jpg"
        }
    },
    "news_5": {
        "title": "[Switch] L'UnlockSwitch MSK se montre enfin avec son programmeur",
        "content": "Ca y est voilà enfin l'UnlockSwitch MSK (le linker) ainsi que son programmeur, l'équipe UnlockSwitch a dévoilé un long message rappelant ce que l'on savait déjà plus ou moins, sans très grande nouveauté, mais la plus importante d'entre elles est arrivée avec la mise en ligne des deux premières photos.\n \nL'UnlockSwitch MSK est une solution open-source, aucun fichier ou code ne vous sera fourni. Vous aurez un contrôle total sur votre linker, y compris les mises à jour des deux composants sur le circuit imprimé et les mises à jour du firmware, avec d'autres améliorations en cours de développement. Cette fonctionnalité est facilitée par le programmateur UnlockSwitch et son logiciel complémentaire, le logiciel de programmation UnlockSwitch, qui est fourni sans frais supplémentaires.\n \n \n\n \n \nSelon UnlockSwitch plusieurs équipes sont en cours du développement de la solution software, et des tests seront effectués pour proposer plusieurs possibilités. La production de masse permettra de fournir un volume suffisant. \n \n \n\n \n \nL'objectif principal pour le lancement est de dévoiler l'UnlockSwitch ainsi que sa solution de sauvegarde des jeux. Le travail sur le Xtractor est actuellement en cours sachant que la team s'engage à fournir une solution 2 en 1 :  \n \n \n- Permettre aux utilisateurs de sauvegarder leurs jeux de manière indépendante\n \n- Fournir une cartouche pour exécuter leurs jeux.\n \n \nLa team indique vouloir laisser les solutions de piratage à la concurrence, ce n'est tout simplement pas l'objectif de la team UnlockSwitch. Elle indique également qu'elle souhaite un boitier redessiné éliminant le besoin d'une petite vis, une nouvelle conception du circuit imprimé, un nouveau bouton a été ajouté sur la cartouche pour la sélection des jeux, ainsi qu'une antenne Wi-Fi intégrée est maintenant directement incorporée sur le circuit imprimé. Enfin comme nous pouvons le voir sur la photo a été introduit un connecteur pour la liaison avec le programmateur UnlockSwitch.\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191493/in-switch-lunlockswitch-msk-se-montre-enfin-avec-son-programmeur-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191493/in-switch-lunlockswitch-msk-se-montre-enfin-avec-son-programmeur-2.jpg"
        }
    },
    "news_6": {
        "title": "[PS4] L'interface GUI DroidPPPwn v1.1 disponible",
        "content": " \nDroidPPPwn est une nouvelle application Android qui permet d’exécuter l’exploit PPPwn sur la console PlayStation 4 en utilisant votre smartphone. \n \nDroidPPPwn est une interface graphique (GUI) pour l’exploit PPPwn sur PS4, elle inclut le binaire PPPwn_cpp spécifiquement compilé pour arm-android, ainsi que les fichiers stage1.bin et stage2.bin pour tous les firmwares pris en charge (du firmware 7.00 au 11.00). \n \n \n\n \n \n \nPour les firmwares 9.00, 10.00, 10.01 et 11.00, le stage2.bin est construit à partir du Github de Sistr0, ce qui vous permet de charger des payloads personnalisés tels que GoldHEN. Pour tous les autres firmwares, le stage2.bin est construit à partir du code original de PPPwn, ce qui en fait actuellement davantage une poc (une preuve de concept) affichant “PPPwned” sur la PS4. \n \nVous pouvez également utiliser votre propre stage2.bin en le plaçant à la racine de votre carte SD via la commande push stage2.bin /sdcard/.\n \nExigences :\n \n- Un téléphone Android récent rooté prenant en charge l’OTG.\n- Un câble ou un adaptateur USB OTG.\n- Un adaptateur USB Ethernet.\n- Un câble Ethernet.\n \nUtilisation :\n \n- Téléchargez la dernière version depuis ce dépôt et installez-la sur votre téléphone Android.\n- Sur votre PS4, suivez les instructions de l’exploit PPPwn original pour configurer la connexion Ethernet.\n- Lancez l’application DroidPPPwn et sélectionnez le firmware de votre PS4.\n- Appuyez sur le bouton “Start” dans l’application et simultanément sur la touche “X” de votre manette lorsque vous êtes sur l’écran de test de la connexion Internet.\n- Attendez que l’exploit atteigne l’étape 4 et que le message s’affiche sur votre écran. Si l’exploit échoue, appuyez à nouveau sur le bouton “Start” pour l’arrêter et répétez la dernière étape.\n \n \n \n\n \n \n \nBug connus : Sur certains anciens appareils armv7, lors de l’installation de l’APK, le contenu du dossier “lib” n’est pas copié dans le dossier interne de l’application. Vous pouvez résoudre ce problème en extrayant les fichiers du fichier pppwn.jar (en choisissant entre lib/armeabi-v7a/* et lib/arm64-v8a/* en fonction de votre architecture) et en les transférant manuellement dans /data/data/it.deviato.droidpppwn/lib/. N’oubliez pas de donner les permissions d’exécution à pppwn avec la commande chmod 755 pppwn. \n \n \nChangelog (version 1.1) :\n \n- Ajout de la prise en charge des processeurs 32 bits arm-v7a avec un binaire séparé pour pppwn.\n- Refonte complète du projet en abaissant la version minSdk à 19, ce qui lui permet de fonctionner sous Android KitKat 4.4+.\n- Remplacement de stage2.bin pour les firmwares pris en charge par ceux du référentiel Sistr0 pour permettre le chargement de charges utiles.\n- Possibilité d’utiliser votre propre stage2.bin.\n- Autres petites corrections.\n \n \n \nTéléchargement : DroidPPPwn v1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191469/in-ps5-linterface-gui-droidpppwn-v11-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[Switch] L'UnlockSwitch MSK se montre enfin",
        "content": "Encore une fois, suite aux grandes annonces de Mig Switch ou désormais de l'équipe en charge du développement de MiGDIY 2, nous nous attendions à une grande annonce, bon ben finalement pas grand chose, mais on va dire l'essentiel. \n \nLa team avait annoncé que ce lundi nous allions voir le linker, dans les faits l'équipe vient de dévoiler une photo de la face arrière du PCB du linker. \n \n \n\n \n \nOn peut enfin dire qu'on a du concret, même si cela a mis du temps, voilà donc l'image du PCB du UnlockSwitch. Il est délicat de se faire une opinion sur une simple image il faudra s'en contenter pour le moment, sachant que la team annonce que ce n'est que le début de nombreuses annonces. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191467/in-switch-lunlockswitch-msk-se-montre-enfin-1.png"
        }
    },
    "news_8": {
        "title": "[PS5] Le nouveau payload websrv permet la lecture streaming",
        "content": "Le développeur John Tornblom que l'on ne présente plus vient de mettre en ligne une nouvelle version de son payload websrv à destination des PS5 jailbreakées. \n \nCe payload lorsqu'il est injecté permet d'éxecuter un simple serveur web, cependant il permet beaucoup de choses, puisqu'il permet de lancer des homebrews via le webkit ou bien à distance via un PC, smartphone ou des appareils compatibles. Dans une vidéo, le développeur dévoile les capacités de cette nouvelle version, et c'est plutôt intéressant. \n \n \n\n \n \n \nChangelog 0.3 : \n \n- Ajout de la prise en charge du streaming des URL https avec FFplay\n- Ajout d'un homebrew pour diffuser des émissions de radio en direct depuis sr.se\n- Ajout d'un homebrew pour diffuser des émissions de télévision en direct à partir de svtplay.se\n- Ajout d'un package PS5 qui place une icône sous « média » sur votre tableau de bord avec lequel le lanceur homebrew peut interagir. Merci TeRex777 pour l'avoir mis en place !\n \n \nTéléchargement : PS5 websrv v0.3\n \n",
        "images": {}
    },
    "news_9": {
        "title": "[PS4] Apollo Save Tool PS4 est désormais compatible avec le firmware 11.00",
        "content": " \nLe développeur Bucanero, Damian Parrino, propose depuis quelques heures une toute nouvelle version de son logiciel Apollo Save Tool à destination de la PS4. L'objectif est d'apporter le support du firmware 11.00.\n \nPour rappel, Apollo Save Tool est ce que l'on appelle un must-have sur PS4, ce logiciel permet de sauvegarder, resigner, corriger, télécharger, ou encore déverrouiller les fichiers de sauvegardes des jeux sans avoir à passer par des outils complexes, et tout se fait directement sur la console. \n \n \n\n \n \nAu delà du support du firmware 11.00, le développeur a intégré de nouveaux cheats codes, et divers bugs ont été corrigés qui ont été listé dans le changelog ci-dessous.\n \n\n \nAdded : \n11.00 firmware support (thanks to @LightningMods @SocraticBliss)\nNew cheat codes\n- Like a Dragon: Ishin!\n- Unicorn Overlord\nCustom save decryption support\n- Like a Dragon: Ishin!\n- Metal Gear Solid 5: Ground Zeroes\n- The Last of Us: Part II\n- Uncharted: Drake's Fortune Remastered\n- Uncharted 2: Among Thieves Remastered\n- Uncharted 3: Drake's Deception Remastered\n- Uncharted 4: A Thief's End\n- Uncharted: The Lost Legacy\nCustom checksum support\n- Dead Rising\n- Like a Dragon: Ishin!\n- Strider\n- The Last of Us: Part II\n- Uncharted: Drake's Fortune Remastered\n- Uncharted 2: Among Thieves Remastered\n- Uncharted 3: Drake's Deception Remastered\n- Uncharted 4: A Thief's End\n- Uncharted: The Lost Legacy\n \nFixes\n- Patch Code fixes\n- Metal Gear Solid 5: The Phantom Pain\n \nMisc\n- Updated Apollo Patch Engine to v1.0.0\n- Add jenkins_oaat, lookup3_little2 hash functions\n- Add camellia_ecb encryption\n- Add RGG Studio decryption (PS4)\n- Add Dead Rising checksum\n- Fix SaveWizard Code Type D issue with CRLF line breaks\n- Changed BSD command syntax for decompress(offset, wbits) and compress(offset)\n \n \n \n\n \n\n \nTéléchargement : Apollo Save Tool v1.4.4\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191451/in-ps4-apollo-save-tool-ps4-est-desormais-compatible-avec-le-firmware-1100-1.jpg"
        }
    },
    "news_10": {
        "title": "[Switch] L'émulateur Switch Sudachi disponible en v1.0.1",
        "content": "L'émulateur de Nintendo Switch Sudachi est désormais disponible en version 1.0.1, pour rappel il s'agit d'un nouvel émulateur qui supporte Android, Linux, macOS et Windows. Comme vous pouvez vous en doutez il se base sur Yuzu et va encore plus loin. \n \n \n\n \n \nChangelog : \n \n- Compilation Android corrigée : Les erreurs de compilation sur Android ont été résolues en enveloppant les paramètres pour RebootlessSystemUpdateVersion entre accolades.\n- Stubs SSL ajoutés : Des stubs GetNextAlpnProto et SetNextAlpnProto ont été ajoutés pour résoudre certains problèmes avec les jeux qui tentent de communiquer avec des serveurs.\n- Correction des paramètres système : Le plantage lors de l’accès à la page de support/santé et sécurité dans les paramètres système a été résolu.\n- Compatibilité améliorée : Le jeu Paper Mario: The Thousand Year Door est désormais fonctionnel.\n \n \nTéléchargement : Sudachi 1.0.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191448/in-switch-lemulateur-switch-sudachi-disponible-en-v101-1.png"
        }
    },
    "news_11": {
        "title": "[PS4] PS4Debug adapté au firmware 11.00",
        "content": "Un temps développé par Jogolde, puis par GianPluto sur le 6.72, puis par ChendoChap sur le firmware 7.02, ensuite repris pas Joonie86 sur le firmware 7.55, puis par Kmeps4 qui avait pris le relai sur le firmware 9.00, voilà que c'est désormais golden qui a adapté PS4Debug pour le firmware 11.00. \n \nComme vous le savez, PS4Debug est un débogueur pour la PlayStation 4. Vous trouverez des outils très utiles en ligne ou sur le canal source discord de la PS4. \n \n \n \n\n \n \nCette nouvelle version v1.1.16, a été également mise à jour par ctn123 & SiSTRo, l'idée étant d'ajouter le support du firmware 11.00 et bientôt pour le mode repos. \n \nLe support du 11.00 n'est pas le seul a être ajouté puisque sont pris en charge également le 9.00, 9.60, 10.00 et le 10.01. \n \nTéléchargement : PS4Debug v1.1.16\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191442/in-ps4-ps4debug-adapte-au-firmware-1100-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] Le clone chinois du Mig Switch se nomme MiGDIY 2",
        "content": " \nLa team UnlockSwitch en avait parlé il y a quelques semaines lors de sa lettre ouverte, et bien le voici, le premier vrai clone du Mig Switch qui est visible dans une vidéo. \n \nLa version chinoise du clone du Mig Switch se nomme MiGDIY 2, elle est identique à la version v1 du Mig Switch, sauf qu'il dispose d'un bouton permettant de réaliser une glissade sur le haut du linker permettant de changer de jeu.\n \n \n\n \n\n \n\n \n \nLa vidéo ci-dessus montre la manipulation à 1 min 30, et permet ainsi de limiter les injections / éjections sur le chariot de chargement des jeux. \n \nPour le moment, pas d'information sur la disponibilité d'un site spécialisé mais le profil Twitter se charge de photos et de vidéo, il est déjà vendu en chine contre 559 yuans, soit environ 70 euros, et risque de faire de l'ombre au Mig Switch dont il en est une copie revendiquée, avec l'évolution de la v2 qui vient tout juste d'être annoncée.\n \n \n \n\n \n \n\n \n \n\n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-96552319.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-429274974.png",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-329184751.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] Et UnlockSwitch montre ses images de conception",
        "content": "Comme prévu également, la team UnlockSwitch a montré deux images de conception de son linker qui va concurencer le Mig Switch (la v2 remplaçant directement la v1 il ne sera plus nécessaire de distincter les deux versions sur le linker russe). \n \nNous nous attendions a une grande annonce, peut être à voir le produit ou un des samples de la UnlockSwitch, mais rien de tel, deux images de conception qui finalement ne disent pas grand chose, il faudra s'en contenter pour le moment. \n \nLa Team UnlockSwitch réagissant beaucoup aux commentaires, nous allons voir cela ensemble. Tout à commencé il y a quelques heures, la team UnlockSwitch a attendu l'annonce de Mig Switch pour dévoiler le design de la première version d'UnlockSwitch.\n \nLe produit se nomme MSK UnlockSwitch, et la team annonce vouloir dévoiler les photos lundi, pourquoi attendre... rien d'annoncé, pas de spécifications, pas de roadmap, pas de précommande ou de date de disponibilité, face à la v2 du Mig Switch, c'est un peu léger, mais ces images de conception confirme qu'un programmeur (le PCB noir) est aussi en conception.\n \n \n\n \n \nLe premier PCB rouge est celui du linker à proprement parler, et le second est celui du programmeur (pas du dumper) qui permettra de flasher le linker. On peut y voir une antenne WiFi, et le câble de connexion du dumper sera inclus. \n \n \n\n \n \nLa partie orange que l'on découvre sur le PCB rouge est le connecteur qui relie le programmeur (le PCB noir) avec un câble qui sera inclus.\n \nL'équipe dit avoir une réunion aujourd'hui pour préparer certainement le lancement de ce nouveau produit, elle annonce aussi avoir choisi 10 personnes de plus pour le tester (ce qui porte maintenant à 20 personnes le nombre de testeurs), nous verrons bien si le délai de la semaine prochaine est maintenu pour la phase de test, et si lundi l'équipe montrera la version finale de la première version. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191404/in-switch-et-unlockswitch-montre-ses-images-de-conception-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1191404/in-switch-et-unlockswitch-montre-ses-images-de-conception-2.png"
        }
    },
    "news_14": {
        "title": "[Switch] La Mig Card v2 est finalement là et remplace directement la v1",
        "content": "Comme prévu la team Mig Switch annonce sa Mig Card V2, il s'agit de la deuxième version de leur linker, elle est enfin là. \n \n \n\n \n \nVoilà l'annonce officielle : \n \n \n\" La carte Mig Switch \"V2\", notre première révision matérielle, est maintenant en production et remplace la version originale \"V1\". A partir de maintenant, nous ne fabriquons plus que cette nouvelle version, qui comporte un bouton qui change la donne.\n \nUne pression rapide sur le bouton vous permet de passer au jeu suivant sur votre microSD, et une pression longue de revenir au jeu précédent.\n \nParce que vos demandes étaient assez unanimes, nous avons décidé d'arrêter la \"V1\", donc toute nouvelle commande ou commande en cours recevra maintenant cette nouvelle version.\n \nLes propriétaires de \"V1\" n'ont pas à s'inquiéter, leur carte sera mise à jour exactement comme la \"V2\" et bénéficiera des mêmes nouvelles fonctionnalités que la \"V2\" lors des prochaines mises à jour. Seule la méthode de changement de jeu sera différente.\n \nEt pour tous les nouveaux clients ou ceux qui attendent leur carte Mig Switch, nous espérons que vous apprécierez cette nouvelle façon de naviguer entre vos jeux !\n \nDes échantillons sont en cours d'envoi aux testeurs, et vous verrez les premières évaluations indépendantes la semaine prochaine. \"\n \n \nBref, nous le voyons la team Mig Switch tient ses promesses, reste plus qu'à assurer les livraisons, pas de nouveauté annoncée, cela laisse supposer que peu d'évolution interne ont été opérés, à part le switch intégré. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191384/in-switch-la-mig-card-v2-est-finalement-la-et-remplace-directement-la-v1-1.png"
        }
    },
    "news_15": {
        "title": "[Switch] Le Mig Switch 2 se dévoile en images",
        "content": " \nComme prévu NickMoses a dévoilé son sneak peak sur la toute nouvelle version du Mig Switch, appelé aussi Mig Switch 2, un sneak peak c'est un aperçu, un aperçu uniquement visuel puisqu'il s'est contenté de dévoiler deux images et c'est déjà pas mal en attendant demain l'annonce officielle. \n \n \n\n \n\n \n \nNous pouvons donc voir la nouvelle version du Mig Switch la face avant et la face arrière sans le sticker, ce que l'on découvre c'est un boitier noir, un PCB bleu, et surtout le désormais célèbre bouton qui permettra enfin de changer de jeux. Nous remarquons également toujours la présence de la vis centrale, reste à voir si les puces seront effacées et si l'utilisation en elle même sera différente. \n \n \n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191343/in-switch-le-mig-switch-2-se-devoile-en-images-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1191343/in-switch-le-mig-switch-2-se-devoile-en-images-2.png"
        }
    },
    "news_16": {
        "title": "[Switch] L'équipe Mig Switch va annoncer sa V2 et propose une mise à jour firmware de la V1",
        "content": "L'équipe Mig Switch vient d'annoncer une \"V2\" de son linker qui se destine comme vous le savez à la Nintendo Switch, une forme de concurrence s'est imposé avec UnlockSwitch même si ce dernier n'a pour l'heure pas encore été dévoilé officiellement, plus que quelques jours à attendre. \n \nDeadSpecimen et Nick Moses confirment qu'ils ont eu quelques informations sur cette nouvelle version du linker, l'intégration du bouton qui permet de changer de jeu, sans avoir la contrainte de réaliser la manipulation d'éjection, mais ce n'est probablement pas tout. \n \n \n\n \n \nL'équipe russe vient de dévoiler une mise à jour firmware 1.1.4 pour ce que nous appelerons désormais la version 1 du Mig Switch, elle permet d'élargir le support des cartes microSD a de nombreuses marques, mais surtout dans son message, la team annonce que Samedi elle annoncera cette nouvelle version \" Restez à l'écoute, car ce samedi, nous aurons une annonce officielle pour notre mise à jour la plus demandée qui arrive enfin bientôt \" . \n \nCe week-end va donc être assez chaud, car les deux équipes vont annoncer leur produit en même temps. Depuis quelques temps, la team Mig Switch semble subir des ruptures occasionnant des retards dans les livraisons.\nAu sujet du Mig Switch 2, un appui court et un appui long permettront d'avancer et de reculer dans les jeux installés sur la carte SD.\n \n \nTéléchargement : migswitch.com\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191262/in-switch-lequipe-mig-switch-va-annoncer-sa-v2-et-propose-une-mise-a-jour-firmware-de-la-v1-1.png"
        }
    },
    "news_17": {
        "title": "[PS3] La 9eme Bêta du CFW Evilnat 4.91.2 PEX/D-PEX est là",
        "content": "Le développeur Nathan Martin a récemment publié la neuvième version bêta de son CFW Evilnat 4.91.2 pour les PlayStation 3. Cette mise à jour inclut plusieurs nouvelles fonctionnalités, notamment de nouvelles corrections suite à la mise en test de la huitième version.\n \nIl a donc opérer quelques modifications, et surtout des corrections importantes, cette nouvelle version ayant été testée notamment par Zecoxao qui a largement contribué à faire évoluer le CFW. A l'heure où nous écrivons les version CEX, D-PEX, DEX et PEX sont proposées, les déclinaisons noBD/noBT/Overclock ne sont pour le moment pas en ligne. \n \n \n \n\n \n \n \nVoici le changelog par rapport à la version précédente : \n \n- Vérification externe du kernel corrigée lors de l’utilisation de l’option [Swap Kernel] en PEX/D-PEX\n- Écran noir aléatoire corrigé lors de l’activation des QA Flags\n- Mises à jour avancés des QA Flag (grâce à Zecoxao et Soul)\n- Code d’erreur 0x800299D2 et écran noir corrigés (lecture Blu-ray/DVD en mode CEX/DEX)\n- Option [Activer le mode OFW au démarrage] mise à jour pour permettre la restauration automatique des system calls\n- PlayStation Home ajouté (par DeViL303)\n- eula_cddb_plugin.rco personnalisé ajouté (par DeViL303)\n \n \nTéléchargement : CFW Evilnat 4.91.2 Beta 9\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191216/in-ps3-la-9eme-beta-du-cfw-evilnat-4912-pexd-pex-est-la-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS4] PPPwnUI Release 3.0 disponible et ajoute le support de Linux",
        "content": "Les propositions autour de PPPwn sont nombreuses, dans un peu plus d'une semaine le développeur TheFlow présentera officiellement ses recherches, mais les avancées sont nombreuses depuis qu'il a dévoilé son hack. \n \nPPPwnUI version 3.0 est disponible et s’est encore amélioré ! Ce programme ajoute une interface utilisateur (UI) à l’exploit PPPwn créé par TheFlow. L’interface graphique proposée par Memz a été largement optimisée ces derniers jours, notamment avec les ajouts récents. De plus, l’outil a été mis à jour pour intégrer le support de GoldHEN_v2.4b17.2 de SiSTR0. \n \n \n \n\n \n \n \nVoici les principales modifications apportées dans cette version PPPwnUI version 3.0 :\n \n- Prise en charge de Linux pour l’interface utilisateur (UI) : La dernière version inclut désormais une compatibilité avec Linux, permettant aux utilisateurs d’exécuter PPPwnUI sur des systèmes Linux.\n- Mises à jour GoldHEN : Le programme intègre la dernière version de GoldHEN (2.4b17.2), améliorant la compatibilité et les performances.\n- Options de firmware GoldHEN étendues : Les options de firmware GoldHEN ont été élargies pour inclure les versions 10.00 et 10.01.\n- Prise en charge étendue des firmwares : PPPwnUI prend désormais en charge les firmwares 7.00, 7.01 et 7.02.\n- Nettoyage et optimisation :\n- Les fichiers inutilisés ont été supprimés.\n- Les scripts redondants ont été remplacés par le script officiel de TheFlow.\n- Un grand merci à Aldostools d’avoir rendu cette mise à jour possible !\n \n \nTéléchargement : PPPwnUI 3.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191215/in-ps4-pppwnui-release-30-disponible-et-ajoute-le-support-de-linux-1.png"
        }
    },
    "news_19": {
        "title": "[PS4/PS5] PS Multi Tools v14.1.4 disponible",
        "content": " \nLe développeur SvenGDK a proposé successivement ces derniers jours de nombreuses évolutions pour sa solution PS Multi Tools, il a en effet offert au public la semaine dernière la v14.1.2 et 14.1.3, et il y a quelques heures il a livré la v14.1.4.\n \n \n\n \n \n \n\n \n \nChangelog PS Multi Tools v14.1.4 : \n \nPS4 :\n \n- Outil PPPwner\n- Mise à jour de PPPwn++ avec les derniers changements (20 mai 2024)\n- Mise à jour des fichiers SiSTRo/GoldHEN stage2 pour FW 9.00 & 11.00\n- Ajout de fichiers SiSTRo/GoldHEN stage2 et support pour FW 10.00 & 10.01\n- Mise à jour de GoldHEN en v2.4b17.2\n- Cette mise à jour supporte maintenant GoldHEN sur les firmwares 10.00 & 10.01\n \nPS5 :\n- Téléchargeur de correctifs de jeux\n- Correction d'un crash possible lors du chargement du téléchargeur de correctifs de jeux.\n \nChangelog PS Multi Tools v14.1.3 : \n \nGénéral :\n- Changement mineur de l'Updater\n- Ne pas télécharger à nouveau l'Updater s'il existe déjà (PSMT-Update.exe)\n \nPS4 :\n- Mise à jour de PPPwn avec les derniers changements (14 mai 2024)\n \n \nChangelog PS Multi Tools v14.1.2 :\n \nPS3 & PS Vita\n- PKG Browser & Downloader\n- Correction d'un crash lors d'une recherche par Nom / Titre ID ou Contenu ID (survenait lorsqu'aucune base de données n'était chargée)\n \nPS4\n- Mise à jour de l'interface graphique de PPPwn pour PS4\n- Remplacement de la version Python de PPPwn par PPPwn c++ (cela peut générer un faux positif \"Trojan:Win32/Wacatac.B!ml\" dans MS Defender)\n- Ajout du support pour FW 7.50 / 7.51 / 7.55 / 8.00 / 8.01 / 8.03 (PoC uniquement)\n- Ajout d'une sortie de journal\n- Ajout d'une nouvelle option \"Auto-Retry\" à partir de PPPwn c++\n- La sélection de l'adaptateur Ethernet affiche maintenant plus d'informations\n \n \nTéléchargement : PS Multi Tools v14.1.4\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191185/in-ps4ps5-ps-multi-tools-v1414-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191185/in-ps4ps5-ps-multi-tools-v1414-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS4] Le payload GoldHEN v2.4b17.2 disponible avec support 10.00 et 10.01",
        "content": "Bonne nouvelle pour ceux qui sont bloqués sur le firmware 10.00 ou 10.01 en raison d'une corruption ou défaillance de leur lecteur blu-ray, ils vont pouvoir profiter de l'exploit PPPwn en utilisant le payload GoldHEN. \n \nLe développeur Sistr0 a en effet rajouté les bons offsets afin de rendre son payload GoldHEN compatible sur les deux firmwares 10.00 et 10.01. Un travail est aussi en cours sur le firmware 9.60 mais cela semble un peu plus complexe. \n \n \n\n \n \nComme d'habitude, la version personnalisé du stage2 cherchera le payload qui sera présent en racine d'une clé USB, et si elle la trouve, il sera copié sur le disque dur interne permettant ainsi de se passer de la clé USB.\n \nActuellement les versions 9.00, 10.00, 10.01 et 11.00 sont supportées, en plus des 5.05, 6.71 et 6.72, sachant qu'il a libéré le tout sur Github. \n \nTéléchargement : GoldHEN v2.4b17.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-872062260.png"
        }
    }
}