{
    "news_1": {
        "title": "[PS3] CFW Flash Writer d'Aldostools pour le firmware 4.91",
        "content": "Le développeur Aldostools propose sa version de CFW Flash Writer supportant HFW 4.91 pour la PlayStation 3. Bien entendu, il s'agit d'une version non officielle, le logiciel étant à l'origine proposé par esc0rtd3w \n \n Cela peut être un candidat secondaire pour permettre l'installation de Custom Firmware lorsque le PS3Toolset de bguerville (https://www.ps3toolset.com/bgtoolset/) n'est pas accessible ou une option hors ligne d'auto-hébergement. \n \n \n\n \n \nFlash writer permet d'installer un CFW à partir du 4.91 OFW une fois le firmware hybride installé, cependant, Ps3toolset reste la méthode préférée et la plus sûre lorsqu'il est disponible pour pirater votre modèle de PS3 afin qu'il soit prêt pour les installations de Custom Firmware PS3.\n \nCette version de \"PS3Xploit\" Flashwriter 4.91 préparée par Aldostools a été testée sur NOR et NAND. \n \n \nTéléchargement : CFW Flash Writer d'Aldostools pour l'HFW 4.91\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193436/in-ps3-cfw-flash-writer-daldostools-pour-le-firmware-491-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS4/PS5] Pourquoi TheFlow ou TyphoonCon ne publient rien au sujet de la conférence PS4 et PS5",
        "content": "La conférence Typhoon aura largement attiré les regards, il faut dire que le plus célèbre des hackers, TheFlow, y a participé pour tenir une présentation qu'on se délectait de découvrir, cependant rien n'a été dévoilé ou juste une photo que nous vous avions montré, avec la vision sur un slide de la trentaine que doit contenir celle de TheFlow. \n \n \n\n \n \nPourquoi presque 2 mois après la présentation rien n'a été dévoilé ? \n \nLa première des explications est que TyphoonCon, malgré le fait d'avoir bien entendu filmé avec deux caméras (une en face, et une sur le côté droit de TheFlow), n'a pas obtenu encore l'autorisation du hacker. La seconde est que TheFlow lui même n'a pas encore donné son accord de diffusion. Il l'a fait précédemment en dévoilant directement ses présentations sur son github, il le fera mais pas encore. \n \n \n\n \n \nMais pourquoi alors ne pas diffuser ? \n \nEn cherchant un peu des nouvelles images de cette présentation, nous sommes tombés sur les Highlights de la TyphoonCon qui pour rappel s'est tenue du 30 au 31 Mai 2024 à Séoul.\n \n \n\n \n \nDans cette vidéo, on voit bien à 01.00 min de la vidéo ci-dessous que TheFlow est filmé sous un autre angle que celui de la photo officielle, ce qui confirme la présence de la seconde caméra. \n \n \n \n\n \n \n \nMais alors pourquoi ne pas dévoiler ses vidéos ou sa présentation ? \n \nCe n'est pas la peur de Sony ou la remontée des failles, car ça on a bien compris depuis longtemps que TheFlow et Sony sont en lien de coopération, Sony préférant rémunérer les génies plutôt que de leur faire des procès comme Nintendo. Cependant la seule explication rationnelle que l'on peut admettre est que TheFlow a une autre présentation le 28 Septembre 2024. \n \n \n\n \n \nEn effet se tient une autre conférence, la RomHack 2024 à Rome (Italie) où TheFlow va intervenir pour présenter la \" PlayStation 4 Remote Kernel Exploitation \", probablement la même présentation que celle qu'il a effectué à la TyphoonCon. A noter aussi la présence de celui qui a proposé mast1c0re, McCaulay Hudson, même si sa présentation n'aura aucun lien avec son exploit. \n \n \n \n\n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193404/in-ps4ps5-pourquoi-theflow-ou-typhooncon-ne-publient-rien-au-sujet-de-la-conference-ps4-et-ps5-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1193404/in-ps4ps5-pourquoi-theflow-ou-typhooncon-ne-publient-rien-au-sujet-de-la-conference-ps4-et-ps5-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1193404/in-ps4ps5-pourquoi-theflow-ou-typhooncon-ne-publient-rien-au-sujet-de-la-conference-ps4-et-ps5-1.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1193404/in-ps4ps5-pourquoi-theflow-ou-typhooncon-ne-publient-rien-au-sujet-de-la-conference-ps4-et-ps5-2.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1193404/in-ps4ps5-pourquoi-theflow-ou-typhooncon-ne-publient-rien-au-sujet-de-la-conference-ps4-et-ps5-3.png",
            "image_6": "https://www.logic-sunrise.com/images/news/1193404/in-ps4ps5-pourquoi-theflow-ou-typhooncon-ne-publient-rien-au-sujet-de-la-conference-ps4-et-ps5-3.jpg"
        }
    },
    "news_3": {
        "title": "[PS4] Sony sort le firmware officiel 11.52 pour la PS4",
        "content": "Sony vient de mettre en ligne une mise à jour pour nos PS4, il s'agit du firmware 11.52, certains utilisateurs PS4 Pro se plaignent déjà de cette mise à jour les obligeant à passer en mode sans échec pour faire l'update via une clé USB. Il peut s'agir de cas isolés, mais sachez qu'une fois n'est pas coutume Sony a publié un changelog. \n \n \n\n \n \nNotes de patch Version 11.52 :\n \n- Nous avons amélioré les messages et la convivialité sur certains écrans.\n- Nous avons apporté quelques correctifs de sécurité au logiciel système.\n \nBon, pas de quoi s'extasier non plus, mais il est probable que cette mise à jour vise à corriger une faille.\n \n \nComme toujours, le mieux est de ne pas mettre à jour votre console en la débranchant d'internet et en la protégeant avec un bloquer de mise à jour proposé dans n'importe quel bon host. Il ne serait pas étonnant de voir débarquer une mise à jour PS5, ce serait alors signe qu'une faille aurait été corrigée également, seul le temps nous le dira. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193400/in-ps4-sony-sort-le-firmware-officiel-1152-pour-la-ps4-1.jpg"
        }
    },
    "news_4": {
        "title": "[Switch] L'UnlockSwitch sera proposé à 24.90 $, l'Xtractor à 34.90 $ et le kit à 59.90 $",
        "content": " \n \nLa Team UnlockSwitch vient de dévoiler les prix auquel sa solution sera proposée, à l'origine l'équipe avait l'intention de proposer l'UnlockSwitch PBS a 29.90 $, mais cela a déjà été corrigé puisque son prix sera finalement de 24.90 $.*\n \nPlusieurs informations importants ont été communiquées par l'équipe, la première d'entre elles est que les premiers modèles envoyés aux bêta-testeurs ne sont que des prototypes de démonstration et pas la version finale qui sera encore améliorée. Les images et les vidéos de la version finale seront proposées avant le lancement officiel.\n \n \n\n \n \nLa production des 10 000 premières unités de l'UnlockSwitch PBS ainsi que son programmateur débutera le 01 Août 2024. La team rappelle que l'éditeur sera disponible en kit avec l'Xtractor, rendant impossible l'achat séparé. \n \nMalheureusement, l'antenne Wifi ne sera pas intégrée dans l'UnlockSwitch PBS, le constructeur faisant étant d'un retard de livraison, dommage. La conséquence est la baisse du prix de vente à 24.90 $ au lieu des 29.90 $.\n \nVoici enfin les prix finaux des produits :\n \n- La commercialisation et l'expédition commenceront vers le 15-20 août.\n- L'UnlockSwitch PBS sera vendu à 24.90 USD (en raison de l'absence d'antenne WiFi)\n- L'Xtractor seul sera vendu au prix de 34,90 USD.\n- Le kit, comprenant l'UnlockSwitch PBS, le programmateur et l'Xtractor, sera vendu au prix de 59,90 USD.\n \nAutre petit point noir, peu de détail sur Xtractor, si ce n'est qu'il est presque terminé, des échantillons de test devraient arriver d'ici la fin du mois de Juillet, les spécifications ne sont pas encore totalement arrêtées et seront dévoilées lors d'une présentation officielle. \n \nAu sujet de l'antenne WiFi l'équipe dit avoir commandé 50 000 puces mais que le fabricant ne les livrera pas à temps pour qu'elles puissent être intégrées, c'est quand même un peu dommage, sachant que la team a toujours revendiqué le fait de ne pas être pressée, finalement cela semble un peu changer sur cet aspect, il faut dire que Nintendo fait désormais pression sur ce type de linker. \n \nSi on se résume, la production de 10 000 unités ne comprenant pas le WiFi sera vendue autour du 15 Août 2024 à 24.90 $, mais qu'ensuite seule la version à 59.90 $ sera commercialisée, vendu avec Xtractor. Vu que la team a commandé 50 000 puces WiFi il y a fort à parier qu'une version améliorée verra rapidement le jour intégrant le WiFi. \n \nTout est là : x.com/UnlockSwitch\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193209/in-switch-lunlockswitch-sera-propose-a-2490-lxtractor-a-3490-et-le-kit-a-5990-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS3] La dixième Bêta du CFW Evilnat 4.91.2 PEX/D-PEX avec Cobra 8.5 disponible",
        "content": " \nPlus de 2 mois se sont écoulés depuis la neuvième version du célèbre CFW de Nathan Martin, voilà que débarque la dixième version bêta du CFW Evilnat 4.91.2, espérons que cela soit la dernière avant la version finale. \n \nCette version vient intégrer le plugin de téléchargement étendu de DeViL303 et a remplacé le plugin DEX game_ext_plugin.sprx par celui du CEX afin d'éviter les problèmes avec PS Plus. \n \n \n \n\n \n \n \n \nSeules les versions PEX et D-PEX sont proposées, le développeur précisant que les autres variantes seront livrées avec la version finale, faut-il y voir enfin la délivrance de la version stable ? \n \n \nChangelog CFW Evilnat 4.91.2 [BETA 10] :\n \n- Ajout du plugin de téléchargement étendu par DeViL3O3\n- CEX game_ext_plugin.sprx remplace la version DEX pour éviter les problèmes avec PS Plus\n \n \nTéléchargement : CFW Evilnat 4.91.2 PEX / D-PEX avec Cobra 8.5\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193203/in-ps3-la-dixieme-beta-du-cfw-evilnat-4912-pexd-pex-avec-cobra-85-disponible-1.jpg"
        }
    },
    "news_6": {
        "title": "[3DS/2DS] Red Viper v0.9.6 disponible",
        "content": " \nNotre ami sunriseur Wargla nous propose de découvrir Red Viper, sous ce nom se cache un émulateur de Virtual Boy, le Virtual Boy est une console de jeux vidéo créée par Nintendo en 1995 au Japon et aux États-Unis, se présentant sous la forme d'un visiocasque 3D.\n \nTentant l'innovation avec un affichage stéréoscopique, la console est finalement un échec commercial. Malgré plusieurs baisses de prix, les ventes ne décollent pas et la commercialisation de la console en Europe sera annulée. Le projet est alors abandonné par Nintendo en 1996, par contre ce sont 770 000 unités vendues, et 22 jeux, et désormais cette console se négocie à plus de 500 euros (environ 200 euros à l'origine bien trop cher pour l'époque). \n \n \n\n \n \n \nAfin de vivre ou revivre l'expérience à moindre frais, il est possible de découvrir la console via l'émulation. Red Viper est l'une des meilleures solution de restitution actuelle, devançant même celle de RetroArch par exemple.\n \nNotre ami sunriseur nous propose de le découvrir car il tourne à la perfection sur la OLD 3DS, sans ralentissement, et techniquement parlant il s'appuie sur les aspects 3D de la 3DS à la perfection. \n \n \n \n\n \n \n \nLa dernière version disponible est sortie il y a quelques jours, la version 0.9.6 :\n \n- Ce patch ajoute un mode anti-scintillement et un affichage d'entrée.\n- Ajout d'une option anti-scintillement pour atténuer les problèmes de rétention d'image, en particulier sur les modèles IPS.\n- Ajout d'une nouvelle entrée sur l'affichage (les boutons s'allument en rouge si le mode turbo est activé et en bleu si le mode bascule est activé)\n- Correction d'un bug critique où l'émulateur se bloque au démarrage d'un jeu si le répertoire d'accueil n'existe pas.\n \nTéléchargement : Red Viper v0.9.6\n \nMerci Wargla pour l'information en MP. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193197/in-3ds2ds-red-viper-v096-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[XBO/XBS/XBX] Carrot c4k3 publie son exploit kernel pour Xbox One et Series S/X",
        "content": "Le développeur Carrot c4k3 dévoile enfin son exploit kernel à destination de la Xbox One et des Xbox Series S et Series X. \n \nLes premiers retours nous informe qu'il est possible de lire les sauvegardes de jeux en les ouvrant en mode développeur. \n \nL'exploit a été appelé \"Collateral Damage\", il s'agit du premier exploit kernel public pour Xbox utilisant le systemOS s'appuyant sur la faille CVE-2024-30088. L'exploit kernel est fonctionnel sous les mises à jour 25398.4478, 25398.4908, et 25398.4909.\n \n \n\n \n \nLe point d'entrée initial est l'application Game Script UWP.\n \nCet exploit a été développé par Emma Kirkpatrick (découvert et exploit des vulnérabilités) et Lander Brandt (développement de loaders PE).\n \n\nComme vous pouvez le voir l'exploit est numéroté v1 cela signifie forcément qu'il va évoluer avec le temps. \n \nCette version initiale est principalement destinée aux développeurs. Actuellement, un moyen de placer des fichiers dans le répertoire LocalState de Game Script est nécessaire via une application telle que Adv File Explorer (FullTrust). Ceci est dû à la nécessité de placer les fichiers stage2.bin et run.exe dans le répertoire LocalState. Dans un avenir proche, un payload sera fourni pour charger ces fichiers sur le réseau, de sorte que le payload initial sera simplement un script qui peut être saisi via un émulateur de clavier USB.\n \nL'exemple de reverse shell fourni ici nécessite que votre console soit connectée à un réseau. Lorsque vous connectez votre console à un réseau, veillez à ne pas vous connecter à Internet et aux mises à jour. Essayez de bloquer la connectivité à Xbox LIVE autant que possible, au moins en réglant vos DNS sur des serveurs non valides.\n \nCet exploit n'est pas totalement fiable. Il s'appuie sur un canal latéral du processeur ainsi que sur une condition de course, qui peuvent tous deux échouer. En cas d'échec, l'exploit peut vous en avertir par le biais d'une sortie réseau, ou la console elle-même peut se bloquer et redémarrer.\n\n \nUsage \n \n\n- Modifiez la ligne 7 de gamescript_autosave.txt pour qu'elle contienne l'IP locale de votre PC.\n- Copiez gamescript_autosave.txt, stage2.bin et run.exe dans le répertoire LocalState de l'application Game Script sur votre console (Q:\\NUsers\\NUserMgr0\\NAppData\\NLocal\\NPackages\\27878ConstantineTarasenko.458004FD2C47C_c8b3w9r5va522\\NLocalState\\N).\n- Lire le port 7070 sur votre PC à l'aide de netcat ou d'un outil similaire (exemple de commande : nc64.exe -lvnp 7070)\n- Ouvrez l'application Game Script sur votre console, sélectionnez \"Show Code Run window\" et cliquez sur \"Run code once\".\n\nSi l'exploit réussit, vous devriez voir apparaître sur votre PC un message ressemblant à ce qui suit :\n \nlistening on [any] 7070 ...\nconnect to [192.168.0.61] from (UNKNOWN) [192.168.0.130] 49665\nCollateral Damage - @carrot_c4k3 & @landaire (exploits.forsale)\nBuild number: 25398.4478\nAttempting to find kernel base...\nFound likely kernel base: FFFFF80AF9800000\nAttempting exploit...\nExploit succeeded! Running payload!\n\nMicrosoft Windows [Version 10.0.25398.4478]\nCopyright © Microsoft Corporation. All rights reserved.\n\nS:\\>\n \n \n \nBeaucoup de travail supplémentaire est nécessaire pour faire de cet outil, un outil convivial de chargement d'homebrews sur Xbox, mais il est déjà un bon point de départ. Si vous souhaitez vous amuser à exécuter du code en tant que SYSTEM, vous pouvez mettre votre code dans la fonction post_exploit dans post_exploit.c.\n\n \nIl y a encore beaucoup à faire sur ce sujet, mais comme la partie kernel est terminée, Carrot c4k3 voulait la partager avec la communauté pour que les développeurs puissent commencer à utiliser les privilèges SYSTEM. Voici quelques éléments qu'il espère encore ajouté dans l'avenir :\n \n- Support du chargement latéral\n- Lancement de processus non-signés non-UWP\n- Support SSH\n\n \n \nTout est là : Dommage Collatéral\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193194/in-xboxbsxbx-carrot-c4k3-publie-son-exploit-kernel-pour-xbox-one-et-series-sx-1.jpg"
        }
    },
    "news_8": {
        "title": "[XBS/XBX] L'app Game Script pourrait revenir mais attention au ban",
        "content": " \nComme vous le savez, l'exploit kernel pour les Xbox (One, series X et series S) va être proposé dans les jours qui viennent, cependant pour en profiter il faudra disposer de l'application Game Script qui a rapidement été retirée par Microsoft. \n \nDe nombreux utilisateurs n'ont pas eu le temps de la télécharger avant qu'elle ne soit retirée, ce qui fait que certains se demandent comment l'obtenir. Il reste encore un peu d'espoir, mais pour cela il faudrait disposer d'un compte partenaire Microsoft. \n \nPour redonner de l'espoir le développeur Khaled Ahmed par exemple nous informe que lui même a été confronté à cette incapacité technique de télécharger l'app game script. \n \n \n\n \n \nAprès avoir envoyé sa console en réparation, elle s'est retrouvée en configuration d'usine, perdant l'intégralité de ses données, mais il souhaitait retrouvé l'application game script et a creusé la question. Il a alors trouvé un article dans lequel il a trouvé un processus pour réinstaller l'application en mode retail via un compte développeur Microsoft. \n \nCe processus risqué pourrait entrainer un ban, \"c'est un choix difficile, mais j'ai payé 20 $ pour obtenir le compte développeurs et j'ai suivi les étapes nécessaires pour republier l'application, cela impliquait la création de groupes privés, et le téléchargement de l'application via un processus complexe\". \n \n \n \n\n \n \n \nOn comprend en substance, qu'il a réussi à télécharger l'app game script en utilisant probablement un serveur privé, mais que cela risque de déboucher sur un ban de la console et du compte développeur. Il a décidé de partager son expérience dans une vidéo qui sera probablement retirée rapidement.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193128/in-xbsxbx-lapp-game-script-pourrait-revenir-mais-attention-au-ban-1.jpg"
        }
    },
    "news_9": {
        "title": "[WiiU] Aroma 22 et Tiramisu 0.1.4 disponibles",
        "content": " \nDepuis quelques jours, une grosse semaine pour être plus précis, le développeur Maschell a dévoilé une nouvelle version de Aroma, pour ceux qui se demandent ce que c'est qu'Aroma, il s'agit d'un environnement de hack pour la Wii U.\n \n \n\n \n \nAroma qui est l'environnement homebrew pour la Wii U, évolue une nouvelle fois avec de nouvelles options et corrections, notamment pour le démarrage d'Aroma, la gestion du menu de démarrage rapide du gamepad a été améliorée, et un écran de démarrage personnalisé peut être affiché (un fichier image 1280x720 ou 1920x1080 pixels est nécessaire). \n \n \nChangelog : \n \n- Éviter/réduire la corruption de l'écran lors du démarrage dans Aroma\n- Fermer le menu de démarrage rapide sur la manette de jeu s'il ne démarre pas automatiquement dans un environnement\n- Rendre les titres à démarrage rapide plus cohérents si la sélection des titres prend plus de 5 à 10 secondes\n- Le lancement du titre via le menu de démarrage rapide affichera désormais l'écran de démarrage correct et jouera l'audio de transition\n- Ajouter une option pour afficher un écran de démarrage personnalisé au démarrage. Il sera chargé depuis sd:/wiiu/environments/aroma/splash.png. La résolution recommandée est 1280x720 ou 1920x1080\n- Rendre l'ouverture du menu de configuration un peu plus stable\n- Correction de l'ouverture du menu de configuration avec les contrôleurs Motion Plus dans certains scénarios (merci @Andrew1Hawes)\n- Utilisez une horloge stable/monotone pour les minuteries dans NotificationModule (merci @dkosmari)\n- Mocha : ajoutez un groupe d'autorisations DLP aux titres homebrew\n- Correction du démarrage dans vWII HBC à partir d'AutobootModule\n \nTéléchargement : Aroma 21\n \nEdit 15.07.24 : Aroma 22\n \n \nPour compléter le repas, Maschell propose une nouvelle version de Tiramisu qui passe en v0.1.4. \n \nCette mise à jour n'ajoute aucune nouvelle fonctionnalité. Elle met simplement à jour l'EnvrionmentLoader et l'AutobootModule pour utiliser la même version dans Aroma et Tiramisu. Elle inclut quelques petites corrections de bugs.\n \nTéléchargement : Tiramisu 0.1.4\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193125/in-wiiu-aroma-21-et-tiramisu-014-disponibles-1.jpg"
        }
    },
    "news_10": {
        "title": "[DS/2DS/3DS] TWiLightMenu++ 27.5.2 et nds-bootstrap 1.5.4 disponibles",
        "content": " \nLe développeur RocketRobz propose une nouvelle version de TWiLightMenu++ et de nds-bootstrap, de petites versions puisque les changements ne sont pas nombreux. \n \n \n \n\n \n \n \nComme vous le savez, TWiLight Menu ++ est une mise à niveau, à code source ouvert, du menu et de l'interface DSi pour nds-bootstrap (compatible 3DS/2DS/DS/DSi). Ce programme va aussi vous permettre de jouer aux homebrews DS, jeux DSiWare et roms .nds et aux roms de la GameBoy (.gb), GameBoy Advance (.gba) et Nes (.nes) depuis votre carte SD.\n \n \nChangelog :\n \n- DeadSkullzJr : v3.3 de Pokémon : Refined Gold Overhaul est maintenant AP-patché.\n- mentusfentus : Thème DSi : Ajout de plus d'animations de liste déroulante ! (#2434)\n \nCorrections de bugs :\n \n- Quelques titres DSiWare tels que Petit Computer démarrent à nouveau sur des cartes SD de moins de 32 Go !\n- Suppression de nds-bootstrap.7z à l'intérieur de nds-bootstrap.zip\n \n \n \nTéléchargement : TWiLightMenu++ 27.5.2 et nds-bootstrap 1.5.4\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193098/in-ds2ds3ds-twilightmenu-2752-et-nds-bootstrap-154-disponibles-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] PS5 offline account activation disponible",
        "content": " \nLe développeur John Tornblom a décidé de travailler sur un nouveau payload pour la scène PS5 nous permettant d'activer une console PS5 sans avoir besoin de la connecter au PlayStation Network. \n \nUn outil un peu similaire existait déjà, PS4OfflineAccountActivator, cependant il est limité aux firmwares 4.xx, et il est impossible de copier des sauvegardes sur une clé ou un disque dur USB, de fait le programme n'a jamais été rendu public. \n \n \n\n \n \nLe programme prend la forme d'un fichier OffAct.elf qui permet donc d'activer votre PS5.\n \nTéléchargement : PS5 offline account activation\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193097/in-ps5-ps5-offline-account-activation-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[XBS/XBX] L'exploit Xbox One fonctionne aussi sur le firmware 4909",
        "content": "Carrot_c4k3 nous confirme que l'exploit Xbox One fonctionne sur le dernier firmware 4909, il dévoile une vidéo dans laquelle le reverse shell est lancé sur Xbox One X en retail mode, la vidéo démarre juste au moment où l'exploit démarre. \n \n \n\n \n \nIl annonce aussi qu'il a lancé l'exploit sur Xbox One S, cela prend beaucoup plus de temps, au delà de la minute pour le lancer.\n \n \n\n \n \n \nTout est là : carrot_c4k3\n \n \nA la question, quand est ce que l'exploit sera disponible, il répond très bientôt, ce n'est probablement plus qu'une question de jours. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1931649245.png"
        }
    },
    "news_13": {
        "title": "[XBS/XBX] Exécuter du code Lua sur Xbox One et Series X et S",
        "content": " \n \nLes développeurs regroupés sous Xbox One Research Project viennent de dévoiler leur projet d'éxecution de code Lua sur Xbox One et Xbox Series S et X.\n \nIl explique dans une vidéo l'exécution de code XBOX via LUA dans EraOS/GameOS et dévoile aussi une procédure pas à pas du code GitHub. L'équipe Xboxoneresearch a publié le code pour stage1.lua et stage2.lua pour permettre l'exécution de code sur la plateforme XBOX.\n \n \n \n\n \n\n \n \n \nComment faire :\n \n- Editez stage1.lua avec l'IP/PORT de votre PC\n- Injecter le contenu édité de stage1.lua dans la sauvegarde de votre choix\n- Editer stage2.lua et le servir via netcat(TCP) sur l'IP/Port configuré dans stage1\n \nComme nous le voyons il faut utiliser une sauvegarde Lua, deux étapes, spécifiquement pour les titres prenant en charge FFI dans leur moteur Lua comme par exemple Warhammer Verminte ou Verminte 2.\n \n \nTout est là : LuaFFI-CE\n \n",
        "images": {}
    },
    "news_14": {
        "title": "[Oldies] Les jeux Gamecube via RetroAchievements dans Dolphin le 15 juillet 2024",
        "content": "La communauté retrogaming a développé une plate-forme retroachievements.org proposant aux joueurs de relever des défis et d'obtenir des distinctions sur leurs jeux préférés. Cette plate-forme supportait jusqu'alors la plupart des consoles (NES, SNES, GB, GBC, GBA, Megadrive, PC engine) mais pas encore les jeux Gamecube, jusqu'au 15 Juillet prochain.\n \n \n\n \n \nA partir de cette date, la Recalbox permettra de connecter un compte retroachievements.org pour prendre part aux défis et se mesurer aux autres joueurs Gamecube puisque la solution prendra en charge certains titres Gamecube via l'émulateur Dolphin. \n \n \n\n \n \nRetroAchievements permet aux joueurs de débloquer et de gagner des succès tout en jouant, une solution très apprécié, puisqu'elle permet aussi d'intégrer des classements, la \"bonne\" nouvelle est que les jeux Wii ne sont pas encore supportés, mais il le seront à coup sûr, l'équipe de développement informe que le support sera ajouté dans une prochaine mise à jour. \n \n \nTout est là :  Retroachievements.org\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192941/in-oldies-les-jeux-gamecube-via-retroachievements-dans-dolphin-le-15-juillet-2024-1.png"
        }
    },
    "news_15": {
        "title": "[Switch] Sudachi c'est désormais terminé suite au DMCA de Nintendo",
        "content": " \nNintendo continue sa chasse aux émulateurs de Nintendo Switch, il faut avouer qu'émuler une console Nintendo est un peu plus simple que les autres consoles puisque la puissance nécessaire est moindre, l'émulation n'est pas moins plus légale surtout que la plupart du temps elle nécessite des clés, des firmwares ou des logiciels officiels.\n \nAfin de protéger ses intérêts, Nintendo a attaqué de nombreux émulateurs à base de Yuzu, il faut avouer qu'après l'accord trouvé avec Tropic Haze LLC, le géant n'a pas l'intention de voir débarquer de nouvelles versions. \n \nL'une d'entre elles, Sudachi, un nouvel émulateur qui supportait Android, Linux, macOS et Windows, vient d'être retiré pour DMCA de github.\n \n \n \n\n \n \n \nL'un des développeurs, Jarrod Norwell, va contester le DMCA car il considère qu'il ne fournit aucun contenu illégal. Pour le moment, le site web n'est pas affecté, simplement le github.\n \nLe développeur rappelle que Sudachi nécessite désormais tous les fichiers d'un système contrairement à Yuzu, avec LibHac le plan est de s'éloigner de l'ancien système Horizon.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192940/in-switch-sudachi-cest-desormais-termine-suite-au-dmca-de-nintendo-1.png"
        }
    },
    "news_16": {
        "title": "[Switch] L'unboxing vidéo du UnlockSwitch",
        "content": "Et voilà les premiers UnlockSwitch viennent d'arriver, et les premiers unboxing du linker peuvent donc avoir lieu. La team estime que la production initiale va démarrer très bientôt, et elle sera comprise entre 10 000 et 20 000 unités. \n \n \n\n \n \nOn y découvre un packaging plutôt solide avec une intégration épuré mais efficace. Le contenant intègre le câble flex, un câble USB, le linker UnlockSwitch et son programmeur, les deux dans leur boitier transparent. \n \n \n\n \n\n \n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192921/in-switch-lunboxing-video-du-unlockswitch-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1192921/in-switch-lunboxing-video-du-unlockswitch-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1192921/in-switch-lunboxing-video-du-unlockswitch-3.jpg"
        }
    },
    "news_17": {
        "title": "[Switch] uLaunch v1.0.0 disponible",
        "content": " \nLe développeur XorTroll  propose la version 1.0.0 de uLaunch, ce n'est pas rien puisqu'il a réécrit le programme, uLaunch est une alternative personnalisée à l’interface originale de la Nintendo Switch, qlaunch.\n \nDéveloppée par XorTroll, elle propose un menu paramétrable mêlant jeux et homebrews, ce qui tranche avec l’austérité de l’interface proposée par Nintendo.\n \nAprès une longue attente, XorTroll a enfin publié uLaunch v1.0.0, une refonte majeure dont il avait parlé lors de précédentes versions de support mineures. \n \n \n \n\n \n \n \nGénéral : \n \n- Le système d'entrée du menu a été complètement refait :\n- Système de grille plus propre, profondément inspiré du menu de la 3DS (et partiellement des menus de la DSi/Wii également), plus facile que jamais à naviguer et à personnaliser.\n- Les homebrew et les applications ne sont plus séparés dans des menus distincts : le menu contient initialement toutes les applications, hbmenu, uManager (voir ci-dessous) et d'autres entrées spéciales (page utilisateur, paramètres/thèmes...), et les entrées homebrew peuvent être facilement ajoutées dans le menu (ou elles peuvent toujours être accédées via hbmenu, bien sûr).\n- Un support a été ajouté pour détecter les échecs de montage de la carte de jeu (et même afficher le résultat, ce que le menu HOME original ne fait pas).\n- La prise en charge de la suppression de la carte SD a été améliorée.\n- Nous utilisons maintenant l'arc pour organiser proprement les codes de résultats et afficher leurs noms.\n- Tous les composants de uLaunch génèrent maintenant des journaux (nettoyés à chaque redémarrage) qui peuvent être très utiles pour identifier les problèmes.\n- Des traductions sont fournies pour des langues supplémentaires : Espagnol, Coréen, Portugais brésilien (celles qui ont été proposées par les traducteurs).\n- Si vous souhaitez ajouter de nouvelles traductions ou améliorer les traductions existantes, n'hésitez pas à contribuer !\n- Comme toujours, toutes les bibliothèques ont été mises à jour vers leurs dernières versions (donc, cela fonctionne avec la dernière version d'Atmosphère).\n- Beaucoup d'autres parties internes du code ont été améliorées ou carrément redessinées.\n \nuSystem :\n \n- Essentiellement de nombreux changements internes pour refléter les changements dans les autres parties du projet de manière plus perceptible par l'utilisateur final.\n \nuLoader :\n \n- Implémentation du support pour utiliser uLoader comme sélecteur de homebrew, permettant ainsi de retourner le homebrew sélectionné par l'utilisateur via hbmenu au lieu de le lancer.\n- Changements mineurs reflétant plus fidèlement la logique suivie par le hbloader actuel, et corrigeant probablement des problèmes mineurs.\n \nuMenu :\n \n- Changements relatifs au nouveau menu :\n- Plusieurs options précédemment placées ailleurs (page utilisateur, paramètres/thèmes uLaunch, menu des contrôleurs...) sont maintenant de véritables entrées de menu, ce qui rend l'interface utilisateur plus propre dans l'ensemble.\n- L'éditeur Mii est désormais accessible à partir du menu d'entrée et du menu rapide.\n- Les dossiers sont de retour, et mieux que jamais ! Les sous-dossiers, sous-sous-dossiers, etc. peuvent être créés comme auparavant, tandis que la nouvelle disposition en grille du menu rend le déplacement des entrées à l'intérieur et à l'extérieur des dossiers plus intuitif que jamais.\n- Améliorations graphiques majeures en dehors du nouveau menu :\n- Toutes les ressources/logiques ont été mises à jour en 1080p, ce qui permet de ne plus avoir une qualité inférieure sur la télévision (une autre chose que le menu HOME officiel n'a pas).\n- Les menus sont maintenant hautement thématisables, puisque plus d'attention a été consacrée aux petits aspects personnalisables.\n- Le menu rapide ne peut plus être ouvert qu'avec ZL/ZR (L/R sont utilisés pour naviguer dans le menu principal), et une option d'éditeur mii a été rajoutée.\n- La boîte de dialogue de saisie d'URL du navigateur web commence par https:// par défaut, pour plus de simplicité.\n- Il n'y a plus de menu homebrew séparé, les entrées homebrew sont ajoutées via le nouveau mécanisme uLoader.\n- Les entrées sont maintenant joliment affichées dans une barre d'entrée juste au-dessus du menu d'entrée.\n- Plusieurs transitions de menu ont été rendues plus agréables, se fondant dans l'arrière-plan du thème au lieu d'un écran noir.\n- Une vérification de base est effectuée pour savoir si les titres peuvent être lancés en premier lieu (plutôt que d'essayer de les lancer, d'échouer et de rouvrir uMenu avec une boîte de dialogue d'erreur).\n- Augmentation de la mémoire interne du menu de 176MB à 296MB, ce qui permet de charger des thèmes de meilleure qualité alors que tout le reste devrait (en principe) fonctionner correctement.\n \nThème uDesigner : \n \n- Les thèmes ont beaucoup changé : cette version introduit une nouvelle version du format de thème, comprenant à la fois des changements mineurs et BEAUCOUP plus de choses personnalisables, au point que tous les changements sont trop longs pour être listés ici.\n- Le nouveau thème par défaut a une couleur générale bleue et des éléments presque entièrement nouveaux.\n- Les thèmes sont maintenant distribués sous forme de fichiers ZIP.\n- Le wiki des thèmes a été réécrit et couvre tout ce qui concerne la création de thèmes.\n- Les anciens thèmes sont loin d'être compatibles (non seulement les différences de format/fichiers, mais aussi de résolution puisque nous sommes en 1080p maintenant ! Quoi qu'il en soit, le nouveau thème est plus personnalisable qu'auparavant, ce qui ouvre de nombreuses possibilités aux esprits créatifs.\n- Dans cette optique, un éditeur de thème officiel (expérimental) est enfin disponible : uDesigner !\n- Le wiki a également été réécrit, couvrant tous les détails pertinents. Les pages du wiki sont la documentation parfaite pour ceux qui créeront des thèmes manuellement ainsi que pour ceux qui utiliseront l'éditeur (expérimental).\n \nuManager :\n \n- Cette nouvelle version introduit uManager, une toute nouvelle application homebrew pour contrôler les fonctionnalités de uLaunch !\n- Il ne sera plus nécessaire de bricoler manuellement les fichiers (sauf dans des cas étranges, bien sûr).\n- Activer/désactiver automatiquement uLaunch\n- Mettre à jour uLaunch avec la dernière version de GitHub\n- Réinitialiser la disposition du menu / le cache de l'image générée par uLaunch (peut s'avérer utile si quelque chose se casse)\n \nuScreen (anciennement uViewer) :\n \n- uViewer a été remplacé par uScreen, un tout nouvel outil (Java) pour la capture d'écran USB, dont les fonctionnalités sont globalement les mêmes.\n \nRemarques :\n \n- Notez que beaucoup d'autres fonctionnalités pas trop compliquées auraient pu être ajoutées à cette version : plus de paramètres système, des entrées de menu pour les options amiibo, des options de thème par utilisateur, des vérifications d'applications importantes que le menu HOME officiel fait (mises à jour nécessaires et données corrompues)...\n \n \n \nTéléchargement : uLaunch v1.0.0 \n \n \n",
        "images": {}
    },
    "news_18": {
        "title": "[Switch] TegraExplorer v4.2.0 disponible",
        "content": " \nLe développeur suchmememanyskill vient de mettre en ligne la version 4.2.0 de Tegra Explorer, comme vous le savez il s'agit d'un excellent gestionnaire de fichiers pour la Switch qui peut faire l'object d'une injection et qui fonctionne de façon indépendant du système. Comme vous le savez déjà, TegraExplorer permet de naviguer dans la partition système sysnand / sysmmc, de copier, de supprimer ou de créer des fichiers ou des dossiers, et de télécharger le firmware actuel sur la SD. \n \nAvec cette nouvelle version, le formatage de la console a été revu pour que le problème d'écran noir ne se produise plus lors d'une mise à jour, la sauvegarde DeviceSettings a été maintenue, la suppression entrainant d'autres difficultés, comme des incohérences de charge de batterie, notamment sur Switch Lite. Le développeur recommande d'ailleurs de restaurer une sauvegarde si vous avez déjà formaté votre Switch Lite avec TegraExplorer. \n \n \n \n\n \n \n \nChangelog : \n \n- Implémentation plus correcte de l'effacement du système, cette mise à jour modifie la façon dont le nettoyage du système est effectué dans Tegra Explorer. Cela devrait maintenant corriger l'écran noir au démarrage après avoir effectué un nettoyage du système, et également sauvegarder les valeurs de calibrage de la batterie après un nettoyage.\n- Merci de rapporter tout problème dans l'onglet Problèmes (Issues)\n- Le message Systemwipe a été édité pour transmettre un plus grand sens du danger lors de l'utilisation du script de nettoyage.\n- Générer un index de sauvegarde (#91, #96), ceci corrige le problème de l'écran noir\n- Conservation de la sauvegarde vieillissante (et l'indexer) (#97, #99), ceci corrige les problèmes de batterie après un effacement du système\n- Sur une Swith Lite, cela aurait auparavant provoqué une charge de la batterie à des niveaux dangereux. Si vous avez déjà exécuté le script systemwipe sur une Switch Lite, vous ne pouvez pas exécuter ce script à nouveau pour corriger ce problème.\nUn grand merci à @JeffVi, qui a corrigé à lui seul le script systemwipe.\n \n \nTéléchargement : TegraExplorer v4.2.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192891/in-switch-tegraexplorer-v420-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] shadps4 v0.1.0 nom de code &#34;Tortue folle&#34; montre des progrès significatifs",
        "content": " \nUne grosse mise à jour du code de ShadPS4 vient d'être dévoilée, il s'agit de la version 0.1.0 portant le nom de code de madturtle que l'on peut traduire par \"Tortue folle\". L'émulation PS4 sur PC Windows et Linux bondit une nouvelle fois avec l'arrivée d'une telle version, qui montre une avancée significative dans la restitution graphique de la PS4.\n \n \n\n \n \nDéveloppé par Georgemoralis, connu sous le pseudonyme de shadow, fondateur et programmeur sur ce projet et beaucoup d'autres, ShadPS4 a connu la modification de plus de 445 fichiers depuis la version précédente 0.0.3 publiée en Mars 2024, les principales évolutions portent sur un recompilateur de shaders qui a été ajouté . Cet ajout permet de faire tourner plusieurs jeux 3D comme Persona 5 ou One Piece Odyssey, de plus une grande partie du core a été réécrite. La restitution sonore elle aussi est excellente, il reste encore quelques artefacts graphiques qui peuvent présenter encore certains risques, mais les progrès sont là. \n \n \n\n \n \n \nTéléchargement : shadps4 v0.1.0 madturtle\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192849/in-ps4-shadps4-v010-nom-de-code-tortue-folle-montre-des-progres-significatifs-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] Le nouveau site internet de Mig Switch est là",
        "content": "\n \nL'équipe en charge du Mig Switch ne compte pas se laisser faire et dévoile, malgré la décision de justice, un nouveau site internet qui prend le relai de http://www.migswitch.com/. \n \nIl s'agit d'une copie de l'ancien site, ou d'une sauvegarde, qui est donc désormais hébergé ici : https://www.migswitchru.com/\n \nMalgré cette situation, l'équipe a annoncé avoir l'intention d'assurer les livraisons et de continuer à servir ses clients, en rajoutant qu'elle s'est dite choquée et que cette réaction de Nintendo était une menace pour l'entreprise mais aussi pour la liberté sur internet en général.\n \n \n\n \n \n \nDésormais l'équipe va communiquer via TOR, elle conclue en disant que ce site est temporaire, qu'il sert surtout à rendre les fichiers accessibles aux utilisateurs, et qu'elle va mettre en place un lien davantage sécurisé dans l'avenir. \n \nPour information, la page Reddit en lien avec Mig Switch a elle aussi été rendue privée, preuve que les changements impactent tous les liens. \n \n \n\n\n \n01/07/2024: Temporary new site for MigSwitch to access firmwares and more: www.migswitchru.com\nAlthough the situation is still not clear, it seems our company has lost the ownership of our domain name www.migswitch.com\n \nFirst and most important: We are operating as usual. We are shipping our products. All orders are being fulfilled and nothing has changed beside the domain name.\n \nWe are shocked by what happened for several reasons, and we feel this is not only shocking for us but for the freedom of Internet in general.\n \nFirst, we were not warned or had a chance to answer and defend our products or at least the simple fact that whatever the complaint is, it applies only to a few countries and in no way allows to take down a domain for all users in the world. Can Afghanistan request to take down a .com website that goes again its interests? We don't think so.\nBut more than that, this is a .com domain, meaning a universal domain applying to many countries.\n\".com\" domains sell products like drug/medications which are only legal in certain countries, or gambling. US sites selling or promoting weapons which are illegal in just about every country on the planet are registered in .com. We never heard any of them being seized as they are operating legally in their markets.\nWe clearly indicate on our site that our product is for legal use only in countries/jurisdictions where backing up your legally owned games is authorized. And there are many.\nWe do not even sell our products directly from our website. And there is no copyrighted material to be found anywhere.\nIf what we suspect is true, this is another proof of the abuse and bullying from some governments and companies which think they are above the laws of the world and do not respect anyone who think different.\n \nWe will not tolerate that attitude and bow down to those bullies.\n \nOf course, IP blocking our site in countries where our products are considered illegal is totally acceptable. And we would never challenge it. In fact, it is the case for many companies. Some of our distributors even enforce that on their own.\nBut trying to tell the world what is right or wrong based on your country point of view is really unacceptable and add to the hate of certain countries for their bullies' attitude.\n \nPlease note this site is likely only temporary as we know our many users need access to files and support and is a quick fix. We will likely move again to a more secure domain in the weeks to come.\n \nThank you for your understanding and for your support against the bullies of the world. As soon as we find out more about what happened, we will post about it so all of us can report to pro-freedom NGO and hopefully contribute to making Internet a better place.\n \nP.S.: If you are not able to access this website, we will post news and update on our .onion website accessible by TOR:4gnoefk5zilujdkixixlsiagd3al5cejg3ooiwq2uuxgizgpnpwq7cqd.onion\n \n\n \n\n \n \n \n\n \n",
        "images": {
            "image_1": "https://nintendo-wii.logic-sunrise.com/images/validation/in-1224670235.png"
        }
    }
}