{
    "news_1": {
        "title": "[PS4/PS5] PKG Tool Box v1.2.0 disponible",
        "content": "Le développeur Seregonwar a proposé une mise à jour de son outil PKG Tool Box en version 1.2.0. \n \nIl a amélioré son outil en fonction des retours utilisateurs, les changements principaux portent sur des problèmes liés à l'extraction des informations des fichiers de trophées PS4, qui sont nommés en .TRP sur PS4, et il a ajouté le support des fichiers .UCP sur la PS5. \n \nLes nouveautés de cette version sont nombreuses, cela passe par un support partiel des PKG PS5, avec la possibilité de tester sans compromettre les fichier originaux, à noter que le reverse dump n'est pas encore opérationnel. \n \nLe développeur a aussi ajouté une fonction de force brute pour rechercher les mots de passer des fichiers PKG, là encore son efficacité reste à démontrer. \n \nDes informations sur les jeux PS5 ont été ajoutées, avec notamment la prise en charge du décryptage des fichiers eboot.bin, et de la vérification de l'authenticité des fichiers PKG. \n \nCertaines opérations de lecture hexadécimale ou encore d'extraction ont été améliorées, avec notamment une amélioration de l'extraction des fichiers du sce_sys.\n \n \n\n \n \n \nChangelog : \n \n- Correction de l'extraction des trophées : Correction du problème d'extraction des informations des packs de trophées .TRP (PS4) et ajout de la prise en charge des fichiers .UCP (PS5).\n \n- Prise en charge partielle des fichiers PS5 .pkg : Le reverse dump n'est pas encore opérationnel, mais vous pouvez le tester sans compromettre le fichier .pkg original.\n \n-Passcode bruteforce : Ajout d'une attaque par force brute pour la bibliothèque afin de rechercher les mots de passe des fichiers .pkg. Cette fonctionnalité a été ajoutée à la demande, mais son utilité n'est pas garantie.\n \n- Fonction d'injection non opérationnelle : La fonction d'injection n'est pas encore opérationnelle dans cette version. Je me suis concentré sur l'extraction des fichiers .TRP, et elle sera mieux développée dans la prochaine version.\n \n- Ajout d'informations sur les jeux PS5 : Ajout de la prise en charge du décryptage des fichiers eboot.bin sur PS5. Il peut maintenant vérifier si un fichier est un vrai ou un faux .pkg.\n \n- Amélioration du navigateur de fichiers : Dans la section du navigateur de fichiers, les trois opérations (extraction, lecteur de texte et lecteur hexadécimal) sont maintenant entièrement fonctionnelles. L'extraction de fichiers supplémentaires a été améliorée, y compris tous les fichiers du dossier sce_sys.\n \n \nTéléchargement : PKG Tool Box v1.2.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197028/in-ps4ps5-pkg-tool-box-v120-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[Switch] Atmosphere 1.8.0 Experimental pour le firmware 19.0.0",
        "content": "Une version expérimentale 1.8.0 d'Atmosphere vient d'être publiée, elle supporte le firmware 19.0.0, elle s'adresse avant tout à celles et ceux qui veulent donwgrade. \n \nComme vous le savez Nintendo a publié un firmware 19.0.0 qui a bloqué Atmosphere, et il faut attendre encore un peu pour que SciresM propose sa version officiellement, demain ou après demain.\n \n \n\n \n \nTéléchargement : Atmosphère 1.8.0 Experimental / fuse.bin\n \nMerci Linkynimes pour les liens \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196987/in-switch-atmosphere-180-experimental-ainsi-que-lockpick-pour-le-firmware-1900-1.png"
        }
    },
    "news_3": {
        "title": "[PS5] Flat_Z en dit davantage sur l'Hyperviseur",
        "content": " \nLe développeur Flat_Z vient de confirmer qu'il existe plusieurs façons de vaincre l'Hyperviseur de la PS5. L'une des méthodes qu'il a trouvé était liée à APIC. \n \nSes pistes sont nombreuses, il explique que la structure APIC, pour Advanced Programmable Interrupt Controller, située dans le segment RW (de lecture) des données du kernel, peut être exploité via un accès en lecture/écriture.\n \n \n\n \n \nAinsi en réindexant un pointeur tel que xapic_mode il serait possible d'exécuter un chaine ROP, et donc du code arbitaire. Selon lui, après une boucle, le code injecté s'exécuterait avant le redémarrage de l'Hyperviseur, permettant ainsi de patcher le kernel. \n \nIl a apporté la précision que cette méthode n'est pas celle qui a été corrigée sur le firmware 5.00 de la PS5, même s'il reconnait ne pas avoir tester sur des firmwares plus récents, il est même possible qu'elle marche sur des firmwares au delà du 5.00.\n \n \n \nTout est là : Flat_Z\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196977/in-ps5-flat-z-en-dit-davantage-sur-lhyperviseur-1.jpg"
        }
    },
    "news_4": {
        "title": "[Switch] Mise à jour urgente pour les utilisateurs du Mig Dumper",
        "content": "La team Mig Flash vient de poster un billet sur son site qui informe qu'une mise à jour urgente pour les utilisateurs du Mig Dumper sous Windows vient d'être publiée. \n \nLe firmware 1.1.6 apporte une mise à jour urgente du Mig Dumper pour les utilisateurs disposant de Windows 11 23H2 ou 24H2, ou supérieure, qui implémente une nouvelle vérification de collision de signature de disque. \n \n \n\n \nAvec les récentes mises à jour de Windows 11, le lecteur Mig Dumper n'apparaîtra plus à cause d'une collision de signature de disque, ce firmware 1.1.6 vient corriger ce problème, cependant les utilisateurs confrontés à ce problème ne peuvent pas mettre à jour le firmware car le lecteur n'apparait plus.\n \n \n\n \n \n \nPour résoudre ce problème, la team Mig Flash recommande quelques options :\n- Emprunter un ancien système Windows à un ami pour mettre à jour Mig Dumper vers le firmware 1.1.6\n- Télécharger un ISO Windows 10 et créer une clé USB Windows To Go avec Rufus, puis démarrer dans Windows To Go et effectuer la mise à jour du firmware \n- Télécharger un ISO Linux pour lancer un système Live Boot afin d'effectuer la mise à jour du firmware. \n \nSi vous utilisez toujours un ancien système Windows, nous vous recommandons d'installer le firmware pour éviter le problème ci-dessus à l'avenir.\n \nVous l'aurez compris il faut mettre à jour, surtout qu'à l'avenir ces signatures seront toujours présentes dans Windows. \n \n \nTéléchargement : Firmware 1.1.6\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196920/in-switch-mise-a-jour-urgente-pour-les-utilisateurs-du-mig-dumper-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1196920/in-switch-mise-a-jour-urgente-pour-les-utilisateurs-du-mig-dumper-1.jpg"
        }
    },
    "news_5": {
        "title": "[Switch] Le vendeur de puces Switch conteste Nintendo sans avocat",
        "content": "Si vous suivez un peu l'actualité de Nintendo et du hack qui entoure la marque, vous avez peut être eu connaissance que la marque japonaise a souhaité attaquer Modded Hardware, un youtubeur qui exploitait un store pour y revendre solution software et hardware. \n \nLa confrontation entre Nintendo et Ryan Daly a débuté dès le mois de mars avec d'abord des menaces de poursuites, sous délai de cessation d'activités illicites puisqu'il vendait des consoles Switch avec des puces ou des solutions software. \n \nModded Hardware en mars avait répondu son intention de cesser ces activités, mais il a continué à le faire, affirmant qu'il cherchait un avocat. \n \n \n\n \n \n \nLa passiveté de Modded Hardware ne risque pas de plaire, accusé de 6 chefs d'accusation dans un tribunal fédéral de Seattle, notamment pour trafic de dispositifs de contournement, ou encore violation de droits d'auteurs. \n \nTout ceci sans compter l'enrichissement personnel sans cause, l'incitation frauduleuse au piratage, ou l'utilisation inéquitable des licences Nintendo. \n \nEn plus du matériel, Nintendo estime que Modded Hardware a proposé directement des jeux piratés, ce qui allourdi encore plus ses bagages. Il proposait des consoles Switch avec des jeux populaires comme Super Mario, The Legend of Zelda et Metroid. \n \n \n\n \n \n \nPour l'heure, Modded Hardware n'a pas l'intention de prendre un avocat et souhaite se défendre seul (ou il est prolixe sur le sujet), l'affaire va désormais entrer dans une phase d'enquête où les deux parties vont avancer leurs preuves. Le site Web de Modded Hardware n'est plus accessible au public, il faut désormais un mot de passe pour y accéder.\n \n \nTout est là : Torrentfreak.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196840/in-switch-le-vendeur-de-puces-switch-conteste-nintendo-sans-avocat-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1196840/in-switch-le-vendeur-de-puces-switch-conteste-nintendo-sans-avocat-2.png"
        }
    },
    "news_6": {
        "title": "[Switch] Nintendo sort le firmware 19.0.0, Atmosphere est cassé jusqu'à sa mise à jour",
        "content": " \nNintendo a décidé de frapper fort une nouvelle fois, la mise à jour qui vient d'être publiée cette nuit est selon SciresM une mise à jour majeure qui vient casser Atmosphere. \n \nLa mise à jour firmware 19.0.0 qui est désormais diffusée par Nintendo pour les Switch et Switch Lite, comme souvent nous ne savons pas ce qu'elle apporte réellement car Nintendo par d'amélioration de stabilité générale du système, ce qui en d'autres termes signifie qu'elle a corrigé des failles, du moins il doit y avoir assez de changement pour perturber le bon fonctionnement d'Atmosphere. \n \nCe firmware n'étant livré sans un réel changelog, nous ne savons pas vous dire quels sont les changements apportés sur les fonctionnalités, peut être qu'aucune n'est livrée ce qui serait surprenant s'agissant d'une version majeure. \n \nSciresM lui confirme que pour lui il s'agit d'une version majeure dans le sens où Atmosphere ne fonctionne plus, et qu'il faut qu'il soit mis à jour. \n \n \n\n \n \nIl s'agit d'une mise à jour majeure, donc Atmosphère ne fonctionnera plus jusqu'à sa mise à jour. Le développeur SciresM explique qu'il vient de rentrer de voyage et qu'Atmosphere ne sera pas mis à jour avant mercredi ou jeudi prochain. Il s'excuse même de ne pas pouvoir proposer la mise à jour avant quelques jours, un dévouement sans faille de sa part, ce qui ne manque pas de rassurer et d'étonner la communauté. \n \nRapport Yellow's 8 : yls8.mtheall.com\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196836/in-switch-nintendo-sort-le-firmware-1900-atmosphere-est-casse-jusqua-sa-mise-a-jour-1.png"
        }
    },
    "news_7": {
        "title": "[Switch] La roadmap UnlockSwitch et une vidéo démo de l'Xtractor",
        "content": " \nLa Team UnlockSwitch semble vouloir accélérer en la matière, elle a dévoilé deux grands messages, et aussi une vidéo de démonstration de l'Xtractor.\n \n \n\n \n \nDepuis avril 2024, nous avons dépassé les 14 000 abonnés sur Twitter uniquement. Nous ne partagerons pas nos statistiques internes, nous ne voulons pas rendre les gens trop envieux ! Il s'agit d'une réussite considérable pour un projet qui était encore en développement, pas encore commercialisé. Alors, encore une fois, merci d'être resté avec nous et d'avoir fait preuve de patience dès le début de ce voyage. Depuis notre lancement, nous avons rencontré hors ligne de nombreux nouveaux visages de la scène Switch : futurs bêta-testeurs, YouTubeurs, développeurs externes. Un grand merci à vous tous, vous savez qui vous êtes !\n \nLorsque nous sommes arrivés sur la scène Switch, il y avait beaucoup de buzz. Pourquoi ? Parce que nous avons introduit une solution qui permet d'exécuter des jeux dumpés sur une simple cartouche, ramenant cette nostalgie pour ceux qui se souviennent du célèbre R4. Pour de nombreux joueurs qui ne veulent pas modifier leurs consoles, la demande et l'anticipation ont été (et sont toujours) hors normes ! Mais ici, chez Team UnlockSwitch, nous avons toujours refusé d'entrer sur le marché avec une solution basée sur le piratage.\n \nIl existe déjà des solutions de piratage, dont les prix sont ridiculement élevés et, à notre avis, injustifiables. Sans compter qu'elles sont illégales dans de nombreux pays, voire dans la plupart. Nous laisserons les autres prendre ce risque. Bonne chance à eux, mais ils ne se rendent peut-être pas compte des ennuis qu'ils causent à leurs distributeurs et détaillants. En réalité, c'est irresponsable. Mais nous en resterons là.\n \nNous avons pris la décision consciente d'éviter toute solution qui encourage les téléchargements 100 % illégaux. Au lieu de cela, nous nous sommes concentrés sur l'offre d'une solution complète pour créer des sauvegardes personnelles de vos propres jeux Switch. Donc pour clarifier : NON, le UnlockSwitch PBS n'est PAS une flashcard. Il s'agit d'une solution complète et évolutive qui évoluera au fil du temps. Nous n'avons pas encore tout dévoilé, mais de nouvelles fonctionnalités seront déployées pour les membres les plus férus de technologie de la communauté.\n \nAlors, qu'est-ce que le PBS UnlockSwitch exactement ? UnlockSwitch est une cartouche qui vous permet d'exécuter vos copies de sauvegarde de vos jeux Switch.\n \nNous avons décidé très tôt d'adopter une approche open source. Cela signifie que nous fournirons le logiciel et les fichiers nécessaires à la programmation de votre PBS. Nous avons immédiatement ajouté des programmeurs et inclus des fonctionnalités que personne d'autre ne propose encore, comme un simple commutateur pour naviguer et sélectionner des sauvegardes. Nous avons également intégré une antenne WiFi directement dans l'UnlockSwitch, ce qui vous permettra à terme d'exécuter des jeux ou d'autres applications externes.\n \nNous avons maintenant terminé le développement et les tests de l'Xtractor, la solution ultime pour créer une copie complète de votre jeu Switch original. Que vous souhaitiez l'enregistrer sur votre ordinateur, votre disque dur ou directement sur le lecteur microSD intégré à la carte, l'Xtractor est là pour vous.\n \nIl vous suffit de connecter l'Xtractor et deux nouveaux lecteurs apparaîtront sur votre ordinateur. D'un simple copier/coller, votre sauvegarde complète du jeu et son certificat unique (propre à chaque cartouche) seront entièrement transférés sur le périphérique de stockage de votre choix.\n \nLe kit UnlockSwitch PBS se compose de trois appareils :\n \n- Le linker UnlockSwitch\n- L'Xtractor\n- Un programmateur qui vous permet d'utiliser les deux appareils\n \nLe kit comprend son propre logiciel de programmation et est préconfiguré pour le partage de fichiers non illégal. En tant que solution open-source, nous prévoyons de partager à l'avenir des projets externes liés à notre équipe sur Twitter. Tous les projets ou équipes externes approuvés par notre équipe seront présentés. Nous nous concentrons uniquement sur le matériel, mais nous resterons en contact hors ligne avec tous les futurs développeurs.\n \nUn projet particulièrement prometteur vient de l'équipe OpenMig qui développe une solution logicielle spécifiquement conçue pour le matériel UnlockSwitch. Nous avons des échanges réguliers avec eux.\n \nLancement de la production :\n \n- Tous les tests internes pour l'UnlockSwitch et l'Xtractor ont été effectués et approuvés.\n- Nous sommes prêts à commencer la production de masse à la mi-octobre.\n \nTrois productions seront lancées simultanément : \n- UnlockSwitch Solo : 10 000 unités, disponibles exclusivement pour nos followers, avec une limite de 2 unités par client. \n- UnlockSwitch PBS Kit : 20 000 unités sans limite d'achat.\n- Xtractor Solo : 5 000 unités sans limite d'achat. \n \nAttention, nous ne proposons pas de précommandes. Les produits seront disponibles à l'achat en ligne uniquement lorsqu'ils seront en stock. Si un produit est en rupture de stock, il ne sera pas disponible à l'achat. Pour l'UnlockSwitch Solo, nous exporterons notre liste complète de followers le lundi 7 octobre. Assurez-vous de lier votre compte Twitter pour recevoir le prix de 24,90 $. Nos produits seront vendus exclusivement via notre site Web http://UnlockSwitch.com . Nous ne ferons pas appel à des distributeurs ou revendeurs externes pour le lancement. Cette décision nous permet d'éviter les retards ou le risque que les distributeurs proposent des précommandes et ne répondent pas aux attentes des clients. Nous avons choisi de gérer l'ensemble du processus en interne, de la fabrication au contrôle qualité et à l'expédition, le tout depuis notre plateforme en Chine. L'expédition par courrier aérien avec numéro de suivi mondial coûte 7 $ avec un délai de livraison estimé de 10 à 14 jours. Parallèlement au lancement de la production, nous terminons la mise en place de notre site Web officiel et de notre boutique en ligne. Dans notre prochain article, nous partagerons une date de lancement estimée pour le site ainsi que des détails sur les quantités disponibles pour l'expédition. Comme promis, nous publierons des vidéos de démonstration de nos produits, en commençant par notre première production. À nos bêta-testeurs et aux gagnants de l'UnlockSwitch Black Edition noire : vos unités sont en route et devraient arriver bientôt, nous apprécions donc votre patience. Merci. \n \n \nAu delà de ce long message, la team a publié une vidéo de démonstration, assez rapide, de son Xtractor. \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196834/in-switch-la-roadmap-unlockswitch-et-une-video-demo-de-lxtractor-1.png"
        }
    },
    "news_8": {
        "title": "[PS5] PS5 Payload Dev SDK v0.17.2 disponible",
        "content": "Le développeur John Törnblom vient de mettre en ligne une nouvelle version de son SDK spécifiquement dédié au développement de payloads ELF à destination des PS5.\n \nComme vous le savez, ce SDK a pour ambition de faciliter le portage et le développement de payloads qui pourront s'exécuter sur les consoles bénéficiant du loader ISO BD-JB ELF, mais aussi sur celles utilisant l'exploit \"ipv6 uaf\" basé sur le webkit.\n \n \n\n \n \nChangelog : \n \n- Version bump\n- toolchain: Correction d'une faute de frappe pour les envvars du shell\n- Ajout du support pour le firmware 1.01\n \nTéléchargement : PS5 Payload Dev SDK 0.17.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196827/in-ps5-ps5-payload-dev-sdk-v0172-disponible-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS5] L'exploit Lua fonctionne aussi sur PS5 jusqu'au firmware 10.01",
        "content": "Après quelques tests un peu plus poussés, nous pouvons vous confirmer que l'exploit Lua fonctionne également sur PS5. Dit comme ça, cela ne semble pas très utile, mais détrompez vous cela intéresse fortement Flat_z car il y voit un point d'entrée, et le Lua permet d'exécuter du code. \n \n \n\n \n \n \nComme Flat_z le rapelle, Lua 5.1 permet nativement de casser VM (la machine virtuelle) et peut permettre potentiellement de placer une chaine ROP. \n \n \n\n \n \n \nBien entendu, pour l'heure il est bien trop tôt pour se prononcer sur un éventuel hack, que ce soit un kernel, mais cela peut remplacer un exploit webkit, qui n'ont pas encore été découvert sur les firmwares récents de la PS5. \n \nNe mettez pas à jour votre console, si vous le pouvez, il restera toujours plus intéressant de rester sur un firmware le plus bas possible, les développeurs étant constamment en analyse et comparatif d'un firmware à l'autre afin de comparer les différences. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196786/in-ps5-lexploit-lua-fonctionne-aussi-sur-ps5-jusquau-firmware-1001-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] PS5 PKG Tool v1.0.2 disponible",
        "content": "Le développeur Master-s propose le fork d'un utilitaire proposé par DNNDHH il y a 8 mois, sous le nom de PS5 PKG Tool se cache un outil qui va vous permettre de créer et gérer des fichiers de package (PKG) pour la PlayStation 5. Il comprend des fonctionnalités pour construire, modifier et installer des fichiers PKG, qui sont essentiels pour le développement de jeux et le modding.\n \nLes versions s'enchainent et nous sommes déjà en présence de la version 1.0.2. \n \n \n\n \n\n \n \n \nChangelog 1.0.1: \n \n- Possibilité de sélectionner un emplacement d'application\n- Emplacement jeux\n- Emplacement média\n \nChangelog 1.0.2 : \n \n- Ajout de l'emplacement des icônes\n- Ajout de 1 à 14 icônes\n \n \nTéléchargement : PS5 PKG Tool v1.0.2 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1591128251.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1196784/in-ps5-ps5-pkg-tool-v102-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[PS4/PS5] Un exploit Lua sur le firmware 12.00 sur PS4",
        "content": "Le développeur Gezine propose un exploit Lua basé sur un point d'entrée connu sous le nom d'Artemis. \n \nArtemis est un moteur de jeu Visual Novel multiplateforme qui utilise le script Lua, qui prend en charge notamment Windows, Android, iOS, Web, la Nintendo Switch et la PlayStation. \n \nL'exploit réside dans le fait que la plupart des jeux Artemis chargent automatiquement le fichier de sauvegarde save9999.dat au démarrage du jeu. \n \nVous l'aurez compris, il suffit de modifier ce fichier et nous pouvons charger des scripts personnalisés.\n \n \n\n \n \n \nProcédure : \n \nDémarrage du jeu -> charger le fichier de sauvegarde \"save9999.dat\" -> charger le script iet \"inject.iet\" -> charger le script lua \"inject.lua\"\n \nLe Github contient actuellement un fichier de sauvegarde personnalisé pour le jeu PS4 CUSA16074 (Raspberry Cube), mais il en existe d'autres comme CUSA27389, ou encore CUSA13303, et il doit probablement y en avoir d'autres. \n \nSi vous avez accès au PS Store, vous pouvez simplement de télécharger la version d'essai pour la tester.\n \nVous devrez peut-être créer un fichier save9999.dat personnalisé pour chaque jeu.\n \nLa bonne nouvelle est tout cela fonctionne sur le dernier firmware 12.00 comme le montre la vidéo qui vient de sortir. Pour votre information, le développeur Master-S a testé la chose ici sur le firmware 9.00 de la PS4. \n \nSur PS5 aucun espoir par contre, du moins pour le moment, même après avoir été testé. \n \n \n \nTéléchargement : ArtemisLuaLoader\n \n \n",
        "images": {}
    },
    "news_12": {
        "title": "[XB] L'émulateur Xbox Orignal de la Xbox 360/Xbox One et Series mis à jour",
        "content": "Le développeur Derf a mis à jour son script permettant de mettre à jour l'émulateur interne d'une Xbox 360 qui permet la rétrocompatibilité avec la Xbox Originale. La liste de jeux Xbox pris en charge par la Xbox 360 est très faible, mais avec Xefu Spoofer vous pouvez étendre cette liste à beaucoup plus de titres. \n \nL'émulateur Xbox (originale), appelé en interne Xenon Fusion (XeFu), est utilisé pour jouer à des jeux Xbox originaux rétrocompatibles sur les consoles Xbox 360 et Xbox One / Series. Ces fichiers xefu se trouvent dans les jeux Xbox rétrocompatibles sortis sur les consoles Xbox One ou Xbox Series et sont signés pour fonctionner sur des devkits, ils ne peuvent donc pas être utilisés sur des Xbox 360 non modifiées, mais peuvent fonctionner sur des systèmes JTAG/RGH.\n \n \n \n \n\n \n \n \n \nPendant des années, les propriétaires de Xbox 360 hardmodded ont pu installer des fichiers d'émulateur Xbox d'origine \"déverrouillés\" qui permettent de démarrer tous les jeux Xbox d'origine sur une console, des fichiers proposés sur consolemods.org.\n \nBien que la compatibilité soit aléatoire, elle a été améliorée grâce à Xefu Spoofer, un script qui permet aux utilisateurs de sélectionner une version spécifique de l'émulateur pour jouer aux jeux Xbox d'origine pour une meilleure compatibilité. Nous avons maintenant des versions mises à jour supplémentaires de l'émulateur de 2019 et 2021 qui peuvent être utilisées, corrigeant encore plus de jeux.\n \n \n \n\n \n \n \nLa vidéo de Mario2011 ci-dessous explique comment prendre tous ces composants et les combiner ensemble pour obtenir une configuration de compatibilité ascendante, sélectionner des versions d'émulateur spécifiques avec Xefu Spoofer et utiliser les dernières versions pour jouer à d'autres titres Xbox originaux!\n \n \n \n\n \n \n \n \nTéléchargement : Xefu Spoofer v3\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196733/in-xb-lemulateur-xbox-orignal-de-la-xbox-360xbox-one-et-series-mis-a-jour-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1196733/in-xb-lemulateur-xbox-orignal-de-la-xbox-360xbox-one-et-series-mis-a-jour-2.png"
        }
    },
    "news_13": {
        "title": "[PS5] L'outil PS Multi Tools se met à jour pour la PS5",
        "content": "Le développeur SvenGDK vient de mettre à jour son utilitaire PS Multi Tools en version 14.4.5 avec de nombreuses nouveautés pour la PS5. Il met donc à la page son outil uniquement pour la PS5 tellement les nouveautés sont nombreuses ces derniers jours. Comme vous le savez probablement cet utilitaire s'adresse à tout ceux qui dispose d'une console Sony, de la PSP à la PS5 en passant par toutes les générations. PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale. Cette nouvelle version 14.4.5 apporte son lot de nouveautés pour la PS5. \n \n \n\n \n \nGénéralités :\n \n- L'écran d'accueil a été mis à jour et ouvre désormais par défaut la « bibliothèque de jeux » de la console ou de l'ordinateur de poche sélectionné.\n- Tous les outils, téléchargements et autres éléments disponibles se trouvent dans le menu principal de chaque « Ludothèque ».\n \n \nPS5 :\n \n- Les outils PS5 sont maintenant classés par ordre alphabétique dans le menu principal\n- Mise à jour de PS5 BD-JB JAR Loader v1.1 -> v2.0.0\n- Ajout de charges utiles JAR dans les téléchargements PS5 :\n -> Chemin d'accès à la classe de vidage\n -> Serveur FTP\n -> Mini Tennis\n -> Imprimer les propriétés du système\n -> Bug UMTX\n- Le 'Kernel Log Viewer' se trouve maintenant dans 'Tools'.\n- Suppression de 'Game Mods & Patches' dans PS5 Downloads -> Game Patches, utilise etaHEN à la place\n- Correction d'un bug dans la bibliothèque PS5 qui plaçait 'More Settings' dans le mauvais sous-menu.\n- Les propriétés des jeux sont désormais cachées dans la bibliothèque PS5 jusqu'à ce qu'un jeu soit sélectionné.\n- La police des onglets dans la bibliothèque PS5 a été légèrement augmentée.\n- L'espacement des jeux listés dans la bibliothèque PS5 a été légèrement augmenté (5px), y compris la police du titre du jeu.\n \nAjustements de l'interface graphique sur :\n- Graveur de disque Blu-Ray\n- PKG Merger\n- FTP Grabber (Dumper)\n- Gestionnaire de notifications\n- RCO Dumper\n- Payload & Mast1c0re Sender\n- Installateur de navigateur Web\nCréateur de projet GP5\n-> Ajout d'un nouveau bouton pour créer rapidement un fichier manifest.json\nSimple Shortcut PKG Creator a été mis à jour :\n-> Ajustements de l'interface graphique\n-> Ajout d'une option pour définir la version requise du système\n-> Ajout d'une option pour activer ou désactiver 'Enable HTTP cache' (activer le cache HTTP)\n-> Ajout d'une option pour activer ou désactiver 'Twin Turbo'.\n- Mise à jour de l'état de la configuration par défaut du configurateur etaHEN\n- Remplacement de la propriété source par défaut de WebView2 « https://google.com » par « about:blank » sur tous les outils qui utilisent WebView2 \n- Suppression du code inutilisé et Windows \n \n \nTéléchargement : PS-Multi-Tools 14.4.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196726/in-ps5-loutil-ps-multi-tools-se-met-a-jour-pour-la-ps5-1.png"
        }
    },
    "news_14": {
        "title": "[PS5] PS5 Jar Loader v2.0.0 disponible",
        "content": " \nLa scène PS5 est en feu, voilà que désormais une nouvelle version de l'outil PS5 Jar Loader vient d'être dévoilée, et elle n'arrive pas pour rien ! Pour rappel, PS5 Jar Loader est un outil de lancement de payloads s'appuyant sur un exploit au niveau du lecteur BD-J et qui est compatible jusqu'au firmware 7.61 de la console. \n \nIl permet d'exécuter des fichiers JAR qui seront préalablement gravés sur un BD-R.\n \n \n\n \n \n \nAvec cette nouvelle version 2.0.0, le développeur hammer-83 a apporté des correctifs pour vmspace, améliorant ainsi la stabilité car il faut savoir que tout n'est pas encore parfait, que certains kernel panics interviennent après une certaine période d'utilisation, et que les crashs sont encore fréquents, notamment lié à l'implémentation de UMTX. \n \nChangelog 2.0.0 : \n \n \n- Refonte dans le but d'avoir un support éventuel de la lecture et l'écriture sur le kernel. Implémentation de la primitive r/w du kernel basée sur l'ipv6, bien qu'elle nécessite d'abord une r/w externe du kernel. Ajout des mappings SDK nécessaires pour diverses API liées aux sockets.\n \n- Cadre pour activer les primitives de lecture/écriture du kernel à travers les exécutions JAR (nécessite un nouveau chargeur JAR) :\n \n- Exploitation d'un mécanisme de base indépendant pour la persistance de l'accès à la mémoire du noyau.\n- Implémentation de la lecture/écriture du kernel à l'aide de sockets ipv6\n- Refonte des classes de pointeurs pour ajouter une certaine protection contre les erreurs de page dans l'espace kernel.\n- Ajout d'une classe de décalage de clé spécifique au firmware. Pour l'instant, seule la version 1.02 est supportée\n- Correction du projet IntelliJ. (suppression de quelques fichiers déplacés)\n \n \nAttention, les versions antérieures de PS5 JAR Laoder n'exécuteront pas les JAR compilés avec cette version 2.0.0, en effet le framework a été modifié pour permettre un accès permanent à la lecture et l'écriture du kernel, ce qui a demandé des ajustements incompatibles avec les versions précédentes. \n \n \nTéléchargement : PS5 Jar Loader v2.0.0\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196725/in-ps5-ps5-jar-loader-v200-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[PS5] Un autre exploit pour bypasser l'Hyperviseur jusqu'au firmware 4.51 compris",
        "content": "Le développeur Flat_z a confirmé qu'il dispose d'un autre exploit permettant de bypasser l'hyperviseur sur PS5 disposant d'un firmware jusqu'au 4.51. \n \nComme vous le savez si vous lisez nos lignes, le développeur Specter avec l'aide de la chaine ROP de Chendochap a réussi à contourner l'hyperviseur sur les firmwares 1.xx et 2.xx jusqu'au firmware 2.50 pour être plus précis. C'est une bonne nouvelle, cependant cela signifie aussi qu'il faudra patienter sur les firmwares plus récent, notamment les 3.xx et 4.xx qui sont plus populaires du fait de la présence de l'exploit du lecteur blu-ray. \n \nLe développeur Flat_z a confirmé disposer d'un exploit différent de celui de Specter et qui permet de monter jusqu'au firmware 4.51, il précise que les failles sur lesquelles il s'appuie sont corrigé à partir du firmware 5.00.\n \n \n\n \n \nBien que Flatz lui-même ne semble pas avoir de problème à publier son travail, il a reconnu que celui-ci repose sur le travail d'un autre hacker. Flat_z a toujours était respectueux du travail des autres développeurs, et tant qu'il n'aura pas l'accord pour dévoiler cette trouvaille ou bien que le développeur ne publie lui même son exploit, il ne le diffusera pas. \n \nFlat_z confirme qu'il est donc possible de bypasser l'hyperviseur par différentes techniques, et qu'il a donc entre ses mains l'une d'entre elles qui n'a pas encore été dévoilée. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196723/in-ps5-un-autre-exploit-pour-bypasser-lhyperviseur-jusquau-firmware-451-compris-1.png"
        }
    },
    "news_16": {
        "title": "[PS5] Specter tiendra une conférence pour expliquer comment ils ont cassé l'Hyperviseur PS5",
        "content": " \nSpecter tiendra une conférence pour expliquer comment ils ont réussi à contourner l’hyperviseur de la PS5. Lors de cette présentation,dont il a titré \"Byepervisor\" ils examineront le rôle de l’hyperviseur dans la protection du système contre les attaques à privilèges élevés et discuteront des méthodes pour contourner ces mesures de sécurité.\n \n \n\n \n \n \nByepervisor : comment nous avons cassé l'hyperviseur de la PS5\n \nBien qu'un exploit du kernel de la PlayStation 5 (PS5) soit public depuis des années, l'architecture de sécurité basée sur l'hyperviseur a largement réussi à empêcher la retro engineering du système et à maintenir l'intégrité du kernel sur toutes les versions du firmware, jusqu'à présent.\n \nNous explorerons les méthodes utilisées pour contourner l'hyperviseur, permettant l'exécution de code personnalisé et le décryptage de la bibliothèque système. De plus, nous révélerons deux vulnérabilités jusqu'alors non divulguées dans les versions du firmware de l'hyperviseur jusqu'à 2.50, qui peuvent être exploitées pour compromettre complètement l'hyperviseur et contourner la protection eXecute Only Memory (XOM). De plus, nous publierons des scripts pour aider à la rétro-ingénierie du système, qui seront rendus publics après la présentation.\n \nSpecterDev est un chercheur en sécurité spécialisé dans l'exploitation de kernel et ancien intervenant sur hardwear.io. Il a commencé à faire des recherches sur les consoles il y a six ans sur la PlayStation 4 et s'est récemment concentré sur la PlayStation 5 et le processeur sécurisé AMD. Il co-anime également un podcast hebdomadaire et une chaîne multimédia appelée dayzerosec, qui suit et discute de diverses vulnérabilités, exploits et recherches récents.\n \n \n\n \n \nLes journées de conférence, dans lesquelles les intervenants présentent leur travaux, se tiendront les 24 et 25 Octobre prochain, à l'hotel Marriott Hotel d'Amsterdam, il coutera 200 euros pour les étudiants, 700 euros pour une personne lambda, 800 euros pour les entreprises, et 3100 euros pour ceux qui veulent participer sur les 3 journées de formation. Souvent ce genre d'évènements est entouré de formation hack ou d'astuces sur 2 ou 3 journées permettant aussi de rentabiliser l'évènement. Specter semble attaché à Hardwear.io, il y avait déjà présenté nombreux de ses travaux lors de conférences précédentes notamment en 2023. \n \nCela semble être une conférence fascinante pour ceux qui s’intéressent à la sécurité des systèmes et aux vulnérabilités des consoles de jeux. Est-ce que ce sujet vous intéresse particulièrement?\n \nTout est là : hardwear.io\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1986868739.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1556929601.png"
        }
    },
    "news_17": {
        "title": "[Switch] Mig Flash clarifie sur le ban des consoles",
        "content": "La Team Mig Flash vient de publier un message sur le ban des consoles, l'équipe en charge du développement du linker Mig Flash a voulu apporter quelques précisions sur leur site officiel.\n \n \n\n \n \nD'après les rapports que nous avons reçus et vus avec Mig Flash, TOUS les bannissements de console à ce jour ont été dus à l'utilisation de dumps incomplets OU à un mélange de fichiers BIN provenant d'autres dumps de cartes de jeu.\n \nNous n'avons pas encore vu un seul bannissement lors de l'utilisation de dumps de cartes de jeu 100 % complets avec tous les fichiers BIN et XCI provenant de la même carte de jeu.\n \nDe plus, la désactivation du Wi-Fi de la console Switch n'efface aucune activité avec des dumps incomplets.\nToutes les activités hors ligne sur la console sont enregistrées et seront transmises la prochaine fois que le Wi-Fi sera à nouveau activé sur la console.\n \nGardez ces informations à l'esprit et n'utilisez JAMAIS de dumps incomplets pour éviter les bannissements de console.\n \n \nPour que l'équipe appuie cet argumentaire, c'est qu'elle doit avoir un certain nombre d'utilisateurs qui se plaignent du bannissement de leur console, mais les utilisateurs doivent aussi avoir en tête que leur propre utilisation peut avoir des conséquences. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196615/in-switch-mig-flash-clarifie-sur-le-ban-des-consoles-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] Sudachi continue de s'améliorer sur MacOS, Windows et Android",
        "content": "Bien qu'il soit sous le retrait DMCA, le développement de Sudachi continue, le développeur Jarrod Norwell ne semble pas se soucier des injonctions de Nintendo et propose une mise à jour de son émulateur qui a la spécificité d'être proposé sur Windows, MacOS et Android, même si toutes les versions ne se suivent pas au même moment. \n \nLa version Android du fork de Yuzu reste celle qui obtient toujours les mises à jour les plus récentes, mais les utilisateurs de macOS peuvent désormais tester Sudachi sur Apple Silicon ! Attendez-vous à de nombreux plantages, car MoltenVK n'est pas encore à la hauteur. Il reste aussi à corrigé la réécriture, et notamment à tester sur iPad.\n \n \n\n \n \nSur Android la version 1.09 : \n \n- Ajout d'une page supplémentaire au flux de configuration et d'un bouton à la page des paramètres permettant aux utilisateurs de sélectionner un fichier title.keys\n \n- Correction d'un problème qui faisait planter l'application lors de l'installation d'un DLC ou d'une mise à jour.\n \n- Nécessite les fichiers prod.keys et title.keys\n \n- Les version Windows et MacOS se sont arrêtées à la 1.08, qui a apporté une amélioration de la précision et du dimensionnement de la mémoire.\n \n \nTéléchargement :  Sudachi 1.09\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196608/in-switch-sudachi-continue-de-sameliorer-sur-macos-windows-et-android-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] PS5-Exploit-Host-Self-Host-Tool d'idlesauce v1.0.0-rc1",
        "content": "Le développeur idlesauce dévoila première version de PS5-Exploit-Host-Self-Host-Tool, un moyen simple d'auto-héberger PS5-Exploit-Host. \n \n \n\n \n \nCe programme ne doit pas être considéré comme prêt à l'emploi, utilisez-le à vos risques et périls, il serait plus sage d'attendre une version stable ! Si vous souhaitez l'auto-héberger et le mettre en ligne, pensez à utiliser des projets activement maintenus comme PiHole pour le DNS et nginx pour l'hébergement de fichiers statiques. \n \nVous pouvez trouver les fichiers statiques (en option) déjà configurés avec appcache sous l'onglet versions du dépôt PS5-Exploit-Host.\n \n \nTéléchargement : PS5-Exploit-Host-Self-Host-Tool v1.0.0-rc1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196597/in-ps5-ps5-exploit-host-self-host-tool-didlesauce-v100-rc1-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] PS5-Jar-Loader v1.0.1 pour désactiver les mises à jour intempestives",
        "content": "Le développeur Master-s s'intèresse au hack PS5 et souhaite apporter sa pierre à l'édifice, il propose une nouvelle version de PS5-Jar-Loader qui est désormais proposé en v1.0.1. \n \n \n\n \n \nAprès une première version 1.0.0 qui permet de lancer : \n \n- dumpclasspath-1.0-SNAPSHOT.jar\n- ftpserver-1.0-SNAPSHOT.jar\n- minitennis-1.0-SNAPSHOT.jar\n- printsysprops-1.0-SNAPSHOT.jar\n- ps5-jar-loader-1.1.2.iso\n- umtx-bug-1.0-SNAPSHOT.jar\n \n \n \n\n \n \nVoilà que la version 1.0.1 apporte la possibilité de bloquer les mises à jour intempestives sur firmware 5.xx et 7.xx : \n \n- PS5 7.xx : Disable-updates\n- PS5 5.xx : Disable-updates\n \n \nTéléchargement : PS5-Jar-Loader v1.0.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196594/in-ps5-ps5-jar-loader-v101-pour-desactiver-les-mises-a-jour-intempestives-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1196594/in-ps5-ps5-jar-loader-v101-pour-desactiver-les-mises-a-jour-intempestives-2.png"
        }
    }
}