{
    "news_1": {
        "title": "[PS3] webMAN Mod 1.47.47m disponible",
        "content": "Le développeur Aldostools, de son vrai nom Aldo Vargas, propose la mise à jour de webMAN Mod, son plugin développé par Deank qui permet de lancer des backups de jeux PS3, PS2, PS1, PSP ainsi que des Blu-ray ou des DVD, stocké sur disque dur (y compris en NTFS) ou sur le réseau local, au format JB ou ISO. M@tsumot0 et Aldostools ont proposé une version MOD de webMan, apportant notamment le support de 21 langages utilisant des fichiers externes, un installer/updater pour CFW Cobra et NonCobra, le spoof IDPS/PSID, la désactivation des syscalls du cfw, et de nombreuses autres évolutions qui se sont succédées.\n \nAvec cette version 1.47.47m, le développeur a corrigé une régression découverte dans l'affichage de /setup.ps3, mais aussi corrigé un bug de détection dans la gestion des Rom de Mame. \n \n \n\n \n \n \nChangelog 1.47.47m\n \n- Régression corrigée dans l'affichage de /setup.ps3\n- Tentative de correction de la détection de nom partielle dans les ROM MAME\n \n \nTéléchargement : webMAN Mod 1.47.47m\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202599/in-ps3-webman-mod-14747m-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[Switch] switch_AIO_LS_pack 5.17.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.17.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format).\nLe mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.17.0:\nAjout de Sphaira qui remplace le Homebrew Menu, une sauvegarde de ce dernier se trouve au chemin \"switch/hbmenu.nro\" qui peut être restauré via les options de Sphaira.\nMise à jour de Status-monitor-overlay.\nMise à jour du homebrew AIO_LS_pack_Updater en version 7.01.00 contenant les évolutions suivantes:\nOptimisation de l'écriture des logs.\nAjout de fonctions pouvant servir plus tard.\nQuelques autres corrections mineures.\n\nNote: Pour traiter les problèmes particuliers de lancement de la sysnand en firmwares 17.0.0 et supérieurs c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets. Pour cela nous avons mis en place un questionnaire de satisfaction, en plus de pouvoir reporter les problèmes sur Github ou sur le forum vous pouvez utiliser ce questionnaire pour nous donner vos opinions de façon anonyme (pour des problèmes spécifiques il vaut mieux reporter sur Github ou ouvrir un sujet sur le forum, il y aura une réponse bien plus rapide et cela permet de demander plus de détails pour identifier et peut-être résoudre le possible problème.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe et vous avez aussi un tutoriel plus détaillé sur cette page, d'ailleurs ce dernier site contient aussi pas mal de tutoriels notamment sur la Switch. Enfin si vous souhaitez voir le changelog complet du pack il est consultable ici.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_3": {
        "title": "[PS3] Il est désormais possible d'utiliser la PS3Eye comme une webcam",
        "content": "Le développeur Seregon vient de dévoiler il y a quelques instants un nouveau programme qui permet d'utiliser la webcam PS3 Eye comme une webcam normale, pour ceux qui veulent l'essayer il n'a pas encore été compilé, et certaines librairies sont nécessaires. \n \nPs3EyeManager est un programme qui permet d'utiliser le périphérique PS3 Eye sur n'importe quel PC Windows. Il a été testé avec le AY0140890 et est entièrement fonctionnel.\n \n \n \n\n \n \n \nIl nécessite le pilote de test CL-Eye, le pilote personnalisé ps3eye_virtual_camera.dll, indispensable pour virtualiser la caméra pour les applications comme Discord, et OpenCV, une bibliothèque essentielle pour la gestion d'images et de vidéos.\n \nBien entendu l'indispensable Python sera également de la partie.\n \nTéléchargement : Ps3EyeManager\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202593/in-ps3-il-est-desormais-possible-dutiliser-la-ps3eye-comme-une-webcam-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] Linux pourrait arriver rapidement sur PS5",
        "content": "Le développeur Jose Coixao, plus connu sous le pseudonyme de Zecoxao, vient d'annoncer qu'un autre développeur de la scène PlayStation, Sleirgoevy, travaille sur le portage ou une adaptation de Linux sur PS5.\n \nComme nous en avons désormais l'habitude il est possible que cela passe par un loader. Concernant l'éventail des firmwares accessibles, Zecoxao précise que Linux devrait pouvoir se lancer sur tous les firmwares qui permettent de lancer kstuff. \n \n\n \n \nEnfin au niveau de la disponibilité il semblerait que cela soit assez proche, annonçant un \"soon\" via son profil X.com .  \n \n \nMerci Linkynimes pour l'information \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202591/in-ps5-linux-pourrait-arriver-rapidement-sur-ps5-1.jpg"
        }
    },
    "news_5": {
        "title": "[Switch] Sphaira v0.6.0 disponible",
        "content": " \nLe développeur TotalJustice propose une mise à jour importante de Sphaira, la solution de remplacement du hbmenu proposant des fonctionnalités inédites, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \nLes changements dans cette version sont très nombreux, cela passe par l'optimisation du téléchargement, du serveur FTP, il a ajouté la prise en charge de l'écran tactile, ou encore une option pour restaurer hbmenu lors de la désactivation de l'option \" Remplacer hbmenu à la sortie \". \n \n \n\n \n\n \n \n \nChangelog :\n \n- Ajout d'un téléchargeur github, ajouter des entrées dans/config/sphaira/github/name.json\n- Correction d'un bug de l'Appstore où j'ai oublié d'ajouter une pause dans un cas de commutation.\n- Optimisation considérable du téléchargement des ressources en utilisant des etags pour mettre en cache toutes les ressources et en ne retéléchargeant que lorsque l'etag change.\n- Tous les événements internes ont désormais un délai d'attente, ce qui signifie que si de nombreux événements se produisent en même temps, ils ne traiteront que la quantité maximale possible dans la tranche de temps donnée.\n- Les images à chargement paresseux sont désormais limitées à 2 par image. Cela supprime les pertes d'images lors du défilement dans l'App Store (en raison d'une E/S lente).\n- La détection de Daybreak prend désormais en charge les chemins personnalisés.\n- Le serveur ftp utilise désormais la configuration ftpsrv et tous ses points de sortie.\n- La vitesse de téléchargement (écriture) du serveur ftp a été grandement améliorée grâce à l'utilisation du code io ftpsrv.\n- Option pour restaurer hbmenu lors de la désactivation de l'option « Remplacer hbmenu à la sortie ».\n- Ajout des points de montage personnalisés pour le système de fichiers (sd et image).\n- Patch forwarder npdm pour prendre en charge les nouveaux indicateurs de débogage.\n- Ajout de la prise en charge de l'écran tactile.\n- Amélioration du temps de chargement de libpulsar (lib de chargement du son).\n- Option pour définir la musique de fond par défaut, placer le fichier dans/config/sphaira/themes/default_music.bfstm\n- Repenser les thèmes, désormais plus personnalisables.\n- Ajout l'héritage de thème, simplifiant grandement la création de nouveaux thèmes.\n- Correction de la liste contextuelle dessinée hors écran.\n- Correction de la barre de défilement dessinée hors de l'écran.\n- Le texte de la barre latérale défilera désormais si la longueur du texte est trop grande pour la région.\n \n \nModifications générées via github\n- Mettre à jour es.json \n- Traduire les champs manquants (portugais)\n- Mettre à jour ko.json et ja.json \n- Mettre à jour ko.json\n- Correction de certaines traductions de ko.json \n- Mettre à jour pt.json \n- Ajout de la prise en charge de la recherche de Daybreak dans les chemins non standard \n- Mise à jour de la langue française. \n- Mise à jour des langues coréenne et japonaise. \n- Ajout du support tactile \n- Ajout une nouvelle chaîne à tous les lang.json \n- corvée : mettre à jour pt.json \n- Créer vi.json \n- Traductions italiennes mises à jour \n- Mettre à jour zh.json \n- Changer quelques couleurs du thème. \n- Mettre à jour pt.json\n- Thème v2 \n- Correction de la fonction \"Mise à jour de l'application\" \n \n \nTéléchargement : Sphaira v0.6.0\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202574/in-switch-sphaira-v060-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202574/in-switch-sphaira-v060-disponible-2.jpg"
        }
    },
    "news_6": {
        "title": "[PS5] Le payload PS5 SELF Decrypter mis à jour par idlesauce",
        "content": "Le développeur idlesauce vient de proposer une mise à jour de son payload PS5 SELF Decrypter, pour rappel, il s'agit d'un payload qui utilise la lecture/écriture arbitraire du kernel pour décrypter les fichiers0 ELF signés (SELF) du système mais il permet aussi de dumper les ELF en texte clair sur une clé USB.\n \n \n \n\n \n \n \nChangelog : \n \n- Corriger la pause manquante\n \n- Corriger le chemin dans le flux de travail\n \n- Migration vers le SDK de John Tornblom afin d'ajouter les offsets 5.xx. \n \n- Par défaut, il sort et s'imprime sur stdout puisque le chargeur elf de John le redirige vers le socket de l'expéditeur, mais l'ancienne configuration est toujours présente en tant que cible séparée.\n \n \nTéléchargement : PS5 SELF Decrypter\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202567/in-ps5-le-payload-ps5-self-decrypter-mis-a-jour-par-idlesauce-1.png"
        }
    },
    "news_7": {
        "title": "[Switch] JoyShockMapper disponible en v3.6.0",
        "content": "Le développeur Electronicks propose une nouvelle version de son outil JoyShockMapper, nous n'en avons pas encore parlé mais il s'agit d'une belle alternative à DS4Windows qui malheureusement n'est plus mis à jour. \n \nJoyShockMapper permet d'améliorer l'expérience utilisateur avec notamment la visée gyroscopique ou le flick stick, permettant ainsi de profiter des trois axes de ces contrôleurs Nintendo, ce que ne permettent pas les contrôleurs Xbox par exemple. JoyShockMapper convertit les entrées de contrôleur de jeu courantes en événements de clavier, de souris et de contrôleur virtuel afin que vous puissiez jouer à des jeux PC avec ces contrôleurs. Utilisez les commandes gyroscopiques et le stick analogique pour jouer à des jeux avec plus de précision que n'importe quelle autre console.\n \n \n\n \n \nCette version 3.6.0 apporte de nombreuses corrections, notamment dans la gestion du SDL2 du Joy-Con, d'ailleurs il a été mis à jour de la v2.28.5 vers la 2.30.11.\n \nLa fonction Autoconnect active uniquement avec SDL2, permet de connecter automatiquement de nouveaux contrôleurs lorsque le nombre d'appareils change. \n \n \n \n\n \n \n \nChangelog \n \nNouvelles fonctionnalités, corrections de bugs et améliorations générales !\n \nLa plus grande amélioration est la refonte de la façon dont SDL2 gère les joycon pour qu'elle soit au même niveau que la version héritée/JSL.\nRECONNECT_CONTROLLERS [MERGE|SPLIT] fonctionne désormais comme prévu !\n \nMise à jour de SDL2 de la version 2.28.5 à la version 2.30.11\n \nCaractéristiques : \n \n- (SDL2 uniquement) Le thread AUTOCONNECT connectera automatiquement les nouveaux contrôleurs lorsque le nombre change. Désactiver avec AUTOCONNECT = OFF.\n- Nouveau modificateur d'action : Relâcher (-) peut être utilisé pour envoyer la touche vers le haut/le bas au moment où vous le souhaitez !\n- Si SDL2 a du mal à reconnecter les contrôleurs (problème HIDAPI parfois), il réessayera jusqu'à 2 fois.\n \nCorrections de bugs :\n \n- SDL2 gère désormais les joycons de la même manière que JSL. Appelez RECONNECT_CONTROLLERS [MERGE|SPLIT]pour compter les paires comme séparées ou non. La commande se souvient de celle qui a été utilisée la dernière fois. La valeur par défaut est MERGE.\n- Les pressions instantanées et turbo ne déclenchaient pas les événements comme prévu. Ce problème est désormais résolu.\n \n \n \nTéléchargement : JoyShockMapper v3.6.0\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202553/in-switch-joyshockmapper-disponible-en-v360-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS3] xai_plugin mis à jour en v1.17",
        "content": "Le développeur Evilnat a proposé son CFW 4.91.3 Beta 1 en intégrant une nouvelle version du module xai_plugin, une version qui est aussi proposée en standalone pour ceux qui souhaitent l'installer sans pour autant passer par la case CFW. \n \nLes changements de cette version sont intéressants car ils justifient à eux seuls la mise à jour partielle du CFW Evilnat, mais en standalone on peut tout de même profiter des améliorations. \n \n \n\n \n \n \nChangelog : \n \n- Désactivation temporaire du chargement de stage2 externe\n- Suppression des options Enable FTP et Disable FTP en raison de blocages aléatoires\n- Ajout de l'option Importer les licences dans rap.bin\n- Ajout de l'option Exporter les licences de rap.bin\n \nTéléchargement : xai_plugin v1.17\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202552/in-ps3-xai-plugin-mis-a-jour-en-v117-1.jpg"
        }
    },
    "news_9": {
        "title": "[Vita] eCFW 6.61 Adrenaline 7.1.5 disponible",
        "content": "Et voilà la première mise à jour de 2025 qui concerne l'eCFW 6.61 Adrenaline qui est désormais proposée en version 7.1.5.\n \nComme vous le savez, le plugin permet de modifier l'émulateur interne PSP dans la PS Vita en utilisant taiHEN afin d'exécuter le custom firmware 6.61. Adrenaline injecte le code personnalisé dans l'IPL - Inital Program Loader - et permet de lancer du code non signé dans la console lorsqu'elle s'allume.\n \n \n\n \n \nL'intérêt de cette version est d'introduire un nouveau système de récupération et d'installation qui améliore la gestion et l'installation d'Adrenaline.\n \nLa prise en charge de l'affichage des manuels dans les jeux au format ISO a également été ajoutée. Vous devez d'abord obtenir ou créer un fichier DOCUMEN.DAT, le renommer avec le nom du fichier ISO suivi de l'extension .DAT et le placer dans le même répertoire que le jeu. \n \nTéléchargement : eCFW 6.61 Adrenaline 7.1.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202539/in-vita-ecfw-661-adrenaline-715-disponible-1.png"
        }
    },
    "news_10": {
        "title": "[PS3] CFW Evilnat 4.91.3 Beta 1 disponible",
        "content": "Le développeur Evilnat propose son premier cadeau en ce début d'année 2025, il s'agit de la première Bêta de son CFW Evilnat qui est maintenant proposé en version 4.91.3. \n \nC'est la première version de son custom firmware à destination de la PS3 qui dispose de ce numéro 4.91.3, et pour cause les changements sont conséquents par rapport à la 4.91.2, notamment avec la mise à jour du kernel, ou bien celle du payload stage2, et de nombreux autres correctifs qu'il est possible de trouver dans le changelog.\n \n \n \n \n\n \n \n \n \nChangelog 4.91.3 Beta 1 : \n \n- Mise à jour du kernel\n- Mise à jour du paylaod stage2 \n- Correction du kernel DEX pour contourner le brick de bip d'ambulance (noyau - DEX chargé avec CEX TargetID) (par Evilnat)\n- Correctif pour autoriser les PS2CLASSICs sur DEX (par Evilnat)\n- Correction pour contourner l'erreur SSL Handshake sur DEX VSH (par Evilnat)\n- Mise à jour des émulateurs PS1/PS2 (par @mrjaredbeta et @kozarovv)\n- [COBRA] Ajout du support pour rap.bin (Par @esc0rtd3w)\n- [XAI] Désactivation temporaire du chargement de stage2 externe (à cause du manque d'espace dans le noyau)\n- [XAI] Suppression des options « Activer FTP » et « Désactiver FTP » en raison de blocages aléatoires.\n- [XAI] Ajout de l'option Importer les licences dans rap.bin (rap2bin) (Par @esc0rtd3w)\n- [XAI] Ajout de l'option Exporter les licences depuis rap.bin (bin2rap) (par @esc0rtd3w)\n- [XAI] Ajout de téléchargements optionnels\n > xai_plugin v1.17 \n > PS1/PS2 EMU Updater Cobra [v1.0]\n > PS1/PS2 EMU Updater MOD [v1.0]\n \n \nTéléchargement : CFW 4.91.3 Evilnat Cobra 8.5 [PEX] [BETA 1]\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202524/in-ps3-cfw-evilnat-4913-beta-1-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[Vita/Switch/PS3/PS4] Vita, Switch, PS3, PS4 ezRemote Client  mis à jour",
        "content": "Le développeur cy33hc a déployé de nombreuses mise à jour de son ezRemote Client, que ce soit sur PlayStation Vita, Nintendo Switch, PlayStation 3 ou PlayStation 4, toutes les versions ont été corrigées. \n \n \n\n \n \nPS4 (v1.33) :\n \n- Ajout du support pour les serveurs ftp qui n'autorisent pas la cmd NOOP. - Ceci corrige le problème où l'application se déconnecte après s'être connectée au serveur et avoir listé le premier répertoire.\n \nTéléchargement : PS4 ezRemote\n \n \n\n \n \n \nPS3 (v1.08) : \n \n- Ajout du support pour les serveurs ftp qui n'autorisent pas la cmd NOOP. - Ceci corrige le problème où l'application se déconnecte après s'être connectée au serveur et avoir listé le premier répertoire.\n \nTéléchargement : PS3 ezRemote\n \n \n \n\n \n \nSwitch (v1.07) : \n \n- Ajout du support pour les serveurs ftp qui n'autorisent pas la cmd NOOP. \n- Ceci corrige le problème où l'application se déconnecte après s'être connectée au serveur et avoir listé le premier répertoire.\n- Correction de l'upload de fichiers pour ftp et smb\n- Augmentation de la taille du mot de passe à 127 caractères\n \nTéléchargement : Switch ezRemote\n \n \nVita (v1.08) : \n \n- Ajout du support pour les serveurs ftp qui n'autorisent pas la cmd NOOP. - Ceci corrige le problème où l'application se déconnecte après s'être connectée au serveur et avoir listé le premier répertoire.\n- Augmentation du champ du mot de passe à 127 caractères\n \nTéléchargement : Vita ezRemote\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202515/in-vitaswitchps3ps4-vita-switch-ps3-ps4-ezremote-client-mis-a-jour-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202515/in-vitaswitchps3ps4-vita-switch-ps3-ps4-ezremote-client-mis-a-jour-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1202515/in-vitaswitchps3ps4-vita-switch-ps3-ps4-ezremote-client-mis-a-jour-2.png"
        }
    },
    "news_12": {
        "title": "[Vita] Street Fighter One s'invite en v1.1 sur Vita",
        "content": "La Vita continue d'attirer les développeurs, et pour cause, elle reste une console très attractive, et les optmisations récentes trouvées relance les ambitions. \n \nUn portage bien sympathique est un remake Mugen de Street Fighter One (SF1MR) utilisant Dolmexica Infinite comme moteur.\n \n \n\n \n \n\n \n \nStreet Fighter One MUGEN Remake, cette fois, il s'agit d'un remake du tout premier jeu Street Fighter original, simplement appelé Street Fighter One, qui est également connu dans les ports d'origine sous le nom de Fighting Street.\n \n \n\n \n\n \n \nChangelog 1.1 : \n \n- Correction d'un bug sur l'intro\n- Accès désactivé aux étapes Mugen KFM par défaut\n \n \nTéléchargement : SF1MR Vita v1.1\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202513/in-vita-street-fighter-one-sinvite-en-v11-sur-vita-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202513/in-vita-street-fighter-one-sinvite-en-v11-sur-vita-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1202513/in-vita-street-fighter-one-sinvite-en-v11-sur-vita-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1202513/in-vita-street-fighter-one-sinvite-en-v11-sur-vita-4.png"
        }
    },
    "news_13": {
        "title": "[WiiU] NUSspli Lite v1.154 disponible",
        "content": "En ce début d'année 2025, le développeur V10lator vient de publier une nouvelle version de son application NUSspli qui se destine à la Nintendo Wii U.\n \nNUSspli est un simple loader et installateur de package pour cette console, qui s'appuie sur un fork de l'excellent WUPDownloader de Poke303.\n \nPour parler simplement, NUSspli vous permet d'installer du contenu directement depuis les serveurs de mise à jour Nintendo sur votre Wii U. La version Lite est la version légale de NUSspli car ne comporte que le programme d'installation WUP, aucun contenu illégal, l'outil utilise des API pour obtenir les logiciels à partir du système d'exploitation Wii U. \n \n \n\n \n \nCette nouvelle version corrige les problèmes de mise à jour, améliore l'interface, corrige les fautes de frappe, des améliorations importantes ont été apportées aux traductions, avec notamment des corrections sur l'allemand, le turc et l'italien. \n \nLes changements sont nombreux pour un tel outil, des améliorations dans la gestion des bibliothèques (zlib, libCURL et nghttp2), les outils de développement ont été mis à jour, la stabilité a été amélioré grâce à une fonctionnalité qui utilise le SDL, ou encore l'utilisation de paramètres proxy poussés de la Wii U.\n \nD'autres correctifs supprime un gestionnaire d'exceptions personnalisé et des optimisations spécifiques ont été implémentées. Une bien belle version. \n \n \nChangelog 1.154 : \n \n- Correction de l'updater.\n- Mettre en évidence les entrées en file d'attente dans le menu de l'installateur. \n- Correction d'une coquille. \n- Ajout de la traduction en turc.\n- Ajout d'une nouvelle traduction. \n- Amélioration de la localisation allemande\n- Faire passer la zlib de 0f51fb4 à ef24c4c \n- Bump devkitpro/devkitppc de 20240702 à 20241111 \n- Mise à jour de libCURL et nghttp2 \n- Faire passer devkitpro/devkitppc de 20241111 à 20250102 \n- EXPERIMENTAL : Utiliser les paramètres proxy de la Wii U.\n- Mise à jour de la localisation turque des boutons \n- Correction de la traduction italienne. Crédits à @Duoslow pour avoir repéré ce problème. \n- Mise à jour de la localisation turque avec de nouvelles phrases et des invites supplémentaires \n- Correction 82e2f16 85e2b0c \n- EXPÉRIMENTAL : Utiliser SDL en amont. \n- Suppression du gestionnaire d'exception personnalisé. \n- Faire passer la zlib de 0f51fb4 à ef24c4c \n- Ajout d'une solution de contournement moche. \n \nTéléchargement : NUSspli Lite v1.154\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202475/in-wiiu-nusspli-lite-v1154-disponible-1.jpg"
        }
    },
    "news_14": {
        "title": "[PSP/Vita] PSP Ark-4 r152: New Years Edition",
        "content": "A l'occasion de la nouvelle année, le développeur JoseAaronLopezGarcia propose une nouvelle version d'Ark-4, voilà que débarque PSP ARK-4 r152 : News Years Edition. Comme vous le savez la principale différence entre ARK et Adrenaline sur les consoles PlayStation Vita et PlayStation TV est qu'il ne nécessite pas l'exécution de l'exploit HENkaku. ARK est un portage du PRO CFW, il s'agit plutôt d'un eCFW (Custom Firmware de la PSP sur Playstation Vita), tout comme TN-C il peut démarrer les homebrews et les jeux de la première PSP et PSX, mais il ne peut faire tourner d'homebrews sur Vita, il faudra obligatoirement passer pour cela par HENkaku.\n \n \n \n\n \n \n \nAprès quelques jours de fêtes, revoilà les développeurs au travail et propose une mise à jour qui a été préparée depuis un certain temps. Les développeurs avaient pour intention d'utiliser la liste de modifications typique de Sony, du type « Stabilité du système améliorée », mais comme cette version contient des fonctionnalités intéressantes, il a été décidé de les énumérer toutes :\n \n- Ajout de la possibilité d'exécuter l'intégralité du firmware 1.50 à partir d'un Memory Stick, pas seulement le homebrew, mais aussi le XMB. Cela signifie que ARK est maintenant un CFW 1.50 à part entière. Cela se fait via le 1.50 Kernel Addon.\n- Ajout du paramètre Force Extra RAM pour les installations PS Vita Standalone. Notez que ce paramètre est connu pour être instable.\n- Correction des plantages de mise en veille/reprise avec Inferno.\n- Correction d'un dépassement de tampon dans le patch syscon_plugin.\n- Ajout d'une nouvelle combinaison (L+R+Select+Down) pour revenir rapidement au XMB.\n- Correction des traductions italiennes.\n- Dernier point, mais non des moindres : Stabilité du système améliorée.\n \n \nTéléchargement : Ark-4 r152 : New Years Edition\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202469/in-pspvita-psp-ark-4-r152-new-years-edition-1.png"
        }
    },
    "news_15": {
        "title": "[WiiU/vWii] SaveMii v1.6.4 disponible",
        "content": " \nLe développeur Xpl0itU nous propose une nouvelle version du mod SaveMii qui est maintenant proposé en v1.6.4.\n \nSaveMii, est à l'origine un homebrew développé par le brésilien Ryuzaki_MrL et qui permet de faire un backup ou des restaurations de vos sauvegardes. Vous devez d'abord exécuter IOSUhax et le CFW Mocha pour que cet homebrew puisse fonctionner, et ensuite vous allez pouvoir archiver vos sauvegardes Wii U et vWii sur carte SD. \n \nAvec les versions modifiées le développement est plus poussé et les fonctions plus nombreuses, ainsi dans les dernières versions il est possible de réaliser les opérations sur plusieurs sauvegardes, d'ajouter l'icône du jeu, les sauvegardes sont mieux réalisés grâce à l'emploi du Unicode et cette dernière version 1.6.4 apporte à elle seule pas mal de nouveautés, les jeux de sauvegarde peuvent être restaurés en une seule fois à l’aide du traitement par lots, et l'interface a également été légèrement améliorée.\n \n \n \n\n \n \n \nChangelog 1.6.4 :\n \nAméliorations (par w3irDv) :\n- Nouvelle tâche : restauration par lots de titres déjà installés à l'aide des données de sauvegarde d'un jeu de sauvegarde par lots\n- Vous pouvez marquer et supprimer des emplacements en utilisant \"+\"/\"-\" dans le menu des tâches de sauvegarde.\n- Vous pouvez marquer et supprimer des jeux de sauvegarde en utilisant \"+\"/\"-\" dans le menu BackupSetList\n- Améliorations mineures de l'interface utilisateur - mise en évidence des couleurs lors de la navigation dans les menus\n- Mise à jour de SaveMii 1.6.3 Traduction chinoise simplifiée (merci à @kavid)\n \nCorrectifs (par w3irDv) :\n- Prévenir le freeze potentiel dû à un disque inséré dans la console\n \n \nTéléchargement : SaveMii v1.6.4\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202466/in-wiiuvwii-savemii-v164-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[PS5] John Tornblom travaille dur pour proposer de nouveaux plugins",
        "content": "On ne l'arrête plus, John Tornblom a publié de nombreuses mises à jour de nombreux de ses plugins ou de ses propositions pour la PS5. \n \n \n\n \n \n \n \nChangelog 0.24.1 :\n- libc : déclarer les dépendances sur crt1.o comme faibles\n- stacktrace : afficher une notification d'interface utilisateur lorsque des signaux POSIX fatals sont détectés\n \n \nChangelog 0.24 :\n- crt : améliorer la trace de pile imprimée sur /dev/klog lorsqu'une charge utile plante\n- crt : ajouter kernel_mprotect() qui contourne les permissions associées à l'appel système mprotect standard\n- crt : éviter d'allouer de la mémoire partagée\n- libc : autoriser mmap et mprotect à mapper la mémoire exécutable\n \nTéléchargement : SDK PS5 Payload v0.24.1\n \n \nwebsrv 0.18 : \n \n- rebuild avec le dernier SDK\n- éviter d'utiliser la mémoire partagée\n- retroarch : modifier les drapeaux et les paramètres du compilateur\n- retroarch : construire un noyau commodore amiga\n \n \nTéléchargement : websrv 0.18\n \n \nEt de nombreux plugins ont été remis à jour grâce au dernier SDK : \n \n \n \nFtpsrv 0.11.1 : \n \nhttp://github.com/ps5-payload-dev/ftpsrv/releases\n \nShsrv 0.13 : \n \nhttp://github.com/ps5-payload-dev/shsrv/releases\n \nKlogsrv 0.5.1 :\n \nhttp://github.com/ps5-payload-dev/klogsrv/releases\n \nGdbsrv 0.5 :\n \nhttp://github.com/ps5-payload-dev/gdbsrv/releases\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202434/in-ps5-john-tornblom-travaille-dur-pour-proposer-de-nouveaux-plugins-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS4/PS5] FetchPKG v0.3 disponible",
        "content": "Le développeur John Tornblom dévoile une nouvelle version de FetchPKG, ce programme permet notamment de construire des PKG pour PlayStation 4 et PlayStation 5. \n \nPour rappel il s'agit d'un outil simple basé sur cURL ( https://curl.se/ ) pour télécharger les mises à jour officielles des jeux Sony Playstation 4 et 5, et ainsi créer très simplement un fichier PKG. \n \nFetchPKG est disponible pour GNU/Linux, Windows (64bit), et les PS5 jailbreakées. Les mises à jour de jeux qui sont réparties sur plusieurs fichiers sont fusionnées automatiquement pendant le téléchargement. Si vous êtes derrière un pare-feu, vous pouvez télécharger les mises à jour via un serveur proxy, ce qui est pratique lorsque vous utilisez une PS5 jailbreakée qui est protégée d'internet.\n \nPour exécuter Fetchpkg sur PS5, vous devez le charger avec un loader ELF qui fournit une interface de ligne de commande, par exemple, shsrv, et les moyens de transférer l'ELF vers la ps5, par exemple, ftpsrv. Il vous faudra lancer les commandes qui téléchargeront le fichier ELF dans /data, qui se connecteront à shsrv et qui téléchargeront un fichier pkg dans /mnt/usb0 via un serveur proxy.\n \n \n\n \n \n \nCette nouvelle version v0.3 introduit des améliorations significatives, comme la possibilité de créer des cibles Windows avec la prise en charge de fichiers volumineux, et aussi une fonctionnalité permettant de vérifier les valeurs de hashs des fichiers téléchargés, cela permet notamment de garantir une plus grande fiabilité des opérations. \n \nSi, lors de l'utilisation de FetchPKG vous subissez un bug, vous pouvez désormais ouvrir un ticket sur le Github spécifiquement déployé pour l'occasion. \n \n \nChangelog v0.3 :\n \n- Construire des cibles Windows avec prise en charge de fichiers volumineux\n- Vérifier les valeurs de hashs des fichiers téléchargés\n \n \nTéléchargement : FetchPKG v0.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202428/in-ps4ps5-fetchpkg-v03-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] elfldr 0.17 et pacbrew 0.18 disponibles",
        "content": "Alors que nous avons la confirmation que les ventes de PS5 sont juste énormissimes, avec 4.1 M de ventes pour le mois de novembre, du simple au triple entre la partie Sony et la partie Microsoft au niveau mondial. \n \nVoici les ventes sur Novembre 2024 ainsi que les ventes totales : \n \nPlayStation 5 - 4,120,898 (67,698,724)\nSwitch - 1,715,636 (146,041,084)\nXbox Series X|S - 767,118 (31,208,651)\nPlayStation 4 - 4,118 (117,194,908)\n \n \nAu total, 67 Millions de PS5 contre 31 Millions de Xbox Series X/S ont été vendues depuis leur lancement, la Switch se vend encore très bien, avec 146 Millions de consoles vendues au total depuis son lancement. \n \n \n\n \n \nVoilà que débarque de la nouveauté pour PS5, avec la disponibilité de nouvelles propositions de John Tornblom qui dévoile la version 0.17 de elfldr, et la version 0.18 de pacbrew. \n \n \nElfldr 0.17 :\n \n- correction sur l'utilisation de la mémoire partagée \n \nPacbrew 0.18 :\n \n- Correction de la compilation sur les hôsts aarch64\n- Reconstruit avec le dernier SDK \n- Modification initiale de lz4 \n \n \nTéléchargement : elfldr 0.17 / pacbrew 0.18\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202412/in-ps5-elfldr-017-et-pacbrew-018-disponibles-1.png"
        }
    },
    "news_19": {
        "title": "[Multi] LibRetro publie son premier article de 2025",
        "content": "L'équipe LibRetro vient de publier un nouvel article, le premier de 2025, et la team explique qu'elle dévoile un nouveau core PS2, et qu'elle propose un meilleur support des téléviseurs CRT. \n \nPrincipalement développé lors de l'époque des téléviseurs CRT, l'affichage de la PlayStation 2 s'appuie sur un balayage de lignes et une synchronisation plutôt que sur des pixels ou des résolutions. \n \n \n \n\n \n \nLe synthétiseur graphique de la PS2, limitée à 4 Mo de VRAM, est incapable de gérer les tampons plus élevés que le 640 x 480, et les développeurs ont du s'appuyer sur les coprocesseurs vectoriels pour maintenir une fréquence d'images stable (à 50 Hs en PAL et à 60 Hz en NTSC).\n \nLes TV CRT se sont améliorées en prenant en charge la norme EDTV, certains jeux PS2 ont donc commencé à prendre  en charge l'affichage 480p (balayage progressif). \n \nSi le sujet vous intéresse il est possible de le retrouver sur le site LibRetro. \n \n \n\n \n \n \nLe ticket de blog est disponible ici : LibRetro\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202399/in-multi-libretro-publie-son-premier-article-de-2025-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202399/in-multi-libretro-publie-son-premier-article-de-2025-1.jpg"
        }
    },
    "news_20": {
        "title": "[WiiU] Bloopair v1.0.2 disponible",
        "content": "Le développeur GaryOderNichts propose depuis quelques heures une nouvelle version de Bloopair qui est maintenant proposé en v1.0.2, pour rappel, il s'agit d'un homebrew qui donne le pouvoir d'utiliser divers contrôleurs Bluetooth directement sur la Wii U en tant que contrôleur Wii U Pro sans logiciel ou matériel supplémentaire. \n \nBloopair se charge de patcher temporairement le module IOS-PAD et s'assure qu'il accepte tous les contrôleurs Bluetooth. De plus, il convertit les requêtes HID reçues (boutons, etc.) en conséquence. Jusqu'à quatre contrôleurs peuvent être connectés, les vibrations et l'indicateur de batterie fonctionnent.\n \n \n\n \n \n\n \n \nDans cette nouvelle version, le développeur est venu corriger quelques bugs, améliorer certains supports, et améliorer la configuration dans Koopair. \n \n \nChangelog 1.0.2 :\n \n- Améliore le mappage Joy-Con par défaut.\n- Ajoute une prise en charge de base pour le contrôleur DualSense Edge.\n- Corrige un problème où Joy-Con ne pouvait pas être correctement remappé dans Koopair.\n- Corrige un problème où les configurations DualShock 4 ne pouvaient pas être appliquées à tous les contrôleurs de ce type.\n- Corrige un crash lors de la suppression de configurations dans Koopair.\n \nPour rappel Koopair permet de :\n \n- Tester les boutons et les sticks des manettes à l'aide du testeur de manettes intégré.\n- Editer et créer des mappings de contrôleurs.\n- Modifier les options des contrôleurs.\n- Gérer les configurations de manettes sauvegardées.\n- Appairer les manettes DualShock3 via USB. L'ancienne application d'appairage a été abandonnée et supprimée des versions en faveur de Koopair.\n- et bien plus encore dans un futur proche...\n \n \nTéléchargement : Bloopair v1.0.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202384/in-wiiu-bloopair-v102-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202384/in-wiiu-bloopair-v102-disponible-1.png"
        }
    }
}