{
    "news_1": {
        "title": "[PS5] SiSTR0 travaille sur libhijacker",
        "content": "Suite à la libération du code source de libhijacker par Astrelsky, toute la scène a accès aux codes et aux commentaires du développeur permettant ainsi à d'autres personnes d'y travailler dessus.\n \nC'est le cas de SiSTR0, le développeur qui a su faire évoluer Mira, GoldHen, ou qui apporté de nombreuses contributions à FTS5, jkpatch ou encore ps4-pkg2usb.\n \n \n\n \n \nComme nous pouvons le voir, SiSTR0 propose un fork de libhijacker car il est venu modifier le code pour pouvoir compiler sous linux avec clang 12.\n \nPour ceux qui ne connaitraient pas, et ce serait bien légitime, Clang est un compilateur pour les langages de programmation C, C++ et Objective-C. Son interface de bas niveau utilise les bibliothèques LLVM pour la compilation. C'est un logiciel libre issu d'un projet de recherche universitaire.\n \nTout est là : SiSTR0/libhijacker\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1740874172.png"
        }
    },
    "news_2": {
        "title": "[PS4] GoldHEN 2.4b14 disponible",
        "content": "Le développeur Sistr0 a publié GoldHEN 2.4b14 pour la PS4 et la PS4 Pro. Il s'agit donc de la 14ème Beta de la 2.4 qui débarque avec des améliorations au niveau du chargeur de plugins, avec la prise en charge du format de fichier MC4 Cheat et au FTP, entre autres.\n \n \n\n \n\n \n \n \nLa plupart des hosts ont déjà été mis à jour, ils intègrent déjà cette version.\n \n \n\n \n \n \nChangelog :\n \n- Loader  de plugins amélioré\n- FTP amélioré\n- Amélioration de la prise en charge de MC4\n- Ajout de la prise en charge de la description de la triche\n- Installation des paquets en arrière-plan \n- Ajout d'informations sur les paquets\n- Correction de la prise en charge de la boîte à outils Orbis\n- Support des firmwares 5.05/6.72 et 9.00 \n \n \n \nPour avoir le loisir de profiter de cette nouvelle version il suffit de supporter le développeur ci-dessous.\n \nTout est là : GoldHEN 2.4b14\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175333/in-ps4-goldhen-24b14-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175333/in-ps4-goldhen-24b14-disponible-2.png"
        }
    },
    "news_3": {
        "title": "[XB] Le projet Stellar, une nouvelle puce pour la Xbox Originale",
        "content": "Il y a quelques jours Microsoft annonçait l'abandon total de la Xbox One, en effet, le géant de Redmond a annoncé qu'il ne développerait plus aucun jeu pour la Xbox One. La firme souhaite se concentrer sur la Xbox Series X et la Xbox Series S. \n \nPlus aucun jeu natif ne verra le jour sur Xbox One, cela ne signifie pas pour autant que cette console ne sera plus supportée. Petit reconfort, ce sera grâce au Xbox Cloud Gaming que Microsoft permettra de diffuser les jeux Xbox Series X et Series S sur Xbox One, maigre consolation. \n \nMais là n'est pas le sujet, il y a quelques jours a été dévoilé le projet Stellar, soit ce nom se cache une toute nouvelle solution de type modchip pour la Xbox Originale. \n \n \n\n \n\n \n \nLes développeurs, à qui l'on doit déjà la solution XboxHD+, ont travaillé dur pour proposer cette puce sur un FPGA intégré, s'appuyant sur une mémoire flash intégrée, et bénéficiant d'un port USB-C permettant de la flasher, et pouvoir déboguer le firmware. Cela permet de rendre cette solution évolutive, car bénéficiant en plus du StellarOS, un système d'exploitation spécialement taillé pour la bête. \n \nLe puce permet tout un tas de paramètre de débogage, de rendre la console compatible avec les disques jusqu'à 16 To, la prise en charge de la lecture d'ISO compressées, ou encore la prise en charge de contrôleurs Xbox One. \n \n \n\n \n \nToutes les fonctionnalités : \n \n- Outils intégrés pour le dépannage du système, la configuration, l'installation du disque dur, etc.\n- Mise à jour automatique du système basée sur le réseau.\n- ODE au niveau du noyau. (Chargement ISO)\n- Chargement ISO compressé. (CISO)\n- Prise en charge de contrôleurs supplémentaires. (Xbox One)\n- Chargement en réseau d'ISO et d'images de disques durs virtuels.\n- Prise en charge Titan+. Prise en charge des disques configurés et des disques durs formatés Titan pour un stockage natif allant jusqu'à 16 To.\n- Synchronisation UDMA optimale automatique. Jusqu'à UDMA5 autoconfiguré, vérifié et testé au démarrage.\n- Prise en charge du TRIM ATA natif.\n- Véritable contournement du lecteur de DVD. Aucune modification externe n'est nécessaire.\n- Prise en charge des configurations de RAM de 64, 128 et 256 Mo.\n- Mise à jour automatique de l'heure système via le réseau au démarrage.\n- Améliorations et corrections de la vidéo analogique avec la parité des caractéristiques de la XboxHD+.\n- Animation de démarrage native en 720P.\n- Force native 480P avec corrections HD+.\n- Améliorations Insignia.\n- Contrôle avancé du ventilateur.\n- Débogueur de kernel via USB.\n- Débogueur GDB via USB.\n- Et bien plus encore...\n \n \n \nTéléchargement : project-stellar / makemhz.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175310/in-xb-le-projet-stellar-une-nouvelle-puce-pour-la-xbox-originale-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175310/in-xb-le-projet-stellar-une-nouvelle-puce-pour-la-xbox-originale-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1175310/in-xb-le-projet-stellar-une-nouvelle-puce-pour-la-xbox-originale-3.png"
        }
    },
    "news_4": {
        "title": "[Switch] SwitchIdent v0.5 disponible",
        "content": "Trois semaines après la version 0.4, le développeur Joel16 semble reprendre un rythme intéressant sur son utilitaire SwitchIdent, pour rappel son logiciel d'identification est désormais porté sur la Nintendo Switch.\n \nL'outil comme sur les plates-formes sur lesquelles il est proposé (Vita, 3DS et Vita) permet d'afficher tout un tas d'informations sur le matériel, à savoir la version du système, du firmware, le numéro de série de la console, la région, la fréquence CPU ou GPU, ou encore les adresses IP utilisées.\n \n \n \n\n \n \n \nChangelog :\n \n- Utilisation de la résolution 1080p au lieu de 720p.\n- Correction de l'affichage du symbole de pourcentage de la batterie '%'.\n- Fusionner les informations sur la batterie et le chargeur sur une seule page. (Nous avons plus de place maintenant que nous sommes passés à une résolution 1080p).\n- Affichage correct de la température de la batterie (les températures internes (PCB) et externes (SoC) peuvent être trouvées dans la page System Info).\n- Affichage du statut du port casque dans la page System Info.\n- Afficher du firmware des joy-con de deux joy-cons connectés au P1. (Doit être retiré du rail et utilisé sans fil).\n \nRemerciements :\n \n- masagrator pour avoir indiqué que les températures internes/externes étaient respectivement liées au PCB et au SoC.\n- Le wiki SwitchBrew pour avoir documenté les différentes API de service utilisées dans SwitchIdent.\n- devkitPro pour la chaîne d'outils devkitA64 et le support de libnx.\n \n \nTéléchargement : SwitchIdent v0.5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175304/in-switch-switchident-v05-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[WiiU] Wii U Time Sync, Wup Installer GX2 et re_nfpii mis à jour",
        "content": "Petit méli-mélo de news pour la Wii U, la console reste attirante malgré ses ventes en retrait si l'on a compare aux autres consoles de Nintendo, voilà que certains développeurs ont mis à jour leur homebrews ou carrément proposé de la nouveauté, notamment pour Aroma. \n \nDéveloppé par Noa Mueller, Wii U Time Sync est un tout nouveau plugin qui va vous permettre de synchroniser automatiquement à la date et à l'heure d'internet, permettant ainsi de conserver à jour cet aspect de la console. \n \nWii U Time Sync va automatiser et garantir que la console soit toujours à jour en terme de date et d'heure, la console a tendance à se décaler par rapport à l'heure réelle, Wii U Time Sync corrige ce problème en synchronisant constamment l'horloge avec Internet , un peu comme le fait la Switch.\n \nPour l'installation, copiez le fichier \"WPS\" téléchargeable vers \" SD://wiiu/environments/aroma/plugins\", appelez le menu WUPS avec \"L\" + \"Control pad down\" + \"MOINS\" et réglez ce qui suit :\n \nSynchronisation activée : vrai\nHeure d'été : vrai\nDécalage horaire (heures) : 1 (pour l'Europe centrale)\nDécalage horaire (minutes) : 0 (pour l'Europe centrale)\nL'heure est alors synchronisée immédiatement lorsque le menu du plugin est fermé et à chaque démarrage du plugin. C'est le cas, par exemple, lorsque le menu Wii U est appelé. Cependant, la console devra peut-être être redémarrée pour que les modifications deviennent visibles.\n \nSoit dit en passant, il existe sntp pour la Wii , mais il doit être exécuté manuellement. Sur la 3DS, vous pouvez le faire dans le menu Luma3DS.\n \n \nTéléchargement : Wii U Time Sync (v1.1.0)\n \n\n \n \nWUP Installer GX2 \n \nLe célèbre outil WUP Installer GX2 a lui aussi été mis à jour pour le rendre compatible avec Aroma, cette application développée par GaryOderNichts permet comme vous le savez d'installer des titres, des DLC et des mises à jour dans la mémoire NAND ou sur un périphérique USB formaté pour la Wii U. \n \n \n\n \nTéléchargement : WUP Installer GX2\n \n \n \nre_nfpii\n \nUne réimplémentation plus ou moins précise de la bibliothèque nn_nfp.rpl de la Wii U, dans un but de recherche et d'émulation amiibo vient d'être mis à jour également. \n \n \n \n\n \n \n \n \nTéléchargement :  re_nfpii\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175283/in-wiiu-wii-u-time-sync-wup-installer-gx2-et-re-nfpii-mis-a-jour-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175283/in-wiiu-wii-u-time-sync-wup-installer-gx2-et-re-nfpii-mis-a-jour-2.jpg"
        }
    },
    "news_6": {
        "title": "[Switch] SimpleModDownloader 1.0.0 disponible",
        "content": "Salut à tous, j'ai créé un homebrew pour la switch et ai décidé de le rendre disponible pour tout le monde. Comme vous l'avez deviné celui-ci va servir à télécharger des mods directement depuis gamebanana. Et ensuite avec SimpleModManager vous pourrez les installer. (SimpleModManager peut être téléchargé depuis SimpleModDownloader)Téléchargement : SimpleModDownloaderPost GbaTemp : gbatemp",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175281/in-switch-simplemoddownloade-100-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[PS4] BzImages ps4 linux v2.6 saya - aeolia/belize - belize - baikal",
        "content": "BzImages ps4 linux version 2.6 saya\n\nCompilées sur ma ps4 pro\n\nRajout à la source 5.15.15 codedwrench :\n\ndivers patchs d'améliorations pour les jeux (dont fsr)\n\nmore-uarches-for-kernel 5.15-5.16.patch\nprjec_v5.15-r1.patch\n0003-glitched-base.patch\n0003-glitched-base-nonrt.patch\n.patch 0009-glitched-bmq.patch\n.patch 0007-v5.15-futex_waitv.patch\n.patch 0007-v5.15-fsync1_via_futex_waitv.patch\n\nMeilleure stabilité du wifi pour les distributions ps4 linux\n\nPossibilité d'émuler un android (fonctions activées dans le kernel du bzImage)\n\nReconnaissance des périphériques au format fat32/ntfs/exfat/ext4/btrfs\n\nDétection manettes :\nwii/ wiiu\n360 filaire\n360 sans fil + adaptateur Microsoft usb/bluetooth spécifique\nps3/ps4 filaire et wifi\n\nPartage de connexion internet par téléphone android ou iphone , en usb\n\nReconnaissance des périphériques audio sur usb\n(exemple micro usb sous discord)\n\nSnap et flatpak fonctionnels sur toutes distributions linux\n\nVPN (TUN/TAP)\n\nsupport ldt pour le jeu LOL\n\nDétections de périphériques usb wifi et usb bluetooth\n(3 fichiers configurés sont inclus dans le package, à installer sur la distribution linux utilisée)\n\n\nCompatible distributions linux en interne ou en usb\n\n \nbzImage 5.15.15 compatible carte mère aéolia/bélize\nhttps://e.pcloud.link/publink/show?code=XZfYVfZ2rgBevf80YJUYD2o9LLna0fFKrE7\n\n\nbzImage 5.15.15 compatible carte mère bélize (boot plus rapide)\nhttps://e.pcloud.link/publink/show?code=XZBYVfZScHDNtiAyThmgegFekArszLxAgek\n\n5.15.15-aeolia_belize-source_codedwrench-config saya 2.6 fallback\n(afin de détecter des périphériques)\nhttp://sayalinux.free.fr/pour_tuto_belize_2.6/compil_aeolia_belize_fallback.jpg\nhttps://e.pcloud.link/publink/show?code=XZmdVfZoDvH0WVxWqX2B9sdbERA1zTutt0X\n\nA noter que :\npour le bzImage aéolia/bélize,\nla led de la ps4 est différente suivant si l'on a une ps4 aéolia ou bélize (led bleue et led power violette clignotante / leds multi-alternante\npour le bzImage bélize,\nle boot est très rapide, led bleu/blanc + luminosité alternante\n\nRemerciements :\n\ncodedwrench pour ses sources 5.15.15 ps4 de son github\nYoshiLightStar pour les .patchs trouvés pour kernel 5.15.15\ndf_aus pour les tests de fonctionnalitées snap flatpak vpn\nDr4kk3N pour ses 3 fichiers de configuration pour le bluetooth\nfarofr pour les tests finaux pour aeolia/belize + test usb/bluetooth sur ps4 belize (sans bluetooth en natif fonctionnel)\n\n\n\nJ'ai compilé aussi un bzImage baikal 5.4.213 source whitehax0r config 2.6 saya\nhttps://e.pcloud.link/publink/show?code=XZWYVfZ1Yk5sSmauImJovmdu3OLGH8gyr07\n \n\n\n",
        "images": {}
    },
    "news_8": {
        "title": "[PS5] libhijacker de Astrelsky, le code source libéré et déjà un tools",
        "content": "Le développeur Astrelsky vient de publier cette nuit le code source de son PoC PS5 confirmant l'arrivée imminente des homebrews sur PS5. \n \nIl affirme que le github qui a été mis en oeuvre est temporaire, en attendant l'intégration de ce code dans un référentiel comme le SDK PS5. \n \n \n\n \n \nCela nous permet de confirmer que son code s'appuie sur le serveur Redis exécuté sur PS5 pour générer un processus «démon», qui lui même exécutera l'homebrew. Ainsi cela permet de lancer une autre partie exploitable différente de celle utilisée par le hack (Bluray ou Webkit), ce qui s'avère essentiel pour les homebrews. \n \nLe code source a été utilisé pour créer un petit utilitaire permettant de tester le PoC : PS5 Homebrew POC 3.xx 4.xx\n \n \n\n \n \nCode source de libhijacker : libhijacker\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175234/in-ps5-libhijacker-de-astrelsky-le-code-source-libere-et-deja-un-tools-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175234/in-ps5-libhijacker-de-astrelsky-le-code-source-libere-et-deja-un-tools-1.jpg"
        }
    },
    "news_9": {
        "title": "[Switch] Les rapports de Mai 2023 de Yuzu et Ryujinx : Zelda TotK",
        "content": "Les deux émulateurs de Nintendo Switch continuent de se faire de la concurrence, d'une part sur les évolutions apportées, mais en plus sur les rapports qui sont souvent émis à quelques heures d'intervalles, ce qui en fait un combat encore plus beau à voir, chacune des équipes de développement souhaitant apporter à son émulateur le meilleur. \n \n \n\n \n \nDu côté de chez Yuzu : \n \n \nLe rapport de Mai 2023 qui vient de paraitre fait état de plusieurs évolutions notamment pour The Legend of Zelda: Tears of the Kingdom. On l'a bien compris le titre est l'un des jeux les plus exigeants de la console. L'équipe revient sur le jeu en lui même, mais nous en explique un peu plus la technologie derrière, avec la gestion des textures ASTC, la VRAM en feu ce qui a donc imposé le rajout d'une option dans Yuzu, la recompression ASTC. \n \n \n\n \n \nCette nouvelle option vise à réduire la consommation de VRAM en transformant ces textures ASTC non prises en charge maudites par Ganon en quelque chose de plus adapté aux GPU à faible VRAM. Cela se fait actuellement à l'aide du CPU, mais l'accélération GPU est prévue pour l'avenir. Yuzu espère également ajouter une option pour utiliser BC7 à l'avenir afin de fournir une expérience de meilleure qualité.\n \nLe billet est énorme sur Zelda, mais il parle également d'Android, et des modifications graphiques, DMLA ou encore la gestion des Amibo, mais ce billet est tout simplement énorme. \n \nLe rapport est là :  yuzu-emu.org\n \n \n\n \n \n \nDu côté de Ryujinx :\n \nL'équipe de Ryujinx s'est concentré sur Breath of the Wild, oui le Zelda précédent, et sur Demon Slayer. Mais elle parle aussi de Tears of the Kingdom, comment cela pourrait en être autrement...Elle revient elle aussi sur le décodeur ASTC, et cela a amené beaucoup de bugs à l'opposé de Breath of the Wild. \n \nBreath of the Wild bénéficie des emplacements tampons exactement opposés, comme Tears of the Kingdom et la mise en oeuvre a évidemment été réglée pour le premier, pas pour le second. \n \nLe rapport est là : blog.ryujinx.org\n \n \nBref on le voit les développeurs des deux émulateurs se concentrent sur Tears of the Kingdom, un jeu qui restera dans la légende.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175200/in-switch-les-rapports-de-mai-2023-de-yuzu-et-ryujinx-zelda-totk-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175200/in-switch-les-rapports-de-mai-2023-de-yuzu-et-ryujinx-zelda-totk-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1175200/in-switch-les-rapports-de-mai-2023-de-yuzu-et-ryujinx-zelda-totk-3.png"
        }
    },
    "news_10": {
        "title": "[PS4] Iconit 5.12 disponible",
        "content": "Le développeur OfficialAhmed vient de mettre en ligne une nouvelle version d'Iconit, le logiciel qui nous permet de modifier et de remplacer l'icône des jeux sur la console PlayStation 4.\n \nAvec cette nouvelle version, le développeur a intégré de nouvelles fonctionnalités, notamment la possibilité de masquer toutes les icônes ou un ensemble d'icônes à la fois et de les télécharger directement.\n \nUn site est d'ailleurs disponible ici pour obtenir différents maques : https://all-exhost.github.io/Masks.html\n \n\nL'application de masques sur un ensemble d'icônes nécessite justement le téléchargement gratuit d'un masque à partir de ce site. \n \n \n\n \n\n \n \nVoilà le processus : \n \n- Créer un ensemble d'icônes (groupes)\n- Sélectionnez le mode Icônes dans la fenêtre principale\n- Sélectionnez Menu (coin supérieur gauche)\n- Sélectionnez Set Icon Group (Créer un groupe d'icônes)\n- Cliquez sur SET/UPDATE DEFAULT GROUP NOTE : Assurez-vous que toutes les icônes sont normales, sans modifications ni masques.\n- Toutes les icônes de la PS4 seront dans le groupe par défaut.\n \nPour créer un groupe personnalisé :\n \n- Cliquez sur SET CUSTOM GROUP (créer un groupe personnalisé)\n- Choisissez les jeux pour ce groupe, tapez le titre du groupe.\n- Cliquez sur SAUVEGARDER\n- Appliquer le masque\n- Cliquez sur Mask Maker en mode Icônes\n- Cliquez sur Mask... et choisissez le masque .Zip\n- Cliquez sur Group... et choisissez le groupe auquel appliquer le masque\n- Cliquez sur BAKE ICONS pour appliquer le masque à toutes les icônes du groupe sélectionné\n- Cliquez sur UPLOAD BAKED ICONS pour envoyer les icônes à la PS4.\n \nSi quelque chose s'est mal passé pendant le téléchargement, relancez l'application mais cette fois-ci, cliquez sur Continue (Continuer) - le processus de téléchargement sera répété pour les icônes restantes.\n\n \nTéléchargement : Iconit 5.12\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-326923226.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-187247020.jpg"
        }
    },
    "news_11": {
        "title": "[PS5] La preuve de concept de Astrelsky sur les homebrews PS5",
        "content": " \nLe développeur Astrelsky (Andrew Strelsky) vient de publier un PoC permettant de confirmer les propos de Zecoxao sur l'arrivée imminente des homebrews sur PS5.\n \nSa preuve de concept prend la forme d'un pack de fichiers composé d'un script send_elf.py , spawner.elf et test_elf.elf.\n \nCe test Homebrew, lorsqu'il est exécuté, dumpe les données du kernel sur le disque. Ce n'est pas encore un activateur d'homebrews pour PS5 (HEN). A noter qu'il faudra passer par l'exploit BD-JB ce qui en limite d'office l'accès au firmware récent.\n \n \n\n \n \nLa grande différence avec les anciennes solutions est qu'il fonctionne sur son propre processus,  le développeur mentionne que ce système \"utilise tellement de fichiers au lieu de tout extraire de dlsym\" et que \"vous pourrez lire/écrire dans d'autres processus utilisateur avec l'API. Les protections mémoire sont ignorées.\"\n \nAstrelsky a déclaré que son travail devait être nettoyé avant d'être intégré au SDK PS5 Homebrew. Il a volontaire laissé pas mal de commentaires dans ses fichiers pour parvenir à comprendre son fonctionnement, charges à certains de s'en saisir pour que dans quelques semaines ou jours quelque chose de plus concret arrive.\n \nTéléchargement : Poc\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175198/in-ps5-la-preuve-de-concept-de-astrelsky-sur-les-homebrews-ps5-1.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] switch_AIO_LS_pack 5.0.1 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.0.1.Pour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.Le homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables. Depuis cette news les évolutions sont les suivantes:- Changelog pour la version 5.0.0:Mise à jour de Hekate vers la dernière version de celui-ci.Changement mineur dans la configuration de Hekate, deux configurations ont été inversées pour être plus logiquement agencées.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 5.51.00:La détection du type d'emunand (fichiers ou partition) a été désactivé car non fiable dans certains cas (lancement de l'emunand via une configuration spécifique dans Hekate qui peut intégrer des paramètres de l'emunand non inscrits dans le fichier \"emummc/emummc.ini\"), cependant le homebrew détecte toujours s'il est lancé sur une emunand ou sur la sysnand.Un menu d'aide a été ajouté pour épurer le menu principal, il est accessible sur le menu principal en faisant un clique sur un des sticks.Nouvelles fonctions permettant de redémarrer la console via un combo de touches sur le menu principal (\"L+R\" pour un redémarrage normal, \"ZL+ZR\" pour redémarrer sur le payload de l'application qui fait un léger nettoyage après l'installation du pack donc normalement cette option ne devrait pas être utilisée sauf si vous savez se que vous faites).Nouvelles fonctions permettant d'activer/désactiver l'autoboot de Hekate sur une de ses configurations durant l'installation du pack ou via des combos de touches sur le menu principal (\"L+ZL\" pour le désactiver, \"R+ZR\" pour l'activer). En cas d'activation de l'autoboot vous pourrez choisir la configuration qui sera lancée par celui-ci.[*Les téléchargements sont affichés comme ils auraient dû l'être depuis bien longtemps, des bugs impactant l'affichage sur ce point ont donc été corrigés.L'affichage de la couleur du fond du menu en mode applet lorsque celui-ci passe en plein écran ou qu'il revient à la normal (l'affichage des infos de la console était impacté par ce bug) a été corrigé.Les configurations de Hekate intégrées au homebrew ont été modifiées pour refléter les changements effectués dans le pack.Certains changements mineurs dans les messages affichés ont été effectués.Probablement des corrections de bugs et modifications mineurs que j'ai oublié.- Changelog pour la version 5.0.1:Mise à jour du script de nettoyage de la SD pour améliorer la suppression des modules.Pour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.Sauf pour la correction de bugs je pense que le homebrew AIO_LS_pack_Updater est arrivé plus ou moins à sa version final, cependant si vous avez des idées pour l'améliorer autres qu'une interface graphique n'hésitez pas à m'en faire part (consultez le readme du Github du projet pour voir les choses que je voudrais faire mais que je n'arrive pas à faire pour l'instant, c'est dans la todo list).N'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets.Si vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] Picofly-X 1.0 et DragonFly pour PicoFly",
        "content": "Le développeur SQc04 propose de découvrir les modifications qu'il a apporté à une carte de développement PI rp2040 zéro, qu'il a adapté pour la Nintendo Switch, et notamment compatible avec les modèles V1, V2, Lite et Oled. Il propose les plans, il a listé tous les composants pour créer sa propre solution. \n \n \n\n \n \n\n \n\n \n \n \n \n \n \nIl dévoile les plans ici : \n \nhttps://github.com/SQc04/PICOFLY-X/blob/main/PCBV1.0/CENTER%20V1.0%20SCH_Schematic.pdf\n \nTous les composants sont listés dans un fichier Excel disponible lui ici : \n \nhttps://github.com/SQc04/PICOFLY-X/blob/main/PCBV1.0/BOM_CENTER%20V1_Schematic.xlsx\n \nLe câblage eMMC lui se trouve ici : \n \nhttps://github.com/SQc04/PICOFLY-X/tree/main/Cable/eMMC%20cable\n \net le câblage CPU ici : \n \nhttps://github.com/SQc04/PICOFLY-X/tree/main/Cable/CPU%20cable\n \n \n \n\n \n\n \nTout est là : \n \nhttps://github.com/SQc04/PICOFLY-X\n\n \n \n \nUne autre solution qui vaut le coup d'oeil est DragonFly, proposé par CodyRoseman et qui facile l'installation de PicoFly.\n \n\n \n\n \n \n- Double MOSFET embarqué dans un seul boîtier\n- Oscillateur CMOS\n- Tous les composants sont pratiquement dans le plus petit boîtier disponible.\n- Idéalement, ils devraient être fabriqués en 0.1mm flex, mais le FR4 0.8mm/1mm est bon marché et suffisamment bon pour cette révision.\n22mmx13mm(7/8 \"x1/2\"), la version finale sera 15mmx10mm(5/8 \"x3/8\")\n- Prix de vente d'environ 10 $ \n \n \n\n \n\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175100/in-switch-picofly-x-10-et-dragonfly-pour-picofly-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175100/in-switch-picofly-x-10-et-dragonfly-pour-picofly-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1175100/in-switch-picofly-x-10-et-dragonfly-pour-picofly-1.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1175100/in-switch-picofly-x-10-et-dragonfly-pour-picofly-6.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1175100/in-switch-picofly-x-10-et-dragonfly-pour-picofly-2.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1175100/in-switch-picofly-x-10-et-dragonfly-pour-picofly-3.jpg",
            "image_7": "https://www.logic-sunrise.com/images/news/1175100/in-switch-picofly-x-10-et-dragonfly-pour-picofly-4.jpg",
            "image_8": "https://www.logic-sunrise.com/images/news/1175100/in-switch-picofly-x-10-et-dragonfly-pour-picofly-5.jpg"
        }
    },
    "news_14": {
        "title": "[PS4] PS4norunpack par Zecoxao disponible",
        "content": "Le développeur Zecoxao, bien connu de la scène PlayStation 4, a décidé de publier un de ces outils à destination des utilisateurs de PS4, il s'agit de PS4norunpack, un utilitaire qui va permettre de décompresser la partition en texte clair sflash0 et la contrepartie en texte chiffré que vous obtenez de la ps4. Il nous affirme que cet outil devrait aussi fonctionner sur la PS5, mais qu'il n'a pas testé donc prudence. \n \n \n\n \n \nPS4 NOR unpack est un outil d'analyse, il ne servira qu'à une poignée d'entre vous qui s'amuser à flasher ou dumper la mémoire flash de leur PS4, plus précisément les sflash0/sflash0s0 et sflash0s1.crypt/sflash0s1 (avec en-tête 0x4000 octets de sflash0s1.crypt).\n \n \nPour le code source c'est par ici : ps4norunpack\n \n \nTéléchargement : ps4norextract.7z\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175099/in-ps4-ps4norunpack-par-zecoxao-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[XB] Cerbios Tool v1.2.0 et Cerbios v2.3.1 Beta",
        "content": "Les petits gars de Cerbios dévoile une nouvelle version de leur bios taillé pour la Xbox Originale, ils dévoilent en effet la version 2.3.1 de Cerbios en version Bêta. \n \nA cette occasion ils dévoilent également Cerbios Tool v1.2.0, on fait le tour du propriétaire, en commençant par Cerbios (Xbins.org). \n \n \n\n \n \nCerbios V2.3.0 Beta :\n \n- Ajout d'une nouvelle façon de personnaliser le bios en utilisant l'outil Cerbios (Windows seulement ATM) *\n- Ajout de la possibilité de thématiser le logo Cerbios via l'outil Cerbios.\n- Ajout de la possibilité de mettre à l'échelle ou de cacher entièrement le logo Cerbios via Cerbios Tool *\n- Ajout d'un mode UDMA expérimental 6 (nécessite Ultra DMA (80-Conducteur)) *\n- Câble IDE/ATA et adaptateur Startech.                                       *\n- Suppression des clés IGR personnalisées de l'INI. Maintenant configurable via l'outil Cerbios.\n- Ajout de la possibilité d'utiliser les lettres de lecteur dans les chemins d'accès ainsi que le format \\Device*.\n- Ajout de la possibilité de configurer les modes UDMA 2-6 via l'outil Cerbios.\n- Ajout de la possibilité de régler le mode UDMA Auto via l'outil Cerbios Pour Startech ou *\n- Pour les adaptateurs génériques Sata vers IDE. Le mode automatique détectera le mode UDMA *\n- Mode UDMA supporté par le lecteur et le règle. Cette fonction est expérimentale, vous * * pouvez démarrer en mode UDMA\n- Vous pouvez démarrer en mode UDMA 2 (mode sans échec) en démarrant la Xbox à l'aide de la fonction d'éjection.   *\n- Veuillez partager vos résultats du mode automatique dans notre salle sur Discord.       *\n- Ajout d'un démarrage automatique en mode sans échec si une erreur 9 ou 13 est détectée en raison d'une incompatibilité UDMA.\n- Mode UDMA incompatible.                                                  *\n- Mise à jour de Cerbios.ini pour prendre en charge les noms de chemin des lettres de lecteur.         *\n- Amélioration de la stabilité du système\n \n- Nous travaillons à la résolution de certains des problèmes vidéo signalés pour la version 1.6 avec les câbles vidéo composites.\n- Les câbles vidéo composites. Nous vous recommandons d'utiliser des prises composantes ou HDMI. \n- Nous vous recommandons d'utiliser des solutions en composantes ou HDMI Plug-and-Play telles que Chimeric HDMI, XBOX2HDMI ou Xedusa.           *\n- Nous sommes déjà en train de travailler dur sur notre prochaine version majeure.\n \n \nTéléchargement : Cerbios v2.3.1 Beta\n \n \n \n\n \n \nCerbios Tool v1.2.0 ajoute la prise en chargede BFM, il ne s'agit pas de la célèbre chaîne de TV, il s'agit de l'accronyme de Bios Flashing Manager. Cela signifie que le processus de chargement et de sauvegarde du BIOS sera automatiquement mis à jour pour prendre en charge BFM. De plus, le Phoenix Boot Loader est également fourni , qui peut être utilisé en renommant le fichier bios Cerbios.bin ou en apportant les modifications appropriées au fichier boot.cfg. \n \n \nTéléchargement : Cerbios Tool v1.2.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1371825692.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-895571561.png"
        }
    },
    "news_16": {
        "title": "[Switch] L4T Ubuntu v5.1.1 disponible",
        "content": "Comme vous le savez L4T Ubuntu (ou \"Linux 4 Tegra Ubuntu\") est une distribution Linux personnalisée pour les appareils Tegra de NVIDIA, tels que la console de jeu Nintendo Switch. \n \nHekate, qui est considéré comme l'une des principales contributions de CTCaer n'est pas son seul projet. CTCaer a commencé à travailler sur des projets pour la Switch peu de temps après sa sortie en 2017, et L4T Ubuntu est l'un de ces projet open-source populaire. \n \n \nCette nouvelle version corrige des problématiques sur la RAM des modèles Erista qui peut être overclockée à 2133 MHz et celle des modèles Mariko à 3000 MHz via une modification de l'INI de Hekate. \n \n \n \n\n \n \n \n \nLe calibrage des manettes Nintendo Switch Lite a été amélioré, il faut d'abord sélectionner l'option \"Dump Joy-Con BT\" dans hekate v6.0.5+. Certaines cartes SD Taishin/Silicon Power sont désormais correctement initialisées et le calibrage du stick a été adapté lorsque les valeurs prédéfinies des Joy-Con et du Pro Controller ne peuvent pas être lues.\n \nUne autre nouveauté dans l'espace utilisateur est la commande \"mem-bench\", qui permet de benchmarker la RAM.\n \nLes utilisateurs qui ont déjà installé L4T Ubuntu peuvent le mettre à jour via le Software-Updater ou par apt.\n \nChangelog intégral ici : ubuchangelog\n \nTéléchargement : L4T Ubuntu v5.1.1 / github.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175093/in-switch-l4t-ubuntu-v511-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[PS4] PS4Profile v0.5 de Master_9 disponible",
        "content": "Et bien cela évolue assez vite pour PS4Profile puisque la version 0.5 vient d'être proposé par son développeur Master-s. \n \nIl y a quelques heures, Master_9 a dévoilé en effet une nouvelle mouture de son logiciel qui permet d'éditer le nom de son profil afin d'y apporter des modifications qu'il est impossible de faire dans une configuration standard.\n \n \n\n \n \n \nMaster_9 n'en est pas à son coup d'essai sur PS4, puisque par le passé il a contribué à PS5-PS4Tools, PS5-PS4PKGSender, ou encore PS4-PS5-Mast1c0re-Payloader.\n \n \n\n \n \nLe fonctionnement de PS4Profile est assez simple, l'outil peut se connecter à une PS4 Jailbreakée compatible avec le FTP, ce qui permet d'enregistrer le profil directement sur la console et de le rafraîchir en temps réel. L'outil permet l'édition de l'avatar, de votre nom / prénom, et l'icône associée à votre profil. \n \n \nTéléchargement : PS4Profile v0.5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175068/in-ps4-ps4profile-v05-de-master-9-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[PS4] shadPS4 un nouvel émulateur PS4",
        "content": "La liste s'allonge sur les émulateurs PlayStation 4, voilà qu'un nouvel émulateur vient d'entrer dans la ronde et il se nomme shadPS4. \n \nDéveloppé par georgemoralis, qui se fait aussi appeler Shadow, il est à l'origine de nombreux projets à succès comme PCSX, PCSX2, PXSP, JPCSP ou encore arcadeflex.\n \nPour l'heure le projet est assez limité puisqu'il ne prend en charge sur des fichiers PS4 ELF, espérons qu'il progresse rapidement, même si ça seul le temps nous le dira. \n \n \n\n \n \n \n \nTout est encore à construire, vous devez utiliser Visual Studio 2022 pour cela, et il y a déjà des évolutions prévu comme un extracteur PKG, ou encore une interface graphique digne de ce nom utilisant imgui, SDL3 et Vulkan. Le développeur souhaite également mettre en oeuvre un meilleur système de journalisation avec spdlog.\n \nPour tout dire le projet a démarré en Octobre 2022, et il a déjà connu plus de 150 modifications, ce qui est assez important en matière de développement sachant que georgemoralis est seul pour le moment. \n \n \n\n \n \n \n \nTout est là : shadPS4\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175067/in-ps4-shadps4-un-nouvel-emulateur-ps4-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175067/in-ps4-shadps4-un-nouvel-emulateur-ps4-1.png"
        }
    },
    "news_19": {
        "title": "[XB] Dolphin UWP v1.1.6 et XBSX2 v2.0.2 disponibles",
        "content": "Soirée Microsoft Xbox car ce soir une conférence a lieu, mais il n'est pas pour autant question d'oublier les émulateurs déjà proposés, puisque 2 d'entre eux ont été mis à jour. \n \nL'émulateur Dolphin dans sa version UWP vient d'être mise à jour en version 1.1.6, Dolphin nous permet d'émuler les jeux GameCube et Wii sur les consoles Xbox One et Xbox Seies X/S.\n \n \n\n \n\n \n\n \n \nUn nouveau menu de pause dans le jeu avec des onglets de savestate (sauvegardes rapides) et de netplay (jeu en ligne) ont été ajoutés à partir de cette version. L'interface a également été améliorée, avec l'ajout d'un nouveau système d'onglets qui permet d'organiser les jeux par console (Wii, GameCube et WADS/ELF).\n \nCette version ajoute également un nouveau système de thèmes, comprenant deux thèmes par défaut créés par TXF et UR 0WN DAD, et enfin d'autres améliorations incluent la possibilité de déconnecter le contrôleur en sélectionnant l'option \"Aucun\" dans la fenêtre du contrôleur. Enfin des corrections de bugs ont été apportées pour parfaire le tout. \n \n \nTéléchargement : dolphin\n \n \n\n \n \nAutre émulateur proposé par SirMangler, XBSX qui passe en v2.0.2.\n \nCorrectifs : \n \n- Correction du (des) problème(s) visuel(s) avec Gran Turismo/autres jeux.\n- Numéro de version dans le menu principal.\n- Mise à jour vers la dernière révision.\n \nProblèmes connus dans cette version :\n \n- Le fait de définir \"Software\" comme paramètre par jeu provoque un plantage du jeu.\n- La boîte de dialogue d'échelle de l'OSD se ferme parfois de manière aléatoire lors de la saisie manuelle de nombres.\n \n \nTéléchargement : XBSX v2.0.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175015/in-xb-dolphin-uwp-v116-et-xbsx2-v202-disponibles-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175015/in-xb-dolphin-uwp-v116-et-xbsx2-v202-disponibles-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1175015/in-xb-dolphin-uwp-v116-et-xbsx2-v202-disponibles-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1175015/in-xb-dolphin-uwp-v116-et-xbsx2-v202-disponibles-4.png"
        }
    },
    "news_20": {
        "title": "[Switch] Battery Desync Fix NX v1.2.2 disponible",
        "content": "CTCaer vient de dévoilé une nouvelle version de leurs homebrew Battery Desync Fix NX qui passe désormais en version 1.2.2, pour rappel Battery Desync Fix NX est un homebrew permettant de corrigé la désynchronisation de la batterie sur Nintendo Switch.\n \n \n\n \nAvis de non-responsabilité :\nCette application ne bénéficie d'aucune assistance. Utilisez-la à votre propre discrétion.\nCette application ne doit pas être incluse dans les packs, les serveurs d'applications, etc.\nIl s'agit d'une application spécialisée qui ne doit être utilisée que si l'utilisateur a de réels problèmes avec la capacité totale et le pourcentage.\nLa façon la plus simple d'identifier le problème est d'observer des hausses et des baisses aléatoires du pourcentage de la batterie et de constater que la \"capacité actuelle\" ne correspond pas à la tension moyenne/oc.\n \nComment vous en servir ?\nEn supposant que vous commenciez par SYS CFW ou OFW/Stock :\n \n1. Démarrer SYS CFW\n2. Lancer l'application\n3. Appuyer sur le bouton X pour forcer l'init\n4. Quittez l'application correctement (appuyez sur \n5. Si vous voulez le faire pour OFW, redémarrez et démarrez OFW ou Stock.\n6. Effectuez 2 cycles de charge complets (??% -> 100% -> 0% -> 100% -> 0%).\n- Ne redémarrez pas sur autre chose tant que ce n'est pas fait !\n- Lorsque HOS se met en veille parce que la batterie est trop faible, réveillez-le encore et encore jusqu'à ce qu'il affiche l'icône rouge de la batterie.\n- Si HOS est éteint, mettez le chargeur pour accéder à HOS.\n* S'il est bloqué sur l'écran noir et l'icône du chargeur, débranchez/rebranchez après un moment pour pouvoir entrer à l'intérieur.\n* Ne le chargez pas complètement, car le HOS rétablira le contexte précédent de la jauge de carburant.\n \n\n\n \nChangelog :\n \n- Ajout d'une mesure d'atténuation pour les utilisateurs dont les données de sauvegarde du système sont corrompues.\n- Recompilation avec la nouvelle version de libnx\n\n \nLien de téléchargement : Battery Desync Fix NX v1.2.2\n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1160014/in-switch-ctcaer-devoile-le-correctif-de-desynchronisation-de-la-batterie-1.png",
            "image_2": "https://www.logic-sunrise.com/forums/public/style_emoticons/default/cool.gif"
        }
    }
}