{
    "news_1": {
        "title": "[PS4] PPPwn - PPPoE RCE de TheFlow disponible pour PS4 jusqu'au kernel",
        "content": "Le célèbre développeur TheFloW vient de publier PPPwn, il s'agit de son exploit kernel pour les consoles PS4 fonctionnant jusqu’au firmware 11.00. Cet exploit est techniquement un jailbreak et repose sur une vulnérabilité publique assez ancienne dans l’un des pilotes réseau FreeBSD (sppp), qui n’a apparemment jamais été corrigée pour la PS4 ou a été réintroduite par erreur à un moment donné.\n \nPPPwn est une attaque d’exécution de code à distance, ce qui signifie que quelqu’un sans accès physique à la console pourrait techniquement déclencher l’exploit en configurant un point de terminaison PPPoE “malveillant”. Cependant, il faudrait que la PS4 cible se connecte réellement à ce point de terminaison pour que l’exploit soit activé.\n \nPour le moment, PPPwn affiche simplement un message de confirmation une fois qu’il obtient un accès root. Des “payloads” devront être adaptés à l’exploit et au firmware 11.00, notamment des payloads personnalisés tels que GoldHEN ou Mira. On s’attend à ce que de tels portages prennent quelques jours.\n \n \n \n\n \n \nPour ceux qui sont sur un firmware supérieur à 11.00, PPPwn ne leur sera pas utile, et ils devront probablement attendre un autre jailbreak, cependant, si vous êtes sur le firmware 11.00 ou inférieur (cela a été testé également sur le firmware 9.00), il pourrait y avoir une chance de revenir au firmware 11.00 grâce à une copie de sauvegarde du firmware précédent conservée par la PS4 en cas de mise à jour problématique. Cela nécessiterait cependant un effort de soudure considérable mais en théorie cela pourrait fonctionner.\n \n \n \n\n \n \n \nComme le dit TheFlow, il a décidé de publier PPPwn plus tôt. Le premier noyau RCE pour PlayStation 4 prenant en charge les firmwares jusqu'au 11.00. \n \n \nEst-ce que cela peut être adapté à la PS5 ? via SpecterDev a répondu sur X :\n \nComme j'ai vu beaucoup de personnes poser des questions à ce sujet, le dernier RCE de theflow ne sera pas facilement adapté à la PS5. La PS4 est beaucoup plus faible en termes d'atténuations et de sécurité, ce qui a joué un rôle en autorisant un exploit à distance sans exécution de code dans l'espace utilisateur. La PS5 est différente les SMAP+CFI rendent cela beaucoup plus difficile à réaliser.\n \n \n \n\n \nL'OM joue également un rôle, même si CFI n'était pas un problème, vous ne pouvez pas non plus facilement amener des gadgets en ROP. Ce n'est peut-être pas impossible, mais une nouvelle stratégie serait nécessaire et vous devrez opter pour R/W. Vous auriez probablement également besoin d'un exécutable de code utilisateur. Je ne m'attendrais à rien de sitôt..\n \n \nTout est là : https://github.com/TheOfficialFloW/PPPwn\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-983461838.png"
        }
    },
    "news_2": {
        "title": "[PS4/PS5] La preuve du jailbreak du firmware 9.00 à 11.00 (PS4) et jusqu'au 8.20 (PS5)",
        "content": "Comme vous le savez probablement, TheFlow présentera l’exploit lors de la conférence de sécurité TyphoonCon dans quelques semaines, mais il a déjà partagé certains détails de la vulnérabilité dans un rapport détaillé sur le programme de primes aux bugs de Sony sur HackerOne.\n \nComme toujours avec TheFlow, ses accords exposent la vulnérabilité découverte contre le fait qu'elle soit rapportée à Sony, et avec le code dévoilé il est facile de réimplémenté la faille dans le navigateur afin de voir son fonctionnement. \n \nEn outre, le développeur obhq a publié une mise en oeuvre expérimentale de l’exploit de TheFlow pour le jailbreak de la PS4 en firmware 11.00. C’est une implémentation très préliminaire de l’exploit kernel de TheFlow et il est conseillé aux utilisateurs moins familiers avec ce genre de manipulations d’attendre une version plus accessible du jailbreak.\n \nTheFlow présentera l’exploit lors de la conférence TyphoonCon, et il est certain qu'il ira encore plus loin dans sa présentation. \n \nImplémentation : https://github.com/obhq/jailbreak-11\n \nLe poc sous forme de bin pour le loader : https://github.com/boredmonkeyman/PS4-9.00-11.00-PoC-bin-loader\n \nA noter que nous n'avons pas la confirmation que cela fonctionne sur PS5, ce qui laisse penser que ce n'est pas le cas, du moins cela fonctionne jusqu'au firmware 9.20 sur PS5, mais cela n'est pas exploitable. \n \n \n\n \n \nLe développeur Master_S9 et beaucoup d'autres ont testés la faille CVE-2006-4304 sur PS4 mais elle a été aussi testée sur PS5, reste à voir jusqu'où tout cela peut aller. \n \n \n",
        "images": {}
    },
    "news_3": {
        "title": "[PS4] BwE rend public Syscon Writer &#38; Reader",
        "content": "Le développeur BwE, connu pour ses outils et services dans la scène PlayStation, a récemment rendu public le code source de ses applications Syscon Writer & Reader. Ces outils sont conçus pour lire et écrire le Syscon RL78 sur les consoles PS4, et ils sont maintenant disponibles en open source sur GitHub. \n \nCela signifie que la communauté peut désormais accéder et contribuer à ces outils, ce qui pourrait conduire à de nouvelles avancées et réparations pour les consoles PlayStation 4 et PlayStation 5. La décision de BwE de partager ces applications en open source est un geste significatif dans la communauté du modding et de la réparation de consoles, et cela est aussi probablement lié à ses divers accrochages avec Abkarino.\n \n \n \n\n \n \nIl tient cependant à préciser que le code Arduino est encore fermé, tout comme le code Teensy d'Abkarino et Egycnq justement, ce qui prouve que tout cela a une incidence. Il le fait aussi car il s'est aperçu que certaines personnes revendent ce logiciel presque 200 $, il a donc voulut leur couper l'herbe sous le pied en rendant public le code source. \n \n \nTéléchargement : BwE PS4 Syscon Reader & Writer\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190147/in-ps4-bwe-rend-public-syscon-writer-reader-1.png"
        }
    },
    "news_4": {
        "title": "[Switch] La Team UnlockSwitch répond sur les allégations et promet une preuve",
        "content": "La Team UnlockSwitch vient enfin de réagir aux diverses allégations dont elle fait état sur la simple copie du MigSwitch en publiant une lettre ouverte sous forme de PDF. \n \nLa Team UnlockSwitch dévoile un document dans lequel elle annonce qu'elle va apporter les preuves du travail original effectué par rapport au Mig Switch, en confirmant qu'il s'agit de sa dernière communication sur le sujet, comme s'il y en avait eu de nombreuses auparavant. \n \nAinsi l'équipe UnlockSwitch affirme que l'UnlockSwitch est un propre authentique, que l'attaque de l'équipe Mig Switch n'est là que pour protéger ses propres intérêts commerciaux, visant à intimider les acheteurs et UnlockSwitch a donc répondu avec une lettre ouverte à l'équipe Mig Switch. \n \n \n\n \n \nLa Team UnlockSwitch informe qu'elle va montrer une vidéo dans laquelle elle va faire tourner l'exemplaire UnlockSwitch V3R1 basé sur ICE40/ESP32S couvrant tout du début à la fin, l'extraction du numéro de série, en résolution 4K, et en son Dolby Atmos (là c'est certainement pour la blague).\n \nLe résultat de l'exportation sera publié en ligne, et tout cela sera public, cependant il y a là encore un élément important, l'équipe ne fera cela que si Mig Switch envoie à UnlockSwitch la liste complète de IC utilisés sur Mig Switch, pas avant. \n \nInformation intéressante, selon UnlockSwitch une troisième équipe travaille sur un autre clone du Mig Switch, mais dans le fonds de la lettre nous n'apprenons pas grand chose, ni date de disponibilité, ni volume de production, wait and see. \n \n \nTéléchargement : Lettre ouverte de UnlockSwitch pour Mig Switch\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190141/in-switch-la-team-unlockswitch-repond-sur-les-allegations-et-promet-une-preuve-1.png"
        }
    },
    "news_5": {
        "title": "[PS4/PS5] La prochaine version d'ItemzFlow sur les rails",
        "content": "Le développeur LightningMods a récemment annoncé des nouveautés pour la prochaine version d'Itemzflow, qui inclura la possibilité d'utiliser des cheats XML sur PS4 mais aussi sur PS5. Parmi les améliorations attendues, on trouve des temps de chargement réduits et un menu de développement pour \"The Last of Us Remastered\", ainsi que la possibilité de débloquer tous les contenus pour \"Call of Duty: Vanguard\" (DLC Repack).\n \n \n\n \n \nPour ceux qui sont intéressés par la gestion de backups de jeux sur PS5, Itemzflow est une application homebrew qui permet de lancer des dumps de jeux depuis différentes sources. La version actuelle offre déjà des fonctionnalités telles que le support des backups PS5, la gestion des applications PS5 (homebrew), l'installation de paquets internes, la lecture de MP3, et plus encore.\n \nLe développeur dévoile sur Twitter deux petites vidéos de fonctionnement de la prochaine version d'ItemzFlow en guise de teasers, voici la première. \n \n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189931/in-ps4ps5-la-prochaine-version-ditemzflow-sur-les-rails-1.jpg"
        }
    },
    "news_6": {
        "title": "[PS4/PS5] La faille jusqu'au firmware 11.00 (PS4) et 8.20 (PS5) dévoilée",
        "content": "Il semble qu’il y ait eu un développement important concernant la sécurité de la PS4 et de la PS5. Une vulnérabilité identifiée sous le nom de CVE-2006-4304, a été trouvée affectant les systèmes PS4 jusqu’au firmware 11.00 et les systèmes PS5 jusqu’au firmware 8.20. Cette vulnérabilité a été discutée dans le contexte de méthodes potentielles de jailbreak pour ces consoles.\n \n\n\n \n \nLes détails sur l’exploitation réussie de cette vulnérabilité sont prévus d’être partagés à la TyphoonCon, une conférence de sécurité entièrement offensive. La TyphoonCon est connue pour se concentrer sur des problèmes de sécurité offensive très techniques, y compris la découverte de vulnérabilités et les techniques d’exploitation avancées. La conférence est prévue du 27 au 31 mai à Séoul, en Corée.\n \nSi vous êtes intéressé par les aspects techniques de cette vulnérabilité ou par le domaine de la recherche en sécurité, TyphoonCon pourrait être un événement intéressant. \n \n \n \n\n \n \nIl y a quelques heures, le développeur Andy Nguyen, plus connu sous le pseudonyme de TheFlow a lâché un tweet nous confirmant que la vulnérabilité touche la PS4 jusqu'au firmware 11.00 et la PS5 jusqu'au firmware 8.20. Ce que nous pouvons confirmer c'est que ces vulnérabilités dans le protocole réseau permet l'exploit kernel sur PS4, est-ce que c'est le cas aussi sur PS5, nous verrons bien dans un mois. \n \nLa faille, qui a permis à TheFlow de bénéficier d'une prime de 12 500$ a été dévoilée hier 25 Avril 2024, elle se trouve partiellement détaillée ici : \n \nhttps://hackerone.com/reports/2177925\n \nLe rapport d'origine a été remonté à Sony par TheFlow le 22 septembre 2023, mettant ainsi fin à cette faille sur les firmwares suivant les 11.00 sur PS4 et 8.20 sur PS5. \n \nDu reste, il est possible que cette faille soit réellement utilisable sur la PS4 allant jusqu'à l'exploit kernel, par contre sur PS5 rien n'est annoncé, jusque qu'elle est présente jusqu'au firmware 8.20, ce qui est déjà une avancée supplémentaire par rapport aux informations que nous avions jusqu'à présent puisque nous le supposions, mais avec le Tweet de TheFlow c'est désormais confirmé. \n \nSi vous souhaitez en savoir encore plus sur la faille de freebsd utilisée c'est par ici : \n \nhttps://www.freebsd.org/security/advisories/FreeBSD-SA-06:18.ppp.asc\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189908/in-ps4ps5-la-faille-jusquau-firmware-1100-ps4-et-820-ps5-devoilee-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1189908/in-ps4ps5-la-faille-jusquau-firmware-1100-ps4-et-820-ps5-devoilee-1.png"
        }
    },
    "news_7": {
        "title": "[2DS/3DS/NDS] TWiLight Menu++ v27.1.1 et nds-bootstrap v1.5.0",
        "content": "TWiLight Menu++ v27.1.0 a été publié récemment, marquant une mise à jour importante pour les utilisateurs de Nintendo DS. Cette version est surnommée “Earth Day Release” et comprend plusieurs améliorations et nouveautés. \n \n \n\n \n \nParmi les points forts, on trouve :\n \n- Une mise à jour de nds-bootstrap à la version v1.5.0, qui est incluse dans cette version de TWiLight Menu++.\n- Des changements de thème, notamment pour les thèmes R4 et GBC, qui offrent désormais une apparence plus propre et verte en l’honneur de la Journée de la Terre.\n- Le haut écran des thèmes R4 et GBC utilise désormais la même police que l’écran du bas, et le curseur dans ces thèmes, ainsi que dans le menu des paramètres, a été remplacé par du texte en surbrillance de votre couleur préférée.\n- Sélectionner l’icône de musique dans le thème R4 démarre maintenant Moonshell, permettant aux utilisateurs de profiter d’une expérience multimédia sur leur console.\n- En outre, cette mise à jour apporte un support en écran large pour CTGP Nitro v1.1.0 et corrige divers bugs, y compris un problème avec les homebrews DS qui détectaient à tort une RAM Disk. Les traductions ont également été mises à jour pour améliorer l’expérience des utilisateurs non anglophones.\n \nEdit 26.04.24 (27.1.1 proposée)\n \nTéléchargement : Earth Day Release v27.1.1 / nds-bootstrap v1.5.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189881/in-2ds3dsnds-twilight-menu-v2710-et-nds-bootstrap-v150-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS4/PS5] Sony a sorti le nouveau firmware 9.20 pour la PS5",
        "content": "Sony a publié la mise à jour du firmware 9.20 pour la PlayStation 5 ce 25 avril 2024. Cette mise à jour semble principalement axée sur la correction de bugs, potentiellement pour résoudre certains problèmes mineurs rencontrés par les utilisateurs depuis le firmware 9.00, sorti en mars 2024.\n \n \n \n\n \n \nVoici quelques points clés de la mise à jour 9.20 :\n \n- Game Help a été étendu en ajoutant des fonctionnalités d’Aide Communautaire aux jeux. Dans l’Aide de jeu, vous verrez des indices étiquetés Aide Communautaire dans les jeux pris en charge, ce qui indique que l’indice a été généré à partir des vidéos de gameplay d’autres joueurs.\n- Vous pouvez participer à l’Aide Communautaire en permettant à votre vidéo de gameplay d’être automatiquement capturée et ajoutée à la fonctionnalité après examen. Pour participer, allez dans Paramètres > Captures & Diffusions > Captures > Captures automatiques > Aide Communautaire, puis sélectionnez Participer.\n- Dans Remote Play, si le message persistant « Remote Play connecté. » est affiché pendant le Remote Play, vous pouvez maintenant le masquer sur votre écran de jeu. Allez dans Paramètres > Système > Remote Play et activez Masquer le statut de connexion Remote Play.\n- Amélioration des performances et de la stabilité du logiciel système.\n- Amélioration des messages et de l’utilisabilité sur certains écrans.\n \nTout ça c'est le côté officiel, mais pour ce qui nous intéresse le développeur Zecoxao a déjà confirmé qu'une erreur majeure semble avoir été corrigée sur le firmware 9.20, de plus il rajoute que l'IPL montre que la révision de sécurité est passée de 0xFFF à 0x3FFF. Pour ceux qui ne suivrait pas le hack jusqu'au bout des doigts, l'IPL (Initial Program Load), comme son nom l'indique, est l'un des premiers morceaux de code chargés et exécutés par la machine. Notamment sur les consoles comme la PS5, ce morceau de code est généralement très petit et extrêmement sécurisé. Il est là pour garantir que la machine charge correctement le kernel et effectue les premiers contrôles de sécurité. Dans le passé, les failles des IPL de la console ont été critiques pour obtenir un accès anticipé à la console pour les CFW. \n \nDe plus il semblerait qu'une nouvelle prime de 20 000 $ a été livrée récemment. Bref, ce firmware 9.20 semble aussi corrigé une faille exploitable, ou du moins corriger une ou plusieurs failles, il est recommandé aux utilisateurs qui souhaitent jailbreaker un jour leur console de ne pas mettre à jour.\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189877/in-ps4ps5-sony-a-sorti-le-nouveau-firmware-920-pour-la-ps5-1.jpg"
        }
    },
    "news_9": {
        "title": "[Switch] Un Mig Switch moddé avec un interrupteur permettant de changer de jeu",
        "content": "Il semblerait que quelqu'un a réussi à modder son Mig Switch en y rajoutant un interrupteur, comme quoi cela reste possible.\n \nLa Team Mig Switch a lancé son linker sans interrupteur obligeant à chaque changement de jeu de sortir et remettre le linker dans le port cartouche, à la longue, cela risque de le fragiliser. \n \n \n\n \n \nMoody nous informe que l'un des détenteurs du Mig Switch aurait réussi à y appliquer un mod afin de rajouter un interrupteur permettant ainsi de réaliser l'opération de switch de jeu sans être obligé de déloger/reloger le linker.\n \n \n\n\n \n\n \nCela montre que cela est possible, et que si Mig Switch le décide, une V2 pourrait intégrer ce genre de solution. \n \n \nMerci Moody pour l'information.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-609174918.png"
        }
    },
    "news_10": {
        "title": "[PS5] PS5 Nor Modifier de TheCod3r passe open-source",
        "content": "Le spécialiste du matériel PS5, TheCod3r, a récemment mis à jour son outil PS5 NOR Modifier, qui offre désormais une prise en charge complète de l’UART et a été publié en tant que logiciel open source. Cet outil est conçu pour aider à la mise à jour des fichiers flash NOR de la PS5, en particulier pour les réparations.\n \nPS5 NOR Modifier permet de modifier le fichier NOR de la PS5 pour convertir entre les éditions numériques et à disque, ce qui peut sauver une PS5 lorsque le lecteur de disque est défaillant ou absent. En utilisant ce logiciel gratuit, vous pouvez ramener votre console à la vie en la convertissant d’une édition à disque à une édition numérique, ainsi qu’en changeant le numéro de série et la variante signalée afin de remplacer votre ROM flash SPI lorsque celle-ci meurt.\n \n \n\n \n \nC’est particulièrement utile lorsque vous n’avez pas de lecteur de disque correspondant, en convertissant de disque à numérique pour permettre les mises à jour futures (restauration de la fonctionnalité en ligne en gardant votre PS5 à jour). Si votre ROM flash SPI meurt (ce qui est très courant), vous pouvez maintenant modifier le dump d’une autre console et conserver la fonctionnalité du lecteur de disque.\n \n \n \nLes caractéristiques principales de l’outil incluent :\n \n- Lire les fichiers NOR de la PS5 (non pris en charge actuellement pour la PS5 Slim)\n- Écrire sur les fichiers NOR de la PS5 (non pris en charge actuellement pour la PS5 Slim)\n- Changer le numéro de série sur le fichier NOR\n- Modifier les indicateurs de version (édition disque ou édition numérique)\n- Lire le numéro de série de la carte mère\n- Lire l’adresse MAC WiFi\n- Lire l’adresse MAC LAN\n \nCaractéristiques UART :\n \n- Se connecter à tout appareil TTL compatible\n- Lire les codes d’erreur stockés sur le système PS5\n- Effacer les codes d’erreur stockés sur le système PS5\n- Convertir automatiquement les codes d’erreur en descriptions faciles à comprendre (s’ils existent dans la base de données)\n- Récupérer les codes d’erreur en temps réel à partir de la base de données uartcodes.com\n- Option de télécharger l’intégralité de la base de données uartcodes.com pour une utilisation hors ligne\n- Envoyer des commandes UART personnalisées et recevoir la réponse dans la boîte de sortie\n \nExigences Système :\n \n- Système d’exploitation : Windows 7, 8, 10, 11\n- Disque dur : 5MB\n- Mémoire : 128MB\n- CPU : Tout CPU basé sur X86 ou X64\n- Logiciel : Microsoft .NET 6.0 Desktop Runtime (v6.0.29)\n- Connexion Internet lors de l’utilisation en ligne\n \n \nTéléchargement : PS5 Nor Modifier \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189866/in-ps5-ps5-nor-modifier-de-thecod3r-passe-open-source-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] switch_AIO_LS_pack 5.10.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.10.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format).\nLe mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.10.0:\nDernier firmware compatible mis à jour en 18.0.1.\nMise à jour de l'overlay de Sys-patch pour afficher l'état d'un patch qui ne s'affichait pas. Le module Sys-patch a aussi été modifié pour ne pas appliquer certains patches aux firmwares 18.0.0 et supérieurs.\nMise à jour de la documentation pour ajouter des informations sur l'utilité des dossiers et fichiers du pack.\nMise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.50.01:\nQuelques changements mineures sans impacte pour l'utilisateur.\n\nNote: Pour traiter les problèmes particuliers de lancement de la sysnand en firmwares 17.0.0 et supérieurs c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets. Pour cela nous avons mis en place un questionnaire de satisfaction, en plus de pouvoir reporter les problèmes sur Github ou sur le forum vous pouvez utiliser ce questionnaire pour nous donner vos opinions de façon anonyme.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_12": {
        "title": "[PS4/PS5] Live Die Repeat 1.00 for PS4/PS5 disponible",
        "content": "Le développeur bien connu de la scène PlayStation, Lapy, a récemment sorti une nouvelle application homebrew intitulée Live Die Repeat 1.00 pour les consoles PS4 et PS5. \n \nCette application n'est pas le lecteur vidéo MP4, mais plutôt un jeu inspiré de Dragon's Lair. Il s'agit d'un jeu assez court, quelques heures tout au plus, il est recommandé d'utiliser le dpad pour naviguer dans le menu, pas les sticks.\n \n \n\n \n\n \n \nPour plus d’informations et pour télécharger l’application, les utilisateurs peuvent visiter le store sur leur PS4/PS5 ou bien de consulter pkg-zone.com.\n \n \nTéléchargement : Live Die Repeat 1.00 for PS4/PS5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189789/in-ps4ps5-live-die-repeat-100-for-ps4ps5-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1189789/in-ps4ps5-live-die-repeat-100-for-ps4ps5-disponible-2.jpg"
        }
    },
    "news_13": {
        "title": "[PS3] Aldo Vargas propose Package Manager Mod pour le CFW Evilnat 4.91.2",
        "content": "Le développeur Aldo Vargas a récemment publié une version modifiée de Package Manager MOD, spécialement conçue pour le Custom Firmware (CFW) Evilnat 4.91.2. \n \n \n\n \n \nCette version améliorée offre plusieurs nouvelles fonctionnalités et corrections de bugs, notamment :\n \n- Affichage des bulles PKG dans la section Jeu, similaire au Firmware Officiel, les rendant plus visibles.\n- Gestion des paquets distants pour PKG Linker 2.0.\n- Correction d’un problème où l’installation des PKG restait bloquée à 99% lors du téléchargement en arrière-plan.\n- Introduction d’un fichier package_manager.xml externe pour une plus grande flexibilité.\n \nAvant d’installer cette version, il est nécessaire d’activer l’écriture sur /dev_blind. Le processus d’installation recommandé est de démarrer le gestionnaire de sauvegarde multiMAN, d’activer l’écriture sur /dev_blind dans les paramètres, de télécharger le fichier PKG sur un périphérique USB, de le connecter à la console PS3 et de l’installer depuis le Package Manager. Après l’installation, un redémarrage de la console est requis.\n \n \n \nTéléchargement :  4.91.2_Evilnat_Package_Manager_with_external_bubbles_99download_req_dev_blind_enabled.pkg\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189787/in-ps3-aldo-vargas-propose-package-manager-mod-pour-le-cfw-evilnat-4912-1.jpg"
        }
    },
    "news_14": {
        "title": "[Switch] La team UnlockSwitch va devoir clarifier quelques points",
        "content": "Un petit retournement de situation sur l'UnlockSwitch, il semblerait que tout ne soit pas si clair que cela pouvait sembler l'être. \n \nDepuis quelques tweets la Team UnlockSwitch semble fuyante, il faut dire que la team Mig Switch vient de contre-attaquer, en effet la team Mig Switch affirme que les samples qui ont été envoyés sont en fait des Mig Switch maquillés, et non pas des clones. \n \nLes 50 échantillons intègrent en effet le chipset ICE40/ESP32S du Mig Switch, et il semblerait que les 50 unités soient même \" un ancien lot de production du Mig Switch relookés par des escrocs \" selon la team Mig Switch (via un article de Wololo.net). \n \nLa team Mig Switch aurait l'intention d'envoyer des mails pour avertir les clients et revendeurs de ne pas acheter sinon ils se feront arnaquer. \n \nElle est même en capacité de proposer un logiciel pour prouver que les puces sont celles du Mig Switch. \n \n \n\n \n \nLa team UnlockSwitch a laissé quelques tweets étranges:\n \n\" Juste une précision sur notre produit. Le produit UnlockSwitch est et ne sera jamais disponible en précommande, donc pas d'arnaqueurs ici... Aucune vente ne sera réalisée sans production préalable ! \"\n \n \nAux accusations qu'il s'agit d'un ancien lot de production du Mig Switch, aucune réponse n'est apportée sur https://twitter.com/UnlockSwitch/ malgré plusieurs posts à ce sujet.\n \n\" Dès le début, nous avons déclaré que notre produit était en développement et qu'il atteignait sa phase finale. Nous pouvons confirmer aujourd'hui qu'UnlockSwitch n'aura pas le chipset ( ICE40/ESP32S ), ni le même design de PCB, ni même le même boîtier. \"\n \nBref, il semblerait donc que pour le moment, les samples ne soient que des Mig Switch rebaptisés sur un PCB retravaillé (ou un ancien lot de production) équipés de puces ICE40/ESP32S, qu'aucun dumper ne sera commercialisé par UnlockSwitch, et que le produit final en première version disposerait d'un bouton on/off, et de puces différentes de celle du Mig Switch. \n \nOn est donc encore très loin de voir des samples de pré-commercialisation car ceux qui ont été livrés ne sont en rien ce qui sera réellement lancé en production et ça cela reste très étrange ! A clarifier ! \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189786/in-switch-la-team-unlockswitch-va-devoir-clarifier-quelques-points-1.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] Nintendo dévoile le firmware 18.0.1 pour un problème WLAN",
        "content": " \nNintendo vient de dévoiler un nouveau firmware pour la Switch, la mise à jour firmware 18.0.1 est désormais disponible. Elle a été publiée le 22 avril 2024 et apporte plusieurs améliorations, notamment la correction d’un problème où certains points d’accès sans fil ne pouvaient pas être trouvés lors de la configuration d’un nouveau réseau sans fil. \n \n \n\n \n \nVoici le changelog :\n \n- Version 18.0.1 (Publiée le 22 avril 2024) : Correction d’un problème empêchant la détection de certains points d’accès sans fil lors de la configuration d’un nouveau réseau. Si vous ne pouvez pas mettre à jour vers la version 18.0.1 à cause de ce problème, changez temporairement les paramètres de sécurité de votre réseau sans fil pour utiliser uniquement “WPA2 (AES)” afin de pouvoir vous connecter sans fil et télécharger ainsi que installer la mise à jour du système. Après la mise à jour vers la version 18.0.1, restaurez les paramètres de sécurité de votre réseau à leurs paramètres précédents.\n- Des améliorations générales de la stabilité du système pour améliorer l’expérience utilisateur2.\n \nCette mise à jour est la deuxième de l’année 2024 pour la Nintendo Switch et il semble qu’elle soit principalement axée sur la résolution de problèmes de connectivité. \n \nDu côté de ce qui nous intéresse le plus, la pré-version actuelle d'Atmosphère (de la 1.7.0) fonctionne sans aucun problème sur le firmware 18.0.1 ! Les sigpatch continueront également à fonctionner puisque les modules concernés n'ont pas été modifiés.\n \nRapports : https://yls8.mtheall.com/ninupdates/reports.php?date=2024-04-23_00-06-36&sys=hac\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189748/in-switch-nintendo-devoile-le-firmware-1801-pour-un-probleme-wlan-1.jpg"
        }
    },
    "news_16": {
        "title": "[Wii/Wii Mini] GaryOrNothing porte l'exploit Bluebomb sur Raspberry Pi Pico W et l'ESP32",
        "content": "BlueBomb Micro est un projet intéressant développé par GaryOderNichts, il s’agit d’un portage de BlueBomb pour le btstack de BlueKitchen, qui fonctionne sur divers systèmes embarqués et microcontrôleurs. BlueBomb Micro est conçu pour les systèmes embarqués et permet d’exécuter BlueBomb sur des microcontrôleurs comme le Raspberry Pi Pico W et l’ESP32.\n \nPour l’utiliser, il faut que le microcontrôleur soit branché et que BlueBomb Micro soit en cours d’exécution. Si le microcontrôleur possède une LED, elle devrait clignoter lentement.\nL’utilisateur doit démarrer sa Wii et naviguer vers l’application qu’il souhaite exploiter. Pour le menu système, il suffit d’allumer la Wii et de la laisser sur l’écran de santé et de sécurité.\n \n \n\n \n \nIl est important de ne pas laisser d’autres appareils se connecter à la console via Bluetooth et de s’assurer que la console est proche du microcontrôleur pour une connexion réussie.\n \nUne fois connecté, BlueBomb Micro chargera un fichier boot.elf situé à la racine d’une clé USB formatée en FAT32 et l’exécutera. Cela peut être utilisé pour installer la Homebrew Channel avec l’installateur HackMii.\n \n \nTéléchargement : BlueBoomb Micro v1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189727/in-wiiwii-mini-garyornothing-porte-lexploit-bluebomb-sur-raspberry-pi-pico-w-et-lesp32-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS1/PS2/Vita/PSP/Vita/PS3/PS4/PS5] PS Multi Tools v14.0 disponible",
        "content": "Dans le monde en constante évolution des outils de gestion pour les consoles PlayStation, une nouvelle mise à jour fait sensation : PS Multi Tools v14. Cette version apporte son lot de nouveautés et d’améliorations qui raviront les utilisateurs les plus exigeants.\n \nParmi les points forts de cette mise à jour, on note la mise à jour des paquets NuGet, l’ajout de la classe NPSPKG & PKGDownloadListViewItem pour une utilisation avec le nouveau navigateur PKG, ainsi que des ajustements mineurs dans la fenêtre de bienvenue. Les utilisateurs de PS3 et PS Vita ne sont pas en reste avec des mises à jour spécifiques, notamment un nouveau navigateur PKG qui promet de simplifier la vie des joueurs.\n \nCette mise à jour souligne l’engagement continu des développeurs à fournir des outils robustes et à jour pour la communauté. Avec PS Multi Tools v14, la gestion de vos jeux et contenus sur PlayStation n’a jamais été aussi facile et intuitive.\n \n \n\n \n \nComme vous le savez  PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \nLe changelog est énorme et concerne toutes les consoles Sony !\n \n \nTéléchargement : PS Multi Tools v14.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189697/in-ps1ps2vitapspvitaps3ps4ps5-ps-multi-tools-v140-disponible-1.jpg"
        }
    },
    "news_18": {
        "title": "[3DS] Lime3DS s'améliore encore afin de succèder à Citra3DS",
        "content": " \nLe développement de Citra3DS a cessé suite à un accord avec Nintendo et Tropic Haze, et Lime3DS a été créé pour continuer le travail sur cet émulateur. Lime3DS est activement maintenu pour Windows, Linux, Android et macOS, et vise à raviver et poursuivre le développement de Citra. \n \nLa nouvelle version 2110 de Lime3DS a été récemment lancée, apportant des améliorations significatives et des corrections de bugs. Cette mise à jour inclut un correctif pour un crash lors de l’entrée en plein écran tout en jouant à Super Smash Bros 3DS sur Vulkan et des améliorations mineures de performance sur les GPU Mali.\n \n \n\n \n \n \nChangelog :\n \n- Correction d’un crash : Un problème a été résolu qui provoquait un crash lors du passage en plein écran en jouant à Super Smash Bros. 3DS sur Vulkan.\n- Améliorations de performance : Des améliorations mineures de performance ont été apportées sur les GPU Mali.\n- Joysticks sur Android : Correction de l’ordre de dessin incorrect des joysticks à l’écran sur Android.\n- Environnements de build mis à jour :\n- Clang mis à jour de la version 15 à la version 18.\n- Android Gradle Plugin (AGP) mis à jour de la version 8.2.1 à la version 8.3.2.\n- Gradle mis à jour de la version 8.2 à la version 8.4.\n \nNote : La correction pour Smash Bros a inclus une restructuration à grande échelle de plusieurs sections du rendu Vulkan. Cela pourrait entraîner des améliorations de compatibilité pour d’autres jeux qui n'ont pas été anticipées.  \n \nCes mises à jour montrent l’engagement continu de l’équipe de Lime3DS pour améliorer l’expérience utilisateur et la compatibilité des jeux, sachant que Lime3DS est disponible pour Windows, MacOS, Linux et Android. \n \n \nTéléchargement : Lime3DS version 2110\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189662/in-3ds-lime3ds-sameliore-encore-afin-de-succeder-a-citra3ds-1.jpg"
        }
    },
    "news_19": {
        "title": "[Vita/PSTV] Le firmware manager psp2fwtool pour Vita et PSTV devient un projet public",
        "content": "Le développeur SKGleba, que l'on connait bien pour l'ensemble de ces projets sur la PlayStation Vita avec des contributions à Enso Ex, VitaDeploy, Psp2renga, iTLS, psp2hfw ou encore Psp2spl, nous informe que son gestionnaire de firmware psp2fwtool pour PlayStation Vita et PSTV est désormais un projet public. \n \nC’est fascinant de voir comment le projet psp2fwtool a évolué au fil du temps ! Initialement créé en 2019 aux côtés de Modoru 2.0, il a été conçu pour contourner les restrictions imposées par PlayStation lorsqu’ils ont corrigé l’exploit original du coprocesseur cryptographique. À l’époque, il s’agissait d’un simple clic pour PlayStation.\n \nCependant, psp2fwtool a continué à se développer et à s’améliorer. Il a ajouté de nombreuses fonctionnalités supplémentaires, offrant ainsi aux utilisateurs de la PlayStation Vita et de la PSTV un outil plus puissant et polyvalent. C’est un excellent exemple de la passion et de l’ingéniosité des développeurs de la communauté homebrew comme tout ce que fait SKGleba. \n \npsp2fwtool intègre des fonctionnalités complètes bien que certaines soient encore en phase de test, il est suffisamment sûr pour être accessible au public. Cet outil est très puissant, et nécessite une connaissance avancée du système Vita ainsi qu'une documentation complète pour l'utiliser correctement. Le développeur espère finir cette documentation complète d'ici cet été. \n \n \n\n \n \nVoici quelques informations supplémentaires sur ce projet :\n \nFirmware Image : Il s’agit d’un conteneur pour les images de partition EMMC, les mises à jour du firmware et l’exploit enso.\nNPUP : C’est un package conforme au format PUP contenant l’image du firmware, un installateur autonome de l’image du firmware (psp2swu.self) ainsi que des correctifs de partition supplémentaires.\nCréation d’une image du firmware :\nAssurez-vous d’avoir gzip installé dans votre environnement WSL.\nClonez le référentiel psp2fwtool sur votre ordinateur local et exécutez la commande ‘. build_all.sh’ dans WSL.\nCopiez tous les composants de mise à jour dans le répertoire /create/ au format approprié.\nExécutez le script ‘mkcfw_wingui.ps1’ dans le répertoire /create/ pour créer l’image du firmware.\nInstallation de l’image du firmware :\nAssurez-vous que l’option ‘Unsafe homebrew’ est activée et qu’aucune carte de jeu n’est insérée.\nPlacez l’image du firmware dans ‘ux0:data/fwtool/’ sous le nom ‘psp2cfw’.\nL’installateur peut mettre à jour les partitions avec les fichiers trouvés dans ‘ux0:data/fwtool/[part]-patch/’ (par exemple, ‘os0-patch/’).\nOuvrez fwtool et sélectionnez ‘Flash a firmware image’, puis appuyez sur [start].\nAttendez que l’installation se termine avec ‘ALL DONE’ ou une erreur, puis appuyez sur [circle] pour redémarrer l’appareil.\nInstallation d’un package NPUP :\nInstallez-le avec modoru ou neighbourhood comme vous le feriez pour un PUP normal.\n \n \nVous pouvez trouver le projet psp2fwtool sur GitHub pour plus d’informations et de détails.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189658/in-vitapstv-le-firmware-manager-psp2fwtool-pour-vita-et-pstv-devient-un-projet-public-1.jpg"
        }
    },
    "news_20": {
        "title": "[PS3] La Bêta 6 du CFW Evilnat 4.91.2 disponible",
        "content": " \nL'univers du hacking de console est en constante évolution, et récemment, le développeur Nathan Martin, également connu sous le pseudonyme d'Evilnat, a dévoilé une mise à jour majeure de son Custom Firmware (CFW). La version 4.91.2 de l'Evilnat CFW, disponible en versions PEX, D-PEX, CEX, et DEX, propose une intégration étendue des fonctions Cobra 8.5, ainsi que des corrections de bugs importantes, offrant ainsi aux utilisateurs une expérience de jeu encore plus enrichie et personnalisée sur PlayStation 3.\n \nOutre les fonctionnalités habituelles de personnalisation et d'exécution de logiciels non signés, la version 4.91.2 du Custom Firmware Evilnat apporte plusieurs améliorations significatives. Tout d'abord, l'intégration des fonctions Cobra 8.5 offre aux utilisateurs une panoplie de nouvelles fonctionnalités, telles que le chargement de jeux à partir de disques durs externes et la lecture de fichiers multimédias, pour une expérience de jeu encore plus immersive.\n \nDe plus, cette mise à jour inclut des variantes spécifiques, notamment les versions noBD et Overclocked, permettant aux utilisateurs d'adapter leur expérience selon leurs besoins et préférences. De plus, la correction du bug entraînant l'erreur 0x8002F155 lors de l'installation de PUP améliore la stabilité et la fiabilité du Custom Firmware, offrant ainsi une expérience utilisateur plus fluide.\n \n \n\n \nImage d'illustration\n \n \nChangelog intégral : \n \n- Correction de l'erreur 0x8002F155 lors de l'installation de PUP.\n- Correction de la vitesse maximale du ventilateur, affichant désormais 0xFF et 100%.\n- Désactivation temporaire de \"Charger Cobra Externe\".\n- Reversion du code pour Cobra dans le noyau.\n- Ajout d'une option pour activer les drapeaux QA complets.\n- Correction de la description de xai_plugin pour le spoofing IDPS/PSID/MAC depuis \"/dev_hdd0/tmp\".\n- Ajout de la sortie TTY dans socat.\n- Construction de nouveaux charges utiles noyau/Cobra.\n- Correction des plantages/aléas aléatoires.\n- Mise à jour des fonctions Cobra vers la version 8.5.\n- Correction de l'écran noir/plantage lors du lancement d'ISO PS3/PSP/PSX.\n- Correction du plantage lors de l'installation de PKG à partir d'un périphérique exFAT/NTFS externe.\n- Réversion du patch qui causait des problèmes lors de la lecture de films BD.\n- Mise à jour du Débloqueur de Trophées en version 1.1.\n- Création de variantes [noBD] pour PEX et D-PEX.\n- [COBRA] Ajout du support du décryptage des ISO REDUMP à la volée.\n- [COBRA/XAI] Opcode pour basculer l'animation de démarrage à froid.\n- [COBRA/XAI] Opcode pour basculer l'avertissement d'épilepsie.\n- [COBRA/XAI] Opcode pour basculer l'animation et le son de démarrage du jeu.\n- [COBRA/XAI] Opcode pour basculer les informations de trophée cachées.\n- [COBRA/XAI] Correction du Gestionnaire de Cibles pour DEX.\n- [COBRA/XAI] Ajout de cellUsb000_mount_symbol.\n- [COBRA/XAI] Ajout de drapeaux usb_flag et no_cobra.\n- [COBRA/XAI] Option pour basculer l'icône de disque PS2 (ISO/BIN.ENC) dans XMB.\n- [COBRA/XAI] Activation des titres/détails/icônes de trophée cachés dans XMB et en jeu.\n \n \nLes versions PEX, D-PEX, CEX et DEX du Custom Firmware Evilnat 4.91.2 garantissent une compatibilité étendue avec une gamme variée de modèles de consoles PlayStation 3, assurant ainsi une expérience homogène pour tous les utilisateurs, quels que soient leurs besoins.\n \nEn termes de sécurité, le Custom Firmware Evilnat continue de proposer des mesures robustes pour minimiser les risques de bannissement ou de brick des consoles, offrant ainsi aux utilisateurs une tranquillité d'esprit lors de l'utilisation de leur console modifiée.\n \nEn conclusion, la version 4.91.2 du Custom Firmware Evilnat marque une avancée significative dans le domaine du hacking de console. Avec son intégration étendue de Cobra 8.5, ses corrections de bugs et ses variantes spécifiques, cette mise à jour offre aux utilisateurs une expérience de jeu encore plus personnalisée et immersive. Cependant, il est important de rappeler que l'utilisation de tout firmware non officiel peut présenter des risques et être contraire aux conditions d'utilisation des fabricants de consoles. Les utilisateurs sont donc invités à faire preuve de prudence et à agir de manière responsable lors de l'utilisation de ces outils.\n \n \nTéléchargement : CFW Evilnat 4.91.2 Bêta 6 \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2088245629.jpg"
        }
    }
}