{
    "news_1": {
        "title": "[Switch] DayBreak-Converter lui aussi retiré pour DCMA",
        "content": "Le projet DayBreak Converter, de notre ami développeur et sunriseur MurasakiNX, à qui l'on devait aussi le projet NXPayload-Converter, a vu ses deux projets retirés pour DCMA. \n \nDayBreak-Converter était le fruit de NXPayload-Converter, une proposition sous forme de programme permettant de modifier les fichiers présents dans le firmware de votre console Nintendo Switch pour les rendre compatible avec DayBreak. \n \nDayBreak, intégré à Atmosphere, est un homebrew signé SciresM et qui permet d'installer un firmware directement sur sa console (upgrade ou downgrade dans certaines conditions) sans passer par les serveurs de Nintendo.\n \n \n\n \n \nDayBreak-Converter était un outil qui avait besoin du programme hactool.exe et du fichier prod.keys pour fonctionner, ce qui est certainement la cause du retrait pour DMCA.\n \nDe toute façon nous voyons bien que Nintendo s'attaque à tous les programmes, homebrews, logiciels qui touche aux prod.keys, voir à la Nintendo Switch. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188388/in-switch-daybreak-converter-lui-aussi-retire-pour-dcma-1.png"
        }
    },
    "news_2": {
        "title": "[PS5] PCXSense v0.9 Bêta disponible",
        "content": "Le développement de PCXSense continue, l'alternative la plus efficace à DS4Windows qui a été arrêté par Travis Nickles (alias Ryochan), bien qu'il ne s'agisse pas d'un fork de celui-ci, l'efficacité de PCXSense est remarquable. \n \nEn quelques versions son développeur principal, Denellyne, a fait de lui une véritable solution optimisée pour permettre d'utiliser votre propre Dualsense sur votre ordinateur sans tracas sur n'importe quel jeu de votre choix, mais il y a quelques fonctionnalités intéressantes que vous pourriez également apprécier, sur des émulateurs comme Yuzu et Cemu, les gâchettes adaptatives deviennent plus dures et plus courtes, tandis que sur Dolphin, le logiciel émule les manettes GameCube. \n \nDans cette nouvelle version, le développeur a ajouté les vibrations sur chaque pression sur un bouton, et une option pour lancer automatiquement PCXSense du boot de votre système. Il rajoute que le code a été optimisé même si globalement celui-ci n'a pas réellement été modifié au niveau de son poids.\n \n \n\n \n \nChangelog : \n \n- Ajout d'une option permettant d'ajouter un grondement à chaque pression de bouton.\n- Ajout d'une option pour lancer PCXSense au démarrage\n- Code optimisé\n \n \nTéléchargement : PCXSense 0.9 Bêta \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188387/in-switch-pcxsense-v09-beta-disponible-1.gif"
        }
    },
    "news_3": {
        "title": "[Switch] Les puces du Mig-Switch Dumper ne sont pas grattées",
        "content": "Lors de la livraison des Mig Switch de nombreux acheteurs de la première heure ont ouvert la partie plastique du linker pour découvrir l'intérieur de la bête, une procédure bien légitime qui s'est avérée surtout montrer que la Team Mig Switch avait fait le choix de gratter les puces pour en enlever les références. \n \nParfois cette procédure était bien faite, parfois un peu moins, et il s'est même produit que certains Mig Switch ne soit même pas grattés. \n \nLes premières livraisons du Mig-Switch dumper se sont fait attendre, l'équipe s'est même excusée du retard accumulé car nombreux sont ceux qui ont précommandé le dumper sans le voir arriver, suscitant quelques craintes sur le sérieux de l'opération.\n \n \n\n \n \nAu final, les premières livraisons du dumper viennent d'intervenir, et surprise à l'ouverture, toutes les références des puces sont lisibles parfaitement, le grattage n'a pas été effectué, une erreur ou une volonté de ne plus faire cette étape, quoiqu'il en soit nous pouvons voir désormais les deux principales puces qui sont intégrées. \n \n \n\n \n \nUne puce SoC FPGA ESP32-S2F fabriquée par Espressif Systems (environ 1 euro) et une puce FPGA ICE40UP5K-SG48I fabriquée par Lattice Semiconductor (environ 8 euros). \n \n \n \n\n \n \n \nBien entendu tout cela ne nous permet pas de dire que des clones vont apparaitre après demain, mais ce qui est sûr c'est que certains plus facilement se pencher dessus pour voir si cela est réalisable. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188385/in-switch-les-puces-du-mig-switch-dumper-ne-sont-pas-grattees-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1188385/in-switch-les-puces-du-mig-switch-dumper-ne-sont-pas-grattees-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1188385/in-switch-les-puces-du-mig-switch-dumper-ne-sont-pas-grattees-2.png"
        }
    },
    "news_4": {
        "title": "[PS3] webMAN MOD 1.47.46 disponible",
        "content": "Le développeur Aldo Vargas, alias Aldostools, vient de mettre en ligne une nouvelle version de son célèbre plugin webMAN MOD qui est désormais proposé en version 1.47.46. \n \nCette version intègre bien entendu le support de tous les firmwares compris entre le firmware 4.75 et le 4.91 que ce soit des CFW/HFW/CEX/DEX/PEX/D-PEX/DECR.\n \nCe n'est pas tout, il en a profité pour ajouter des fichiers de cache clairs au menu XMB, ajouté une notification sonore si le fichier copié fait plus de 1 Go (il sera possible de désactiver cette option), et mettre à jour la base de données des correctifs PS2.\n \n \n \n\n\n \n \nChangelog : \n \n- Ajout des fichiers de cache webMAN clairs au menu XMB \n- Ajout d'une notification sonore après copie > 1 Go ou après analyse de jeux (décochez BEEP dans /setup.ps3 si vous souhaitez le désactiver) \n- Mises à jour de la base de données de configuration PS2 avec correctifs par@mrjaredbeta,@agrippa,@kozarovv.\n- Mise à jour cumulative (comprend plus de 82 changements dans la suite d'outils après la version 1.47.45).\n \nTéléchargement : webMAN MOD 1.47.46\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188384/in-ps3-webman-mod-14746-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1188384/in-ps3-webman-mod-14746-disponible-2.png"
        }
    },
    "news_5": {
        "title": "[Multi] RetoArch 1.18.0 disponible",
        "content": " \nUn émulateur qui tient face au vent fort qui souffle en ce moment, RetroArch est de retour ! Attendue depuis des mois, cette nouvelle version 1.18.0 fait enfin réapparaitre l'un des plus célèbres émulateur multi-plate forme de jeux vidéo. \n \nPour l'heure le site internet n'a pas encore été mis à jour, cela ne devrait pas tarder, sachant que le code source de la version 1.18.0 est bien disponible sur le github. La mise à jour sera certainement disponible quand vous lirez ces lignes (si vous ne vous levez pas trop tôt), et elle apporte comme toujours un énorme lots de nouveautés. \n \n \n\n \n \nCela passe par de nombreux correctifs, des améliorations, des correctifs sur les traductions, l'ajout d'options de changements de disques, ou encore des optimisations sur le mode DRM. D'autres améliorations sur iOS/TVOS, Android et Linux sont aussi de la partie. \n \n \n\nChangelog 1.18.0 : \n \n\n \nAI: Fix narrator language when AI translation and menu languages are different\nDISK CONTROL: Add option to disable initial disk change\nDISK CONTROL: Visibility option for disk control notifications\nDRM: Fix mode vrefresh calculation. When using an interlaced/doublescan mode, the vertical refresh rate is mis-calculated.\nEMSCRIPTEN: Fix mouse Y parameter translation in rwebinput\nINPUT: Fix input state combos including R3 and false triggers of RETROK_UNKNOWN\nINPUT: Add a new turbo mode, \"Classic (Toggle)\"\nINPUT: Fix bind hold when axis does not rest at 0\nINPUT: Limit axis threshold setting to sensible values\nINPUT: Add Overlay Mouse, Lightgun, and Pointer\nINPUT/ANDROID: Fix mouse grab behavior on Android\nINPUT/LINUXRAW: Fix device name and hotplug reconnect\nIOS: Minor iOS JIT availability information\nIOS/TVOS: Pause application on applicationWillResignActive\nLIBRETRO: Add Doxygen-styled comments to parts of the libretro API\nLUA: Update Lua to version 5.3.6\nMENU: Add sublabels for input bind common entries\nMENU: Don't load history and favorites if size is 0\nMENU: Don't disable fast forward when entering menu\nMENU: Widget position, size, color, icon adjustments\nMENU: Fix savestate slots in Qt UI\nMENU: Reorder and reduce depth of User Interface menu\nMENU/OZONE: Fix sidebar wraparound, visibility after config load, crash after playlist delete\nMENU/OZONE: Fix sidebar and sublabel animations\nOSX/MACOS: Fix crash on non-Metal build\nOSX/MACOS: Add portable.txt as flag for portable install\nREMOTE RETROPAD: add display for analog axes, indication of inputs already pressed\nSAVES: Allow combining saves in content dir with save sorting\nSHADER: Added rolling scan line simulation based on the shader subframe feature. This is implemented with a scrolling scissor rect rather than in the shader itself as this is more efficient although may not work for every shader pass - we may need an option to exclude certain passes. The implementation simply divides the screen up by the number of sub frames and then moves the scissor rect down over the screen over the number of sub frames\nTVOS: Force asset re-extraction when cache is deleted\nTVOS: Add history and favorites to Top Shelf\nTVOS: Fix crash when history item does not have a label\nUWP: Enable HAVE_ACCESSIBILITY for UWP builds\nUWP: Allow UWP build to work with a modified version of Mesa Gallium D3D12\nVIDEO: Add subframe shader support for Vulkan/GLcore/DX10-11-12, enabling shaders to run at higher framerate than the content\nVIDEO: Fix restoring fullscreen/windowed setting when unloading override\nVIDEO/VULKAN: Fix HDR with Vulkan after reinit\nVIDEO/VULKAN: Remove the use of oldSwapchain\nVIDEO/GL2: Fix OpenGL ES version detection\nWEBDAV: Fixed SEGFAULT in WebDav task sync + type changes\nWEBOS: Fix build, add core location on webosbrew.org\nWIN32: Fix Alt+Enter not working when menubar is disabled\n \n \n\n \n\n \nTéléchargement : \n \nhttps://retroarch.com/?page=platforms\n \nhttps://github.com/libretro/RetroArch/releases\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188335/in-multi-retoarch-1180-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[Switch] Suyu see you, Gitlab supprime Suyu",
        "content": "Les retraits d’émulateurs et d'homebrews qui sont liés à la Nintendo Switch continuent. Sur demande de Nintendo et donc peu de temps après sa mise à disposition Suyu se voit donc être supprimé de Gitlab. \n \nSuyu était un émulateur Switch issu d'un fork de Yuzu, malheureusement suite à une demande de retrait de Nintendo pour DMCA le projet prend du plomb dans l'aile. \n \nD'un autre côté le discord n'autorise pas de nouveaux membres et la page de téléchargement de Gitlab a été supprimé.\n \n \n\n \n \nPour l'heure il reste encore quelques brides, comme un accès autohébergé qui permet encore de télécharger les releases, ou bien des sauvegardes alternatives mais officiellement le projet a bien été retiré de Gitlab. \n \nA noter que Linkynimes nous informe en parralèle que sont projet AtmoPack-Vanilla a lui aussi été retiré de Gitlab.\n \nTout est là (encore mais pour combien de temps) : \n \nhttps://gitlab.com/suyu-emu/suyu-releases\n \nhttps://gitlab.com/openretro/suyu\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188334/in-switch-suyu-see-you-gitlab-supprime-suyu-1.png"
        }
    },
    "news_7": {
        "title": "[Switch] Suyu v0.0.2 Bêta disponible",
        "content": "La toute première version officielle de Suyu vient de sortir en version Bêta 0.0.2. \n \nSuyu est un tout nouvel émulateur reprenant le code source de Yuzu et qui est proposé pour Windows, Linux, MacOS et Android. \n \n \n\n \n \nChangelog : \n \n- Rebrand complet\n- Génération d'icônes ICNS\n- Gestion des erreurs\n- Intégration initiale de Qlaunch (bugué/nécessite des tests supplémentaires, nécessite le firmware V17.0.0 ou plus récent)\n- Gitlab ci pour les builds automatisées\n- Exige que toutes les clés soient fournies par l'utilisateur, ainsi que le firmware\n- Amélioration du gestionnaire de modules complémentaires\n- Diverses corrections de crashs\n- Travail initial pour la prise en charge de MacOS\n- Correction de la lecture vidéo sur les périphériques AMD\n- Activation de plus de fonctionnalités sur les pilotes propriétaires AMD\n- Réimplémentation de l'API multijoueur\n- Suppression de toutes les données télémétriques\n- Nouvelles options/améliorations de l'interface utilisateur\n- Changements de qualité (QOL)\n \n \nTéléchargement : Suyu v0.0.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188276/in-switch-suyu-v002-beta-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[Wii/WiiU] WiiStation v3.2 disponible",
        "content": "Le développeur xjsxjs197 vient de mettre à jour WiiStation, comme vous le savez l'émulateur WiiSX-RX a changé son nom en WiiStation, pour rappel le programme permet d'émuler les titres de la PlayStation 1 (PS1 / PSX / PSone) sur les consoles Wii et Wii U, basé à son tour sur le port de PCSX-Reloaded et avec beaucoup plus de modifications que PCSX-ReARMed.\n \nCette mise à jour corrige quelques bugs, implémente de nouveaux détails et limite les erreurs, les freezes et le trop plein de mémoire. \n \n \n \n \n\n \n \n \n \nChangelog :\n \n- SPU : Correction du débordement de nombres à 16 chiffres.\n- psxbios : implémente encore plus de détails sur la carte mémoire.\n- Corrige le gel de la Formule 1 au premier écran de chargement.\n- Mise à jour vers la dernière libCHDr.\n- Pour éviter les erreurs où les jeux CHD occupent trop de mémoire, déplacez le tampon 4M de Lightrec vers la mémoire MEM2.\n \n \nTéléchargement : WiiStation 3.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188275/in-wiiwiiu-wiistation-v32-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[PS3] PyPS3tools et PS3DumpChecker supportent le firmware 4.91",
        "content": " \nNotre ami sunriseur et le développeur littlebalup a mis à jour son outil PyPS3tools et son outil PS3DumpChecker afin qu'ils supportent les hashs du firmware 4.91.\n \nCes deux scripts regroupent des outils python pour analyser les dumps de mémoire flash de PS3. Il a aussi mis à jour PS3 Dump Checker qui est un utilitaire de downgrade de PS3 développé à l'origine par Swizzy, permettant de checker et vérifier les dumps NAND ou NOR pour rajouter le support des CFW 4.91 (à partir du CoreOS du custom firmware 4.91 d'Evilnat) et de l'OFW 4.91. \n \n \n \n\nChangelog PyPS3tools : \n- Ajout des hashes Evilnat 4.91 CEX\n- Ajout du support 4.91\n \nChangelog PS3DumpChecker :\n- Mise à jour vers la build 504\n \n \nNota Bene\n- Personne ne pourra être tenu responsable pour tout faux négatif ou faux positif donné par cette application. La responsabilité de la validité des dumps est la votre, et uniquement la vôtre, pas celle de littlebalup, ou encore Logic-Sunrise.\n- Cet outil doit être considéré comme un moyen facile de faire une vérification rapide afin de voir s'il est nécessaire d'approfondir les recherches.\n- Merci de faire remonter tout éventuel bug, faux négatif ou faux positif à littlebalup afin de lui permettre d'améliorer ces applications.\n \nEn plus de tout cela, littlebalup a aussi proposé une version HFW du firmware 4.91 Dualboot mais aussi la version Hybride, l'idée étant de proposer un firmware qui dispose de la désactivation des contôles ECDSA, permettant l'installation d'un CFW éventuellement. \n \nComme vous le savez ces firmwares Dualboot permettent de jouer à des jeux originaux, mais aussi de profiter du HEN.\n \n \nTéléchargement : PyPS3tools / PS3DumpChecker / Littlebalup's 4.91 Dual Boot firmwares\n \nMerci Littlebalup\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188250/in-ps3-pyps3tools-et-ps3dumpchecker-supportent-le-firmware-491-1.png"
        }
    },
    "news_10": {
        "title": "[PS4] GameBato augmente encore ses vitesses de téléchargement",
        "content": "Le développement de GameBato est toujours d'actualité, et la solution semble se maintenir dans son schéma économique partagée entre le gratuit et le payant. \n \nEt pour preuve, dans la dernière mise à jour, l'équipe en charge du développement a réussi encore à augmenter entre 35 et 120 % les vitesses de téléchargement en mode GameBato, ceci s'applique autant aux utilisateurs Premium que gratuits (Free).\n \nC'est le seul changement, du coup la numérotation ne change pas, il suffit de rouvrir l'application pour la mettre à jour, et ainsi appliquer les modifications. \n \n \n\n \n \n \nChangelog Mise à jour du patch !\n \n- Augmentation de la vitesse de téléchargement de 35% à 120% pour les téléchargements en mode GameBaTo.\n- Cela s'applique aux utilisateurs Premium et Free.\n- Réouvrir l'application pour qu'elle soit mise à jour et implémentée.\n- La version de l'application restera intacte.\n \nTout est là : GameBato\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188235/in-ps4-gamebato-augmente-encore-ses-vitesses-de-telechargement-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] Un nouveau firmware pour le Mig Switch disponible",
        "content": "Seconde mise à jour de Mars 2024 pour le Mig Switch, l'équipe en charge du développement ne se tourne pas les pouces, et propose donc un nouveau firmware pour leur périphérique. \n \nBon, il ne s'agit pas d'une mise à jour importante, qui n'apportera pas de grosses nouveautés, mais elle vise à corriger un bug que certains utilisateurs du Mig ont découvert avec des caractères non latins ou spéciaux (chinois, symboles spéciaux, etc.).\n \nL'équipe russe tient à remercier les utilisateurs pour leurs retours et suggestions, ils aident aussi à améliorer le produit, à corriger les bugs, et sont bénéfiques pour tout le monde.\n \n \n\n \n \nChangelog : \n \n- Ajout de la prise en charge des noms de fichiers contenant des caractères Unicode\n \n \nTéléchargement : Mig Switch.com firmware 1.1.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188216/in-switch-un-nouveau-firmware-pour-le-mig-switch-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] Yuzu-emu.org appartient désormais à Nintendo",
        "content": "C'est désormais officiel, le nom de domaine Yuzu-emu.org appartient désormais à Nintendo. Bien entendu cela n'est pas le fruit du hasard et cela faisait parti de l'accord conclu entre les avocats de Nintendo et ceux de Tropic Haze LLC, société détentrice de la propriété de Yuzu. \n \nPar extension ce sont aussi tous les forks de Yuzu qui sont concernés, et Nintendo ne va pas s'arrêter en si bon chemin. \n \n \n\n \n\n \n \nReste à savoir ce que Nintendo va bien pouvoir en faire jusqu'en 2026.\n \n \nTout est là : who.is/whois/yuzu-emu.org\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188210/in-switch-yuzu-emuorg-appartient-desormais-a-nintendo-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1188210/in-switch-yuzu-emuorg-appartient-desormais-a-nintendo-2.png"
        }
    },
    "news_13": {
        "title": "[PS5] LibHijacker v1.158 disponible",
        "content": "Le développeur illusion vient de mettre à jour l'outil LibHijacker à l'origine proposé par Astrelsky. Comme vous le savez c'est un outil permettant d’exécuter des applications homebrew sur les consoles PlayStation 4 et 5. \n \nDans cette mise à jour le développeur a ajouté par exemple le menu de débogage 1.04 de Demon Souls ou encore le déverrouillage de la fréquence d'Alien : Isolation. \n \n \n\n \n \nPS4 :\n- Batman: Arkham Knight v1.15: 60 FPS\n- Bloodborne v1.09: 60 FPS by Lance McDonald\n- Notes: You may encounter softlock during Laurence (optional DLC boss) cinematic. Disable patch to progress.\nAlso includes:\n- No Motion Blur\n- No Chromatic Aberration\n- Burnout Paradise Remastered v1.03\n- Skip Logo Videos\n- Skip First Time Introduction Video\n- Crash Team Racing v1.21: 60 FPS\n- Dragon Age: Inquisition v1.12: 60 FPS\n- Driveclub v1.28: 60 FPS\n- Gravity Rush 2 v1.11: 60 FPS\n- The Order 1886: v1.02: 60 FPS ( Notes: Softlocks will occur in Chapter 6 and 9 during Quick - Time Events. Disable patch to progress )\n- The Last Guardian v1.03: 4K at 60FPS\n- The Last of Us Remastered 60 FPS + Debug Menu (v1.11)\n- The Last of Us Part 2 60 FPS + Debug Menu (v1.00 + v1.09)\n- Uncharted: The Nathan Drake Collection Debug Menu (v1.00)\n- Uncharted 4: A Thief's End 60 FPS (v1.33)\n- Uncharted: The Lost Legacy 60 FPS (v1.09)\n- Just Cause 4 v1.32: 60 FPS\n- Shadow of the Colossus: 1440p at 60FPS + Debug Menu\n- Silent Hills: P.T at 60FPS\n- Red Dead Redemption 2 v1.29: 60FPS\n- Mafia Definitive Edition v1.04: 60 FPS + Skip logo movies\n \nPS5 :\n- Demon Souls v1.00 ( 60 FPS Unlock in Cinematic Mode / Debug Menu )\nDemon Souls v1.04 ( Debug Menu )\nUncharted: Legacy of Thieves Collection v1.00 (Debug Menu )\n \n \nTéléchargement : LibHijacker 1.158\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188205/in-ps5-libhijacker-v1158-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[PS5] PS2 2 PS5 V1.2:  Convertir vos backups PS2 pour PS5",
        "content": "Voici la version 1.2 de mon script python, vous permettant de convertir vos backups PS2 au format FPKG et donc jouable sur PS5.\n \n\n \nSon fonctionnement reste inchangé, sélectionner votre iso PS2, vos covers, background et BG menu, ajouter si besoin vos fichiers de configurations (.lua et .conf) pour améliorer l'émulation puis lancer la création de FPKG.\n \nVous trouverez juste une nouveauté, la possibilité de sélectionner l' émulateur PS2 afin d'avoir une meilleur compatibilité de votre jeux PS2. Ceci va vous permettre de sélectionner l' émulateur le plus adapté à votre iso PS2, par exemple pour Gran Turismo 4 il vous faut sélectionner l' émulateur Siren.pkg, pour God of War 2 l'émulateur JakX.pkg (je vous explique dans ma vidéo tuto, comment savoir quel émulateur il vous faut pour tel ou tel jeux PS2.)\n \n\n \nPetite précision importante, il vous faudra installer (si ce n est pas déjà fait) Python 3, version 3.12.1 au mieux, en cochant bien la case \"PATH\" avant l installation (ceci est tres important) mais aussi les dépendances (je vous fournir un fichier .bat qui automatise l' installation de ces dernières)\n \nAutre petite chose à savoir, les 3 images (PS2 cover, Background et BG Menu) sont OBLIGATOIRES, sans l 'une des 3 le programme vous donnera un message d'erreur...\n \nDe plus ce programme ne règle pas les soucis rencontrés en jeu (lags, black screen, lignes vertes, etc...) pour réparer ceci vous devrez intégrer à votre FPKG des fichiers .lua et .config qui EUX règlent les soucis rencontrés. Vous les trouvez sur le PS DEV wiki ici\n \nInstallation et utilisation:\n \n\n- Installer Python3\n- Installer les dépendances en lançant le .bat fourni (Install_pillow.bat)\n- Lancer le .py (PS2_2_PS5.py)\n- Suivre les instructions\n- Lancer la création du FPKG\n \n\n \n \n \nTuto video:\n \n\n \nTélécharger PS2 2 PS5 V1.2\n \nFaire un don: https://www.paypal.com/paypalme/markus00095\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188197/in-ps5-ps2-2-ps5-v12-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1188197/in-ps5-ps2-2-ps5-v12-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS4/Switch/XBO] Un émulateur Saturn découvert dans une compilation Puzzle Bobble",
        "content": "Bonne nouvelle, il semblerait qu'un nouvel émulateur a été découvert pour la PS4, mais aussi potentiellemnt pour la Nintendo Switch et la Xbox One, car le jeu est également sorti sur ces plates-formes. \n \n \n\n \n \nC'est tout de même sur PS4 que cela se passe, l'émulateur a été extrait d'une compilation (un jeu) Puzzle Bobble, il permet d'emballer des jeux 3 ou 4 CD sur un seul paquet. La mauvaise nouvelle est que pour le moment on ne sait pas encore comment lancer les jeux. \n \n \n \n\n \n \n \nLes premiers tests débouchent pour le moment sur un écran noir mais certains sont en train de chercher comment le faire réellement fonctionner, surtout que cela peut aussi intéresser la Switch et la Xbox One. \n \nTout est là : gamershhh_vika\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188177/in-ps4switchxbo-un-emulateur-saturn-decouvert-dans-une-compilation-puzzle-bobble-1.jpeg",
            "image_2": "https://www.logic-sunrise.com/images/news/1188177/in-ps4switchxbo-un-emulateur-saturn-decouvert-dans-une-compilation-puzzle-bobble-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS3] PS3 Toolset v1.2.007 avec support firmware 4.91 CEX",
        "content": "Le développeur bguerville nous informe via PSX-Place.com qu'il a mis à jour la suite d'outils qu'il propose sur PS3 afin de supporter le dernier firmware 4.91 de Sony. \n \nPS3 Toolset voit en effet sa numérotation passée à la v1.2.007, et ce n'est pas simplement le support du firmware 4.91 qui a été ajouté. \n \n \n\n \n \nLa détection du type de syscalls personnalisés a été corrigée. idps/psid est maintenant caché par défaut dans le gestionnaire de système, il a profité de l'occasion pour appliquer quelques corrections mineures.\n \nUne mise à jour plus complète permettant d'activer le gestionnaire de fichiers est en cours de réalisation et sera déployée en temps voulu, pas d'ETA comme toujours.\n \nQuelques changements ont également été apportés au serveur, en espérant que tout fonctionne correctement. \n \nRemerciements : \n \nMerci à @esc0rtd3w pour sa patience et ses tests.\nMerci à @Evilnat et @littlebalup.\nMerci à tous les utilisateurs de Toolset qui ont fait un don, vos contributions permettent de maintenir le nouveau site en vie et de le mettre à jour.\n \n \nTout est là : https://www.ps3toolset.com/bgtoolset/\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188176/in-ps3-ps3-toolset-v12007-avec-support-firmware-491-cex-1.jpg"
        }
    },
    "news_17": {
        "title": "[GC] Swiss v0.6r1622 disponible",
        "content": "Swiss est un utilitaire homebrew tout-en-un pour la Gamecube qui permet la lecture de Carte SDSC / SDHC / SDXC via SDGecko ou SD2SP2, la lecture de DVD (- / + R) ou disques GameCube originaux via le lecteur de disque, de lire une Mémoire flash Qoob Pro, de faire du Stockage de fichiers à distance via USB Gecko, d'émuler des cartes mémoire et bien plus encore.\nIl peu lire des documents texte, lancer des homebrews, lancer de la musique ou même lancer des jeux.\n \n\n \n\nChangelog : \n \n\n\n- Activer l'émulation de l'adaptateur large bande pour IDE-EXI et M.2 Loader.\n- Optimisations désespérées de l'hyperviseur pour faire tenir les choses.\n- Correction d'une désélection accidentelle de périphérique EXI.\n- Activation de l'émulation de l'adaptateur large bande pour le chargeur GC et l'adaptateur de carte SD.\n- Ajout du logo ETH2GC.\n- Mise à jour de l'infobulle.\n- Éviter les fins de lecture inutiles.\n- N'activer le GC Loader que s'il est éligible en tant que dispositif de correction.\n- Forcer l'utilisation de GC Loader en tant que dispositif de correction si les fonctionnalités activées l'exigent.\n- Éviter de masquer inutilement l'interruption de débogage PI.\n\n \n\nHash : ef5dce210277237b83fd66ffe9c639d147793810029908fc1a7ab11e2ee227989 swiss_r1622 .7z              \nLien de téléchargement : swiss_r1622.7z\n \n\n \n",
        "images": {
            "image_1": "https://user-images.githubusercontent.com/19207074/82130697-c475c900-979b-11ea-917d-197198b22a0f.jpg"
        }
    },
    "news_18": {
        "title": "[Multi] Flycast 2.3 disponible (Android, xbox et switch)",
        "content": " \nLe meilleur émulateur de Sega Dreamcast, de Sega Naomi et d'Atomiswave est de retour dans une nouvelle version, en effet Flycast est désormais proposé en v2.3.\n \nFork de Reicast, Flycast est un émulateur efficace qui continue d'être maintenu, les fonctionnalités sont nombreuses et la qualité de restitution font de cet émulateur l'un des meilleurs, que ce soit sur Nintendo Switch ou sur PlayStation Vita. \n \n \n\n \n \nNouveautés :\n- Prise en charge du câble de combat\n- Jeux SystemSP hopper : kingyo, manpuku, shateki, magicpop, unomedal, puyomedal, ochaken et westdmrg\n- Prise en charge du lecteur de cartes Club Kart\n- Réglages de la zone morte et de la saturation du gamepad\n- Switch : prise en charge du grondement de l'écran tactile et du joycon, corrections de bugs, améliorations des performances\n- Prise en charge du lecteur de code-barres HID pour les jeux de cartes (Mushi King, Dinosaur King, Love & Berry)\n \nJeux corrigés :\n- Initial D v2/v3\n- Melty Blood : Act Cadenza\n- Mission confidentielle\n- Le labyrinthe des rois\n- Spikers Battle\n- NBA Showtime\n- NHL 2K2\n- Ready 2 Rumble Boxing\n- Monkey Ball\n- Crackin'DJ 1 et 2\n- F355 (Naomi)\n- Samurai Shodown VI\n- Shenmue\n- Test Drive Le Mans\n- Sakura Taisen 3\n- Death Crimson 2\n- Force Five\n- NHL 2K2\n- Shakatto Tambourine\n- Xtreme Sports\n- Blue Stinger\n- RevolveR\n- Kaen Seibo\n- Nittere Shiki ! Mirai Yosou Studio\n- Shakatto Tambourine Arcade\n \n \nTéléchargement : flycast\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188152/in-switch-flycast-23-pour-switch-et-vita-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS3] PS3HEN 3.3.0 et HFW 4.91 de Team PS3Xploit disponibles",
        "content": "La Team PS3Xploit est de retour, depuis la sortie du firmware 4.91, l'équipe travaille dur pour proposer la mise à jour de leur solution.\n \nVoici donc la mise à jour du PS3HEN en v3.3.0 avec de nouveaux changements proposés par esc0rtd3w et Joonie, mais aussi la disponibilité du HFW 4.91 de Joonie.\n \n \n \n\n\n \n \n\nPS3HEN 3.3.0 Changelog:\n \nHEN Global Changes\n- Added support for 4.91 CEX firmware (HFW) (thanks @Joonie )​\n \nHEN Plugin Changes\n- Fixed early reboot problem with HEN_UPD.PKG for Emergency USB Recovery​\n \nPayload Changes\n- Fixed issue with PSP Launcher (thanks @aldostools , @LuanTeles )​\n \nResource Changes\n- Added *Toggle 99 Percent Package Install/Delete* option in HFW Tools->Maintenance (thanks @zmod )\n- Updated download_list.xml to use updated paths on dev_hdd0 (thanks @LuanTeles , @DeViL303 )\n- Added support for PS Home Catalogue path in download_list.xml (thanks @DeViL303 , @LuanTeles , @aldostools )\n- Added support for dev_usb002 - dev_usb007 in package manager (thanks @LuanTeles )​\n \n \nOfficial HFW 4.91.1 is available (thanks @Joonie )\nhttp://ps3xploit.me/firmware/hfw/HFW_4.91.1_PS3UPDAT.PUP​\nMD5: C2717C377EB4F0FF458B8819B1E53D50\n \nThanks to everyone for their patience, and extra thanks to @aldostools, @LuanTeles, @bguerville, @Joonie, @MrMario2011, @Coro, @littlebalup, @DeViL303 for help with testing everything, suggestions, firmware, and advice\n \n\n \n\n \nTout est là : ps3xploit.me\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188151/in-ps3-ps3hen-330-et-hfw-491-de-team-ps3xploit-disponibles-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] Nintendo continue la sauvegarde de ses intérêts sur les patchs signatures",
        "content": "Il fallait s'y attendre, ce sont désormais tous les homebrews qui sont visés par Nintendo, mais au délà de ça, ce sont maintenant toutes les modifications considérées comme violant tout copyright qui sont visées. \n \nNintendo vient désormais de se pencher sur les patchs signatures, notamment sur l'homebrew sigpatch-updater proposé par iTotalJustice, et bien entendu tous les forks et autres versions dérivées qui peuvent être librement proposées. \n \n \n \n\n \n \n \n \n \n \nAvant de désactiver tout contenu en rapport avec cet avis de retrait, GitHub\n- a contacté les propriétaires des dépôts concernés pour leur donner la possibilité de [faire des changements] \n- a fourni des informations sur la manière de [soumettre un contre-avis DMCA]  \n- proposé de mettre les propriétaires des dépôts concernés en contact avec [des ressources juridiques] dans le cadre de notre engagement à défendre les développeurs.\n \nPour savoir quand et pourquoi GitHub peut traiter certains avis de cette manière, veuillez consulter notre [Readme].\n \nLa console Nintendo Switch contient des mesures technologiques qui vérifient chaque jeu joué sur la Nintendo Switch (les \" MTP du jeu \"). Les MTP du jeu utilisent le cryptage et la vérification des signatures, comme décrit plus en détail ci-dessous. La console Nintendo Switch permet aux utilisateurs soit de jouer à des jeux sur des cartouches physiques qui sont insérées dans la console, soit de jouer à des jeux téléchargés numériquement à partir du serveur de Nintendo. Les deux formats sont protégés par les mesures technologiques de Nintendo ; en particulier, les jeux numériques téléchargés sont protégés par le cryptage, y compris les clés de titre cryptées, ou \"signatures\", qui sont vérifiées par les MTP du jeu lorsqu'un jeu téléchargé est lancé sur la console Nintendo Switch. Nintendo détient ou contrôle exclusivement de nombreux droits d'auteur sur des logiciels et des jeux qui sont protégés contre l'accès et la copie illicites par le fonctionnement de ces Mesures Technologiques. Dans le cadre de leur fonctionnement normal, les Mesures Technologiques requièrent l'application d'informations et d'un processus (sous la forme des contrôles de signature décrits ci-dessus), avec l'autorité de Nintendo, pour obtenir l'accès aux œuvres protégées par le droit d'auteur de Nintendo, et ainsi contrôler efficacement l'accès aux œuvres protégées par le droit d'auteur de Nintendo et la copie de celles-ci.  \n \nNintendo a précédemment soumis un avis de contournement à GitHub concernant la mise à disposition de SigPatches par l'utilisateur [private]. L'avis précédent a été soumis le 23 juillet 2022, pour un contenu posté sur [private], qui contenait des SigPatches. GitHub a supprimé le contenu signalé en réponse à la notification de juillet 2022. Plusieurs des dépôts (forks) mentionnés dans la présente notification contiennent également des SigPatches dans les fichiers postés sur GitHub.  \n \nAvec le dépôt iTotalJustice signalé dans la présente notification, iTotalJustice tente d'échapper aux efforts de mise en œuvre de Nintendo en fournissant des SigPatches via un lien vers un site web tiers ([private]), plutôt que d'inclure des SigPatches dans le dépôt lui-même. Le lien est accompagné de la mention \"Les patchs sont téléchargés à partir d'un nouvel hôte. Un grand merci à eux !\" Plusieurs des forks signalés dans le présent avis renvoient également au site web tiers [private] pour fournir des SigPatches. L'établissement d'un lien vers un logiciel de contournement est considéré comme un \"trafic\" en violation du DMCA lorsque, comme c'est le cas ici, la partie responsable du lien sait que le matériel incriminé se trouve sur le site lié, il sait que le matériel lié est une technologie de contournement et il maintient le lien dans le but de disséminer cette technologie. Le dépôt signalé viole donc le DMCA et les droits de Nintendo. \n \n \n \nCe n'est pas une première pour iTotalJustice, cela avait déjà été le cas en 2022 avec sipatches, ses applications permettaient de mettre à jour les patchs signatures directement depuis la Nintendo Switch. \n \nL'outil a été retiré du référentiel GitHub pour DMCA, mais il va réapparaitre probablement par ailleurs comme les autres, cependant cela met un coup d'arrêt direct à son développement ou ses mises à jour. \n \nDe plus, cela ne fait que grossir la liste qui s'allonge de jour en jour, Incognito_RCM, kezplez-nx, Lockpick_RCM et donc désormais sigpatch-updater, à qui le tour ?\n \n \nTout est là : github.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188099/in-switch-nintendo-continue-la-sauvegarde-de-ses-interets-sur-les-patchs-signatures-1.png"
        }
    }
}