{
    "news_1": {
        "title": "[XB] Xemu mis à jour en version 0.7.117",
        "content": "L'équipe en charge du développement de Xemu, l'émulateur de la console Xbox originale pour PC Windows, MacOS et Linux. Pour se souvenir Xemu est avant tout un fork de XQEMU, le projet d'émulation système complet QEMU, toujours axé sur les fonctionnalités, les performances, et la stabilité et surtout l'expérience utilisateur.\n \nAinsi comme nous pouvons le voir dans le changelog ce sont de nombreux correctifs qui ont été déployés, comme par exemple la simplification de l'interface utilisateur ou la suppression d'éléments non utilisés. \n \nLe code a été retravaillé, une restauration de l'affichage du système au premier démarrage est aussi de la partie , ainsi de nombreuses évolution du menu contextuel. \n \n \n\n \n \nChangelog v0.7.117 :\n \n- Utiliser une seule option pour la fenêtre de paramétrage (#1122)\n \n- rebase code\n \n- suppression des éléments inutilisés\n \n- restaurer l'affichage du \"système\" au premier démarrage\n \n- restaurer les fonctions du menu popup (commit séparé)\n \n- restaurer la fonction snapshot dans le menu popup\n \n- récupérer la valeur de l'index actuel dans le fichier de configuration\n \n \nTéléchargement : Xemu v0.7.117\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182742/in-xb-xemu-mis-a-jour-en-version-07117-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS5] Sony dévoile le code source de la PlayStation Portal",
        "content": "Cela ne vous aura pas échappé mais la PlayStation Portal est un véritable succès, du moins, elle est déjà en rupture 5 jours après sa sortie, de deux choses l'une, soit Sony n'en a pas produit et fourni assez pour honorer un lancement digne de ce nom, soit c'est un véritable succès au delà des attentes, en tout cas les scalpers se font déjà plaisir. \n \nBref, au delà de cela, Sony vient de publier le code source de la PlayStation Portal comme la firme avait pu le faire avec la PS4 et la PS5, et ceci en raison que s'appuyant sur un licence open-source, la divulgation du code source du système d'exploitation est indispensable et indiscutable. \n \nPesant 600 Mo, ce sont 5 dossiers différents : External, kernel_platform, prebuilts, system et vendors.\n \n \n \n\n \n \n \nLe développeur emuonpsp a découvert que la PlayStation Portal utilise un SoC Snapdragon SM6225, soit un SnapDragon 680.\n \n \n\n \n \nTout est là : Source Code PlayStation Portal Remote Player\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182729/in-ps5-sony-devoile-le-code-source-de-la-playstation-portal-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1182729/in-ps5-sony-devoile-le-code-source-de-la-playstation-portal-2.png"
        }
    },
    "news_3": {
        "title": "[Switch] RyuJinx au rapport d'Octobre !",
        "content": "C'est désormais au tour de la Team RyuJinx de dévoiler son rapport du mois d'Octobre quelques heures après celui de la Team Yuzu. \n \nLà aussi de nombreuses évolutions, notamment dans certains jeux comme Luigi's Mansion 3. Des problèmes de GPU AMD ont été corrigés via à certains correctifs, afin de corriger des problèmes d'objets et d'ombres. \n \n \n\n \n\n \n \nLa Team nous explique qu'elle a été confronté à la nécessité de gérer la suppression de données de mémoire GPU (VRAM) après la fin d'utilisation de certains jeux. \n \n \n\n \n \nA noter que certains jeux, bénéficiant d'un nouveau service IFileSystem.GetFileSystemAttribute introduit à partir du firmware 16.0.0 ne fonctionnaient plus, c'est désormais corrigé. \n \n \n\n \n \nComme nous le voyons, RyuJinx évolue comme Yuzu dans le bon sens.\n \n \nTout est là : ryujinx.org\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182676/in-ps3-ryujinx-au-rapport-doctobre-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1182676/in-ps3-ryujinx-au-rapport-doctobre-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1182676/in-ps3-ryujinx-au-rapport-doctobre-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1182676/in-ps3-ryujinx-au-rapport-doctobre-4.png"
        }
    },
    "news_4": {
        "title": "[PS3] Le xai-plugin voit arriver les options de la Rebug Toolbox",
        "content": "Le développeur Nathan Martin vient d'annoncer sur son profil Twitter qu'à la suite de la demande d'un utilisateur, RoboKingsComos, qu'il vient de rajouter de nouvelles options dans le xai-plugin. \n \nCe ne sont pas n'importe lesquelles des options qui ont été rajoutées, ce sont les options de la Rebug Toolbox. \n \nL'option \"Basculer l'espace disque dur\" a été corrigée et fonctionne désormais sur HEN. Le code d'erreur 0x800299D2 lors de la lecture d'un film DVD/BD semble avoir été contourné lors de tests récents. \n \nCorrection d'un problème dans xai_plugin lors de la création de fichiers act.dat/RIFs lorsque l'ID utilisateur actuel comporte plus de deux chiffres.\n \n \n\n \n\n \n \nCes derniers jours, il a porté ses efforts sur la gestion des régions des films DVD/BD à partir du XMB, et aussi pour le format de diffusion PAL/NTSC, preuve qu'il est toujours possible de trouver des évolutions sur PS3. \n \nPour rappel, xai_plugin fait partie du CFW 4.90 Evilnat. Le plugin est utilisé conjointement avec le menu Custom Firmware Tools (XML), certaines options nécessitent des fonctionnalités ajoutées à Cobra 8.4.\n \nDonc, si vous souhaitez utiliser xai_plugin, il vous suffit d'installer CFW 4.90 Evilnat et tout est prêt. \n \nTout est là : https://twitter.com/xXEvilnatXx\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182643/in-ps3-le-xai-plugin-voit-arriver-les-options-de-la-rebug-toolbox-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182643/in-ps3-le-xai-plugin-voit-arriver-les-options-de-la-rebug-toolbox-2.jpg"
        }
    },
    "news_5": {
        "title": "[PS4] Abkarino dévoile une méthode de partage de compte",
        "content": "Le développeur Abkarino a publié sur son profil Twitter (X) une technique de partage de compte pour la PlayStation 4. \n \nCette technique a déjà été approuvée sur PSP, PS3 et Vita, mais Sony a changé pas mal de choses sur la PlayStation 4, il a fallu adapter la méthode. Comme vous le savez cette technique n'est pas nouvelle, elle s'appuie sur le fait que Sony tolère un compte ami sur une nouvelle console en faisant oublier la première console. \n \nComme cette méthode s'appuie sur des dumps, des flashs SPI et Syscon, elle ni gratuite, ni simple à mettre en oeuvre.\n \n \n \n\n \n \n \nCette méthode de partage / activation de compte PSN : \n \n1 - Ajoutez des comptes PSN avec des jeux à votre console et activez-la en tant que console principale et téléchargez tous les jeux que vous souhaitez à partir de ces comptes .\n \n2 - Éteignez votre console et dumpez votre flash SPI et Syscon 2 ou 3 fois pour être sûr que vous avez un dump correct. \n \n3 - Retirez le disque dur actuel, installez-en un nouveau et réinstallez le même firmware que vous aviez à nouveau.\n \n4 - Ajoutez les mêmes comptes PSN que vous avez ajoutés lors de la première étape et désactivez maintenant cette console de tous les comptes. \n \n5 - Éteignez à nouveau votre console et restaurez vos dumps SPI Flash et Syscon que vous aviez effectués à l'étape 2. \n \n6 - Remplacez le nouveau disque dur par votre original (très important).\n \n7 - Rallumez la console et tadaaaaaa vous avez activé les jeux PSN sans compter votre console parmi les comptes PSN utilisés.\n \n \nLa méthode se trouve ici : AbkarinoMHM\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182629/in-ps4-abkarino-devoile-une-methode-de-partage-de-compte-1.png"
        }
    },
    "news_6": {
        "title": "[2DS/3DS/DS] TWiLight Menu++ v26.3.0 et nds-bootstrap v1.0.3 disponibles",
        "content": "Le développeur RocketRobz est de retour avec de nouvelles versions de TWiLight Menu++ et de nds-bootstrap, ainsi le thème DSi Classic a été ajusté pour se comporter davantage comme l'original. Plusieurs traductions ont été mises à jour et un patch anti-piratage a été ajouté pour le hack ROM \"Pokémon : Refined Gold Overhaul\".\n \nAu délà de cela certains bugs ont été corrigés dans Bootstrap NDS. Le jeu « Tootuf : Mission Nadia » est désormais sauvegardé et « Style Lab : Jewelry Design » démarre en mode DSi. \n \n \n\n \n \nSur la 3DS , les astuces dans DSiWare fonctionnent désormais également et l'ouverture du menu \"Enregistrements\" dans Tetris DS ne provoque plus de crash si le menu Nintendo WFC était précédemment ouvert.\n \n \n \nTéléchargement : TWiLight Menu++ v26.3.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182622/in-2ds3dsds-twilight-menu-v2630-et-nds-bootstrap-v103-disponibles-1.jpg"
        }
    },
    "news_7": {
        "title": "[Switch] Yuzu fait son introspection du mois d'Octobre 2023",
        "content": "Comme tous les mois, la Team Yuzu fait le récapitulatif des évolutions de son émulateur Switch nommé tout simplement Yuzu, et elles ont encore une fois étaient nombreuses sur le mois dernier. \n \nLe rapport qu'elle dévoile souvent en milieu de mois permet de connaitre les améliorations, les nouveautés et vers où va les ressources de l'équipe, un bon moyen d'informer mais aussi de rassurer les utilisateurs et ceux qui continuent de soutenir le projet. \n \nAinsi la team annonce avoir amené une pléthore de correctifs GPU, la prise en charge de nouvelles applets, beaucoup de travail consacré aux versions Android, et des nouvelles intéressantes sur l'avenir.\n \nGPU ?\n \nDes optimisations par certains endroits pour Super Mario Bros Wonder, notamment sur des bascules internes entre VSync à double et triple tampon. De nombreux changements sur la gestion des GPU ont été effectués le mois dernier. Lorsqu'un jeu utilise un tampon de profondeur, il s'inspire généralement d'une scène 3D chargée tout en profitant d'un processus accéléré par le matériel appelé test de profondeur.\n \nLors des tests de profondeur, le matériel GPU détermine si un pixel est visible ou masqué (occlus) par un autre pixel. Ceci est décidé par leurs valeurs de profondeur. Le tampon de profondeur suit la distance entre chaque pixel stocké et la caméra. Si un pixel rendu est plus éloigné que ce qui a déjà été dessiné sur la scène, alors le pixel est ignoré ; s'il est plus proche, alors il est conservé et les tampons de couleurs sont mis à jour. Généralement, le tampon de profondeur est également mis à jour et écrit, dans ce cas, pour stocker la profondeur du nouvel objet plus proche.\n \n \n\n \n \n \nIl est possible pour un jeu d'utiliser uniquement les tests de profondeur et de désactiver les écritures réelles dans le tampon de profondeur pour des éléments spécifiques, et de nombreux jeux le font lors du rendu d'objets partiellement transparents. Cependant, l'inverse n'est pas permis par les API graphiques comme Vulkan : les conceptions matérielles nécessitent que les tests de profondeur soient activés afin de mettre à jour le tampon de profondeur. Le chemin clair masqué de yuzu pour les tampons de profondeur/pochoir a un shader qui met à jour le tampon de profondeur, et permet ainsi les écritures en profondeur, mais a oublié d'activer également les tests de profondeur. La plupart du temps, cela fonctionnait par coïncidence, car le jeu permettait des tests approfondis et Yuzu ne sortait pas de cet état. Cependant, tous les jeux ne les permettent pas, et sans tests de profondeur, des jeux comme Super Mario 64, ou Super Mario 3D All-Stars, ne peuvent pas restituer correctement le visage de Mario.\n \n \n\n \n \nCela passe par un travail effectué par le développeur Maide, qui lui aussi est à l'origine de l'optimisation de Vulkan Memory Allocator standard (VMA en abrégé) qui est la façon dont il peut aider à nettoyer le code, mais il a aussi résolu des problèmes de cache, de scale de résolution, de redimensionnement d'images, et il a même découvert un problème avec les calculs des shaders lorsqu'ils déclenchaient des invalidations dans le cache de tampon. Bref il a fait un énorme boulot. \n \n \nAndroid ? \n \nLa version Android a largement était améliorée, il faut dire qu'elle a vu arriver de nombreuses modifications, notamment pour améliorer l'expérience utilisateur et la compatibilité avec les appareils. Ainsi un nouveau gestionnaire de pilotes GPU a été développé. \n \nDes crashs ont été résolus, ceux qui se produisaient uniquement en faisant une simple rotation de l'appareil, et des problèmes liés à Vulkan 1.1, surtout présent sur Adreno 600 et 700 ont là ausi été rectifiés. \n \nUne grille d'accueil a été implémentée, et certains threads de mémoire ont été séparé afin de limiter les freezes.\n \n \n\n \n \nEnfin un menu applets nommé \"Cabinet\" est désormais intégré permettant par exemple d'accéder à l'éditeur Album et Mii, ou à un app permettant de gérer les données Amiibo. \n \n \nL'interface utilisateur ? \n \nUn support spécifique pour Windows a été apporté, après un début difficile certaines fonctionnalités ont été intégrées, comme des raccourcis permettant de mettre votre jeux directement sur le bureau ou dans le menu démarrer. Il a fallu également créé un format d'icônes, ainsi que sur la gestion de la souris. Des spécifiques comme pour les captures d'écran, mais ils ne peuvent pas tout voir, les développeurs passent beaucoup de temps à ouvrir et fermer yuzu alors que byte[] peut mesurer avec précision que 10 % des crashs d'arrêt qui sont causés par les jeux. \n \n \n\n \n\n \n \n \nQuelques modifications à venir ? \n \nOui notamment du côté AMD, Polaris et Vega, d'ancienne génération vont sortir du support AMD, les pilotes sont désormais scindés en deux, les 2 derniers vestiges de l'architecture GCN sont sur le point d'être abandonnés. Ces produits exécutent des branches de pilotes Vulkan obsolètes par rapport à RDNA et au matériel plus récent. La nouvelle d'AMDVLK, le pilote Linux AMD officiel, supprimant la prise en charge de ces produits signifie qu'aucun nouveau pilote Vulkan ne sera disponible. Il faut se préparer à la sortie du support de ces générations.\n \nLe Project Nice pour les appareils Android, NCE (Native Code Execution) progresse très bien, mais il reste encore quelques bugs à corriger. Les jeux deviennent non seulement jouables, mais aussi plus rapides sur les appareils soumis à des restrictions thermiques. De plus, le temps passé à charger et fermer les jeux a désormais été considérablement réduit ! NCE a également aidé à comprendre les problèmes liés à l'émulation de processeur dans x86_64, alors attendez-vous à des gains sur les deux fronts.\n \n \n\n \n \nBref, on le voit le travail effectué par la Team Yuzu restent impressionnant, tenant à s'excuser car les devoirs universitaires et les examens retardent un peu la publication des rapports mensuels. \n \n \nLe rapport intégral se trouve ici : \n \nhttps://yuzu-emu.org/entry/yuzu-progress-report-oct-2023/\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182590/in-switch-yuzu-fait-son-introspection-du-mois-doctobre-2023-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1182590/in-switch-yuzu-fait-son-introspection-du-mois-doctobre-2023-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1182590/in-switch-yuzu-fait-son-introspection-du-mois-doctobre-2023-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1182590/in-switch-yuzu-fait-son-introspection-du-mois-doctobre-2023-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1182590/in-switch-yuzu-fait-son-introspection-du-mois-doctobre-2023-5.png",
            "image_6": "https://www.logic-sunrise.com/images/news/1182590/in-switch-yuzu-fait-son-introspection-du-mois-doctobre-2023-6.png"
        }
    },
    "news_8": {
        "title": "[Switch] AIO Switch Updater v2.23.2 disponible",
        "content": "Le développeur HamletDuFromage a mis en ligne hier une nouvelle version de son AIO Switch Updater, comme vous le savez cet outil permet de profiter d'options très utiles comme mettre des DNS Lan Play, de mettre à jour Atmosphere ou les sigpatches, ou encore de gérer des cheats codes via CheatSlips.com.\n \n \n\n \n \n \nChangelog 2.23.2 : \n \n- Correction du payload rcm pour les unités picofly \n- Correction du payload ne fonctionnant pas sur certaines unités picofly\n- Mise à jour de la traduction en anglais\n- Mise à jour du fichier menus.json coréen\n- Correction de certaines formulations dans la traduction en roumain\n \n \nTéléchargement : aio-switch-updater\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182581/in-switch-aio-switch-updater-v2232-disponible-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS4/Vita/Switch] wiliwili v1.2.2 disponible",
        "content": "Le client tiers multiplateforme Bilibili a vu débarquer une mise à jour de wiliwili, conçu pour être contrôlé via GamePad, et fonctionnant sur PC, PlayStation Vita, Nintendo Switch et PlayStation 4.\n \nLe client wiliwili prend en charge, comme sa version PC, les commandes tactiles, la navigation à la souris, au clavier, au joystick, ou encore une interface PC et même PDA. \n \nDes options de diffusion en direct, qui intègre des optimisations, des correctifs pour lutter contre les plantages sur la page de diffusion, et des mises à jour de ffmpeg.\n \n \n \n\n \n \n \nChangelog : \n \n- Correction de l'impossibilité d'afficher le danmaku en direct\n- Correction d'un éventuel crash lors de l'ouverture de la page de streaming en direct\n \n \n \n \n\n \n \n \nNintendo Switch \n \n- Télécharger wiliwili-NintendoSwitch.zip\n- Placez wiliwili.nro dans le répertoire switch de votre carte mémoire.\n- Sur la page d'accueil, maintenez la touche R enfoncée pour ouvrir n'importe quel jeu, allez dans hbmenu et sélectionnez wiliwili dans la liste, cliquez pour l'ouvrir.\n- [Optionnel] Installez une icône de bureau dans l'application : Paramètres/Utilitaires/Tutoriels.\n \nPSVita\n \n- Télécharger wiliwili-PSVita.vpk et l'installer \n- Le support de la résolution dure n'est pas très stable, actuellement nous recommandons d'utiliser la résolution douce avec la résolution 360P.\n \nPS4\n \n- Télécharger wiliwili-PS4.pkg et l'installer.\n- Ne supporte que la résolution faible, pour la ps4, nous recommandons de désactiver le décodage basse qualité dans les paramètres ; la ps4 pro doit activer le décodage basse qualité si vous voulez jouer à peine en 4k@60.\n \nPC\n \n- Le client PC prend en charge la commutation du décodage matériel, l'ouverture en douceur en quelques secondes pour les anciens ordinateurs et le contrôle de la souris (clic gauche, clic droit pour revenir).\n- Téléchargez le paquet d'installation pour le système correspondant et exécutez-le.\n \n \nTéléchargement : wiliwili 1.2.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182578/in-ps4vitaswitch-wiliwili-v122-disponible-1.png"
        }
    },
    "news_10": {
        "title": "[PS5] Loader JAR PS5 v1.0 disponible",
        "content": "Le développeur Hammer-83 vient de dévoiler la première version stable de son Loader PS5 JAR, pour rappel cet outil s'appuie sur des vulnérabilités dans le lecteur blu-ray. \n \n \n\n \n \nLes diverses failles et vulnérabilités fonctionnent jusqu'au firmware 7.61, et permet de charger des fichiers JAR. C'était en Septembre 2023 que TheFlow confirmait que son exploit bluray 0day fonctionnait sur le dernier firmware 7.61, qui lui avait été lancé un mois avant. \n \nLe développeur n'a pas publié de changelog, si ce n'est de dire qu'il s'agit d'une version stable. \n \n \nTéléchargement : ps5-jar-loader v1.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182576/in-ps5-loader-jar-ps5-v10-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[PS5] Les hackers s'intèressent déjà à la PlayStation Portal",
        "content": "Annoncé le 23 mai 2023 et commercialisé depuis aujourd'hui, le 15 novembre 2023, voilà déjà que la PlayStation Portal intéresse les hackers et autres bidouilleurs d'hardware. \n \nL'un d'entre eux, Emuonpsp, a déjà commencé à mettre son nez dans la bestiole, notamment en dévoilant des captures d'écran et une liste de bibliothèques androidX utilisées sur l'appareil, ainsi que certaines interactions USB et réseau.\n \n \n\n \n\n \n\n \n \n\n \n\n \n\n \n\n \n \nAutant le dire tout de suite, des limites ont été mises en oeuvre par Sony sur le navigateur interne, d'après les captures, la PlayStation Portal est équipé du firmware 2.0.0.\n \n \n\n \nIl en profite pour comparer la PlayStation Portal a une DualSense afin de confirmer la taille de la bête. \n \n\n \n\n \n \n \nTout est là : twitter.com/emuonpsp\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182543/in-ps5-les-hackers-sinteressent-deja-a-la-playstation-portal-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182543/in-ps5-les-hackers-sinteressent-deja-a-la-playstation-portal-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1182543/in-ps5-les-hackers-sinteressent-deja-a-la-playstation-portal-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1182543/in-ps5-les-hackers-sinteressent-deja-a-la-playstation-portal-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1182543/in-ps5-les-hackers-sinteressent-deja-a-la-playstation-portal-5.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1182543/in-ps5-les-hackers-sinteressent-deja-a-la-playstation-portal-6.jpg",
            "image_7": "https://www.logic-sunrise.com/images/news/1182543/in-ps5-les-hackers-sinteressent-deja-a-la-playstation-portal-7.jpg",
            "image_8": "https://www.logic-sunrise.com/images/news/1182543/in-ps5-les-hackers-sinteressent-deja-a-la-playstation-portal-8.jpg",
            "image_9": "https://www.logic-sunrise.com/images/news/1182543/in-ps5-les-hackers-sinteressent-deja-a-la-playstation-portal-9.jpg",
            "image_10": "https://www.logic-sunrise.com/images/news/1182543/in-ps5-les-hackers-sinteressent-deja-a-la-playstation-portal-10.jpg"
        }
    },
    "news_12": {
        "title": "[PS5] Le lecteur optique et la PS5 slim décortiqués par Abkarino",
        "content": "Le développeur Abkarino que l'on connait bien pour PS4SysconTools ou encore quand il était membre de la Team Rebug, a désormais entre ses mains une PlayStation 5 Slim. \n \n \n\n \n \n\n \n\n \n \nIl s'agit d'une CIF-2000 A01 qui a pu être désossé, l'occasion pour nous de découvrir l'ensemble du PCB dans des photos intéressantes puisqu'il l'a démonté entièrement, et aussi de découvrir le lecteur optique lui aussi mis à nu, avec cache retiré et PCB apparent. \n \n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n \n \nTout est là : twitter.com/AbkarinoMHM\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-5.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-6.jpg",
            "image_7": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-7.jpg",
            "image_8": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-8.jpg",
            "image_9": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-9.jpg",
            "image_10": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-10.jpg",
            "image_11": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-11.jpg"
        }
    },
    "news_13": {
        "title": "[PS5] PS5 Wee Tools supporte désormais le modèle slim",
        "content": "Le développeur Andy_maN vient de mettre en ligne une nouvelle version de PS5 Wee Tools, comme vous le savez il s'agit d'un outil gratuit qui permet de réaliser sensiblement les mêmes choses que Nor Tool proposé par Better Way Electronics. \n \nIl s'agit d'un script python qui pour l'heure est assez limité dans son nombre d'options, il permet tout de même de connaitre les informations sur le dump de la NOR, comme le MD5, l'ID de la carte, le modèle, le SKU, la région, le numéro de série, l'id Kiban, le firmware actuel / minimum / usine, l'adresse MAC (LAN/Wifi) ou encore permet d'autres options pour activer/désactiver IDU (mode kiosque) et le type de modèle (avec lecteur optique ou numérique).\n \nCette version permet aussi bien entendu de réaliser des dumps, des extractions de partitions ou encore des contrôles basiques de validation, et cette nouvelle version apporte le support du modèle Slim. \n \n \n \n\n \n \n \nNouveautés :\n \n- Prise en charge du modèle Slim\n- Région #18 ajoutée\n- PS5 Nor dump info\n- Flags toggle : idu, modèle, slot actif\n- Pack/déballage du dump PS5\n- Validation de base\n- Navigateur de fichiers\n- Terminal (UART) avec surbrillance (win10+)\n- Comparaison des fichiers Multy\n- Emballer/déballer des fichiers 2BLS\n- Optimisation du code\n- Correction de bugs mineurs\n \n \nTéléchargement : PS5 Wee Tools 0.1.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182504/in-ps5-ps5-wee-tools-supporte-desormais-le-modele-slim-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] DBI v633 disponible",
        "content": "Hormis une tendance très minimaliste exacerbée, DBI est apprécié pour ses fonctionnalités et une partie backend de Windows qui permet de faciliter les transferts. Avec cette nouvelle version, les jeux peuvent désormais être transférés d'une console à une autre via USB. De plus, les contrôles de mise à jour (en DBI) pour certains jeux peuvent être désactivés via la config.\n \nRashevskyv, le développeur de DBI propose la v633 de DBI (pour DB Installer) qui est un gestionnaire et installateur de fichiers NSP/NSZ/XCI et XCZ via SD, USB. Il fonctionne tout aussi bien en standalone ou bien en créant son propre serveur http local. Il permet aussi de gérer et supprimer les fichiers orphelins des tickets (mise à jours par exemple).\n \n \n\n \n \n \nAjout :\n \n- Transfert de captures d'écran via HTTP : Les utilisateurs peuvent désormais transférer des captures d'écran de leur appareil vers un PC en utilisant HTTP. Cette fonctionnalité est disponible sous l'option de menu Outils > Parcourir l'album via HTTP.\n- Options de configuration :\n- EnableNSZ=true : Permet l'installation de NSZ/XCZ en mode applet. Cette option désactive l'installation des fichiers NSZ/XCZ lorsque DBI fonctionne en mode applet. Elle garantit que les installations ne peuvent être effectuées qu'en mode titre, soit par l'intermédiaire d'un transitaire, soit par l'intermédiaire d'un jeu. Ce mode se caractérise par un fond noir dans l'application, ce qui élimine l'erreur due à l'insuffisance de mémoire lors du décompactage.\n- CreateLFS=true : Crée un dossier LFS (Large File Storage) dans /atmosphere/contents après l'installation du jeu.\n- Traduction en chinois traditionnel : Une nouvelle version de l'application, DBI_znch.nro, a été ajoutée pour prendre en charge le chinois traditionnel.\n \n \nTéléchargement : DBI v633\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182501/in-switch-dbi-v633-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS4] PS4 Edit RCO v1.0.3 disponible",
        "content": "Le développeur Master-s propose une nouvelle version de PS4 Edit RCO, qui prend la forme de CXMLDecompilerRCO_1.0.3, et qui vous permet de modifier facilement le fichier RCO de votre PS4. \n \n \n\n \n\n \n \nAvec ce programme, vous allez pouvoir éditer 3 fichiers : \n \n- TopMenu.rco\n- Notification.rco\n- Settings.PkgInstaller.rco\n \net ainsi apporter une personnalisation aux arrières plans, aux notifications et à certains paramètres du XMB et d'installation de PKG de la PS4 comme le montre le développeur. \n \n \n \n\n \n \n \nTéléchargement : CXMLDecompilerRCO_1.0.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182476/in-ps4-ps4-edit-rco-v103-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182476/in-ps4-ps4-edit-rco-v103-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[Vita] Apollo Save Tool v1.2.8 disponible",
        "content": "Le développeur Damian Parrino, alias Bucanero, nous informe de la disponibilité d'une nouvelle version d'Apollo Save Tool pour la PlayStation Vita, proposé en version 1.2.8, cette mouture apporte de nombreuses nouveautés. \n \nCela faisait un bon moment que nous n'avions pas eu droit à une mise à jour la dernière avait été proposée le 12 Avril 2023, les changements sont donc nombreux au fil des versions PS4 et PSP.\n \nPour rappel, il s'agit d'une application qui vous permet de gérer les fichiers de sauvegarde de jeu sur PlayStation Vita et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur la PlayStation Vita. \n \n \n \n\n \n \n \nChangelog 1.2.8 : \n \nAjouts : \n- Détection automatique des paramètres des boutons X/O\n- Compression des fichiers .ISO en .CSO\n- Décompression des fichiers .CSO en .ISO\n- Ajout d'une base de données de clés de sauvegarde pour les jeux PSP\n- Nouveaux cheat codes Vita :  Odin Sphere Leifthrasir (PCSE00899, PCSB00986)\n- Nouveaux cheat codes PSP : BlazBlue : Continuum Shift II (ULUS10579, ULES01526), Persona (ULUS10432), Monster Hunter Freedom Unite (ULES01213, ULUS10391), Monster Hunter Portable 2nd G (ULJM05500)\n- Prise en charge du décryptage personnalisé : Patapon 3 (UCUS98751, UCES01421), Monster Hunter Freedom Unite (ULES01213, ULUS10391), Monster Hunter Portable 2e G (ULJM05500), Monster Hunter Portable 3 (ULJM05800)\n- Nouveaux correctifs de déverrouillage de copie pour PSP : InviZimals : Shadow Zone (UCES01411, UCES01581, UCUS98760), InviZimals : The Lost Tribes (UCES01525), SOCOM : Fire Team Bravo 2 (UCUS98645)\n- Prise en charge des checksum personnalisées : InviZimals : Shadow Zone (UCES01411, UCES01581, UCUS98760) , InviZimals : Les Tribus Perdues (UCES01525), Monster Hunter Freedom Unite (ULES01213, ULUS10391), Monster Hunter Portable 2nd G (ULJM05500), Monster Hunter Portable 3 (ULJM05800)\n \nCorrections : \n- Correction de l'installation du plugin Key dumper pour les sauvegardes PSP\n \nDivers :\n- Prise en charge des paramètres de proxy HTTP réseau\n- Mise à jour du moteur de patch apollo-lib en v0.6.0\n- Ajout de rappels d'hôtes (nom d'utilisateur, mac wlan, psid, id de compte)\n- Ajout des fonctions de hash murmu3_32 et jhash\n- Ajout du décryptage de Patapon 3 PSP\n- Ajout du décryptage de MGS5 (PS3/PS4)\n- Ajout du décryptage de Monster Hunter 2G/3rd PSP\n- Ajout de la checksum de Castlevania:LoS\n- Ajout de la checksum de Rockstar\n- Correction de SaveWizard Code Type C\n- Correction de right() sur les plateformes little-endian\n \n \nTéléchargement : Apollo Save Tool v1.2.8 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182472/in-vita-apollo-save-tool-v128-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[PS5] Un pilote PSVR2 nommé iVRy bientôt disponible pour PC et Steam VR",
        "content": "Comme vous le savez, le casque PlayStation VR 2 n'est officiellement compatible qu'avec la PlayStation 5, et il semble même plus fermé que la première version car il semble entièrement lié à un format prioritaire et au format USB Type-C, ce qui fait qu'il attire forcément les développeurs qui souhaitent élargir sa compatibilité avec d'autres périphériques. \n \nUn prix accessible par rapport aux autres casques sur le marché, avec des spécifications techniques intéressantes pour cette gamme, et nous comprenons aisément que certains ont travaillé le sujet comme cela avait été le cas sur la première génération.\n \n \n\n \n \nL'équipe iVRy, déjà à l'origine d'un pilote pour le PSVR1, vient de mettre en ligne une solution de replis pour le PSVR2, entendez par là qu'elle propose un pilote permettant aux utilisateurs d'utiliser un iphone, un périphérique Android, GearVR, Oculus Mobile ou encore le casque PSVR 2 à la fois sur PC et sur SteamVR. \n \n \n\n \n \n \nIl y a tout de même quelques limites, à savoir que la solution n'est compatible qu'avec un GPU AMD RDNA2+, et qu'elle nécessite un dongle et même un port VirtualLink via un adaptateur BizLink, cela commence à faire beaucoup mais il n'est pas perdu d'étendre la compatibilité avec les GPU nVidia d'ici quelques mois, l'équipe parle de jusqu'à 6 mois de développement nécessaire. \n \nConcernant les limites, le PSVR2 ne fournit que des informations nécessaires au mode cinéma, et il s'appuie sur la PS5 pour ses caractéristiques d'affichage, lorsque la PS5 n'est plus présente il faut venir élargir la communication avec un périphérique intermédiaire qui va faire le relai. Des limites spécifiques au PSVR2 qui bloque la proposition de la Team iVRy, et la rend forcément peu accessible. \n \n \nTout est là prochainement : iVRy_Driver_for_SteamVR_PSVR2_Premium_Edition\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182470/in-ps5-un-pilote-psvr2-nomme-ivry-bientot-disponible-pour-pc-et-steam-vr-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] PS5 Backup Payload disponible",
        "content": "Le développeur Jeroendev-one propose un nouveau payload qui se nomme PS5 Backup Payload. \n \nUtilisez ce payload pour sauvegarder les fichiers app.db et appinfo.db, si vos jeux externes ont disparu, vous pouvez les restaurer via FTP pour les remettre sur votre écran d'accueil.\n \n \n \n \n\n \n \n \n \nEn fait le payload permet de sauvegarder les données du répertoire /system_data/priv/mms sur la clé USB, et ainsi de restaurer certains fPKG qui seraient toujours présent sur un disque dur externe, mais non visibles à l'écran après une reconstruction forcée de base de données. A noter d'ailleurs que les jeux installés en interne seront perdus lors d'une reconstruction.\n \n \nTéléchargement : ps5-db-backup\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182466/in-ps5-ps5-backup-payload-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] PS4 Kernel BTTF v1.00 disponible",
        "content": "Le développeur Lapy vient de dévoiler au téléchargement un nouvel utilitaire nommé PS4 Kernel BTTF qui permet de régler la date et l'heure de l'horloge interne de la PS4. Comme vous pouvez le voir, le thème a été largement inspiré de Retour vers le futur, et du tableu de bord de la DeLorean de Marty McFly.\n \nPour le moment, il faudra disposer d'un firmware inférieur à la 9.00, son mode de fonctionnement est similaire à celui du payload ReactPSPlus, renommé Kernel Clock est qui permet de réinitialiser l'horloge interne de la PS4 à 2013.\n \n \n\n \n \nA quoi cela sert ? Cela pourrait être efficace dans le cadre du C-BOMB, qui pourrait rendre inutilisable votre console si sa batterie tombe en panne et que vous ne parvenez plus à vous connecter au PSN.\n \n \nTéléchargement : PS4 Kernel BTTF v1.00\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182440/in-ps4-ps4-kernel-bttf-v100-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[Switch] Haku33 et SaltyNX se mettent à jour",
        "content": "Les développeurs de Haku33 et SaltyNX ont mis à jour leur proposition, le premier a été corrigé pour fonctionner parfaitement avec le firmware 17.0.0, tandis que le second a été corrigé pour éviter d'importantes corruptions. \n \nRappelons que Haku33 est une application homebrew livrée sous format NRO qui va vous permettre de nettoyer votre NAND sous Nintendo Switch. Ecrit en C++, ce programme open source a pour fonction d'éliminer les fichiers critiques de la console pour effectuer une réinitialisation matérielle de la console, ne laissant que l'essentiel pour démarrer. L'utilisation de cet outil n'est pas sans risque, il est donc fortement conseillé de sauvegarder sa nand avant son utilisation.\n \n \n\n \n \nLe plugin SaltyNX quand à lui facilite la gestion du processus qui nous permet d'envoyer des commandes en arrière-plan pour éditer des fichiers et du code sous Nintendo Switch.  \n \n \nHaku33 : \n \n-  Correctif pour le firmware 17.0.0\n \n \nSaltyNX 0.7.1 :\n \n- Appliquer une solution de hack pour les importations qui ne fonctionnent pas dans les jeux commerciaux en utilisant RELR.\n- Réduire la taille du core de moitié\n \n \n \nTéléchargement : SaltyNX / Haku33\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182437/in-switch-haku33-et-saltynx-se-mettent-a-jour-1.jpg"
        }
    }
}