{
    "news_1": {
        "title": "[PS5] Un premier jeu en 60 FPS non officiel sur PS5 via un patch illusion",
        "content": "Le développeur illusion vient de commencer à travailler sur la PS5, du moins il montre une vidéo de Gravityrush 2 tournant non officiellement à 60 FPS sur la PlayStation 5. \n \nLe développeur illusion est très connu de la scène PlayStation 4 pour ses patchs permettant de faire tourner la plupart des gros titres AAA à 60 FPS là où les studios de développement ont été trop frileux pour le proposer. \n \n \n\n \n \n \nBien entendu tout ceci n'a rien d'officiel et pour le moment aucun fichier n'est proposé au téléchargement. \n \nEn plus de cette vidéo informative, le développeur illusion nous informe qu'il est désormais possible d'éditer la mémoire, d'exécuter des payloads en externes sans passer par l'exploit webkit/bdjb. \n \nCela signifie donc une énorme avancée, qu'il est donc maintenant possible de modifier les jeux et leur fonctionnement sans point d'entrée au hack. \n \nPour le moment, cela n'est possible que sur un firmware 4.xx, et notez que les fonctionnalités PSN dans l'activation de compte hors ligne ne fonctionnent pas encore, les mots les plus importants étant pas encore. \n \nLe développeur illusion renvoi vers la bibliothèque libhijacker de Astrelsky, un autre développeur qui était à l'origine d'un PoC de fonctionnement des homebrews un peu passé inaperçu sur PS5 en Juin 2023. \n \nA noter que pour confirmer cela le développeur illusion enfonce encore le clou en proposant des images de Uncharted 4 sur PS5 tournant à 60 FPS, la preuve que d'autres titres supportent ses patchs.\n \nPour conclure, il dit que cela peut marcher sur n'importe quel jeu, il suffit juste qu'il dispose du jeu dans sa version disque. \n \n \n\n \n\n \n\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176564/in-ps5-un-premier-jeu-en-60-fps-non-officiel-sur-ps5-via-un-patch-illusion-sans-kexploit-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176564/in-ps5-un-premier-jeu-en-60-fps-non-officiel-sur-ps5-via-un-patch-illusion-sans-kexploit-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1176564/in-ps5-un-premier-jeu-en-60-fps-non-officiel-sur-ps5-via-un-patch-illusion-sans-kexploit-3.jpg"
        }
    },
    "news_2": {
        "title": "[Vita] Le bootrom de la PlayStation Vita a été dumpé",
        "content": "Le développeur Jose Coixao, Zecoxao, nous informe que les développeurs Skgleba et Mathieulh ont réussi à dumper le bootrom de la PlayStation Vita. Cela signifie qu'une copie du firmware de démarrage sécurisé de la console portable a été extraite et décryptée par ces chercheurs spécialisés dans le hacking matériel. Le dump du bootrom est une étape majeure dans le domaine du jailbreaking et du hacking des consoles, car il permet aux développeurs et aux hackers d'accéder au système de la PlayStation Vita de manière beaucoup plus profonde. Avec cette nouvelle avancée, les possibilités pour les joueurs et les développeurs s'ouvrent sur de multiples facettes.\n \nPour les joueurs, cela pourrait signifier la possibilité d'exécuter des homebrews, des émulateurs, et même des jeux non officiels sur leur PlayStation Vita beaucoup plus facilement, du côté des développeurs, le dump du bootrom pourrait stimuler la création de nouvelles applications et de fonctionnalités innovantes pour la PlayStation Vita. Ils pourront explorer plus en profondeur les capacités matérielles de la console, créant ainsi des projets originaux qui repoussent les limites du système.\n \nMathieulh annonce preuve à l'appui avoir réussi à dumper façon matérielle (hardware) une PlayStation Vita avec un glitch, il a réussi à obtenir les Static Keyslot 0x605, et les Perconsole Keyslots, de plus le bootrom complet du modèle commercial a été dumpé. Le tout a été placé sur le Wiki de la console. Le bootrom permet d'obtenir les emplacements de clés 0x605, 0x606 et 0x607 deviennent visibles à ce moment-là.\n \n \n\n \n \nDe son côté SKGleba a travaillé la partie software du dump, la contribution des deux développeurs va permettre probablement de faire progresser encore une fois la scène PlayStation Vita.\n \n \n\n \n \nPour la postérité, le premier glitch PS Vita réussi lors d'une séquence SD Boot :\n \nLe dépôt du first_loader est ici : https://t.co/A4lpaWt8Y3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176514/in-vita-le-bootrom-de-la-playstation-vita-a-ete-dumpe-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176514/in-vita-le-bootrom-de-la-playstation-vita-a-ete-dumpe-2.jpg"
        }
    },
    "news_3": {
        "title": "[XB] Microsoft bannit désormais les consoles retail exécutant des émulateurs",
        "content": "Nous apprenons que Microsoft a décidé de ne plus accepter les consoles ayant téléchargées des émulateurs sur Xbox One ou Xbox Series X ou S.\n \nDans une décision controversée, Microsoft a récemment annoncé qu'il bannit désormais toutes les consoles Xbox exécutant des émulateurs tiers. Cette mesure vise à contrôler l'utilisation non autorisée de logiciels tiers sur ses plates-formes de jeu, mais elle suscite des débats parmi les joueurs et la communauté des passionnés d'émulation. Les émulateurs sont utilisés par les joueurs nostalgiques pour rejouer à d'anciens titres qui ne sont plus disponibles sur les consoles modernes, ou pour profiter de jeux provenant d'autres plateformes. Cependant, l'utilisation d'émulateurs tiers peut également faciliter le piratage de jeux et de logiciels protégés par des droits d'auteur.\n \nFace à une augmentation préoccupante des cas de piratage et de distribution illégale de jeux sur ses consoles, Microsoft a pris la décision radicale d'interdire tous les émulateurs tiers. La société considère que cette mesure est nécessaire pour protéger les intérêts de ses partenaires développeurs et éditeurs de jeux, ainsi que pour maintenir un environnement de jeu équitable et sécurisé pour l'ensemble de sa communauté de joueurs.\n \n \n\n \n \nLa réaction des joueurs et des fans d'émulation est d'exprimer leur mécontentement en soulignant que l'utilisation d'émulateurs peut également servir à des fins légitimes, comme la préservation du patrimoine vidéoludique ou la personnalisation des expériences de jeu. Il convient de noter que Microsoft n'est pas la première entreprise à prendre une telle mesure. D'autres fabricants de consoles de jeu ont également restreint l'utilisation d'émulateurs tiers sur leurs plates-formes pour des raisons similaires.\n \n \n\n \n \n \nMalgré la controverse, Microsoft reste ferme dans sa décision, la firme UWeaPons s'est retrouvée avec une interdiction permanente imposée par Microsoft sur toutes ses consoles, et le développeur gamr13 s'est exprimé à ce sujet : \n \n \nNous allons immédiatement supprimer tout ce qui est lié à notre activité sur notre Discord, et nous vous recommandons fortement de supprimer tous les émulateurs du mode Retail installés sur votre console.\n \nMicrosoft donne désormais des suspensions de 15 jours à quiconque utilise des émulateurs en mode retail.\n \nTRW et SirMangler ont également vu leur console être bannie définitivement (avec possibilité de faire appel). \n \n \n\n \n \nLa Team UWeaPons était à l'origine d'un regroupement \"Root App\" de Xenia, Dolphin et RetroArch, mais désormais la Team recommande de supprimer tout émulateur, sous peine d'être dans un premier temps banni pendant 15 jours par Microsoft ou plus longtemps si la firme l'estime nécessaire. \n \nRien n'est dit pour le mode développeur, mais rappelons que Microsoft perçoit une commission d'activation du mode développeur sur ses consoles. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176511/in-xb-microsoft-bannit-desormais-les-consoles-executant-des-emulateurs-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176511/in-xb-microsoft-bannit-desormais-les-consoles-executant-des-emulateurs-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1176511/in-xb-microsoft-bannit-desormais-les-consoles-executant-des-emulateurs-3.jpg"
        }
    },
    "news_4": {
        "title": "[PS2] La toute première version d'Apollo Save Tool pour la PS2 disponible",
        "content": "Le développeur Damian Parrino connu sous le pseudo Bucanero propose la toute première version d'Apollo Save Tool pour la PS2.\n \nRappelons pour la forme que Apollo Save Tool est une application qui vous permet de gérer les fichiers de sauvegarde de jeu sur PlayStation Vita et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur votre console. \n \nPour la PS2, cela fait un petit moment qu'il nous tease cela, mais enfin voilà la première mouture qui permet notamment d'importer des fichiers de sauvegardes PSU/PSV/MAX/CBS/XPS d'une clé USB directement sur une carte mémoire et d'exporter les sauvegardes sous PSU/PSV/CBS/ZIP.\n \n \n\n \n \nA noter que les utilisateurs de PS3 peuvent utiliser les sauvegardes PSV qui sont interchangeables : vous pouvez désormais échanger facilement des sauvegardes PS2 entre votre PS2 et votre PS3 en utilisant \".PSV\" comme format d'importation/exportation.\n \nExemple : vous pouvez exporter une sauvegarde sur PS2 au format .PSV et importer ce fichier .PSV sur une carte mémoire virtuelle à l'aide du XMB de la PS3.\n \n \nTéléchargement : Apollo Save Tool v0.6.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176496/in-ps2-la-toute-premiere-version-dapollo-save-tool-pour-la-ps2-disponible-1.jpg"
        }
    },
    "news_5": {
        "title": "[3DS] nimdsphax l'alternative à l'exploit unSAFE_MODE pour les 3DS",
        "content": "Le développeur Luigoalma a publié l'exploit nimdsphax, il s'agit d'un nouvel exploit du kernel ARM9 qui peut être considéré comme une alternative satisfaisante à unSAFE_MODE. Attention calmons tout le monde, il ne permet toujours pas d'installer boot9strap sur une Old3DS avec le firmware actuel sans matériel supplémentaire ! nimdsphax est en réalité une version modifiée de nimhax qui permet d'utiliser dsp avec un service ps:ps émulé, de configurer GPUPROT et d'exploiter le kernel.\n \nCependant tous les modèles de 3DS avec les versions de firmware comprises entre la 11.8 et la 11.17 (la dernière en date) sont pris en charge.\n \n \n\n \nSi vous pouvez démarrer dans le lanceur Homebrew, vous pouvez exécuter nimdsphax et vous épargner tout le détour de l'installation de l'emplacement Wi-Fi, comme cela serait nécessaire avec unSAFE_MODE ce qui simplifie la démarche. Sur une New3DS, cela raccourcit considérablement l'installation de boot9strap puisque seul super-skaterhax doit être exécuté. Malheureusement, il n'y a pratiquement pas de gain de temps sur l'Old3DS.\n \nIl reste à voir s'il y aura un moyen facile d'installer boot9strap sur l'Old3DS à l'avenir. Ainsi le développeur récommande sur New3DS de mettre à jour au dernier firmware (le 11.17 actuellement) puis d'installer super-skaterhax avec nimdsphax.\n \n \n \n\n \n \n \n \nPour l'installation : \n \n- Il suffit de placer le dossier nimdsphax dans /3ds/ sur la carte SD, et non son contenu individuel.\n- L'exploit tente de s'exécuter immédiatement après avoir été lancé.\n- Lors de l'exécution de *hax xml takeover, il est possible qu'il ne s'exécute pas sur un écran rouge, il s'agit d'un problème de xml takeover.\n- Malgré l'utilisation de nim:s, une connexion en ligne n'est pas nécessaire.\n \n \nTout est là : nimdsphax\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176475/in-3ds-nimdsphax-laternative-a-lexploit-unsafe-mode-pour-les-3ds-1.jpg"
        }
    },
    "news_6": {
        "title": "[Vita/PSTV] Vita3K Android Release 7 disponible",
        "content": "Vita3K est de retour, comme vous le savez il s'agit du tout premier émulateur open-source pour la PlayStation Vita compatible avec Windows, Linux, macOS et Android. Cet émulateur n'a pas pour but de permettre l'activité illégale mais de restituer au mieux la PlayStation Vita sur PC. \n \nLes versions PC Windows, Linux, macOS et Android, et là nous allons focuser sur la version Android. A noter que les versions PC, Linux et macOS sont générées automatiquement et qu'il est possible de les retrouver ici.\n \n \n\n \n \nCette mise à jour améliore de manière significative le backend audio SDL et contient également de nombreuses autres corrections audio. Si vous mettez à jour depuis une version précédente, le passage à SDL pour l'audio peut résoudre quelques petits problèmes audio restants.\n \n \n\n \n \nChangelog version 7 Android :\n \n- Correction de l'implémentation audio SDL et retour à la valeur par défaut\n- Correction de quelques bugs avec l'implémentation du Double Buffer (j'aime la mémoire non-cohérente)\n- Implémentation de la synchronisation de surface et des requêtes d'occlusion en utilisant le double tampon\n- Désactiver la mise en pause du jeu car elle provoque des blocages de périphériques et des plantages\n- Amélioration de la détection du pilote Turnip, nécessaire pour une solution de contournement du bug du pilote\n- Ajout d'une solution de contournement pour les pilotes Adreno récents (non Turnip)\n- Correction de la version androïde de ffmpeg (des optimisations d'assemblage manquaient)\n- Amélioration des performances de l'upload de textures YUV\n- Marquer Vita3K comme un jeu, ce qui peut aider à certaines optimisations du système d'exploitation\n- Rebase PC (liste non exhaustive) :\n- Macdu : Emule la synchronisation des tuiles des macroblocs, corrige le problème du bloom dans de nombreux jeux (Project Diva, Uncharted, Gravity Rush...)\n- Zangetsu : Permet de naviguer dans l'interface graphique à l'aide d'un contrôleur (fonctionne aussi avec le contrôleur d'incrustation)\n- Zangetsu : Implémenter la texture u3u2u2u8\n- Macdu : Réécriture majeure de NGS (bibliothèque audio PS vita), stub de tous les modules manquants\n- Macdu : NGS decoder fixes, fix audio noise in most games that had this issue\n- bookmist : Implémentation des fonctions kernel manquantes\n- Macdu : Amélioration du support de l'attachement de stencil sans profondeur, correction de l'effet DOF dans Persona 4 Dancing\n- Zangetsu : Correction d'un bug avec le trophée de platine\n- Saturnsky : Nombreuses améliorations avec l'encodeur et le décodeur Jpeg, corrections de nombreux romans visuels\n- Macdu : Corrections multiples des shaders, permet à World of Final Fantasy d'aller dans le jeu\n- slipcounter : Correction de bugs avec la fonction guest printf et la vérification des ngs, correction de crashs dans certains jeux spécifiques\n- Zangetsu : Ajout d'une option pour désactiver la notification des shaders compilés\n- Macdu : Implémentation du verrouillage des shaders (ne concerne que l'utilisation d'un GPU de bureau)\n- Macdu : Implémenter des événements de type timer, permettre à Zanki zero d'aller dans le jeu\n- Zangetsu : Réécrire le gui du dialogue de sauvegarde\n- ExtremeExploit : Corrections multiples\n- Zangetsu : Implémentation d'un gestionnaire de registre\n \n \n \nTéléchargement : Vita3K Android Release 7 / site officiel\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176474/in-vitapstv-vita3k-android-release-7-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176474/in-vitapstv-vita3k-android-release-7-disponible-2.jpg"
        }
    },
    "news_7": {
        "title": "[Switch] TegraExplorer v4.1.0-b1 disponible",
        "content": "Le développeur suchmememanyskill vient de mettre en ligne en cette fin du mois de Juillet 2023 une version correctrice de son superbe outil TegraExplorer comme vous le savez il s'agit d'un programme qui est un gestionnaire de fichiers qui vous permet de naviguer dans la partition système sysnand / sysmmc, de copier, de supprimer ou de créer des fichiers ou des dossiers, et de télécharger le firmware actuel sur la SD. \n \nL'outil n'avait pas été mis à jour depuis Février 2023, cette version apporte le support de la version OLED.\n \n \n\n \n \nChangelog : \n \n- Prise en charge de l'OLED Préversion\n- Cette version ajoute le support de la Switch OLED. Il s'agit d'une version très expérimentale, n'hésitez pas à signaler un problème via l'onglet problèmes ou via Discord. Si possible, utilisez la dernière version stable (v4.0.1).\n- Mise à jour du BDK vers Lockpick-RCM 1.19.10\n- Nouvelle stratégie de keydump, avec l'espoir d'atténuer les hotfixes du pkg1\n- Merci beaucoup à @JeffVi pour m'avoir aidé à porter le BDK Lockpick_RCM sur TegraExplorer !\n \n \n \n\n \n \n \nTéléchargement : TegraExplorer v4.1.0-b1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176473/in-switch-tegraexplorer-v410-b1-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176473/in-switch-tegraexplorer-v410-b1-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[PS5] Interview de Flat_z suite au dump du PS5 bootrom PSP (Platform Security Processor)",
        "content": "Le développeur Flat_z hier a répondu à de nombreuses questions sur le discord PS5 sur l'image qu'il a proposé sur Twitter, faisons le tour de ce qu'il a découvert.\n \nNous vous proposons l'interview croisée, un résumé de questions réponses que Flat_Z a tenu sur le discord PS5. \n \n \n\n \n \n \n \nInterview croisée :\n \n \n\n \n \nQ : Cette image \" ROM : FFF0000 \" c'est ce que l'on pense, le dump du PSP (Platform Security Processor) ? \nR (Flat_z) : oui, c'est un dump du Platform Security Processor de la PS5.\n \nQ : Il y a beaucoup de clés importantes, il y a d'autres clés mineures dans le système\nR : Je ne publierai jamais d'informations confidentielles mais je veux essayer de l'implémenter (et divulguer si ça marche) des méthodes ou des trucs comme les fpkgs, comme je l'ai déjà fait pour la PS4.\n \nQ : Il y a des clés seeds dedans ? \nR : Je n'ai aucune idée, je viens de recevoir le dump il y a quelques minutes, mais ce que je sais c'est que le psp est la racine de la confiance, il contient le code du boot system, les key seeds, etc.\n \nQ : Obtenu à partir d'un logiciel comme fail0verflow ?\nR: Oui, c'est vrai\n \nQ : Vous en avez parlé à fail0verflow ?\nR : Oui, nous avons comparé nos dumps aujourd'hui\n \nQ : Le partagerez-vous avec d'autres personnes pour qu'elles puissent également travailler dessus ? Je suppose que non.\nR : L'idée est d'obtenir des clés pour l'IPL, puis des clés pour le SSD, de sorte que je puisse décrypter mon IPL à partir du dump du SSD et faire de la rétro-ingénierie dessus afin d'obtenir des clés, etc.\n \nQ : A quel firmware cela serait-il lié, ou parce que c'est une puce, c'est pertinent pour n'importe quel firmware qui a déjà un accès au kernel ? Ou bien vous concentrez-vous sur les versions 2.30-2.50 ?\nR : il s'agit plus de la révision du matériel que de la version du logiciel. Je ne sais pas si ou quand ils ont corrigé ce problème, mais d'habitude ils changent les clés entre les révisions de matériel, donc je suppose que les dumps de bootrom des révisions plus récentes ont d'autres clés.\n \nLe bug utilisé est d'ordre logiciel, aucun matériel hardware n'a été utilisé, je suis sur que cela fonctionne sur les firmware 2.xx, je suis actuellement sur firmware 2.50. Il dit qu'il a acheté sa PS5 en 2021, certainement un modèle de référence 1015 mais cela n'a que peu d'importance finalement. \n \nQ : C'est ce que j'essaie de comprendre. Il n'y a pas d'autre solution que de faire appel à l'ATM, car il s'agit d'une ATM spécifique au matériel (très probablement).\nR : Le but de cela est d'avoir des clés pour tous les firmwares (clés de tout sauf de l'IPL), l'objectif est aussi de fournir le même niveau de possibilité pour les fpkg. \n \nQ : Si cela est rendu public, cela pourrait-il signifier l'arrivée d'un CFW (custom firmware) ? Ou parce que Sony semble avoir tellement de puces qui ont besoin de se serrer la main, non ? \nR : Je sais pas si l'accès au bootrom pour certains appareils peut nécessairement signifier CFW ,et je ne sais pas si c'est le cas pour le ps5.\nLe problème, c'est qu'il n'y a pas d'autre solution que d'inverser le processus, il faudrait que d'autres vulnérabilités soient trouvées pour exploiter le bootrom. \n \nQ : Tous les bugs sont répertoriés sous https://www.psdevwiki.com/ps5/Bugs_%26_Vulnerabilities il vient de là ? \nR : Aucun de cette liste\n \nQ : Le ou les bugs seront un jour dévoilé(s) ? \nR : Bon, fail0verflow a été le premier à le faire, c'est donc à cette Team de décider de le publier ou non. Je pense que j'ai juste trouvé leur méthode. \n \nQ : Quels modèles sont affectés, il faudra du matériel ?\nR : J'ai un teskit et une PS5 Retail sous le dernier firmware également, cependant pour le dump, je reste sur le fimware 2.50 car j'ai tout implémenté pour elle, mais peut-être que je commencerai à travailler sur des firmwares plus récents à l'avenir, et j'ai aussi des trucs pour les 1.xx\n \nQ : Cela peut être porté sur des firmwares plus récents ? \nR : Qui peut le savoir. nous ne savons pas s'ils ont corrigé les bugs, ou quand ils l'ont fait. Mais avec les firmwares ou les révisions plus récentes ils ont probablement fait quelque chose.\n \nQ : Un CFW (Custom Firmware) ? \nR : Afin de permetre l'exécution de code, la ps4 n'a pas de firmware personnalisé, c'est juste des mods en temps réel, c'est la même chose ici.\n \nQ : Des plans pour SAMU (sur PS4), et donc un CFW sur PS4 ?\nR : Non, j'ai arrêté de travailler sur la ps4 il y a longtemps, j'ai tout ce qu'il y a dessus.\n \nJe suppose que les fpkgs peuvent être mis en oeuvre sur PS5 sans Hyperviseur, mais je n'en suis pas sûr, on ne peut pas savoir tant qu'on n'a pas essayé de l'implémenter.\n \nQ : On parle d'une solution un peu comme Okage ? \nR : Non, mais j'ai utilisé sur PS5 un jeu PS4, tout simplement parce que la ps4 est meilleure parce qu'il n'y a pas de xom userland. \nLe système fonctionne aussi sur la ps4, il est donc facile à déboguer. Je charge une sauvegarde corrompue qui exploite le jeu.\n \nSpecter rajoute à ce sujet : Le cryptage des sauvegardes et l'encrytage et signature sont en partie nécessaires, de même que le fait qu'il faille un très bon bug, car les bugs de type analyseur sont difficiles à exploiter dans les environnements ASLR.\n \nFlatz quand à lui rajoute que l'exploitation de l'hyperviseur peut se faire directement à partir de la sauvegarde, mais de rajouter qu'il s'agit d'un jeu original sur disque PS4. \n \nQ : Un jeu PSN ça marcherait ?\nR : Je ne veux pas utiliser les jeux PSN car ils nécessitent des act.dat ... (entendez par là des licences d'activation), de plus un jeu sur disque pourrait éventuellement marcher sur tous les firmwares si les offsets sont adaptés.\n \nQ : Il y a aussi un point d'entrée pour l'emu de la ps4. Nous ne sommes pas encore sûrs d'avoir besoin d'un exploit kernel pour ça, mais si Flatz n'en a pas besoin pour leur hack PSP, ça devrait être bon.\nR : Vous pouvez utiliser tout le reste, je suppose, Sony peut juste corriger les bugs importants comme dans le kernel/ Hyperviseur, les exploits dans les jeux sont hors de portée, et ceux dans les webkits. \n \n \n \nVoilà c'est tout pour le moment, en espérant que cette interview croisée vous a plu, et que nous en sachions davantage d'ici quelques jours ou semaines. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176427/in-ps5-interview-de-flat-z-suite-au-dump-du-ps5-bootrom-psp-platform-security-processor-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176427/in-ps5-interview-de-flat-z-suite-au-dump-du-ps5-bootrom-psp-platform-security-processor-2.jpg"
        }
    },
    "news_9": {
        "title": "[PS5] Flat_z dumpe le SP de la PS5",
        "content": "Le développeur Flat_z vient d'annoncer avoir réussi à dumper le Secure Processor (SP) de la PS5, ce qui confirme tout simplement qu'il dispose d'un exploit Hyperviseur.\n \n \n\n \n \n \nExplications ! \n \nFlat_z affirme avoir eu accès au processeur sécurisé de la plate-forme (PSP) de la PS5, cela signifie qu'il a accès à la plupart des clés de décryptage sur la console. Le pirate a également confirmé qu'il avait un exploit Hypervisor et a ajouté que toute la chaîne avait été déclenchée via un logiciel (pas de piratage matériel) via un jeu PS4 basé sur disque, cela confirme une nouvelle fois que pour hacker les consoles, il faut éviter les modèles digitaux sans lecteur.\n \nPar contre, et afin de se protéger de Sony, aucun détail n'a été donné que ce soit sur le firmware, et il n'a pour le moment pas l'intention de diffuser quoique ce soit. \nFlat_z revendique le piratage de l'hyperviseur PS5 par des moyens logiciels, et quand on connait sa renommée, nous ne pouvons que le croire, il dit simplement avoir réussi avec une toolchain déclenchée via un exploit sur un jeu PS4 sur disque. \n \n \n\n \n \nIl a dévoilé une capture confirmant qu'il a obtenir les accès ROM, et qu'il peut dumper les clés, clairement Flat_z a désormais accès à toutes les clés de décryptage PS5. Il a donc théoriquement l'accès au décryptage des fichier intégrés dans les firmwares, et des fichiers de jeu.\n \n \nLa suite ? \n \nRien n'est sûr, Flat_z si ça se trouve ne publiera jamais rien, on le connait sur PS4 il avait attendu des années avant de proposer certains de ses outils. Nous pouvons penser qu'il a trouvé un exploit similaire à celui de Fail0verflow mais l'arrivée d'un hack probable pourrait venir d'ailleurs, nombreux sont ceux à penser que la possibilité de lancer des fpkg pourrait venir d'autres possibilités que de devoir passer par un exploit hyperviseur. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176387/in-ps5-flat-z-dumpe-le-sp-de-la-ps5-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176387/in-ps5-flat-z-dumpe-le-sp-de-la-ps5-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1176387/in-ps5-flat-z-dumpe-le-sp-de-la-ps5-3.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] Une nouvelle PS5 CFI-1300 va bientôt arriver",
        "content": "Il semble que Sony ait décidé de faire une nouvelle fois évoluer sa PS5, le modèle CFI-1300 vient d'être dévoilé dans les référencements. La CFI-1300, qui promet d'établir une nouvelle référence pour la PlayStation 5 disposerait d'un APU gravé chez TSMC en 5 nm, les précédents modèles CFI-1000 et CFI-1100 étaient gravés en 7 nm, tandis que le CFI-1200 disposait d'un APU gravé en 6 nm, ainsi avec cet AMR Ryzen amélioré et plus fin, moins de chaleur, donc la console n'aurait plus besoin de métal liquide. \n \nIl faut dire que le modèle de base consomme presque 200 watts, là où ce nouveau modèle CFI-1300 de PS5 lui ne consommerait que 120 à 140 watts. \n \nBien entendu les rumeurs vont bon train, et certains annoncent déjà qu'il s'agit du modèle Slim de la console, mais pour le moment rien n'est encore confirmé de ce côté là, mais s'agissant de la quatrième révision, si Sony fait comme pour la PS4, ce serait la SLIM.\n \n \n \n\n \n \n \nLe doute subsiste dans le fait que le modèle SLIM porte toujours la référence de série 2xxx, ce serait là aussi une première, qu'une série 1x00 soit une SLIM.\n \nLes remises commerciales récentes de toute façon laisse penser que Sony souhaite laisser le temps aux revendeurs d'écouler leur stock qu'ils avaient enfin commencer à constituer après 3 années chaotiques. De plus, il se pourrait aussi que ce modèle fasse l'impasse sur le lecteur optique, ce qui clairement serait une catastrophe, mais cela permettrait à Sony d'alléger le poids de la console, la consommation et les frais d'expédition, une bonne nouvelle quand on sait que la console vient de passer la barre des 40 millions d'unités vendues. \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176379/in-ps5-une-nouvelle-ps5-cfi-1300-va-bientot-arriver-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176379/in-ps5-une-nouvelle-ps5-cfi-1300-va-bientot-arriver-2.jpg"
        }
    },
    "news_11": {
        "title": "[Series X/S et XO] La toute nouvelle interface Xbox est disponible",
        "content": "Cher sunriseur, cher sunriseuse, aujourd'hui, les joueurs du monde entier peuvent enfin découvrir la nouvelle interface de la Xbox, offrant une expérience de jeu plus fluide et conviviale que jamais auparavant. Microsoft a déployé la mise à jour tant attendue, apportant une pléthore de fonctionnalités passionnantes pour les propriétaires de la console.\n \n \n \n\n \n \n \n \nVoici les principales caractéristiques de la toute nouvelle interface Xbox :\n \nFacilité d'accès à la bibliothèque, au MS Store, au Game Pass et aux Paramètres\n \nLa refonte de l'interface met l'accent sur la simplicité et la convivialité. Les joueurs peuvent désormais accéder facilement à leur bibliothèque de jeux, au Microsoft Store, au Game Pass et aux paramètres de leur console. Tout est pensé pour être intuitif et rapide, permettant aux utilisateurs de se plonger instantanément dans l'action sans tracas.\n \n \n\n \n \nNouvelle disposition des jeux et des éléments\n \nLa mise à jour apporte également une nouvelle disposition des jeux et des éléments sur l'écran d'accueil. Les icônes sont plus grandes et plus nettes, offrant une expérience visuelle améliorée. Les joueurs peuvent personnaliser leur disposition préférée pour un accès rapide à leurs titres et fonctionnalités les plus utilisés.\n \n \n\n \n \nFond d'écran mis en valeur\n \nL'esthétique est également au rendez-vous avec la nouvelle interface Xbox. Les fonds d'écran sont mis en valeur pour donner à l'écran d'accueil une ambiance unique et personnalisable. Les joueurs peuvent choisir parmi une variété de thèmes dynamiques, offrant ainsi une immersion totale dans leur univers de jeu préféré.\n \nCette mise à jour marque un tournant majeur pour la console Xbox, offrant aux joueurs une expérience améliorée, tant sur le plan de la fonctionnalité que de la présentation visuelle. \n \nBien entendu cela ne change rien au hack, les consoles Xbox semblent verrouillées et ce n'est pas la disponibilité de mise à jour qui va changer quelque chose. \n \n \nTout est là : news.xbox.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-131082183.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-881415111.jpg"
        }
    },
    "news_12": {
        "title": "[PS4] PS4Dumper 1.0 disponible",
        "content": "Le développeur codemasterv partage une nouvelle application pour faciliter le dump de contenu d'une PS4 vers un PC Windows. \n \nAinsi avec PS4Dumper vous allez pouvoir facilement dumper un jeu, mais il est également possible d'injecter différents payloads, y compris le payload GoldHEN.\n \n \n\n \n \nIl y a pas moins de 23 payloads intégrés dans le répertoire Bins, qui peuvent donc être mis à jour très facilement, en l'écrasant tout simplement. \n \n \n \n\n \n \nProcédure : \n \n- Téléchargez le fichier Release.zip\n- Décompressez le sur votre PC\n- Démarrez GoldenHEN et le serveur FTP sur votre ps4 \n- Démarrez votre jeu \n- Entrez vos informations IP et de port que votre PS4 \n- Cliquez sur Download\n \n \nTéléchargement : PS4Dumper 1.0 / Github\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176331/in-ps4-ps4dumper-10-disponible-1.jpg"
        }
    },
    "news_13": {
        "title": "[WiiU] Tiramisu 0.1.2 et Aroma Bêta 15 disponibles",
        "content": "Il y a du mouvement pour la Nintendo Wii U puisque le développeur Maschell propose les mises à jour de Aroma et de Tiramisu. \n \nAroma, qui est l'environnement homebrew pour la Wii U, évolue une nouvelle fois avec de nouvelles options et corrections. \n \n \n\n \n \n \nChangelog : \n \n- Recompilation de tout avec les derniers wut, devkitppc, wums/wups pour améliorer la stabilité et arrêter le softlocking sur les erreurs FS\n- Mise en place d'un support pour l'appairage des contrôleurs et des GamePads dans le module Autoboot\n- Prise en charge de l'utilisation d'une Wiimote ou d'une manette Pro dans le module Autoboot (les combinaisons de boutons pour ouvrir ces menus ne fonctionnent que sur le GamePad)\n- Correction du chargement des fichiers .rpl depuis la carte SD\n- Toujours éviter la confirmation \"close app\" lors du lancement d'un homebrew\n- CURLWrapperModule utilise maintenant curl 8.0.1\n- Enregistrement de la version du module pour plus de modules à chaque démarrage de l'application.\n \nTéléchargement : Aroma Bêta 15\n \n \nDu côté de Tiramisu, qui est l'environnement qui peut être démarré avec l'EnvironmentLoader a lui aussi connu une mise à jour. Mais ici pas d\"éffusion de nouveautés car là le développeur n'a pas ajouté de nouvelles fonctionnalités. Cette version met à jour l'EnvironmentLoader et l'AutobootModule afin qu'ils utilisent la même version qu'Aroma. Il dit avoir corrigé quelques petits bugs sans préciser lesquels. \n \n \n\n \n \nTéléchargement : Tiramisu v0.1.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176265/in-wiiu-tiramisu-012-et-aroma-beta-15-disponibles-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176265/in-wiiu-tiramisu-012-et-aroma-beta-15-disponibles-2.jpg"
        }
    },
    "news_14": {
        "title": "[Vita/PSTV] FuHEN lancé, Eldritch proposé et Autoplugin mis à jour",
        "content": "L'actualité PlayStation Vita s'enchérit, et cela va perdurer dans le temps avec ce concours FuHEN qui relance la machine à homebrews sur PS Vita et PSTV pour notre plus grand plaisir. \n \n3 petites nouveautés pour la PS Vita, la première est l'ouverture officielle du concours FuHEN depuis le 22 Juillet 2023, rappelons que ce concours se tiendra jusqu'au 22 Septembre 2023, ensuite durant une semaine il y a aura des votes pour une annonce des gagnants le 29 Septembre 2023.\n \n\n \n \nCertains ne vont pas attendre, comme Rinnegatamante qui vient déjà de proposer son jeu, qui porte le titre de Eldritch. Il s'agit là d'un portage d'Eldritch pour PSVita basé sur le remaster Reanimated du jeu. Eldritch est un jeu d'action à la première personne inspiré des roguelikes, des simulations immersives et de H. P. Lovecraft.\n \n \n\n \n\n \n\n \n \nTéléchargement : Eldritch (Portage)\n \n \nAutre nouveauté, l'arrivée d'une mise à jour pour AutoPlugin II, mais ceci n'a rien à voir avec le concours FuHEN. Le logiciel AutoPlugin a été l'homebrew le plus téléchargés de la scène PlayStation Vita développé par theheroGAC et qui permettait d’installer facilement des plugins. L'équipe Onelua a ensuite repris le flambeau dans cette version II qui ajoute encore des caractéristiques plus complètes.\n \n \n\n \n \nCette version apporte la correction d'une erreur lors de l'installation du plugin Quicklauncher.\n \n \nTéléchargement : AutoPlugin2 2.07\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176249/in-vitapstv-fuhen-lance-eldritch-propose-et-autoplugin-mis-a-jour-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176249/in-vitapstv-fuhen-lance-eldritch-propose-et-autoplugin-mis-a-jour-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1176249/in-vitapstv-fuhen-lance-eldritch-propose-et-autoplugin-mis-a-jour-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1176249/in-vitapstv-fuhen-lance-eldritch-propose-et-autoplugin-mis-a-jour-3.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1176249/in-vitapstv-fuhen-lance-eldritch-propose-et-autoplugin-mis-a-jour-2.jpg"
        }
    },
    "news_15": {
        "title": "[PS3] Aldo Vargas (Aldostools) met à jour webMAN MOD 1.47.45",
        "content": "Vous êtes encore nombreux à disposer d'une PS3, il faut dire que la console propose de bons jeux dont certains n'ont pas pris une ride, le développeur Aldo Vargas nous a informé dans la nuit qu'il a mis à jour il y a 2 jours le célèbre plugin webMAN MOD dans sa version 1.47.45 dans l'objectif de corriger quelques bugs. \n \nwebMAN est un plugin développé par Deank qui permet de lancer des backups de jeux PS3, PS2, PS1, PSP ainsi que des Blu-ray ou des DVD, stocké sur disque dur (y compris en NTFS) ou sur le réseau local, au format JB ou ISO. M@tsumot0 et Aldostools ont proposé une version MOD de webMan, apportant notamment le support de 21 langages utilisant des fichiers externes, un installer/updater pour CFW Cobra et NonCobra, le spoof IDPS/PSID, la désactivation des syscalls du cfw, et de nombreuses autres évolutions qui se sont succédées.\n \n \n \n\n \n \nSans aller jusqu'à proposer une nouvelle numérotation, il a remis à jour la version 1.47.45 afin de corriger une régression qui faisait crasher la PS3 si vous utilisiez le combo SELECT + L1 our SELECT + R1 pour monter les jeux dernièrement joués.\n \nLe développeur conseille par ailleurs d'utiliser l'outil de mise à jour intégré (le online updater) afin de profiter des dernières corrections. \n \n \n\n \n \nTéléchargement : webMAN_MOD_1.47.45_Installer.pkg (13.3 MB)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176247/in-ps3-aldo-vargas-aldostools-met-a-jour-webman-mod-14745-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1176247/in-ps3-aldo-vargas-aldostools-met-a-jour-webman-mod-14745-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS4/PS5] BwE PS4 NOR Validator &#38; Syscon, Nor Tool et PS4 Wee Tools",
        "content": "En ce beau lundi nous vous proposons au menu les mises à jour de PS4 NOR Validator & Syscon Patcher, de PS5 NOR Tool et de PS4 Wee Tools, au boulot ! \n \nHier en fin de journée, le développeur BwE a annoncé qu'il avait mis à jour quelques un de ces outils, le premier est PS4 NOR Validator & Syscon Patcher qui est désormais proposé en version 2.3.3 car le logiciel a bénéficié d'une mise à jour du correctif Syscon, d'une mise à jour de la détection Southbridge (type de puce), il a aussi réorganisé le menu, et apporté d'autres modifications mineures.\n \n \n\n \n \nTéléchargement : ps4-nor-validator 2.3.3\n \n \n \nNous en profitons pour vous informer qu'il propose un guide qu'il met à jour régulièrement :  sce_syscon.html\n \nIl a mis à jour également PS5 NOR Tool en version 1.1.1, cette version vient apporter quelques corrections à des bugs selon lui. \n \n\n \n \nTéléchargement : BwE_PS5_NOR_Tool\n \n \nEnfin dernière nouveauté du lundi matin, l'arrivée de la version 0.8 de PS4 Wee Tools, avec comme d'habitude un énorme lot de nouveautés et de corrections.\n \n \n\n \n \n\n \n \nv0.8 (le fichier exe est également disponible)\n- Reconstruction du SNVS (Syscon)\n- Le correctif manuel de Syscon permet d'enlever un bloc entier.\n- Conseils pour le patching syscon\n- Patch syscon supplémentaire (bloqué sur la mise à jour du FW)\n- Améliorations de la classe NVStorage\n \nTéléchargement : ps4-wee-tools 0.8\n \n \nUne bonne journée, où que vous soyez. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176246/in-ps4ps5-bwe-ps4-nor-validator-syscon-nor-tool-et-ps4-wee-tools-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176246/in-ps4ps5-bwe-ps4-nor-validator-syscon-nor-tool-et-ps4-wee-tools-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1176246/in-ps4ps5-bwe-ps4-nor-validator-syscon-nor-tool-et-ps4-wee-tools-2.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1176246/in-ps4ps5-bwe-ps4-nor-validator-syscon-nor-tool-et-ps4-wee-tools-3.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] Le switch entre firmware officiel et exploitable est une réalité",
        "content": "Avec toutes les possibilités de downgrade possibles, nous en avons quasiment oublié l'essentiel et le meilleur à savoir profiter du dernier firmware officiel et donc d'internet, mais aussi d'un firmware exploitable permettant de lancer tous les backups. \n \nEt bien Modded Warfare s'est posé la bonne question, pourquoi ne pas tenter de créer une console disposant des deux possibilités. \n \nDans sa vidéo il montre que sa PS4 dispose du dernier firmware 10.70, de l'accès internet et au PSN, et donc il bascule vers le firmware 9.00.\n \n \n \n\n \n\n \n \n \nIl est parti de l'idée que le firmware tout comme le système d'exploitation sont stockés sur le disque dur, et bien avec un petit Teensy connecté au Syscon de la NOR, il dispose d'une PS4 réversible, bien entendu c'est complexe comme opération, cela ne prend qu'un quart d'heure pour changer de firmware, et il faut disposer deux disques durs, mais cela fonctionne. \n \n \n \n\n \n \nPetite information, il rajoute qu'il faut dessouder les fils sinon la console ne boote pas, mais il parle de l'E4 Flasher, qui pourrait intégrer cette possibilité. Il précise bien que cette console a la base était en 9.00, et qu'elle a été mise à jour en 10.70.\n \nEnsuite il montre comment il flash la Nor et le syscon, puis il démarre la console, tout cela promet un bel avenir encore pour la scène PS4. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176214/in-ps4-le-switch-entre-firmware-officiel-et-exploitable-est-une-realite-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176214/in-ps4-le-switch-entre-firmware-officiel-et-exploitable-est-une-realite-2.jpg"
        }
    },
    "news_18": {
        "title": "[PS4] USB ELF Loader, USB PS2 Game Laoder, mast1c0re PS4 pour le 10.70",
        "content": "Le développeur McCaulay propose toutes les mises à jour possibles pour son exploit mast1c0re pour la PS4, mais surtout de tous les outils qui y sont rattachés. \n \n \n\n \n \nIl vient en effet de mettre en ligne la mise à jour de l'exploit en lui même rajoutant les offsets Ghidra, mais en plus de cela il a mis à jour USB ELF Loader et USB PS2 Game Laoder qui passent tous les deux en v0.1.1. Il a mis aussi à jour les versions Network de ces propositions. \n \n \nTéléchargement : \n \nmast1c0re PS4 Firmware 10.70 support\n \nNetwork ELF Loader PS4 FW v10.70\n \nNetwork PS2 Game Loader PS4 FW v10.70\n \nUSB ELF Loader PS4 FW v10.70\n\n \nUSB PS2 Game Loader PS4 FW v10.70\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176208/in-ps4-usb-elf-loader-usb-ps2-game-laoder-mast1c0re-ps4-pour-le-1070-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] Un prototype de Projet Q de Sony en leak vidéo",
        "content": "Pour une fois qu'une vidéo semble assez légitime proposée par Zuby_Tech, il peut s'agir d'un prototype de la Sony Projet Q, vous savez l'écran disposant LCD disposant d'une manette Dual Sense sur chacun de ses côtés. \n \nMême si cela reste un peu surprenant de ne pas voir marquer quelque part Sony ou Prototype, il pourrait s'agir de pré-série de prototype, mais même dans ce cas normalement ils sont estampillés.\n \n \n \n\n \n \n \nQuoiqu'il en soit, c'est l'occasion de reparler de la \"console\" de 8 pouces, qui comme vous le savez nécessitera une PS5 puisqu'elle se destine uniquement au remote play de celle-ci.\n \n \n \n\n \n \n \n\n \nComme nous pouvons le voir sur la vidéo, on remarque le logo PlayStation, mais il est difficile pour nous de traduire les icônes. \n \n \n\n \n \nCet écran n'est plus ni moins qu'une tablette insérée dans une manette Dual Sense coupée en deux\n \n \n\n \n \n\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176185/in-ps5-un-prototype-de-projet-q-de-sony-en-leak-video-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176185/in-ps5-un-prototype-de-projet-q-de-sony-en-leak-video-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1176185/in-ps5-un-prototype-de-projet-q-de-sony-en-leak-video-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-1212505689.jpg"
        }
    },
    "news_20": {
        "title": "[Wii/WiiU] Aroma Updater, PriiLoader et Swiss à jour",
        "content": "Le développeur Maschell propose une mise à jour d'Aroma Updater, l'outil qui permet d'installer et de mettre à jour Aroma sur Nintendo Wii U.\n \nGrâce à son application, vous pourrez mettre à jour directement certains modules, ce qui rendra inutile le PC, et qui permettra de mettre à jour Bloopair, FTPiiU, ou encore SDCafiine. \n \nCette dernière version a été construire avec la dernière mouture de wut et devkitPPC permettant ainsi de profiter de la meilleure stabilité utilisateur. \n \n \n\n \n \nTéléchargement : Aroma Updater v0.2.2\n \n \nPour la WiiU et sa petite soeur la Wii, c'est PriiLoader qui a été mis à jour en v0.10.0 RC3, le programme compatible Wii, Wii U et Wii Mini. \n \nCette nouvelle version porte le nom de code \"Kappa\". \n \nNouvelles fonctionnalités :\n- Ajout de la compatibilité vWii !\n- Ajout de la possibilité de charger des disques Wii et gamecube (ceci ne tient pas compte de la région des disques, et ceci n'applique pas non plus les hacks)\n- Ajout d'un paramètre pour donner la priorité à l'accès USB par rapport à l'accès SD\n- Priiloader peut faire revivre vos plantes grâce au zombisme\n- Ajout de la prise en charge du menu système 1.0\n- Afficher Priiloader après l'installation\n- Priiloader se lancera au démarrage du Menu Système\n- Ajout de nouveaux hacks\n- Bloquer le démarrage automatique du disque\n- Supprimer Deflicker\n- Refonte de l'accès aux périphériques\n- Priiloader n'attend plus que le lecteur usb réponde lors du montage\n- Ajout d'un fichier de retour à l'installation\n \nCorrections et améliorations :\n- Correction du lancement de chaînes à partir d'une autre région (ceci ne s'applique qu'aux chaînes lancées par Priiloader)\n- Refactorisation des hacks sans région sur SM < 4.3\n- Correction des mises à jour en ligne après que mon hébergeur l'ait cassé (encore une fois)\n- Vérification correcte du drapeau d'arrêt du gamecube\n- Correction de l'effacement de la section bss avec les fichiers .elf\n- Correction d'une faute de frappe dans l'installeur\n- Correction du lancement de SM sur IOS < 28\n- Correction de la vérification de l'activité du dvd\n- Refactorisation de l'analyse meta.xml\n- Refactoriser le versioning dans priiloader\n- Mise en noir de l'écran avant le chargement du titre ou du binaire\n- Correction des hacks qui ne sont pas chargés correctement de manière aléatoire\n- Divers changements dans hacks_hash\n \nTéléchargement : priiloader 0.10.0-RC3\n \n \n \n\n \nEnfin au chapitre des petites nouveautés c'est Swiss qui lui aussi a été mis à jour. Comme vous le savez Swiss c'est le couteau suisse de la Nintendo Wii, et c'est Extrems qui a opéré de nombreux changements. \n \nChangelog : \n- Correction d'une erreur d'analyse avec D&D Apploader V2.00.\n- Vérifier l'intégrité du fichier patché que nous chargeons.\n- Correction de quelques fuites de mémoire.\n- Ajout d'un checksum pour GC Loader 2.0.1.BETA.\n- Ajout d'un support minimal pour démarrer des disques sans licence.\n- Utilisation correcte de l'en-tête BS2.\n- Ajouter les hashs des images BS2 pour une utilisation future.\n- Correction d'une fuite de mémoire dans l'interface graphique.\n- Correction de la taille de aram.bin à la taille réelle de l'ARAM.\n- Ajouter aram_internal.bin.\n- Utiliser ARQ pour lire l'ARAM.\n- Vérifier la présence d'une image BS2 connue.\n- Vérifier l'intégrité de l'exécutable du jeu avec les images NKit.\n- Amélioration de la gestion des erreurs.\n- Refonte de l'affichage du message d'erreur.\n- Permettre l'écriture dans aram.bin, aram_internal.bin et sram.bin.\n- Ajout de aram_expansion.bin\n- Corrections mineures.\n- Correction du correctif execD.img après a3b3066.\n- Inclure appl2.img, appl2D.img et exec.img.\n- Ajout des sommes de contrôle des en-têtes NKit pour distinguer les légères différences.\n- Liste complète des fichiers qui doivent être réencodés.\n- Suppression des faux positifs multi-disques.\n- Mise à jour de la base de données No-Intro.\n- Filtrer les fichiers système.\n- Mise à jour de la base de données Redump.\n- Vérification des erreurs lors de la configuration des fragments du GC Loader.\n- Augmentation de la version du firmware du GC Loader à 2.0.1.\n \n \nTéléchargement : Swiss v0.6r1515\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1482842661.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-970796421.jpg"
        }
    }
}