{
    "news_1": {
        "title": "[PS5] Lightning Mods dévoile etaHEN SDK",
        "content": " \nLe développeur LightningMods propose depuis quelques jours un tout nouveau SDK pour etaHEN, qui se nomme fort logiquement etaHEN SDK. \n \nSon Github construit des builds automatiquement, il dévoile surtout des exemples de plugins, des utilitaires daemon, des patches et les cheats du développeur Illusion, PS5Debug de Dizz, des exemples de Elfs, http2, hwinfo, klog_printf, list_files, tcp_echo_server.\n \n \n\n \n \nL'etaHEN SDK est donc une collection d'outils open source et d'échantillons pour développer pour etaHEN, à noter qu'il nécessite le PS5SDK. L'etaHEN SDK supporte la liaison dynamique avec les bibliothèques disponibles dans le dossier libs. Tout ELF ou plugin réalisé avec ce SDK est déjà jailbreaké, aucun code n'est nécessaire.\n \nL'etaHEN SDK explique la différence entre un Elf et un plugin, et le fonctionnement des plugins et des elfs, ainsi que de certaines commandes standards, et comment lire et écrire dans le kernel. \n \nTout est là : etaHEN SDK\n \n \nCela n'a rien à voir mais sachez que certains développeurs commencent à s'intéresser aussi directement à la carte PCB du lecteur bluray de la PS5. L'intérêt de ce genre de lecture ou de dump est d'analyser la carte gérant le lecteur pour en dumper le firmware, éventuellement trouver une faille ou travailler sur un jig comme cela avait été le cas sur la génération PS3 ou Xbox 360.\n \n \n \n\n \n \nIl est aussi possible d'envisager un lecteur ODE si les développeurs s'intéresse à ce genre de process, cela pourrait déboucher sur ce type de périphérique. Wait and see. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194397/in-ps5-lightning-mods-devoile-etahen-sdk-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1194397/in-ps5-lightning-mods-devoile-etahen-sdk-1.jpg"
        }
    },
    "news_2": {
        "title": "[XB] PE Loader pour Xbox en 2024",
        "content": " \nSi vous connaissez déjà le chargement par PE Loader, le billet de blog du développeur Lander ne présente absolument aucune nouveauté, mais vous pourriez apprendre quelque chose qui existe et que vous ne connaissez peut être pas. Le code source complet est disponible sur notre GitHub.\n \nVoici le résumé de son introduction :\n \n\" Emma ( @carrot_c4k3 ) est une bonne amie à moi. Nous nous sommes rencontrées en 2007 sur la scène Xbox 360 et sommes restées amies depuis. Elle a récemment participé à pwn2own dans la catégorie Windows LPE et a fini par utiliser un super bug pour LPE.\n \nLe bug dépassait cependant de loin la catégorie : cette vulnérabilité était également une évasion sandbox , c'est-à-dire qu'elle se trouvait dans un syscall NT accessible depuis le sandbox UWP. Il y a quelques mois, elle a eu une idée folle : pourquoi ne pas essayer de porter l'exploit sur la Xbox One ? ( Xbox modernes, à ne pas confondre avec la Xbox OG) \".\n \n \n \n\n \nLa Xbox One ? \n \nOui il existe un aperçu détaillé du modèle de sécurité de la Xbox One sur YouTube présenté par Tony Chen, l'un des concepteurs de la Xbox One. Le développeur recommande vivement de la regarder si vous êtes intéressé.\n \nIl s'agit d'un schéma très, très simplifié de ce que vous trouverez sur la page Architecture Hyper-V de Microsoft. La principale chose que j'essaie de souligner ici est qu'il existe 3 machines virtuelles avec 3 objectifs différents :\n \n- HostOS, qui agit de manière très similaire à votre hôte Hyper-V standard.\n- ERA OS (alias GameOS) qui est l'endroit où les jeux s'exécutent.\n- SystemOS, où s'exécutent les applications. \n \n \n\n \n \nL'idée principale derrière tout cela est de rendre le piratage extrêmement difficile , voire impossible sans casser le SP. Si vous piratez la Xbox One, vous ne pouvez pas le faire en ligne de manière triviale car le SP attestera que l'état de la console est quelque chose d'inattendu.\n \nIl reste encore à faire fonctionner le loader PE, c'est la partie la plus difficile mais aussi la plus intéressante, notamment en passant par un stockage loacl des threads. Il faudra ensuite corriger les données TLS, mais aussi corrigé des arguments en ligne de commande. Il reste encore quelques éléments à faire, notamment activer certains modules, exploiter des binaires .NET en utilisant certaines techniques pour lancer du code.\n \nSi l'intégralité du sujet vous intéresse c'est par ici : reflective-pe-loader-for-xbox\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194396/in-xb-pe-loader-pour-xbox-en-2024-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1194396/in-xb-pe-loader-pour-xbox-en-2024-2.png"
        }
    },
    "news_3": {
        "title": "[XB360] FATXplorer 3.0 beta 32 est une alternative à HDDHackr",
        "content": " \nTous ceux qui ont déjà bricolé une Xbox 360 connaissent HDDHackr, il était le seul moyen de rendre un disque dur compatible avec les Xbox 360, un outil utile et très en avancé sur son temps. \n \nDéveloppé il y a plus de 10 ans, il est devenu plus difficile à utiliser en raison de problèmes de compatibilité avec les chipsets modernes. Les disques durs OEM pour Xbox 360 ne sont également plus en production. Comme ces disques OEM commencent à tomber en panne, le besoin d'un outil pour rendre les disques compatibles s'est accru.\n \n \n \n \n\n \n \n \nLa nouvelle version bêta 32 de FATXplorer 3.0 dispose d'une toute nouvelle solution, un outil nommé Xbox 360 HDD Maker, ce projet essayer de créer une alternative plus accessible et plus facile à utiliser à HDDHackr. Lorsque vous souhaitez utiliser HDDHackr, vous devez créer une clé USB bootable, modifier les paramètres du BIOS, puis espérer que le chipset de votre PC fonctionnera avec. Xbox 360 HDD Maker ne nécessite aucune de ces étapes et est simplement un autre outil que vous pouvez utiliser dans FATXplorer.\n \n \n \n\n \n \n \nPour vous aider à prendre une décision d'achat d'un disque dur (sachant qu'il est préférable d'opter pour un disque d'avant 2020), Xbox 360 HDD Maker dispose d'une fonction de liste de compatibilité qui est mise à jour chaque fois que quelqu'un flashe avec succès un lecteur (accès Internet requis). Cette liste continuera de s'allonger au fil du temps et devrait vous aider à vous faire une idée des lecteurs qui peuvent être achetés en toute sécurité. Vous la trouverez dans le menu Options !\n \n \n \n\n \n \nChangelog : \n \n- Voici Xbox 360 HDD Maker - un nouvel outil FATXplorer conçu pour modifier le firmware des disques durs Western Digital afin de les rendre compatibles avec la Xbox 360. Xbox 360 HDD Maker est un substitut complet de HDDHackr qui fonctionne sur le bureau de Windows et même par USB !\n- Ajout d'une fonctionnalité de réparation automatique du référentiel WMI pour résoudre les rares problèmes où la détection des périphériques se terminait prématurément en raison d'erreurs « Invalid class » ou « Invalid namespace ».\n- Amélioration de la recherche et du rafraîchissement des périphériques grâce à l'implémentation de la fonctionnalité Rescan Disks du gestionnaire de périphériques Windows. Lorsque l'on travaille sur des connexions SATA, cela résout les problèmes de disparition des disques après un branchement à chaud, une réinitialisation ou un redémarrage du firmware, etc.\n- Amélioration de la compatibilité de la fonction « Récupérer le mot de passe WD » de HDD Security Tools. - Elle fonctionne désormais de manière plus fiable sur les disques plus récents (à partir du milieu des années 2010).\n- Prise en charge du formatage de disque dur secondaire Cerbios activée.\n- Mise à jour du pilote vers la version 22.0.8971. Certaines erreurs rares ont été corrigées. Les mises à jour de pilotes peuvent nécessiter un redémarrage.\n- La date d'expiration a été modifiée au 9 février 2025.\n \n \nTéléchargement : FATXplorer 3.0 beta 32\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194359/in-xb360-fatxplorer-30-beta-32-est-une-alternative-a-hddhackr-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1194359/in-xb360-fatxplorer-30-beta-32-est-une-alternative-a-hddhackr-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1194359/in-xb360-fatxplorer-30-beta-32-est-une-alternative-a-hddhackr-3.png"
        }
    },
    "news_4": {
        "title": "[PS4] PS4 Wee Tools v1.0.1 et PS4 Wee Tools Pro v1.0.5 disponibles",
        "content": " \nLe développeur Andy_maN vient de mettre en ligne les mises à jour de PS4 Wee Tools SE et de PS4 Wee Tools Pro, des outils qui permettent de modifier la mémoire NOR et Syscons sur la PS4.\n \nPS4 Wee Tools SE est un outil gratuit qui grâce à des script python téléchargeables permet d'exécuter tout un tas de tâches sur la PS4 (la version Windows est payante à 5 $), la version Pro quand à elle est payante et permet beaucoup plus d'options, elle est vendue environ 10 $. \n \nCes nouvelles versions apportent notamment le support du firmware 11.52, mais aussi de nouvelles options qu'il est possible de découvrir dans les changelogs. \n \n \n\n \n \nPS4 Wee Tools v1.0.1 :\n \n- [fix] Syscon SNVS lib (active volume)\n- 11.52 support\n \nPS4 weeTools PRO v1.0.5 :\n \n- Syscon rebuilder (Quick modes)\n- Syscon S/NVS viewer (blocks)\n- Syscon SNVS lib (active volume)\n- Syscon flasher - erase + write\n- Syscon flasher - set DEBUG mode\n- 11.52 support\n \n \nTéléchargement : PS4 Wee Tools v1.0.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194357/in-ps4-ps4-wee-tools-v101-et-ps4-wee-tools-pro-v105-disponibles-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] JKSV passe en version  06.08.2024",
        "content": "Le développeur JDK (J-D-K) sort une nouvelle version de son utilitaire de sauvegarde, JSKV, pour des bugs-fix et des améliorations axé sur Webdav. Cela peut tout de même paraître étonnant car aucune mise à jour n'allait être publié de sa part avant une ré-écriture complète du homebrew.\n \n \n\n \n \nUpdate 06.08.24 (Extra edition) : \n \nCorrection des noms de fichier vides sur une partie des serveurs Webdav\nUtilisation de titres sécurisé pour les serveurs Webdav\n \nImportant : \n \nCela entraînera un problème dans lequel cette version de JKSV ciblera un dossier parent différent du précédent pour Webdav.\n \n \n \nAccéder au téléchargement\n \n \n \n \n",
        "images": {
            "image_1": "https://camo.githubusercontent.com/ce8ae47f144a27c720f7b1d7f8e5d71f89ef5b1e7e9621125fa889d1fc941a67/68747470733a2f2f692e696d6775722e636f6d2f794c6354507a742e6a7067"
        }
    },
    "news_6": {
        "title": "[3DS] Un nouveau fork de Citra se nomme Mandarine",
        "content": " \nL'émulateur Citra est avec son petit frère Yuzu désormais inaccessible officiellement suite à l'accord entre Nintendo et la société Tropic Haze LLC. Le développement de forks est logique et sortir du lot n'est pas simple, parmi l'un d'entre eux, il y a Mandarine, une version retravaillée qui offre en théorie des performances supérieures, des mises à jour récentes, et des optimisations supplémentaires par rapport à Citra Enhanced. \n \nL'interface utilisateur a été revue, de nouvelles options audio ont été introduites, et ainsi que le contrôle sur Android. \n \n \n\n \n \nMandarine est proposé sur Android, Linux, PC Windows, et MacOS. \n \nTéléchargement : Mandarine v1.0\n \n \n",
        "images": {}
    },
    "news_7": {
        "title": "[PS4/PS5] etaHEN 1.8b remplace les debug settings par etaHEN Toolbox",
        "content": " \nLightningMods a également mis à jour son playload etaHEN en v1.8b qui améliore la stabilité du Homebrew Enabler, elle remplace également les \" Debug Settings \" par une \" etaHEN Toolbox \" qui s'avère être plus complète. \n \n \n\n \n\n \n \nChangelog : \n \n- réécriture (amélioration de la fiabilité)\n- remplacement des paramètres de débogage par la boîte à outils etaHEN\n- Chargeur de plugins personnalisé\n- Amélioration de la stabilité générale\n- Ajout de diverses options de la boîte à outils etaHEN\n- Ajout des nouveaux paramètres suivants : Klog, StartOption, Rest_Mode_Delay_Seconds, Util_rest_kill et - Game_rest_kill (voir le ReadMe pour plus d'informations)\n- Ajout de la possibilité d'installer le Store directement sur votre PS5\n- Et encore plus de chose à trouver \n \n \nTéléchargement : etaHEN 1.8b\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194332/in-ps4ps5-etahen-18b-remplace-les-debug-settings-par-etahen-toolbox-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1194332/in-ps4ps5-etahen-18b-remplace-les-debug-settings-par-etahen-toolbox-2.jpg"
        }
    },
    "news_8": {
        "title": "[PS4/PS5] ItemzFlow 1.07 disponible",
        "content": "Depuis quasiment 2 mois nous n'avions pas de nouvelle version d'ItemzFlow, et bien voilà que le développeur LightningMods dévoile la v1.07 de son célèbre manager, le menu Homebrew/Game ajoute Game Dumper v2 pour la PS5 (qui permet de dumper nativement les jeux PS5 - aucun décryptage inclus), des correctifs, Game PlayTime et qui corrige plusieurs bugs.\n \nItemzFlow est un menu alternatif Open Source pour votre PS5 ou PS4 hackée, avec une interface magnifique. L'outil propose également quelques fonctionnalités supplémentaires directement accessibles pour chaque jeu, comme un dumper, une possibilité d'accéder/d'activer des patchs et des trainers, des outils de réparation (par exemple pour éviter de perdre tout votre contenu fpkg en cas de corruption des données PS4), le support des thèmes ... \n \n \n\n \n\n \n \n \nChangelog : \n \n- Game Dumper v2 (décryptage non inclus mais native dump de jeux PS5)\n- Patchs Itemzflow (cheats de démarrage, i.e. patchs 60 FPS)\n- Correction d'un problème avec plus de 100 jeux installés\n- Ajout du temps de jeu etaHEN dans itemZflow\n- Ajout du support DLC Dumping (à la fois pour les DLC chargés et non chargés)\n- Itemzflow installera automatiquement les plugins HENV et Cheats/patches (s'ils n'existent pas)\n- Itemzflow supprimera automatiquement l'util de dumping s'il existe encore au démarrage.\n- Correction d'un problème provoquant l'introuvabilité de certains titres de jeux PS5\n- Ajout d'une option pour activer l'échantillonnage des fichiers (afin de ne pas être bloqué en essayant de décharger quelque chose qui n'est pas installé)\n- Plus d'informations\n \n \nTéléchargement : ItemzFlow 1.07\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194330/in-ps4ps5-itemzflow-107-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1194330/in-ps4ps5-itemzflow-107-disponible-2.jpg"
        }
    },
    "news_9": {
        "title": "[Wii] NUSGet disponible, une alternative à NUS Downloader",
        "content": "Le développeur NinjaCheetah a dévoilé récemment un nouvel outil nommé NUSGet, proposé en version 1.0.0 à la fin Juin 2024, voilà qu'à débarqué la version 1.1.0 il y a quelques jours à la fin Juillet. Il s'agit là d'une alternative moderne et indépendante à la plate-forme de téléchargement NUS Downloader avec qui vous allez pouvoir télécharger des chaînes, des menus-systèmes ou des IOS à partir du serveur Nintendo. \n \nNUSGet est écrit en Python et fonctionne sous Windows, MacOS, ou Linux, contrairement à NUS Downloader qui ne fonctionne que sous Windows, et surtout il comporte moins de bugs. NUSGet peut aussi vous permettre d'accéder à des titres vWii, de regrouper des titres DSi sous le nom de TAD. \n \n \n \n\n \n \n \nVoici quelques possibilités de NUSGet : \n \n- Interface utilisateur graphique multiplateforme\n- Téléchargez n'importe quel titre à partir des serveurs de mise à jour Wii, vWii ou DSi\n- Bases de données de titres pour la Wii, la vWii et la DSi avec tous les titres système, les titres préinstallés et les chaînes Wii répertoriés (WiiWare et la console virtuelle ne sont pas encore dans la base de données en raison de la taille énorme de ces listes)\n- Possibilité de sauvegarder le contenu crypté de n'importe quel titre\n- Possibilité de décrypter le contenu des titres Wii, vWii et DSi s'ils disposent d'un ticket commun disponible\n- Possibilité d'emballer un WAD pour n'importe quel titre Wii ou vWii, ou un TAD pour n'importe quel titre DSi si un ticket commun est disponible\n- Possibilité de recrypter n'importe quel titre vWii avec la clé commune Wii pour permettre sa modification avec des outils standards, son installation depuis la vWii sur une Wii U et son installation dans Dolphin (aucun dump NAND Wii U requis !) si un ticket commun est disponible\n \nChangelog : \n \n- Mise à jour de libWiiPy vers 0.4.1\n- Corrections mineures de la base de données (le TID du canal Demae a été corrigé, le canal de données personnelles défini a été ajouté, certaines chaînes d'avertissement ont été rendues plus claires).\n- La formulation de l'option de recryptage a été rendue un peu plus claire, elle indique désormais « Recrypter le titre à l'aide de la clé commune Wii » au lieu de « Pack pour le mode vWii au lieu du mode Wii U ».\n- Ajout de traductions norvégiennes, grâce à@rolfieeIl s'agit principalement d'un test d'utilisation de Qt Linguist, et il existe encore quelques problèmes avec la façon dont il est implémenté. - Une fois ces problèmes résolus, des instructions sur la façon de contribuer aux traductions seront ajoutées et d'autres langues seront, espérons-le, disponibles.\n- Modification de libWiiPy : tous les WAD empaquetés utilisent des calculs ajustés pour la taille de la région de contenu dans l'en-tête WAD, créant ainsi une cohérence avec les outils existants. Cela signifie notamment que les WAD IOS de NUSGet correspondront désormais aux sorties attendues des outils existants.\n \n \nTéléchargement : NUSGet v1.1.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194232/in-3dswii-nusget-disponible-une-alternative-a-nus-downloader-1.jpg"
        }
    },
    "news_10": {
        "title": "[3DS] Une vulnérabilité dans Pokemon Ultra Soleil : Exploit, code et payloads",
        "content": " \nLe développeur Wack0, aussi connu sous le pseudo Slipstream, vient de dévoiler une faille dans Pokemon Ultra Soleil, pour profiter de cet exploit vous devez posséder deux consoles disposant de la même version du jeu, car il doit s'exécuter sur une des deux consoles en arrière plan, ce qui rend la tâche un peu lourde. \n \nL'exploit va bloquer la console 3DS lorsque vous allez suivre un parcours spécifique dans le jeu, vous devez démarrer le jeu en choisissant Litten ou Popplio, vous rendre ensuite au centre Pokemon le plus proche, accéder au menu Démarrer, sélectionner Lien rapide et vous connecter. \n \n \n \n\n \n \n \nEnsuite vous rechargerez le fichier de sauvegarde, la console s'étant alors bloquée, et vous devrez combattre un Darkrai de niveau 100, c'est là que le code s'exécutera. Il est possible que d'autres versions du jeu soit hackable comme Pokemon Ultra Lune, ou encore d'envisager un portage sur la Wii U. Cette chaine ROP permettant le chargement des payloads a été testée sur la version 2.2.0 de Pokemon Ultra Soleil. \n \nTout est là : pialeasenerf-pokemonultrasun\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194231/in-3ds-une-vulnerabilite-dans-pokemon-ultra-soleil-exploit-code-et-payloads-1.jpg"
        }
    },
    "news_11": {
        "title": "[Multi] La sécurité du TEE d'AMD en question dans une présentation à la Black Hat",
        "content": "Le développeur Tom Dohrmann, chercheur en sécurité, a dévoilé mercredi lors d'une conférence à la Black Hat 2024 qui s'est tenue du 03 au 08 Août 2024 à Las Vegas (USA), ses trouvailles sur les protections des TEE modernes, il faut entendre par TEE la partie sécuritaire des technologies SEV-SNP d'AMD qui sont implémentées dans le firmware du processeur de sécurité (SP) d'AMD, TEE signifiant Trusted Execution Environment.\n \n \n\n \n \n \n\n \n \nBien que sa présentation ne soit pas directement ciblé sur une console ou un PC, il détaille deux vulnérabilités d'un firmware et présente de nouvelles techniques pour exploiter ces vulnérabilités. Cela entraîne une perte totale de confidentialité, car un attaquant peut décrypter la mémoire invitée arbitraire sur les systèmes affectés. Dans certains cas, un attaquant peut modifier arbitrairement le contenu de la mémoire cryptée, ce qui entraîne une perte totale de l'intégrité d'un programme invité en cours d'exécution.\n \n \n \n \n \n\n \n\n \n \n \nAinsi il explique comment fonctionne l'Hypervision et les liens qu'il peut y avoir dans le firmware afin de l'attaquer. \n \nSa présentation est ici : Exploiter les bugs du firmware pour casser les TEE\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194198/in-multi-la-securite-du-tee-damd-en-question-dans-une-presentation-a-la-black-hat-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1194198/in-multi-la-securite-du-tee-damd-en-question-dans-une-presentation-a-la-black-hat-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1194198/in-multi-la-securite-du-tee-damd-en-question-dans-une-presentation-a-la-black-hat-3.png"
        }
    },
    "news_12": {
        "title": "[PS4] La Bêta de Call of Duty Black Ops 6 leakée et hackée sur PS4",
        "content": "Nous avons attendu 4 longues années et Treyarch est enfin de retour, enfin il devait l'être le 25 Octobre 2024, le leak du titre a provoqué la panique chez Activision, fort heureusement il ne s'agit que de la version bêta qui était attendue fin août qui a été leakée et hackée, permettant à de nombreux joueurs de profiter du jeu dès maintenant. \n \n \n\n \n \nC'est bien entendu la PS4 qui profite le plus de ce hack puisque le titre est accessible sur PS4 hackée. Il s'agit toutefois d'un hack bien spécifique, pas la version complète du jeu, vous n'aurez pas accès au mode campagne, mais bien la bêta multijoueur qui devrait sortir à la fin de ce mois. L'intégralité du contenu de la Bêta peut être joué hors ligne sur PS4 hackée. \n \n \n \n\n \n \nLa version PS4 requière 25.15 Go à télécharger, et il semblerait que cette version puisse également tourner sur PS5 sous firmware 4.51 via etaHEN, c'est du moins ce que confirme LightningMods via une version personnalisée d'etaHEN. \n \nAucun lien dans les commentaires ne sera toléré, merci. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194173/in-ps4-la-beta-de-call-of-duty-black-ops-6-leakee-et-hackee-sur-ps4-1.png"
        }
    },
    "news_13": {
        "title": "[XB/XB360/PS2/GC] Un nouvel exploit RCE Tony Hawk's Pro Strcpy",
        "content": " \nLa présence de Tony Hawk au JO de Paris ne passe pas inapperçu, elle marque les esprits pour l'histoire tout comme la découverte d'une amélioration de l'exploit RCE nommé Tony Hawk's Pro Strcpy.\n \nTony Hawk's Pro Strcpy est un exploit de sauvegarde de jeu/réseau RCE qui peut être utilisé pour pirater plusieurs consoles de jeu différentes, notamment la Xbox, la Xbox 360, la Playstation 2 et la Gamecube. Le Github de référence contient le code d'exploitation et les fichiers de sauvegarde de jeu prédéfinis ainsi que des variantes RCE qui peuvent être utilisées pour pirater certaines consoles de jeu à distance via des correspondances réseau/LAN.\n \n \n\n \n \nCet exploit est destiné à être utilisé pour pirater votre propre console et à des fins éducatives uniquement. Les sauvegardes de jeu et les correctifs prédéfinis peuvent être trouvés dans la section Versions. Vous ne devriez avoir besoin de compiler les exploits à partir du code source que si vous souhaitez les modifier/expérimenter.\n \nBaptisé Tony Hawk's Pro Strcpy, cet exploit existe dans Tony Hawk's Pro Skater 3, Tony Hawk's Pro Skater 4, Tony Hawk's Underground 1, Tony Hawk's Underground 2 et Tony Hawk's American Wasteland.\n \n \n\n \n \n \nLe bug strcpy existe dans le code de chargement des skateparks personnalisés créés avec la fonctionnalité « créer un skatepark ». L'éditeur de skatepark permet aux joueurs de créer des niveaux personnalisés et l'une des fonctionnalités vous permet de créer un « gap » (terme de skateboard désignant une zone entre deux plates-formes sur lesquelles il faut sauter) et de le nommer avec un maximum de 31 caractères. En créant de manière malveillante un nom de skatepark personnalisé dans le fichier park, vous pouvez déclencher un débordement de pile/tas et prendre le contrôle du pointeur d'instruction du processeur. Cela peut ensuite être utilisé pour démarrer une chaîne ROP (ou exécuter du code shell) et exploiter davantage la console pour une exécution complète du code.\n \nCe bug existe dans plusieurs versions différentes du jeu et peut même être utilisé sur le réseau via des matchs LAN pour pirater à distance les clients sans qu'ils aient besoin d'obtenir les fichiers de sauvegarde piratés. Pour des informations détaillées sur le fonctionnement de l'exploit pour chaque console de jeu, consultez les notes dans les fichiers sources de l'exploit.\n \nLe développeur Grimdoomer a publié un énorme article expliquant le fonctionnement de ce nouvel exploit RCE : https://icode4.coffee/?p=954\n \n \nTout est publié ici : TonyHawksProStrcpy\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194171/in-xbxb360ps2gc-un-nouvel-exploit-rce-tony-hawks-pro-strcpy-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] switch_AIO_LS_pack 5.14.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.14.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format).\nLe mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.14.0:\nMise à jour de Hekate, de Status-monitor-overlay, de JKSV et de Haku33 vers la dernière version de ceux-ci.\nCompilation du homebrew AIO_LS_pack_Updater avec la dernière version de la Libnx et quelques mise à jour pour être compilé en C++23.\nNote: Pour traiter les problèmes particuliers de lancement de la sysnand en firmwares 17.0.0 et supérieurs c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets. Pour cela nous avons mis en place un questionnaire de satisfaction, en plus de pouvoir reporter les problèmes sur Github ou sur le forum vous pouvez utiliser ce questionnaire pour nous donner vos opinions de façon anonyme (pour des problèmes spécifiques il vaut mieux reporter sur Github ou ouvrir un sujet sur le forum, il y aura une réponse bien plus rapide et cela permet de demander plus de détails pour identifier et peut-être résoudre le possible problème.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe et vous avez aussi un tutoriel plus détaillé sur cette page, d'ailleurs ce dernier site contient aussi pas mal de tutoriels notamment sur la Switch.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] La team UnlockSwitch annonce la date pour l'Xtractor",
        "content": " \nLa Team UnlockSwitch vient de mettre en ligne la date approximative de l'arrivée de l'Xtractor, cela signifie deux choses, qu'elle a finalisé son produit et qu'elle souhaite le présenter.\n \nRevenons sur cet Xtractor, dans un post sur X du 27 Juillet l'équipe expliquait qu'elle était en mode silence depuis quelques jours, mais que cela était du au fait qu'elle se concentrait sur sa solution. En effet, l'Xtractor est est une solution cruciale pour elle, lui permettant de proposer un kit UnlockSwitch complet.\n \nJusqu'à présent la team a livré une soixantaine d'échantillons de l'UnlockSwitch, mais uniquement le linker avec son programmeur, dans sa version violette, mais pour l'heure il n'y a pas la solution software, ni l'Xtractor. \n \n \n\n \n \nCe dernier sera vendu seul dans un premier temps au prix de 34,90 $ d'après les dernières informations communiquées, permettant de proposer d'un côté une solution UnlockSwitch PBS à 24,90 $, et son Xtractor à 34.90 $ séparément. \n \nPar la suite, seule une version complète nommée \"Kit\" intégrera l'UnlockSwitch PBS, le programmateur et l'Xtractor, sera vendue au prix de 59,90 USD.\n \nTout cela c'est très bien, mais c'est quoi l'Xtractor ? \n \nAu début surnommé eXtractor, l'Xtractor est le Game Dumper de l'UnlockSwitch, il s'agit de la solution matérielle qui permet de dumper les jeux Nintendo Switch. Selon l'équipe en charge du développement, ce dumpeur de rom permet de se passer d'une Switch hackée. \n \nVous l'aurez compris l'Xtractor est essentiel dans l'équation, surtout si vous voulez dumper vos propres cartouches pour garder vos licences pour jouer en ligne. \n \nLa Team UnlockSwitch vient d'annoncer qu'elle présentera son Xtractor dans quelques jours, elle précise entre le 15 et le 20 août 2024. Espérons qu'une fois avoir finalisé l'Xtractor, l'équipe puisse rapidement proposer la solution firmware (le software) de l'UnlockSwitch PBS afin que le produit soit pleinement fonctionnel, et puisse être réellement testé. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194041/in-switch-la-team-unlockswitch-annonce-la-date-pour-lxtractor-1.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] Moonlight Switch v1.2.0 disponible",
        "content": " \nLe développeur Xitrix propose une nouvelle version de Moonlight Switch, un peu plus de trois mois après la version précédente, il amène ainsi quelques corrections au portage de Moonlight Game Streaming Project pour la Nintendo Switch.\n \n \n\n \n \n \nChangelog 1.2.0 vs 1.1.0 : \n \n- Les contrôles de résolution ont été supprimés dans le cadre d'un changement obligatoire pour les nouvelles versions du serveur Sunshine.\n- Ajout de plus d'options de résolution et de FPS\n- Améliorations mineures de la saisie\n- Mise à jour de la version de LibNX (prise en charge du firmware 18)\n- Mise à jour de Moonlight-Common-C\n \n \nPour installer Moonlight-NX v1.2.0, suivez ces étapes :\n \n- Téléchargez la dernière version de Moonlight-NX.\n- Placez le fichier moonlight.nro dans le dossier sdcard:/switch/moonlight.\n- Lancez le menu Homebrew (hbmenu) pour accéder à la redirection des titres (pour un accès complet à la RAM).\n- Lancez Moonlight-NX.\n \n \nGuide d’installation :\n \n- Consultez d’abord le guide officiel de configuration.\n- Connectez votre PC et la Nintendo Switch au même réseau WiFi.\n- Dans Moonlight-NX, appuyez sur le bouton “Add new host” et entrez l’adresse IP de votre PC.\n- Associez Moonlight-NX à votre PC.\n \nTéléchargement : Moonlight Switch v1.2.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194040/in-switch-moonlight-switch-v120-disponible-1.jpg"
        }
    },
    "news_17": {
        "title": "[Switch] Ryujinx 1.1.1368 disponible",
        "content": " \nMême si aucune version majeure n'est dévoilée par l'équipe, et que les versions proposées sont des autobuilds régulières (environ tous les 2 à 3 jours), les changements dans Ryujinx sont nombreux. \n \nL'émulateur de Nintendo Switch récupère des parts de marché à Yuzu qui comme vous le savez n'est désormais plus proposée \"légalement\", il reste possible de le trouver sur certains réseaux mais il est désormais chassé par Nintendo ainsi que ses forks. Reste donc Ryujinx qui pour l'heure, et de façon assez paradoxale, n'est pas inquiété. \n \n \n\n \n \nPour rappel, Ryujinx est un émulateur open-source permettant de faire tourner quelques 3500 jeux Switch sur PC Windows, MacOS, ou Linux. \n \nDans les dernières évolutions que l'on peut au crédit de Ryujinx, il est possible de remarquer des améliorations sur le charge de XCI multi-jeux, une meilleure comptabilité avec les derniers firmwares Switch, plusieurs corrections de bugs, des améliorations sur la 3D ou la gestion des shaders sous Vulkan. \n \n \n\n \n \nDésormais sans réelle concurrence directe, l'équipe en charge du développement de Ryujinx ne propose plus de rapports de progrès comme elle le faisait mensuellement, c'est dommage, il nous permettait de comprendre les directions vers lesquelles l'équipe nous embarquait. \n \nBien entendu il reste possible de consulter ici les dernières modifications du github pour se faire une idée des dernières innovations de cette version 1.1.1368 : \n \nTéléchargement : Ryujinx 1.1.1368\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194039/in-switch-ryujinx-111368-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1194039/in-switch-ryujinx-111368-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[Multi] Switchfin, le client Jellyfin, se met à jour pour la Switch et la PS4",
        "content": " \nLe développeur dragonflylee propose une nouvelle version de Swithfin, il s'agit là d'un outil dont nous ne vous avons jamais parlé, et qui est une interface tierce dédiée à Jellyfin à destination de la Switch, des PC et de la PS4.  Si vous ne connaissez pas Jellyfin, il s'agit d'un serveur de contenus, un serveur multimédia open source et gratuit, offrant la possibilité de naviguer et lire les flux multimédia de toutes natures :\n \n \n- conteneurs : mkv, mov, mp4, avi\n- codecs vidéo : H.264, H.265, VP8, VP9, AV1\n- codecs audio : Opus, FLAC, MP3, AAC, AC-3, E-AC-3, TrueHD, DTS, DTS-HD\n- sous-titres : SRT, VTT, SSA/ASS, DVDSUB\n \n\n \nChangelog 0.5.1\n \nAjout :\n- Mise à jour de ffmpeg 7.0.1\n- Ajout d'une surbrillance pour la piste en cours de lecture\n- Ajout de la prise en charge de la télévision en direct\n- Ajout d'un navigateur de fichiers webdav\n \nCorrections :\n- Délai d'attente réseau pour le chargement de la vidéo\n- Panique après l'annulation de la connexion\n- Focus anormal lors de la connexion après l'ajout d'un serveur\n- Affichage de l'url de la liste des serveurs\n \nTéléchargement : Switchfin\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193940/in-multi-switchfin-le-client-jellyfin-se-met-a-jour-pour-la-switch-et-la-ps4-1.png"
        }
    },
    "news_19": {
        "title": "[Wii/WiiU] Nintendont et Cemu se mettent à jour",
        "content": " \nDeux programmes emblématiques pour la Nintendo Wii et Wii U, Nintendont et Cemu ont été mis à jour récemment.\n \nNintendont comme vous le savez c'est le projet Homebrew qui permet de jouer à des jeux GameCube sur Wii et sur Wii U via vWii. Sa mise à jour, bien qu'elle n'apporte pas grand chose, permet de signaler que le programme est toujours supporté car nous n'avions pas eu de nouvelle version depuis quasiment un an. \n \n \n\n \n \nCette version v6.502 de Nintendont apporte le support de vibrations pour la DualShock 4 qui avait été oublié dans le code ini de la version précédente, il a été rajouté en dur, cela a été testée uniquement sur la v1 de la DualShock 4, mais il n'y a aucune raison que cela ne marche pas avec la v2. \n \nTéléchargement : Nintendont v6.502\n \n \nExZap lui aussi dévoile une nouvelle version de Cemu qui est désormais livré en v2.0-91, toujours proposé en version expérimentale (cela fait plus de 2 ans), cette mise à jour apporte des modifications sur 52 fichiers, pas moins de 14 validations de changements par rapport à la v2.0-91.\n \n \n \n \n\n \n \n \nA titre d'exemple, cette nouvelle version intègre des corrections sur la taille des fenêtres du Gamepad, ou encore l'ajout de nouveaux paramètres dans libusb. Le code a été corrigé et nettoyé aussi pour l'émulation des Skylanders. Les builds étant régulières ces derniers jours, il est possible qu'une nouvelle version soit rapidement dévoilée. \n \n \nTéléchargement : Cemu 2.0-91\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193915/in-wiiwiiu-nintendont-et-cemu-se-mettent-a-jour-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1193915/in-wiiwiiu-nintendont-et-cemu-se-mettent-a-jour-1.png"
        }
    },
    "news_20": {
        "title": "[XBO] Mise à jour du modchip Xbox open-source ModXo",
        "content": "Il y a quelques mois nous vous présentions, ModXo, un custom firmware vous permettant de convertir un Raspberry Pi Pico en modchip pour la Xbox originale, en s'appuyant sur une émulation permettant d'exécuter un bios. \n \n \nComme beaucoup de puces et d'adaptateurs modernes, ModXO est basé sur un RP2040, il fonctionne déjà pour alimenter un BIOS sur votre console, il est assez facile à installer et il ne fera que s'améliorer. \n \n \n\n \n \n \nDans une vidéo Macho Nacho Productions nous montre le processus d'installation de la puce, et donne un aperçu de la suite des possibilités comme peut-être, la prise en charge du projet Prometheos qui équipe votre Xbox d'un menu de services complet. De plus, avec un firmware et un matériel open source, vous pouvez ajouter des tonnes d'autres éléments flashy et utiles, comme de petits écrans LCD/OLED pour l'affichage de l'état et des bandes LED de toutes sortes \n \nRécemment son développeur a publié une mise à jour de la logique LPC de ModXo preuve que le projet est toujours supporté. \n \n \nTout est là : ModXo\n \n",
        "images": {}
    }
}