{
    "news_1": {
        "title": "[PS3] CFW Evilnat 4.91.3 Beta 1 disponible",
        "content": "Le développeur Evilnat propose son premier cadeau en ce début d'année 2025, il s'agit de la première Bêta de son CFW Evilnat qui est maintenant proposé en version 4.91.3. \n \nC'est la première version de son custom firmware à destination de la PS3 qui dispose de ce numéro 4.91.3, et pour cause les changements sont conséquents par rapport à la 4.91.2, notamment avec la mise à jour du kernel, ou bien celle du payload stage2, et de nombreux autres correctifs qu'il est possible de trouver dans le changelog.\n \n \n \n \n\n \n \n \n \nChangelog 4.91.3 Beta 1 : \n \n- Mise à jour du kernel\n- Mise à jour du paylaod stage2 \n- Correction du kernel DEX pour contourner le brick de bip d'ambulance (noyau - DEX chargé avec CEX TargetID) (par Evilnat)\n- Correctif pour autoriser les PS2CLASSICs sur DEX (par Evilnat)\n- Correction pour contourner l'erreur SSL Handshake sur DEX VSH (par Evilnat)\n- Mise à jour des émulateurs PS1/PS2 (par @mrjaredbeta et @kozarovv)\n- [COBRA] Ajout du support pour rap.bin (Par @esc0rtd3w)\n- [XAI] Désactivation temporaire du chargement de stage2 externe (à cause du manque d'espace dans le noyau)\n- [XAI] Suppression des options « Activer FTP » et « Désactiver FTP » en raison de blocages aléatoires.\n- [XAI] Ajout de l'option Importer les licences dans rap.bin (rap2bin) (Par @esc0rtd3w)\n- [XAI] Ajout de l'option Exporter les licences depuis rap.bin (bin2rap) (par @esc0rtd3w)\n- [XAI] Ajout de téléchargements optionnels\n > xai_plugin v1.17 \n > PS1/PS2 EMU Updater Cobra [v1.0]\n > PS1/PS2 EMU Updater MOD [v1.0]\n \n \nTéléchargement : CFW 4.91.3 Evilnat Cobra 8.5 [PEX] [BETA 1]\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202524/in-ps3-cfw-evilnat-4913-beta-1-disponible-1.jpg"
        }
    },
    "news_2": {
        "title": "[Vita/Switch/PS3/PS4] Vita, Switch, PS3, PS4 ezRemote Client  mis à jour",
        "content": "Le développeur cy33hc a déployé de nombreuses mise à jour de son ezRemote Client, que ce soit sur PlayStation Vita, Nintendo Switch, PlayStation 3 ou PlayStation 4, toutes les versions ont été corrigées. \n \n \n\n \n \nPS4 (v1.33) :\n \n- Ajout du support pour les serveurs ftp qui n'autorisent pas la cmd NOOP. - Ceci corrige le problème où l'application se déconnecte après s'être connectée au serveur et avoir listé le premier répertoire.\n \nTéléchargement : PS4 ezRemote\n \n \n\n \n \n \nPS3 (v1.08) : \n \n- Ajout du support pour les serveurs ftp qui n'autorisent pas la cmd NOOP. - Ceci corrige le problème où l'application se déconnecte après s'être connectée au serveur et avoir listé le premier répertoire.\n \nTéléchargement : PS3 ezRemote\n \n \n \n\n \n \nSwitch (v1.07) : \n \n- Ajout du support pour les serveurs ftp qui n'autorisent pas la cmd NOOP. \n- Ceci corrige le problème où l'application se déconnecte après s'être connectée au serveur et avoir listé le premier répertoire.\n- Correction de l'upload de fichiers pour ftp et smb\n- Augmentation de la taille du mot de passe à 127 caractères\n \nTéléchargement : Switch ezRemote\n \n \nVita (v1.08) : \n \n- Ajout du support pour les serveurs ftp qui n'autorisent pas la cmd NOOP. - Ceci corrige le problème où l'application se déconnecte après s'être connectée au serveur et avoir listé le premier répertoire.\n- Augmentation du champ du mot de passe à 127 caractères\n \nTéléchargement : Vita ezRemote\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202515/in-vitaswitchps3ps4-vita-switch-ps3-ps4-ezremote-client-mis-a-jour-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202515/in-vitaswitchps3ps4-vita-switch-ps3-ps4-ezremote-client-mis-a-jour-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1202515/in-vitaswitchps3ps4-vita-switch-ps3-ps4-ezremote-client-mis-a-jour-2.png"
        }
    },
    "news_3": {
        "title": "[Vita] Street Fighter One s'invite en v1.1 sur Vita",
        "content": "La Vita continue d'attirer les développeurs, et pour cause, elle reste une console très attractive, et les optmisations récentes trouvées relance les ambitions. \n \nUn portage bien sympathique est un remake Mugen de Street Fighter One (SF1MR) utilisant Dolmexica Infinite comme moteur.\n \n \n\n \n \n\n \n \nStreet Fighter One MUGEN Remake, cette fois, il s'agit d'un remake du tout premier jeu Street Fighter original, simplement appelé Street Fighter One, qui est également connu dans les ports d'origine sous le nom de Fighting Street.\n \n \n\n \n\n \n \nChangelog 1.1 : \n \n- Correction d'un bug sur l'intro\n- Accès désactivé aux étapes Mugen KFM par défaut\n \n \nTéléchargement : SF1MR Vita v1.1\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202513/in-vita-street-fighter-one-sinvite-en-v11-sur-vita-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202513/in-vita-street-fighter-one-sinvite-en-v11-sur-vita-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1202513/in-vita-street-fighter-one-sinvite-en-v11-sur-vita-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1202513/in-vita-street-fighter-one-sinvite-en-v11-sur-vita-4.png"
        }
    },
    "news_4": {
        "title": "[WiiU] NUSspli Lite v1.154 disponible",
        "content": "En ce début d'année 2025, le développeur V10lator vient de publier une nouvelle version de son application NUSspli qui se destine à la Nintendo Wii U.\n \nNUSspli est un simple loader et installateur de package pour cette console, qui s'appuie sur un fork de l'excellent WUPDownloader de Poke303.\n \nPour parler simplement, NUSspli vous permet d'installer du contenu directement depuis les serveurs de mise à jour Nintendo sur votre Wii U. La version Lite est la version légale de NUSspli car ne comporte que le programme d'installation WUP, aucun contenu illégal, l'outil utilise des API pour obtenir les logiciels à partir du système d'exploitation Wii U. \n \n \n\n \n \nCette nouvelle version corrige les problèmes de mise à jour, améliore l'interface, corrige les fautes de frappe, des améliorations importantes ont été apportées aux traductions, avec notamment des corrections sur l'allemand, le turc et l'italien. \n \nLes changements sont nombreux pour un tel outil, des améliorations dans la gestion des bibliothèques (zlib, libCURL et nghttp2), les outils de développement ont été mis à jour, la stabilité a été amélioré grâce à une fonctionnalité qui utilise le SDL, ou encore l'utilisation de paramètres proxy poussés de la Wii U.\n \nD'autres correctifs supprime un gestionnaire d'exceptions personnalisé et des optimisations spécifiques ont été implémentées. Une bien belle version. \n \n \nChangelog 1.154 : \n \n- Correction de l'updater.\n- Mettre en évidence les entrées en file d'attente dans le menu de l'installateur. \n- Correction d'une coquille. \n- Ajout de la traduction en turc.\n- Ajout d'une nouvelle traduction. \n- Amélioration de la localisation allemande\n- Faire passer la zlib de 0f51fb4 à ef24c4c \n- Bump devkitpro/devkitppc de 20240702 à 20241111 \n- Mise à jour de libCURL et nghttp2 \n- Faire passer devkitpro/devkitppc de 20241111 à 20250102 \n- EXPERIMENTAL : Utiliser les paramètres proxy de la Wii U.\n- Mise à jour de la localisation turque des boutons \n- Correction de la traduction italienne. Crédits à @Duoslow pour avoir repéré ce problème. \n- Mise à jour de la localisation turque avec de nouvelles phrases et des invites supplémentaires \n- Correction 82e2f16 85e2b0c \n- EXPÉRIMENTAL : Utiliser SDL en amont. \n- Suppression du gestionnaire d'exception personnalisé. \n- Faire passer la zlib de 0f51fb4 à ef24c4c \n- Ajout d'une solution de contournement moche. \n \nTéléchargement : NUSspli Lite v1.154\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202475/in-wiiu-nusspli-lite-v1154-disponible-1.jpg"
        }
    },
    "news_5": {
        "title": "[PSP/Vita] PSP Ark-4 r152: New Years Edition",
        "content": "A l'occasion de la nouvelle année, le développeur JoseAaronLopezGarcia propose une nouvelle version d'Ark-4, voilà que débarque PSP ARK-4 r152 : News Years Edition. Comme vous le savez la principale différence entre ARK et Adrenaline sur les consoles PlayStation Vita et PlayStation TV est qu'il ne nécessite pas l'exécution de l'exploit HENkaku. ARK est un portage du PRO CFW, il s'agit plutôt d'un eCFW (Custom Firmware de la PSP sur Playstation Vita), tout comme TN-C il peut démarrer les homebrews et les jeux de la première PSP et PSX, mais il ne peut faire tourner d'homebrews sur Vita, il faudra obligatoirement passer pour cela par HENkaku.\n \n \n \n\n \n \n \nAprès quelques jours de fêtes, revoilà les développeurs au travail et propose une mise à jour qui a été préparée depuis un certain temps. Les développeurs avaient pour intention d'utiliser la liste de modifications typique de Sony, du type « Stabilité du système améliorée », mais comme cette version contient des fonctionnalités intéressantes, il a été décidé de les énumérer toutes :\n \n- Ajout de la possibilité d'exécuter l'intégralité du firmware 1.50 à partir d'un Memory Stick, pas seulement le homebrew, mais aussi le XMB. Cela signifie que ARK est maintenant un CFW 1.50 à part entière. Cela se fait via le 1.50 Kernel Addon.\n- Ajout du paramètre Force Extra RAM pour les installations PS Vita Standalone. Notez que ce paramètre est connu pour être instable.\n- Correction des plantages de mise en veille/reprise avec Inferno.\n- Correction d'un dépassement de tampon dans le patch syscon_plugin.\n- Ajout d'une nouvelle combinaison (L+R+Select+Down) pour revenir rapidement au XMB.\n- Correction des traductions italiennes.\n- Dernier point, mais non des moindres : Stabilité du système améliorée.\n \n \nTéléchargement : Ark-4 r152 : New Years Edition\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202469/in-pspvita-psp-ark-4-r152-new-years-edition-1.png"
        }
    },
    "news_6": {
        "title": "[WiiU/vWii] SaveMii v1.6.4 disponible",
        "content": " \nLe développeur Xpl0itU nous propose une nouvelle version du mod SaveMii qui est maintenant proposé en v1.6.4.\n \nSaveMii, est à l'origine un homebrew développé par le brésilien Ryuzaki_MrL et qui permet de faire un backup ou des restaurations de vos sauvegardes. Vous devez d'abord exécuter IOSUhax et le CFW Mocha pour que cet homebrew puisse fonctionner, et ensuite vous allez pouvoir archiver vos sauvegardes Wii U et vWii sur carte SD. \n \nAvec les versions modifiées le développement est plus poussé et les fonctions plus nombreuses, ainsi dans les dernières versions il est possible de réaliser les opérations sur plusieurs sauvegardes, d'ajouter l'icône du jeu, les sauvegardes sont mieux réalisés grâce à l'emploi du Unicode et cette dernière version 1.6.4 apporte à elle seule pas mal de nouveautés, les jeux de sauvegarde peuvent être restaurés en une seule fois à l’aide du traitement par lots, et l'interface a également été légèrement améliorée.\n \n \n \n\n \n \n \nChangelog 1.6.4 :\n \nAméliorations (par w3irDv) :\n- Nouvelle tâche : restauration par lots de titres déjà installés à l'aide des données de sauvegarde d'un jeu de sauvegarde par lots\n- Vous pouvez marquer et supprimer des emplacements en utilisant \"+\"/\"-\" dans le menu des tâches de sauvegarde.\n- Vous pouvez marquer et supprimer des jeux de sauvegarde en utilisant \"+\"/\"-\" dans le menu BackupSetList\n- Améliorations mineures de l'interface utilisateur - mise en évidence des couleurs lors de la navigation dans les menus\n- Mise à jour de SaveMii 1.6.3 Traduction chinoise simplifiée (merci à @kavid)\n \nCorrectifs (par w3irDv) :\n- Prévenir le freeze potentiel dû à un disque inséré dans la console\n \n \nTéléchargement : SaveMii v1.6.4\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202466/in-wiiuvwii-savemii-v164-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[PS5] John Tornblom travaille dur pour proposer de nouveaux plugins",
        "content": "On ne l'arrête plus, John Tornblom a publié de nombreuses mises à jour de nombreux de ses plugins ou de ses propositions pour la PS5. \n \n \n\n \n \n \n \nChangelog 0.24.1 :\n- libc : déclarer les dépendances sur crt1.o comme faibles\n- stacktrace : afficher une notification d'interface utilisateur lorsque des signaux POSIX fatals sont détectés\n \n \nChangelog 0.24 :\n- crt : améliorer la trace de pile imprimée sur /dev/klog lorsqu'une charge utile plante\n- crt : ajouter kernel_mprotect() qui contourne les permissions associées à l'appel système mprotect standard\n- crt : éviter d'allouer de la mémoire partagée\n- libc : autoriser mmap et mprotect à mapper la mémoire exécutable\n \nTéléchargement : SDK PS5 Payload v0.24.1\n \n \nwebsrv 0.18 : \n \n- rebuild avec le dernier SDK\n- éviter d'utiliser la mémoire partagée\n- retroarch : modifier les drapeaux et les paramètres du compilateur\n- retroarch : construire un noyau commodore amiga\n \n \nTéléchargement : websrv 0.18\n \n \nEt de nombreux plugins ont été remis à jour grâce au dernier SDK : \n \n \n \nFtpsrv 0.11.1 : \n \nhttp://github.com/ps5-payload-dev/ftpsrv/releases\n \nShsrv 0.13 : \n \nhttp://github.com/ps5-payload-dev/shsrv/releases\n \nKlogsrv 0.5.1 :\n \nhttp://github.com/ps5-payload-dev/klogsrv/releases\n \nGdbsrv 0.5 :\n \nhttp://github.com/ps5-payload-dev/gdbsrv/releases\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202434/in-ps5-john-tornblom-travaille-dur-pour-proposer-de-nouveaux-plugins-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS4/PS5] FetchPKG v0.3 disponible",
        "content": "Le développeur John Tornblom dévoile une nouvelle version de FetchPKG, ce programme permet notamment de construire des PKG pour PlayStation 4 et PlayStation 5. \n \nPour rappel il s'agit d'un outil simple basé sur cURL ( https://curl.se/ ) pour télécharger les mises à jour officielles des jeux Sony Playstation 4 et 5, et ainsi créer très simplement un fichier PKG. \n \nFetchPKG est disponible pour GNU/Linux, Windows (64bit), et les PS5 jailbreakées. Les mises à jour de jeux qui sont réparties sur plusieurs fichiers sont fusionnées automatiquement pendant le téléchargement. Si vous êtes derrière un pare-feu, vous pouvez télécharger les mises à jour via un serveur proxy, ce qui est pratique lorsque vous utilisez une PS5 jailbreakée qui est protégée d'internet.\n \nPour exécuter Fetchpkg sur PS5, vous devez le charger avec un loader ELF qui fournit une interface de ligne de commande, par exemple, shsrv, et les moyens de transférer l'ELF vers la ps5, par exemple, ftpsrv. Il vous faudra lancer les commandes qui téléchargeront le fichier ELF dans /data, qui se connecteront à shsrv et qui téléchargeront un fichier pkg dans /mnt/usb0 via un serveur proxy.\n \n \n\n \n \n \nCette nouvelle version v0.3 introduit des améliorations significatives, comme la possibilité de créer des cibles Windows avec la prise en charge de fichiers volumineux, et aussi une fonctionnalité permettant de vérifier les valeurs de hashs des fichiers téléchargés, cela permet notamment de garantir une plus grande fiabilité des opérations. \n \nSi, lors de l'utilisation de FetchPKG vous subissez un bug, vous pouvez désormais ouvrir un ticket sur le Github spécifiquement déployé pour l'occasion. \n \n \nChangelog v0.3 :\n \n- Construire des cibles Windows avec prise en charge de fichiers volumineux\n- Vérifier les valeurs de hashs des fichiers téléchargés\n \n \nTéléchargement : FetchPKG v0.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202428/in-ps4ps5-fetchpkg-v03-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[PS5] elfldr 0.17 et pacbrew 0.18 disponibles",
        "content": "Alors que nous avons la confirmation que les ventes de PS5 sont juste énormissimes, avec 4.1 M de ventes pour le mois de novembre, du simple au triple entre la partie Sony et la partie Microsoft au niveau mondial. \n \nVoici les ventes sur Novembre 2024 ainsi que les ventes totales : \n \nPlayStation 5 - 4,120,898 (67,698,724)\nSwitch - 1,715,636 (146,041,084)\nXbox Series X|S - 767,118 (31,208,651)\nPlayStation 4 - 4,118 (117,194,908)\n \n \nAu total, 67 Millions de PS5 contre 31 Millions de Xbox Series X/S ont été vendues depuis leur lancement, la Switch se vend encore très bien, avec 146 Millions de consoles vendues au total depuis son lancement. \n \n \n\n \n \nVoilà que débarque de la nouveauté pour PS5, avec la disponibilité de nouvelles propositions de John Tornblom qui dévoile la version 0.17 de elfldr, et la version 0.18 de pacbrew. \n \n \nElfldr 0.17 :\n \n- correction sur l'utilisation de la mémoire partagée \n \nPacbrew 0.18 :\n \n- Correction de la compilation sur les hôsts aarch64\n- Reconstruit avec le dernier SDK \n- Modification initiale de lz4 \n \n \nTéléchargement : elfldr 0.17 / pacbrew 0.18\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202412/in-ps5-elfldr-017-et-pacbrew-018-disponibles-1.png"
        }
    },
    "news_10": {
        "title": "[Multi] LibRetro publie son premier article de 2025",
        "content": "L'équipe LibRetro vient de publier un nouvel article, le premier de 2025, et la team explique qu'elle dévoile un nouveau core PS2, et qu'elle propose un meilleur support des téléviseurs CRT. \n \nPrincipalement développé lors de l'époque des téléviseurs CRT, l'affichage de la PlayStation 2 s'appuie sur un balayage de lignes et une synchronisation plutôt que sur des pixels ou des résolutions. \n \n \n \n\n \n \nLe synthétiseur graphique de la PS2, limitée à 4 Mo de VRAM, est incapable de gérer les tampons plus élevés que le 640 x 480, et les développeurs ont du s'appuyer sur les coprocesseurs vectoriels pour maintenir une fréquence d'images stable (à 50 Hs en PAL et à 60 Hz en NTSC).\n \nLes TV CRT se sont améliorées en prenant en charge la norme EDTV, certains jeux PS2 ont donc commencé à prendre  en charge l'affichage 480p (balayage progressif). \n \nSi le sujet vous intéresse il est possible de le retrouver sur le site LibRetro. \n \n \n\n \n \n \nLe ticket de blog est disponible ici : LibRetro\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202399/in-multi-libretro-publie-son-premier-article-de-2025-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202399/in-multi-libretro-publie-son-premier-article-de-2025-1.jpg"
        }
    },
    "news_11": {
        "title": "[WiiU] Bloopair v1.0.2 disponible",
        "content": "Le développeur GaryOderNichts propose depuis quelques heures une nouvelle version de Bloopair qui est maintenant proposé en v1.0.2, pour rappel, il s'agit d'un homebrew qui donne le pouvoir d'utiliser divers contrôleurs Bluetooth directement sur la Wii U en tant que contrôleur Wii U Pro sans logiciel ou matériel supplémentaire. \n \nBloopair se charge de patcher temporairement le module IOS-PAD et s'assure qu'il accepte tous les contrôleurs Bluetooth. De plus, il convertit les requêtes HID reçues (boutons, etc.) en conséquence. Jusqu'à quatre contrôleurs peuvent être connectés, les vibrations et l'indicateur de batterie fonctionnent.\n \n \n\n \n \n\n \n \nDans cette nouvelle version, le développeur est venu corriger quelques bugs, améliorer certains supports, et améliorer la configuration dans Koopair. \n \n \nChangelog 1.0.2 :\n \n- Améliore le mappage Joy-Con par défaut.\n- Ajoute une prise en charge de base pour le contrôleur DualSense Edge.\n- Corrige un problème où Joy-Con ne pouvait pas être correctement remappé dans Koopair.\n- Corrige un problème où les configurations DualShock 4 ne pouvaient pas être appliquées à tous les contrôleurs de ce type.\n- Corrige un crash lors de la suppression de configurations dans Koopair.\n \nPour rappel Koopair permet de :\n \n- Tester les boutons et les sticks des manettes à l'aide du testeur de manettes intégré.\n- Editer et créer des mappings de contrôleurs.\n- Modifier les options des contrôleurs.\n- Gérer les configurations de manettes sauvegardées.\n- Appairer les manettes DualShock3 via USB. L'ancienne application d'appairage a été abandonnée et supprimée des versions en faveur de Koopair.\n- et bien plus encore dans un futur proche...\n \n \nTéléchargement : Bloopair v1.0.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202384/in-wiiu-bloopair-v102-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202384/in-wiiu-bloopair-v102-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[PS4] Remote Lua Loader 3.2 disponible",
        "content": "Le développeur Master-S dévoile une nouvelle version de Remote Lua Loader, il y a quelques jours il a en effet dévoilé la v3.1 puis ma 3.2 juste derrière. Comme vous le savez Remote Lua Loader est un script python déployé pour la PS4 et PS5 (et leur versions pro), permettant de charger des fichiers via l'utilisation de Lua dans les jeux construits autour du moteur Artemis. \n \nLe point d'entrée étant un jeu, ce loader ne dépend pas de la version du firmware installée, et fonctionne donc sur tous les firmwares, il a ainsi été testé avec succès sur le dernier firmware de la PS5 et de la PS5 Pro.\n \n \n \n\n \n \nLa version 3.1 a ajouté un nouveau  thread Lua et quelques petites améliorations, alors que la version 3.2 apporte la version PS_v3.1-1 du loader Lua. \n \n \nTéléchargement : Remote Lua Loader 3.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202381/in-ps4-remote-lua-loader-32-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[PS4] PlaySon 3.7.23 Beta disponible",
        "content": "Le développeur Sondio propose la version 3.7.23 de PlaySon, une application Android distribuée sous format APK afin de lancer le hack facilement sur PlayStation 4 sous tous les firmwares exploitables de la console. \n \n \n\n \n \n \n \nPrise en charge d'Android à partir de l'API 19, avec/sans accès root :\n \n- Serveur local\n- Expéditeur de la charge utile\n- Installer/mettre à jour les Pkg/Cheats/Patches\n- Affichage des paquets\n- Prise en charge du thème/Dlc/App/jeu pour l'installation/désinstallation/vérification\n- Modifier/sauvegarder/restaurer le nom/avatar du profil de l'utilisateur PS4\n- (avec root) Créer/Formater une clé USB avec goldhen.bin ou exfathax_pico.img\n- Activer/désactiver les patchs GoldHEN\n- Visionneuse de klog de GoldHEN\n- Supporte la dernière version de GoldHEN 2.4b18\n- Support de deux types de JB : \navec accès Root et adaptateur OTG-LAN -> exploit PPPwn et bloqueur DNS avec les derniers stage1 et stage2 (1.03 par SISTR0) pour :\nFW 7.00 / 7.01 / 7.02\nFW 7.50 / 7.51 / 7.55\nFW 8.00 / 8.01 / 8.03\nFW 8.50 / 8.52\nFW 9.00\nFW 9.03 / 9.04\nFW 9.50 / 9.51 / 9.60\nFW 10.00 / 10.01\nFW 10.50 / 10.70 / 10.71\nFW 11.00\n \nsans accès Root -> psfree uniquement (pour l'instant) :\nFW 9.00\n \nChangelog 03/01/2025 :\n \n- Ajout d'un outil de sauvegarde\n- Ajout de l'outil PS4 Errors DB\n- Ajout de GoldHEN 2.4b18.2\n- Refonte de la section Info\n- Optimisations mineures\n \nTéléchargement : PlaySon 3.7.23 Beta  (contre un café ou même gratuitement) \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202380/in-ps4-playson-3723-beta-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[Multi] La 38ème édition de la Chaos Communication Congress",
        "content": "Alors que nous avions pris pour habitude de profiter chaque année de la CCC, la Chaos Communication Congress (le congrès de communication du chaos) a été malmenée par le Covid.\n \n \n\n \n \nCette 38ème édition, appelée \" Illegal Instructions \" a été le retour aux sources, à savoir des conférences en physique, lors d'un évènement qui s'est déroulé à Hambourg du 27 au 30 décembre 2024. Il s'agissait de l'édition 2024 de la conférence annuelle de quatre jours sur la technologie, la société et l'utopie, organisée par le Chaos Computer Club (CCC) et des bénévoles. Le congrès a proposé des conférences, des ateliers et divers événements sur une multitude de sujets, notamment (mais pas uniquement) les technologies de l'information et, de manière générale, une attitude critique et créative à l'égard de la technologie et la discussion sur les effets des avancées technologiques sur la société.\n \n \n\n \n \nL'ensemble des vidéos et des interventions se trouvent ici : \n \nhttps://media.ccc.de/c/38c3\n \n \nCes vidéos sont l'occasion de cracker votre satellite, libéré le Wi-Fi sur un périphérique ESP32, ou encore de découvrir les attaques de prise de contrôles à distance des nouveaux iPhone. Malgré la présence de certains développeurs comme ceux de Mikage, il n'y pas eu de discussions sur le hack console. \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202378/in-multi-la-38eme-edition-de-la-chaos-communication-congress-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202378/in-multi-la-38eme-edition-de-la-chaos-communication-congress-1.jpg"
        }
    },
    "news_15": {
        "title": "[3DS] Mikage Developer Edition sur GitHub",
        "content": " \nL'équipe en charge du développement de l'émulateur 3DS Mikage annonce un changement important dans leur plan de développement. L'équipe, représentée par le développeur Neobrain, vient d'annoncer la sortie de la version Mikage Developer Edition de leur émulateur.\n \n \n\n \n \nIl s'agit de la majorité du kernel de l'émulateur, capable d'exécuter de nombreux jeux et logiciels système, le premier objectif est de permettre d'améliorer rapidement le code déjà intégré, représenté par plus de 50 000 lignes de code C++ : \n \n- Un interpréteur ARM11 entièrement personnalisé\n- Emulation du GPU PICA200 alimentée par Vulkan\n- Emulation de haut niveau du noyau 3DS\n- Plus de 20 modules de service HLE\n- Une couche hyperviseur pour le débogage\n- Emulation TeakLite basée sur Teakra\n- Et bien plus encore\n \n \nL'idée est bien entendu que les développeurs puissent améliorer le code, ainsi cette version Developer Edition ne s'adresse pas à l'utilisateur lambda. Ainsi il n'est pas question de performances optimales, ni d'interface utilisateur ou des fonctionnalités instantanées. \n \nIl est demandé de ne pas publier cette Mikage Developer Edition comme une version standard, l'idée est d'améliorer le code, pas d'en faire une version grand public comme le précise l'annonce disponible ici : https://mikage.app/deved-announcement/\n \n \nTout est là : Mikage Developer Edition\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202377/in-3ds-mikage-developer-edition-sur-github-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS3] PyPS3tools mis à jour pour la nouvelle année",
        "content": "Notre ami sunriseur et développeur littlebalup a mis à jour son outil PyPS3tools afin qu'ils supportent les hashs des derniers customs firmware ainsi que pour un nettoyage du code.\n \nCe script regroupe des outils python pour analyser les dumps de mémoire flash de PS3. A noter que PS3 Dump Checker qui est un utilitaire de downgrade de PS3 développé à l'origine par Swizzy, permettant de checker et vérifier les dumps NAND ou NOR n'a pas été mis à jour. \n \n \n \n\n \n \n \nChangelog PyPS3tools : \n- Ajout des hashes Evilnat 4.91.2 \n- Ajout du support du CFW Evilnat 4.91.2 Bêta CEX\n- Correctifs mineurs\n- Nettoyage général, et corrections sur le script py3\n \n \nNota Bene : \n- Personne ne pourra être tenu responsable pour tout faux négatif ou faux positif donné par cette application. La responsabilité de la validité des dumps est la votre, et uniquement la vôtre, pas celle de littlebalup, ou encore Logic-Sunrise.\n- Cet outil doit être considéré comme un moyen facile de faire une vérification rapide afin de voir s'il est nécessaire d'approfondir les recherches.\n- Merci de faire remonter tout éventuel bug, faux négatif ou faux positif à littlebalup afin de lui permettre d'améliorer ces applications.\n \n \nTéléchargement : PyPS3tools\n \nMerci Littlebalup\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202374/in-ps3-pyps3tools-mis-a-jour-pour-la-nouvelle-annee-1.png"
        }
    },
    "news_17": {
        "title": "[Multi] RetroArch v1.20.0 disponible",
        "content": "La première mise à jour de 2025 pour RetroArch vient d'être publiée et est disponible au téléchargement, il s'agit de la version 1.20.0 qui apporte de nombreuses corrections et évolutions de l'émulateur multi plateformes. \n \nLa gestion audio a été corrigée, mais aussi la saisie, l'interface utilisateur, la synchronisation cloud, ou encore la prise en charge de plateformes spécifiques comme la PS2, macOS ou TVOS qui ont vu des correctifs spécifiques. \n \n \n\n \n\n \nAUDIO: Fix audio handling in case of RARCH_NETPLAY_CTL_USE_CORE_PACKET_INTERFACE\nAUDIO: Include missing audio filters on some platforms\nAUDIO/PIPEWIRE: Add PipeWire audio driver\nAUDIO/PIPEWIRE: Add PipeWire microphone driver\nAPPLE: Hide threaded video setting\nAPPLE: Use mfi joypad driver by default\nAPPLE: Include holani, noods, mrboom, yabause, bsnes-jg core in App Store builds\nCHEEVOS: Add rarity and points to achievement unlock widget\nCHEEVOS: Add rank to leaderboard submission notification\nCHEEVOS: Update to rcheevos 11.5\nCHEEVOS: Update to rcheevos 11.6\nCHEEVOS: Show rcheevos game image in Discord rich presence\nCHEEVOS: Use translated strings for achievement messages\nCLOUDSYNC: Allow saves and configs to be synced optionally\nCLOUDSYNC: Add iCloud cloud sync driver\nCLOUDSYNC: Speed up by upload/download in parallel\nCLOUDSYNC: Allow thumbnails and system dir to be synced optionally\nCLOUDSYNC: Enable CloudSync on Android (non-SSL)\nCLOUDSYNC: Add more logs in failure situations\nCLOUDSYNC: Fixes for reauthentication and parallel sync\nCLOUDSYNC: Fixes for file resurrection\nCLOUDSYNC: Enable CloudSync on Windows\nCRT/SWITCHRES: Update switchres to 2.2.1\nGENERAL: Support for mbedtls v3\nGENERAL: Automatic Frame Delay refactor\nGENERAL: Remove Frame Rest, obsoleted by Frame Delay refactor\nGENERAL: Wrap around auto increment save state indexes when amount of states is limited\nGENERAL: Enable CHD hashing for Switch and DOS\nGENERAL: Enable auto save state when new content is loaded\nGENERAL: Improve Preemptive Frames when pointing device is used\nGENERAL: Fix building with menu disabled\nHAIKU: Restore Haiku build\nINPUT: Allow to select a preferred/reserved device for each player\nINPUT: Enable Caps, Num, Scroll Lock modifiers on multiple platforms\nINPUT: Autoconfig extension with alternative name/vid/pid\nINPUT: Fix autoconfig profile saving when device is not in the default port\nINPUT: Change classic turbo mode to work independently of which key was pressed first\nINPUT: Pointer and lightgun handling sanitization on Windows and Linux desktop platforms. These input drivers will now report edge and offscreen positions in a harmonized way, and will not return 0 instead.\nINPUT/DINPUT: Fix detection of quick shift key presses\nINPUT/HID: Fix crash on macOS when disconnecting the controller a second time\nINPUT/LINUX: Add illuminance sensor support to the linuxraw, sdl2, udev, and x11 input drivers\nINPUT/Remaps: Sort and apply remaps based on the specific connected controller\nINPUT/UDEV: Enable mouse buttons 4 and 5\nINPUT/WAYLAND: Enable horizontal scroll and mouse buttons 4 and 5\nINPUT/WAYLAND: Simulate lightgun input for cores\nINPUT/WAYLAND: Support for cursor-shape-v1 and content-type-v1 protocol\nINPUT/X11: Enable mouse buttons 4 and 5\niOS: Enable vibration by default\niOS: Better handling of physical mice/magic keyboard trackpad\niOS: Mouse grab fixes\niOS: Fix mouse cursor movement when button is held down\niOS: Fix microphone support request and entitlement\niOS: Enable compilation back to iOS 12\niOS: Fix OpenGL ES context usage on iOS 9\niOS/TVOS: Add Opera to App Store build\niOS/TVOS: Bring NEON defines in line with ARM64\niOS/TVOS: Flush save files on backgrounding\nLIBRETRO: Support RETRO_ENVIRONMENT_GET_FILE_BROWSER_START_DIRECTORY\nLIBRETRO: Support \"/\" as a file extension for loading a directory as content\nFFMPEG: Fix crash when playing back a file with 96 kHz audio\nMACOS: New display server, including support for ProMotion 120Hz V-Sync\nMACOS: Create App Store build\nMACOS: Generate key up events for command keys\nMIDI: Fix long messages (SysEx) in WinMM driver\nMIDI: Fix lingering notes on close in Alsa driver\nMENU: Support local thumbnails in other image formats than png (jpg/jpeg, bmp, tga)\nMENU: Delete also savestate thumbnails when savestates are garbage collected\nMENU: Option to disable analog stick menu navigation\nMENU: Fix pause toggle to not clear fast forward state\nMENU: Fix search playlist index in XMB/Ozone\nMENU: Fix renamed entry display\nMENU: Filter unknown extensions also inside zip files\nMENU: Add icons for present / missing firmware on core info page\nMENU: Ignore other hotkeys when menu toggle is pressed\nMENU: Fix menu jumping when using L3+R3 combo\nMENU: System Information now only shows features relevant for the platform\nMENU/GLUI: Make Show Sublabels options effective\nMENU/GLUI: Icon fixes\nMENU/XMB: Allow playlist icons to be individually customized, by looking for images in Named_Logos\nMENU/OZONE: Add Selenium theme for Ozone\nMENU/OZONE: Touchscreen improvements\nMENU/OZONE: Add a touch-sensitive Resume button in the lower right corner\nNETPLAY: Add East Asian relay server\nOVERLAY: Add option to load overlay based on system name\nPS2: Fix several broken cores depending on pthread\nQT: Enable building with Qt6\nQT: Fix input panel\nRECORDING: New WAV recording driver (audio only)\nREMOTE RETROPAD: Add gyro/acceleration/light sensor test screen\nREMOTE RETROPAD: Add pointer test screen\nREPLAY: Replay format extended to support external tools\nTVOS: Support bluetooth keyboards on tvOS\nTVOS: Fixes to run correctly on TVOS13\nTVOS: Better handling of Siri remote\nTVOS: WebDAV server for adding files more easily\nTVOS: Add Settings.app option to reset retroarch.cfg\nTVOS: Bring minimum tvos version down to 13.0\nVIDEO: Show and use exact refresh rate (3 decimals) and interlace/doublestrike where available\nVIDEO: Allow setting viewport bias to offset viewport horizontally/vertically\nVIDEO: Support viewport bias also with integer overscale and custom aspect ratios\nVIDEO: Use shader path from CLI for shader cycling\nVIDEO: Pixel perfect integer scaling improvements: axis options, smart mode\nVIDEO: Add upscale 1.66x filter\nVIDEO/D3D: Fix GPU screenshots\nVIDEO/KMS: Force fullscreen when KMS is used\nVIDEO/OpenGLES: Improve version directive granularity\nVIDEO/SHADERS: Fix memory leak when shader parameter step is 0.0\nVIDEO/SHADERS: Add 2 uniforms, OriginalAspect and OriginalAspectRot.\nVIDEO/SHADERS: Add CoreFPS and FrameTimeDelta uniforms.\nVIDEO/SLANG: Support optional includes\nVIDEO/VULKAN: Fix Vulkan window freezes when swapchain becomes suboptimal\nVIDEO/VULKAN: Prefer IMMEDIATE mode without vsync\nVIDEO/X11: Support inhibit of Xss screensaver\nVITA: Enable analog L2/R2 triggers when a DS3 controller is used with PS Vita\nWAYLAND: Fix segfault when relative pointer is not supported\nWAYLAND: Use reverse DNS name for desktop file and icon\nWAYLAND: Commit viewport resizes for more responsive display when resizing window\nWINDOWS: Fix restart if path to executable contains non-ASCII symbols\nWINDOWS: Hide directories starting with $ from file browser\n \n \n\n \n\n \n \nTéléchargement : RetroArch 1.20.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202373/in-multi-retroarch-v1200-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[Multi] Atari présente sa nouvelle console portable : GameStation Go",
        "content": "A quelques jours du CES, Atari vient de présenter sa toute nouvelle console portable, la GameStation Go. La console a été préparée avec MyArcade, et elle représente une évolution par rapport au modèle Pro lancé le 17 novembre 2023, bénéficiant d'une catalogue élargi par rapport au répertoire classique d'Atari.\n \nLe design de la GameStation Go se rapproche de celle d'une Nintendo Switch Lite, elle bénéficie non seulement d'un format portable, mais aussi d'une carte micro-SD qui rendra l'appareil polyvalent, avec notamment les jeux modernes et les classiques (rappelons que la gamme Pro bénéficie d'environ 200 jeux issus des Atari 2600, 5200, 7800, et de l'Arcade). \n \n \n\n \n \nAtari a incorporé des éléments uniques tels qu'un pavé numérique stratégiquement situé sous les boutons A, B, X, Y. La console comprend également des fonctionnalités modernes telles que les déclencheurs R1, R2 et L1, L2, complété par un trackball qui vous permettra de profiter des classiques Atari tels qu'ils ont été conçus à l'origine. L'inclusion de deux ports USB-C pour des contrôleurs supplémentaires, d'une sortie HDMI pour jouer sur des écrans externes (ou TV) et d'une prise casque démontre l'engagement d'Atari en faveur de la polyvalence.\n \n \n \n\n \n \nPour le moment, les spécifications finales ne sont pas annoncées, mais il se pourrait que cette nouvelle console soit proposée autour des 120 à 130 euros, ce qui est plutôt un bon positionnement tarifaire, surtout s'il est possible de facilement intégrer d'autres jeux, des émulateurs ou du hack. Il reste de nombreuses interrogations, quelle capacité de batterie, quel type d'écran, quels sont les jeux intégrés, à quoi pourra servir ce microSD... plus que quelques jours à patienter, le CES ouvre ses portes le 07 janvier 2025.\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202357/in-multi-atari-presente-sa-nouvelle-console-portable-gamestation-go-1.png"
        }
    },
    "news_19": {
        "title": "[3DS/Wii/NDS/Switch] ftpsrv v1.2.1 de TotalJustice disponible",
        "content": "Il y a un peu moins d'un mois, le développeur TotalJustice dévoilait ftpsrv un nouveau serveur FTP ultra léger, simple et rapide, écrit en langage C pour certaines consoles Nintendo comme la Wii, 3DS, DS ou encore la Switch. \n \nDéveloppé pour apprendre le protocole FTP, et afin de proposer un serveur avec une faible utilisation de la mémoire, ftpsrv ne s'appuie sur aucune allocation dynamique, tout en gardant une grande capacité de configuration avec le fichier config.ini modifiable. \n \n \n\n \n \nftpsrv a largement évolué sur décembre 2024, les versions se sont enchaînées, il a proposé la v1.10, puis il y a quelques jours la v1.2.0, et voilà que débarque déjà la v1.2.1. Faisons un petit tour des nouveautés. \n \n \nSwitch : \n- Permettre des options de construction par vfs, ajout d'un flux de travail de commutation.\n- Correction d'un bug potentiel d'oob lors du casting de vfs\n \n- Ajout d'une option pour utiliser l'heure locale au lieu de l'heure GMT, voir config.ini.template pour plus de détails.\n- Ajout de la possibilité de définir des configurations par application / sys, voir config.ini.template pour plus de détails.\n \n- Ajout de commandes personnalisées, la liste complète est ici https://github.com/ITotalJustice/ftpsrv/wiki/Nx---Custom-Commands. \n- Ajout de l'horodatage pour la sauvegarde des zips.\n- Amélioration de la latence de la réponse ftp en envoyant la réponse immédiatement, ce qui permet d'économiser un appel à poll().\n- Correction de la construction de la version de l'application, ceci était dû à l'installation d'anciennes librairies avant qu'elles ne soient fusionnées dans dkp.\n \n \nTéléchargement : ftpsrv v1.2.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202349/in-3dswiindsswitch-ftpsrv-v121-de-totaljustice-disponible-1.jpg"
        }
    },
    "news_20": {
        "title": "[3DS] Des démos techniques de Nintendo présentées lors de l'E3 2010 dévoilées",
        "content": "Un groupe portant le nom de CodeBound vient de dévoiler les démos techniques, les codes sources, et tout un tas de documents de présentation de Nintendo qui ont été présentés lors de l'E3 par Nintendo pour sa console 3DS comme nous en informe Gbatemp.net.\n \n \n\n \n \nUn morceau de l'histoire qui est dévoilé 15 ans après l'évènement, ce sont pas moins de 12 démos prototypes de Nintendo pour la 3DS qui viennent d'être dévoilées et disponibles au téléchargement. \n \nCe sont pour la plupart des démos techniques présentées lors de l'E3 mais aussi certaines applications de débogage inédites. \n \n \n\n \n \nLors de l'E3 2010, Nintendo a dévoilé la Nintendo 3DS, présentant la console elle-même avec un certain nombre de jeux jouables, des démonstrations en direct, des vidéos et des démonstrations techniques qui présentaient l'effet 3D stéréoscopique sur la petite console portable. Des jeux tels que Nintendogs + Cats , Pilotwings Resort et Star Fox 64 3D ont attiré les regards, mais des vidéos et des démonstrations de jeux tels que Kid Icarus : Uprising , Mario Kart 3DS (plus tard rebaptisé Mario Kart 7 ) et Metal Gear Solid: Snake Eater 3D ont aussi suscité l'intérêt. Parallèlement à cela, huit courtes démonstrations techniques ont été présentées lors de l'événement pour vraiment montrer les capacités 3D de la console portable. Deux de ces démonstrations techniques, Face Ace et Target Shooting , deviendront plus tard des logiciels intégrés à la Nintendo 3DS, leurs noms étant changés en Face Raiders et AR Games . \n \n \n \n\n \n \n \nTout cela s'est finalement perdu sur ces démos techniques, Nintendo encadrant fortement la presse et les possibilités offertes lors de l'E3 pour les journalistes  à faire intégralement leur travail. \n \nIl aura donc fallu attendre très longtemps avant de pouvoir profiter des démos techniques : \n \n4e48434b - NHCK - Tech Demo: 3D Paddleball (June 3 2010 15:19:14)\n4e504644 - NPFD - Photo Dojo DX (June 7 2010 10:31:41)\n4e484f50 - NHOP - Tech Demo: 3D Hopper (June 7 2010 11:39:16)\n43464345 - NFCE - Tech Demo: Face Ace (June 8 2010 15:43:14, REV: 8659)\n4e535447 - NSTG - Tech Demo: Target Shooting (June 7 2010 10:49:00)\n4e545251 - NTRQ - 3D Challenge (July 6 2010 18:08:08 REV: 9362) \n43544150 - CTAP - Face Ace / 3D Challenge (July 7 2010 12:09:33, REV: 9410)\n00000000 - CTAP - Face Ace / 3D Challenge (July 12 2010 08:37:31, REV: 9543)\n48494433 - HID3 - 3DS Testing Tool\n4e43414d - NCAM - Camera Demo (May 28 2010)\n43564743 - CVGC - Shader Test\n4f43434c - OCCL - Shader Test\n \n \nTout est là : x.com/_codebound_\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202348/in-3ds-des-demos-techniques-de-nintendo-presentees-lors-de-le3-2010-devoilees-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202348/in-3ds-des-demos-techniques-de-nintendo-presentees-lors-de-le3-2010-devoilees-2.jpg"
        }
    }
}