{
    "news_1": {
        "title": "[3DS] Mikage Developer Edition sur GitHub",
        "content": " \nL'équipe en charge du développement de l'émulateur 3DS Mikage annonce un changement important dans leur plan de développement. L'équipe, représentée par le développeur Neobrain, vient d'annoncer la sortie de la version Mikage Developer Edition de leur émulateur.\n \n \n\n \n \nIl s'agit de la majorité du kernel de l'émulateur, capable d'exécuter de nombreux jeux et logiciels système, le premier objectif est de permettre d'améliorer rapidement le code déjà intégré, représenté par plus de 50 000 lignes de code C++ : \n \n- Un interpréteur ARM11 entièrement personnalisé\n- Emulation du GPU PICA200 alimentée par Vulkan\n- Emulation de haut niveau du noyau 3DS\n- Plus de 20 modules de service HLE\n- Une couche hyperviseur pour le débogage\n- Emulation TeakLite basée sur Teakra\n- Et bien plus encore\n \n \nL'idée est bien entendu que les développeurs puissent améliorer le code, ainsi cette version Developer Edition ne s'adresse pas à l'utilisateur lambda. Ainsi il n'est pas question de performances optimales, ni d'interface utilisateur ou des fonctionnalités instantanées. \n \nIl est demandé de ne pas publier cette Mikage Developer Edition comme une version standard, l'idée est d'améliorer le code, pas d'en faire une version grand public comme le précise l'annonce disponible ici : https://mikage.app/deved-announcement/\n \n \nTout est là : Mikage Developer Edition\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202377/in-3ds-mikage-developer-edition-sur-github-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS3] PyPS3tools mis à jour pour la nouvelle année",
        "content": "Notre ami sunriseur et développeur littlebalup a mis à jour son outil PyPS3tools afin qu'ils supportent les hashs des derniers customs firmware ainsi que pour un nettoyage du code.\n \nCe script regroupe des outils python pour analyser les dumps de mémoire flash de PS3. A noter que PS3 Dump Checker qui est un utilitaire de downgrade de PS3 développé à l'origine par Swizzy, permettant de checker et vérifier les dumps NAND ou NOR n'a pas été mis à jour. \n \n \n \n\n \n \n \nChangelog PyPS3tools : \n- Ajout des hashes Evilnat 4.91.2 \n- Ajout du support du CFW Evilnat 4.91.2 Bêta CEX\n- Correctifs mineurs\n- Nettoyage général, et corrections sur le script py3\n \n \nNota Bene : \n- Personne ne pourra être tenu responsable pour tout faux négatif ou faux positif donné par cette application. La responsabilité de la validité des dumps est la votre, et uniquement la vôtre, pas celle de littlebalup, ou encore Logic-Sunrise.\n- Cet outil doit être considéré comme un moyen facile de faire une vérification rapide afin de voir s'il est nécessaire d'approfondir les recherches.\n- Merci de faire remonter tout éventuel bug, faux négatif ou faux positif à littlebalup afin de lui permettre d'améliorer ces applications.\n \n \nTéléchargement : PyPS3tools\n \nMerci Littlebalup\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202374/in-ps3-pyps3tools-mis-a-jour-pour-la-nouvelle-annee-1.png"
        }
    },
    "news_3": {
        "title": "[Multi] RetroArch v1.20.0 disponible",
        "content": "La première mise à jour de 2025 pour RetroArch vient d'être publiée et est disponible au téléchargement, il s'agit de la version 1.20.0 qui apporte de nombreuses corrections et évolutions de l'émulateur multi plateformes. \n \nLa gestion audio a été corrigée, mais aussi la saisie, l'interface utilisateur, la synchronisation cloud, ou encore la prise en charge de plateformes spécifiques comme la PS2, macOS ou TVOS qui ont vu des correctifs spécifiques. \n \n \n\n \n\n \nAUDIO: Fix audio handling in case of RARCH_NETPLAY_CTL_USE_CORE_PACKET_INTERFACE\nAUDIO: Include missing audio filters on some platforms\nAUDIO/PIPEWIRE: Add PipeWire audio driver\nAUDIO/PIPEWIRE: Add PipeWire microphone driver\nAPPLE: Hide threaded video setting\nAPPLE: Use mfi joypad driver by default\nAPPLE: Include holani, noods, mrboom, yabause, bsnes-jg core in App Store builds\nCHEEVOS: Add rarity and points to achievement unlock widget\nCHEEVOS: Add rank to leaderboard submission notification\nCHEEVOS: Update to rcheevos 11.5\nCHEEVOS: Update to rcheevos 11.6\nCHEEVOS: Show rcheevos game image in Discord rich presence\nCHEEVOS: Use translated strings for achievement messages\nCLOUDSYNC: Allow saves and configs to be synced optionally\nCLOUDSYNC: Add iCloud cloud sync driver\nCLOUDSYNC: Speed up by upload/download in parallel\nCLOUDSYNC: Allow thumbnails and system dir to be synced optionally\nCLOUDSYNC: Enable CloudSync on Android (non-SSL)\nCLOUDSYNC: Add more logs in failure situations\nCLOUDSYNC: Fixes for reauthentication and parallel sync\nCLOUDSYNC: Fixes for file resurrection\nCLOUDSYNC: Enable CloudSync on Windows\nCRT/SWITCHRES: Update switchres to 2.2.1\nGENERAL: Support for mbedtls v3\nGENERAL: Automatic Frame Delay refactor\nGENERAL: Remove Frame Rest, obsoleted by Frame Delay refactor\nGENERAL: Wrap around auto increment save state indexes when amount of states is limited\nGENERAL: Enable CHD hashing for Switch and DOS\nGENERAL: Enable auto save state when new content is loaded\nGENERAL: Improve Preemptive Frames when pointing device is used\nGENERAL: Fix building with menu disabled\nHAIKU: Restore Haiku build\nINPUT: Allow to select a preferred/reserved device for each player\nINPUT: Enable Caps, Num, Scroll Lock modifiers on multiple platforms\nINPUT: Autoconfig extension with alternative name/vid/pid\nINPUT: Fix autoconfig profile saving when device is not in the default port\nINPUT: Change classic turbo mode to work independently of which key was pressed first\nINPUT: Pointer and lightgun handling sanitization on Windows and Linux desktop platforms. These input drivers will now report edge and offscreen positions in a harmonized way, and will not return 0 instead.\nINPUT/DINPUT: Fix detection of quick shift key presses\nINPUT/HID: Fix crash on macOS when disconnecting the controller a second time\nINPUT/LINUX: Add illuminance sensor support to the linuxraw, sdl2, udev, and x11 input drivers\nINPUT/Remaps: Sort and apply remaps based on the specific connected controller\nINPUT/UDEV: Enable mouse buttons 4 and 5\nINPUT/WAYLAND: Enable horizontal scroll and mouse buttons 4 and 5\nINPUT/WAYLAND: Simulate lightgun input for cores\nINPUT/WAYLAND: Support for cursor-shape-v1 and content-type-v1 protocol\nINPUT/X11: Enable mouse buttons 4 and 5\niOS: Enable vibration by default\niOS: Better handling of physical mice/magic keyboard trackpad\niOS: Mouse grab fixes\niOS: Fix mouse cursor movement when button is held down\niOS: Fix microphone support request and entitlement\niOS: Enable compilation back to iOS 12\niOS: Fix OpenGL ES context usage on iOS 9\niOS/TVOS: Add Opera to App Store build\niOS/TVOS: Bring NEON defines in line with ARM64\niOS/TVOS: Flush save files on backgrounding\nLIBRETRO: Support RETRO_ENVIRONMENT_GET_FILE_BROWSER_START_DIRECTORY\nLIBRETRO: Support \"/\" as a file extension for loading a directory as content\nFFMPEG: Fix crash when playing back a file with 96 kHz audio\nMACOS: New display server, including support for ProMotion 120Hz V-Sync\nMACOS: Create App Store build\nMACOS: Generate key up events for command keys\nMIDI: Fix long messages (SysEx) in WinMM driver\nMIDI: Fix lingering notes on close in Alsa driver\nMENU: Support local thumbnails in other image formats than png (jpg/jpeg, bmp, tga)\nMENU: Delete also savestate thumbnails when savestates are garbage collected\nMENU: Option to disable analog stick menu navigation\nMENU: Fix pause toggle to not clear fast forward state\nMENU: Fix search playlist index in XMB/Ozone\nMENU: Fix renamed entry display\nMENU: Filter unknown extensions also inside zip files\nMENU: Add icons for present / missing firmware on core info page\nMENU: Ignore other hotkeys when menu toggle is pressed\nMENU: Fix menu jumping when using L3+R3 combo\nMENU: System Information now only shows features relevant for the platform\nMENU/GLUI: Make Show Sublabels options effective\nMENU/GLUI: Icon fixes\nMENU/XMB: Allow playlist icons to be individually customized, by looking for images in Named_Logos\nMENU/OZONE: Add Selenium theme for Ozone\nMENU/OZONE: Touchscreen improvements\nMENU/OZONE: Add a touch-sensitive Resume button in the lower right corner\nNETPLAY: Add East Asian relay server\nOVERLAY: Add option to load overlay based on system name\nPS2: Fix several broken cores depending on pthread\nQT: Enable building with Qt6\nQT: Fix input panel\nRECORDING: New WAV recording driver (audio only)\nREMOTE RETROPAD: Add gyro/acceleration/light sensor test screen\nREMOTE RETROPAD: Add pointer test screen\nREPLAY: Replay format extended to support external tools\nTVOS: Support bluetooth keyboards on tvOS\nTVOS: Fixes to run correctly on TVOS13\nTVOS: Better handling of Siri remote\nTVOS: WebDAV server for adding files more easily\nTVOS: Add Settings.app option to reset retroarch.cfg\nTVOS: Bring minimum tvos version down to 13.0\nVIDEO: Show and use exact refresh rate (3 decimals) and interlace/doublestrike where available\nVIDEO: Allow setting viewport bias to offset viewport horizontally/vertically\nVIDEO: Support viewport bias also with integer overscale and custom aspect ratios\nVIDEO: Use shader path from CLI for shader cycling\nVIDEO: Pixel perfect integer scaling improvements: axis options, smart mode\nVIDEO: Add upscale 1.66x filter\nVIDEO/D3D: Fix GPU screenshots\nVIDEO/KMS: Force fullscreen when KMS is used\nVIDEO/OpenGLES: Improve version directive granularity\nVIDEO/SHADERS: Fix memory leak when shader parameter step is 0.0\nVIDEO/SHADERS: Add 2 uniforms, OriginalAspect and OriginalAspectRot.\nVIDEO/SHADERS: Add CoreFPS and FrameTimeDelta uniforms.\nVIDEO/SLANG: Support optional includes\nVIDEO/VULKAN: Fix Vulkan window freezes when swapchain becomes suboptimal\nVIDEO/VULKAN: Prefer IMMEDIATE mode without vsync\nVIDEO/X11: Support inhibit of Xss screensaver\nVITA: Enable analog L2/R2 triggers when a DS3 controller is used with PS Vita\nWAYLAND: Fix segfault when relative pointer is not supported\nWAYLAND: Use reverse DNS name for desktop file and icon\nWAYLAND: Commit viewport resizes for more responsive display when resizing window\nWINDOWS: Fix restart if path to executable contains non-ASCII symbols\nWINDOWS: Hide directories starting with $ from file browser\n \n \n\n \n\n \n \nTéléchargement : RetroArch 1.20.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202373/in-multi-retroarch-v1200-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[Multi] Atari présente sa nouvelle console portable : GameStation Go",
        "content": "A quelques jours du CES, Atari vient de présenter sa toute nouvelle console portable, la GameStation Go. La console a été préparée avec MyArcade, et elle représente une évolution par rapport au modèle Pro lancé le 17 novembre 2023, bénéficiant d'une catalogue élargi par rapport au répertoire classique d'Atari.\n \nLe design de la GameStation Go se rapproche de celle d'une Nintendo Switch Lite, elle bénéficie non seulement d'un format portable, mais aussi d'une carte micro-SD qui rendra l'appareil polyvalent, avec notamment les jeux modernes et les classiques (rappelons que la gamme Pro bénéficie d'environ 200 jeux issus des Atari 2600, 5200, 7800, et de l'Arcade). \n \n \n\n \n \nAtari a incorporé des éléments uniques tels qu'un pavé numérique stratégiquement situé sous les boutons A, B, X, Y. La console comprend également des fonctionnalités modernes telles que les déclencheurs R1, R2 et L1, L2, complété par un trackball qui vous permettra de profiter des classiques Atari tels qu'ils ont été conçus à l'origine. L'inclusion de deux ports USB-C pour des contrôleurs supplémentaires, d'une sortie HDMI pour jouer sur des écrans externes (ou TV) et d'une prise casque démontre l'engagement d'Atari en faveur de la polyvalence.\n \n \n \n\n \n \nPour le moment, les spécifications finales ne sont pas annoncées, mais il se pourrait que cette nouvelle console soit proposée autour des 120 à 130 euros, ce qui est plutôt un bon positionnement tarifaire, surtout s'il est possible de facilement intégrer d'autres jeux, des émulateurs ou du hack. Il reste de nombreuses interrogations, quelle capacité de batterie, quel type d'écran, quels sont les jeux intégrés, à quoi pourra servir ce microSD... plus que quelques jours à patienter, le CES ouvre ses portes le 07 janvier 2025.\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202357/in-multi-atari-presente-sa-nouvelle-console-portable-gamestation-go-1.png"
        }
    },
    "news_5": {
        "title": "[3DS/Wii/NDS/Switch] ftpsrv v1.2.1 de TotalJustice disponible",
        "content": "Il y a un peu moins d'un mois, le développeur TotalJustice dévoilait ftpsrv un nouveau serveur FTP ultra léger, simple et rapide, écrit en langage C pour certaines consoles Nintendo comme la Wii, 3DS, DS ou encore la Switch. \n \nDéveloppé pour apprendre le protocole FTP, et afin de proposer un serveur avec une faible utilisation de la mémoire, ftpsrv ne s'appuie sur aucune allocation dynamique, tout en gardant une grande capacité de configuration avec le fichier config.ini modifiable. \n \n \n\n \n \nftpsrv a largement évolué sur décembre 2024, les versions se sont enchaînées, il a proposé la v1.10, puis il y a quelques jours la v1.2.0, et voilà que débarque déjà la v1.2.1. Faisons un petit tour des nouveautés. \n \n \nSwitch : \n- Permettre des options de construction par vfs, ajout d'un flux de travail de commutation.\n- Correction d'un bug potentiel d'oob lors du casting de vfs\n \n- Ajout d'une option pour utiliser l'heure locale au lieu de l'heure GMT, voir config.ini.template pour plus de détails.\n- Ajout de la possibilité de définir des configurations par application / sys, voir config.ini.template pour plus de détails.\n \n- Ajout de commandes personnalisées, la liste complète est ici https://github.com/ITotalJustice/ftpsrv/wiki/Nx---Custom-Commands. \n- Ajout de l'horodatage pour la sauvegarde des zips.\n- Amélioration de la latence de la réponse ftp en envoyant la réponse immédiatement, ce qui permet d'économiser un appel à poll().\n- Correction de la construction de la version de l'application, ceci était dû à l'installation d'anciennes librairies avant qu'elles ne soient fusionnées dans dkp.\n \n \nTéléchargement : ftpsrv v1.2.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202349/in-3dswiindsswitch-ftpsrv-v121-de-totaljustice-disponible-1.jpg"
        }
    },
    "news_6": {
        "title": "[3DS] Des démos techniques de Nintendo présentées lors de l'E3 2010 dévoilées",
        "content": "Un groupe portant le nom de CodeBound vient de dévoiler les démos techniques, les codes sources, et tout un tas de documents de présentation de Nintendo qui ont été présentés lors de l'E3 par Nintendo pour sa console 3DS comme nous en informe Gbatemp.net.\n \n \n\n \n \nUn morceau de l'histoire qui est dévoilé 15 ans après l'évènement, ce sont pas moins de 12 démos prototypes de Nintendo pour la 3DS qui viennent d'être dévoilées et disponibles au téléchargement. \n \nCe sont pour la plupart des démos techniques présentées lors de l'E3 mais aussi certaines applications de débogage inédites. \n \n \n\n \n \nLors de l'E3 2010, Nintendo a dévoilé la Nintendo 3DS, présentant la console elle-même avec un certain nombre de jeux jouables, des démonstrations en direct, des vidéos et des démonstrations techniques qui présentaient l'effet 3D stéréoscopique sur la petite console portable. Des jeux tels que Nintendogs + Cats , Pilotwings Resort et Star Fox 64 3D ont attiré les regards, mais des vidéos et des démonstrations de jeux tels que Kid Icarus : Uprising , Mario Kart 3DS (plus tard rebaptisé Mario Kart 7 ) et Metal Gear Solid: Snake Eater 3D ont aussi suscité l'intérêt. Parallèlement à cela, huit courtes démonstrations techniques ont été présentées lors de l'événement pour vraiment montrer les capacités 3D de la console portable. Deux de ces démonstrations techniques, Face Ace et Target Shooting , deviendront plus tard des logiciels intégrés à la Nintendo 3DS, leurs noms étant changés en Face Raiders et AR Games . \n \n \n \n\n \n \n \nTout cela s'est finalement perdu sur ces démos techniques, Nintendo encadrant fortement la presse et les possibilités offertes lors de l'E3 pour les journalistes  à faire intégralement leur travail. \n \nIl aura donc fallu attendre très longtemps avant de pouvoir profiter des démos techniques : \n \n4e48434b - NHCK - Tech Demo: 3D Paddleball (June 3 2010 15:19:14)\n4e504644 - NPFD - Photo Dojo DX (June 7 2010 10:31:41)\n4e484f50 - NHOP - Tech Demo: 3D Hopper (June 7 2010 11:39:16)\n43464345 - NFCE - Tech Demo: Face Ace (June 8 2010 15:43:14, REV: 8659)\n4e535447 - NSTG - Tech Demo: Target Shooting (June 7 2010 10:49:00)\n4e545251 - NTRQ - 3D Challenge (July 6 2010 18:08:08 REV: 9362) \n43544150 - CTAP - Face Ace / 3D Challenge (July 7 2010 12:09:33, REV: 9410)\n00000000 - CTAP - Face Ace / 3D Challenge (July 12 2010 08:37:31, REV: 9543)\n48494433 - HID3 - 3DS Testing Tool\n4e43414d - NCAM - Camera Demo (May 28 2010)\n43564743 - CVGC - Shader Test\n4f43434c - OCCL - Shader Test\n \n \nTout est là : x.com/_codebound_\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202348/in-3ds-des-demos-techniques-de-nintendo-presentees-lors-de-le3-2010-devoilees-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202348/in-3ds-des-demos-techniques-de-nintendo-presentees-lors-de-le3-2010-devoilees-2.jpg"
        }
    },
    "news_7": {
        "title": "[Switch] Sys-con v1.5 disponible",
        "content": "Le développeur o0Zz a repris le développement de Sys-con proposé à l'origine par Cathery, ce nouveau fork a été réalisé pour ajouter le support de toutes les manettes compatibles PC (avec un profil HID). \n \nAvec Sys-Con vous profiter de ses fonctionnalités, telles que le support des joysticks et gamepads avec profil HID, la configuration des touches en fonction du VID/PID de la manette, la gestion de la deadzone et la personnalisation de la couleur des manettes. Le module Sys-Con permet d’utiliser des contrôleurs tiers sur votre console Nintendo Switch en connectant simplement vos manettes via les ports USB du dock ou via le port USB-C avec un adaptateur OTG.\n \n \n\n \n \n \nChangelog 1.5.0 :\n \n- Correction de la prise en charge de la DualShock 3 : Résolution d'une régression de la version 1.4.0 provoquant l'arrêt du fonctionnement des manettes DualShock 3. \n- Amélioration de la compatibilité avec les contrôleurs HID : Résolution des problèmes liés au mauvais fonctionnement de certaines manettes HID. \n- Suppression de la dépendance à Atmosphere : Suppression de la dépendance à Atmosphere pour éviter les problèmes de compatibilité avec les futures mises à jour du firmware. \n- Mise à jour des liaisons par défaut : Tous les contrôleurs ont maintenant Minus + D-Pad Up pour Home et Minus + D-Pad Down pour Capture par défaut.\n \n \nTéléchargement : Sys-con v1.5\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202327/in-switch-sys-con-v15-disponible-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS4/PS5] PlayStation 4 Save Mounter v1.3.1-ps5-r4 disponible",
        "content": " \nLe développeur idlesauce propose une nouvelle version de PlayStation 4 Save Mounter, c'est la quatrième version de Save Mounter taillée pour la PS5 alors que jusqu'à présent cet utilitaire était réservé aux utilisateurs de la PS4. \n \nPour rappel, il s'agit d'un outil proposé à l'origine par ChendoChap, un utilitaire d'édition est un assistant d'enregistrement. Vous pouvez créer, modifier, déchiffrer des sauvegardes de votre PlayStation, exactement comme un éditeur, pour par exemple pour gagner plus d'argent, des munitions ou augmenter les statistiques de vos personnages. \n \n \n\n \n \nIl subsiste quelques pré-requis pour utiliser Save Mounter et vous pouvez : \n \n- Faire des copies décryptées de vos sauvegardes\n- Remplacer les sauvegardes par des sauvegardes modifiées\n- Remplacer les fichiers de sauvegarde par les fichiers de sauvegarde de quelqu'un d'autre (partager les sauvegardes)\n- Créer de nouvelles sauvegardes\n- A noter qu'il n'est pas possible de remplacer les fichiers de sauvegarde par une sauvegarde cryptée, ni d'utiliser une console qui ne dispose pas d'un exploit\n \n \nv1.3.1-ps5-r4 :\n- Démontage de sauvegarde arbitraire\n- Destiné aux jeux qui montent une sauvegarde en lecture seule dans le menu (comme les jeux Artemis) afin que vous puissiez la remonter en tant que rw, bien sûr s'il essaie d'accéder à un fichier alors que la sauvegarde n'est pas montée, cela causerait des problèmes, non testé.\n- Patchs pour lister et monter les sauvegardes sce_\n- N'a pas été beaucoup testé, la configuration prend quelques secondes car elle corrige les bibliothèques avec une correspondance de modèle, pour permettre le montage de sce_sdmemory\n \n \nv1.3.1-ps5-r3 :\n- Ajout des offsets du firmware 4.50 (identique à 4.03, probablement identique pour tous les 4.xx) et 2.50\n \nTéléchargement : PlayStation 4 Save Mounter v1.3.1-ps5-r4\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202309/in-ps4ps5-playstation-4-save-mounter-v131-ps5-r4-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[Switch] NxFileViewer v3.0.1 disponible",
        "content": "Une nouvelle mise à jour de NxFileViewer vient d'apparaitre, il s'agit de la version 3.0.1 qui apporte pas mal de nouveautés, en quelques jours, son développeur Myster-Tee a su faire évoluer le soft.\n \nNxFileViewer est un logiciel PC qui vous permet de parcourir les fichiers NSP, NSZ, XCI et XCZ et ainsi afficher tout un tas d'informations et de vérifier s'ils disposent de signatures, et d'afficher les hashs.\n \n \n \n\n \n \n \nCréée par le développeur Myster-Tee, le logiciel permet donc de visualiser et de parcourir le contenu des fichiers qui seront déplacés vers votre console Nintendo Switch, à partir de cette version, il vous faudra disposer de 2 clés (prod.keys et title.keys) pour qu'il fonctionne correctement.\n \nVoici la douzième version de NxFileViewer : \n \n- console.keys supprimé des paramètres (pas nécessaire pour NxFileViewer)\n- Un nouveau paramètre a été ajouté pour charger les clés à partir des fichiers de tickets.\n- Possibilité de glisser-déposer les clés\n- Correction de l'injection des clés de tickets pour Sha256PartitionFileSystem (XCI) \n- Prise en charge de la version affichée {VerDsp} pour le renommage \n- Correction de quelques traductions mineures\n- Quelques changements mineurs\n \n \nTéléchargement : NxFileViewer v3.0.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202308/in-switch-nxfileviewer-v301-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[Vita] eCFW 6.61 Adrenaline 7.1.4 disponible",
        "content": "Le développeur isage vient de publier une mise à jour de l'eCFW 6.61 Adrenaline en v7.1.3, le plugin permettant de modifier l'émulateur interne PSP dans la PS Vita en utilisant taiHEN afin d'exécuter le custom firmware 6.61. Comme vous le savez le plugin Adrenaline injecte le code personnalisé dans l'IPL - Inital Program Loader - et ainsi lancer du code non signé dans la console lorsqu'elle s'allume.\n \nL'intérêt de cette version est d'apporter encore plus de stabilité en ne chargeant plus les plugins en mode recovery. Avec cette nouvelle version la prise en charge du téléchargement des mises à jour officielles des jeux au format EBOOT ou ISO a été intégré, à condition que le plugin npdrm_free soit utilisé pour les jeux au format EBOOT. \n \n \n\n \n \n \nIl existe d'autres évolutions comme la possibilité de configurer le lancement automatique des fichiers /PSP/GAME/EBOOT.PBP ou encore la mise à jour automatique de la version affichée dans LiveArea lors de l'utilisation de la mise à jour réseau.\n \nLa prise en charge de la journalisation des printfs PSP avec catlog permet là encore d'améliorer le développement via le débogage. A noter qu'il est préconisé d'installer d'abord la 7.1.2 puis de mettre à jour en 7.1.3.\n \nEdit 03.01.2025 \n \nTéléchargement : Adrenaline 7.1.4\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202306/in-vita-ecfw-661-adrenaline-713-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] La mise à jour de Byepervisor apporte de nouveaux correctifs",
        "content": "Le développeur Echo Stretch vient de déployer un correctif pour l'exploit Byerpervisor qui permet de rajouter le support du firmware 2.70.\n \n \nL'exploit Bypervisor s'appuie sur deux vulnérabilités, il intègre deux chaînes d'exploit totalement indépendante, l'une permet les exploits des tables, et l'autre l'exploit des QA flags.\n \nDans cette mise à jour l'exploit a été amélioré grâce à l'ajout de vérification supplémentaire sur les firmwares, et la correction du firmware 2.20. \n \n \n\n \n \nCela vient en plus des divers firmwares supportés : 1.00, 1.01, 1.02, 1.12, 1.14, 2.00, 2.20, 2.25, 2.26, 2.30, 2.50 et 2.70.\n \nDe nouveaux Shellcores sont nécessaires pour les 1.05, 1.10, 1.11 et 1.13.\n \nDans la toute dernière version, il a mis à jour PS5HEN en v1.1.\n \n \nTéléchargement : Byepervisor\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202305/in-ps5-la-mise-a-jour-de-byepervisor-apporte-de-nouveaux-correctifs-1.png"
        }
    },
    "news_12": {
        "title": "Bonne année 2025",
        "content": "L'année 2024 s'est achevée, et cette année encore a été une année difficile, bien entendu encore une fois notre objectif est le jeu vidéo et le hack, 2024 aura été l'année des grands bouleversements, Microsoft ayant abandonné la course à la puissance vis à vis de Sony, qui a sorti sa PS5 Pro.\n \nCôté Nintendo, on attend toujours la Switch, même si les prototypes ou les concepts semblent de plus en plus réalistes, analysés par des robots anti-ai pour vérifier que les images soient réelles ou pas, il semblerait que la Switch 2 pointe le bout de son nez d'ici la fin du premier trimestre 2025. \n \n \n\n \n \n \nQue peut-on se souhaiter pour 2025 ?\n \nComme l'année dernière, on aimerait de nouveaux hardwares, une nouvelle Switch (décidément) on l'attendait déjà l'année dernière pour rappel, mais quoi attendre des autres constructeurs, pas grand chose, Sony pourrait travailler sur une PlayStation Portable fort du succès du PlayStation Portal, mais pour le reste, à part des modèles slim, pas grand chose de nouveau avant 2027.\n \nPour le hack, une libération de la PS5 pourrait s'envisager, la scène a bien progressé ces dernières semaines, il reste encore à élargir le hack sur des firmwares plus récents, côté Microsoft, rien à en attendre, et pour Nintendo, c'est la Switch 2 qui désormais va cristalliser les esprits après son lancement. \n \n \nPassez toutes et tous une excellente année 2025, toute l'équipe de Logic-Sunrise.com vous souhaite : Bonne Année 2025 !\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202267/in-bonne-annee-2025-1.jpg"
        }
    },
    "news_13": {
        "title": "[Oldies] Gran Theft Auto III s'invite sur Dreamcast",
        "content": " \nGTA III sur Dreamcast, bien sûr, c'est en tout cas un projet qui semblait impossible, et bien non finalement il a bel et bien été porté sur la console de Sega. \n \nLe portage est basé sur le projet RE3, le rétro-portage gratuit de GTA 3, qui déjà est une véritable réussite à lui seul, mais son adaptation à la Dreamcast, là c'est encore une autre étape. Pour l'heure, il ne s'agit que d'une version Alpha, il peut donc y avoir certains bugs gênants ou plantages occasionnels. \n \n \n \n\n \n \nLe projet a pu prendre forme grâce à l'utilisation de KallistiOS, une bibliothèque de développement pour Dreamcast, le projet a prouvé, même s'il reste au stade d'une Alpha, qu'il pouvait parfaitement tourner sur la console de Sega. \n \n \n \n\n \n \n \nAfin d'éviter tout problème avec Rockstar, les joueurs doivent posséder une copie légitime de GTA 3 sur PC, par exemple, cette version a été testée comme fonctionnelle : store.rockstargames.com\n \n \nUne interview des développeurs a été fait par thedreamcastjunkyard.co.uk\n \nComme le montre l'image, la manette VMU a été utilisée pour signaler les statistiques de performance lors des tests.\n \n\n \nMake sure you have a LEGIT copy with no corrupted files, as this process wont work otherwise.\n \nYou will also need the following tools installed\n- git-scm http://git-scm.com/downloads/win\n- dreamsdk r3 https://github.com/dreamsdk/dreamsdk/releases\n \n### Preparing the gta3 folder\n- Open dreamsdk shell\n- type `mkdir gta3` (and press enter)\n- type `explorer .` (and press enter)\n- This will open a folder named gta3. Copy your gta3 files in there.\n  - If you use the 2cdrom version of the game, make sure to also copy the contents of the play disc to this folder.\n- close the folder and the dreamsdk shell and proceed to the next step.\n \n### Cloning the dca3-game repo and downloading the prebuilt elf\n- Open dreamsdk shell\n- type `git clone https://gitlab.com/skmp/dca3-game.git`(and press enter) \n- It should take a moment and successfully clone the repo\n- type `cd dca3-game/dreamcast` (and press enter)\n- type `explorer .` (and press enter).\n- A folder named dreamcast with some files should be open. Keep it on the side.\n- Download the artifacts from https://gitlab.com/skmp/dca3-game/-/jobs/8725216645\n- Open artifacts.zip and extract dca3.elf to the folder that was kept open before.\n- Close the folder and dreamsdk shell\n \n### Repacking and making a prebuilt cdi FOR GD-EMU\n- Open dreamsdk shell\n- type `cd dca3-game/dreamcast` (and press enter)\n- type `make cdi-prebuilt` (and press enter)\n  - This should take a while (5-15 mins)\n  - Due to an issue with dreamsdk, this won't fully complete the first time\n- type `make cdi-prebuilt` (and press enter)\n  - It will continue where it left off before\n  - It should run to completion now and show \"*** Repack Completed Successfully ***\"\n- type `explorer .` (and press enter)\n- The dreamcast folder should open up, and it should contain dca3.cdi for you (~ 900 megs)\n \n### Repacking and making a prebuilt cdi FOR burning CD-ROM\n- Open dreamsdk shell\n- type `cd dca3-game/dreamcast` (and press enter)\n- type `make FOR_DISC=1 cdi-prebuilt` (and press enter)\n  - This should take a while (5-15 mins)\n  - Due to an issue with dreamsdk, this won't fully complete the first time\n- type `make FOR_DISC=1 cdi-prebuilt` (and press enter)\n  - It will continue where it left off before\n  - It should run to completion now and show \"*** Repack Completed Successfully ***\"\n- type `explorer .` (and press enter)\n- The dreamcast folder should open up, and it should contain dca3.cdi for you (~ 700 megs or ~260 megs)\n- If the .cdi is not ~ 700 megs (linux/mkdcdisc) or ~260 megs (windows/cdi4dc), then you did something wrong.\n  - You can type `rm -rf repack-data` (and press enter)\n  - And then start this step from the beggining\n \n \n\n \n\n \nTéléchargement : dca3-game sur Dreamcast\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202240/in-oldies-gran-theft-auto-iii-sinvite-sur-dreamcast-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202240/in-oldies-gran-theft-auto-iii-sinvite-sur-dreamcast-2.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] PS5 Payload Web Server v0.17 disponible",
        "content": "Le développeur John Tornblom dévoile une nouvelle version de PS5 Payload Web Server qui est maintenant proposé en version 0.17. \n \n\n \n \nIl s'agit d'un serveur web qui permet de lancer des homebrews via le webkit ou via une connexion à distance sur un PC, smartphones ou tablettes. La version 0.17 intègre de nouvelles fonctionnalités sur l'interface RetroArch, des améliorations notamment sur la configuration par défaut, afin d'améliorer la lectures des menus. \n \nDe nouveaux cores ont été intégrés, pour le Commodore Amiga, pour le Commodore C64, ou encore pour la Neo Geo.\n \n \nTéléchargement : websrv v0.17\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202237/in-ps5-ps5-payload-web-server-v017-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[3DS] Luma3DS v13.3 disponible",
        "content": "Le développeur TuxSH vient de mettre en ligne une nouvelle version du CFW Luma3DS qui se destine pour rappel à la Nintendo Switch, la version précédente ayant été livrée début octobre 2024. \n \nComme vous le savez Luma3DS est le CFW indispensable pour les 3DS et 2DS et l'arrivée d'une nouvelle version est toujours intéressante à suivre. \n \n \n\n \n \nChangelog 13.3 : \n \n- Ajout de la prise en charge des prototypes de firmwares (en particulier celui utilisé à l'E3 2010), y compris la prise en charge d'EmuNAND (par@Wack0)\n- Correction du remplacement du volume pour les applets (i2s2/csnd), cette fonctionnalité réutilise la fonctionnalité utilisée pour le son de l'obturateur de l'appareil photo. En tant que telle, elle interfère avec elle :\n-> le volume de l'obturateur est réglé sur le dépassement au lieu de sa valeur par défaut de 100 %\n-> en raison de détails d'implémentation, la lecture de l'effet sonore de l'obturateur fera\ncesser cette fonctionnalité jusqu'à ce que le remplacement du volume soit réappliqué en\nrevenant à ce menu\n- D'autres améliorations de la stabilité globale du système et d'autres ajustements mineurs ont été apportés pour améliorer l'expérience utilisateur\n \n \nTéléchargement : Luma3DS v13.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202236/in-3ds-luma3ds-v133-disponible-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS5] SDK PS5 Payload v0.23 disponible",
        "content": "Le développeur John Tornblom dévoile une nouvelle version de son SDK PS5 Payload, la boite à outils destinée à la PS5 permet d'utilisé des payloads ELF.\n \nLa mise à jour régulière du SDK permet d'apporter les dernières évolutions et découvertes de stabilité afin d'améliorer l'expérience utilisateur. \n \n \n\n \n \nLa mise à jour intègre un correctif pour les plantages survenus lors des chargements des payloads via le loader JavaScript ELF. Elle rajoute aussi un gestionnaire de signaux qui intercepte les signaux POSIX critique, et génère une information enregistrée dans /dev/klog, permettant ainsi d'améliorer la gestion des débogages et la correction de bugs.\n \nCe n'est pas tout, un supporte rudimentaire pour les tables de liaison de procédures plt a été ajouté, ainsi qu'une exposition des adresses kernel_dynlib_mapbase_adrr.\n \nLa bibliothèque C (libc) dispose de nouveaux stubs et de certaines nouvelles fonctions ont été implémentées, et des problèmes de scripts sur les commandes systèmes Windows ont été résolus. L'ajout de la bibliothèque libSceSysmodule permet là encore d'élargir les fonctionnalités disponibles.\n \nVous l'aurez compris cette version 0.23 est très riche en nouveautés. \n \n \nChangelog 0.23 : \n \ncrt : correction de plantages lorsque des charges utiles sont déployées via le chargeur elf javascript\ncrt : ajout d'un gestionnaire de signaux qui attrape les signaux POSIX critiques et imprime un stacktrace sur /dev/klog\ncrt : aut du support rudimentaire pour la procédure de lien pour les tables (plt)\ncrt : Montre l'adresse kernel_dynlib_mapbase_addr aux utilisateurs du sdk\nlibc : ajout d'un stub pour getservbyname()\nlibc : ajout de getservbyport()\nlibc : ajout de quelques noms de services par défaut à getnameinfo\nhost : correction des scripts de commande windows\nhost : correction du wrapper pour clang quand aucune unité de traduction n'est fournie\nsce_stubs : ajout de libSceSysmodule\n \n \nTéléchargement : SDK PS5 v0.23\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-25183830.png"
        }
    },
    "news_17": {
        "title": "[PS3] Home Content Preserver v1.00 disponible",
        "content": "Le développeur principal de Destination Home a utilisé un exploit de jeton de bot Discord pour accéder et dumper les canaux Discord privés des développeurs d'un autre groupe Home Revival.\n \nLe développeur DeViL303 a créé une application qui vous permet de saisir en masse les URL d'accueil d'origine, puis de remplacer le domaine à la volée par celui de votre choix. Elle peut également générer automatiquement des liens pour une version alternative. Cela vous évite de devoir rechercher et remplacer des URL ou de créer des scripts pour faire la même chose.\n \n \n\n \n \nVoici une petite application, nommée Home Content Preserver, très simple, qu'il a créé pour télécharger des fichiers à partir des serveurs Web de Playstation Home. Il s'agit principalement d'un simple usurpateur d'agent utilisateur avec des capacités de téléchargement en masse et de génération de liens pour d'autres versions et fichiers associés (ODC/SDC/PNG)\n \nRemarque : Si un serveur dispose d'une liste blanche, vous devez d'abord être sur la liste blanche avant de pouvoir télécharger.\n \n \n \nTéléchargement : Home Content Preserver v1.00\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202160/in-ps3-home-content-preserver-v100-disponible-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS3] Evilnat a mis à jour xai_plugin en v1.6",
        "content": " \nLe développeur Evilnat continue de travailler, ce n'est pas parce qu'il a déployé son CFW Evilnat 4.91.2 en version stable qu'il ne continue pas à proposer des nouveautés. Il dévoile en effet la version 1.6 de xai_plugin.\n \nL'objectif est souvent le même, corriger des bugs, et cette version n'échappe pas à la règle. \n \nNathan Martin a récemment annoncé l'ajout de nouvelles options dans le xai_plugin, suite à une demande d'utilisateur. Ces nouvelles options incluent des fonctionnalités de la Rebug Toolbox, permettant une gestion plus avancée des partitions et des fichiers. Le xai_plugin continue d'évoluer avec des mises à jour régulières pour améliorer les performances et ajouter de nouvelles fonctionnalités.\n \n \n\n \n \nCette version 1.6 dévoilée hier vise à corriger un bug mineur. \n \nChangelog :\n \n- Correction d'un bug détectant à tort que les syscalls du CFW étaient désactivés lors de l'utilisation de l'option [Dump RAM] (Merci à gexgamingyt)\n \nVous pouvez mettre à jour xai_plugin à partir du XMB en sélectionnant l'option [Custom Firmware Tools > Update xai_plugin]\n \n \n \nTéléchargement : xai_plugin v1.6 (téléchargement direct)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202126/in-ps4-evilnat-a-mis-a-jour-xai-plugin-en-v16-1.jpg"
        }
    },
    "news_19": {
        "title": "[XO] PrometheOS V1.5.0 disponible pour la Xbox Originale",
        "content": " \nLe projet PrometheOS-Firmware est maintenu par la Team Resurgent et vise à fournir une version moderne de Xenium OS, le système d'exploitation de la Xbox originale, cet OS est spécifiquement conçu pour les puces Xenium/OpenXenium.\n \n \n\n \n\n \n \nPour contribuer au projet, il est recommandé d'utiliser Visual Studio 2003 ou Visual Studio 2022. Le dépôt GitHub contient des instructions détaillées sur la build et le test du firmware, d'ailleurs le projet PrometheOS est totalement open-source, et les améliorations sont nombreuses.\n \n \n\n \n\n \n \nLa version 1.5.0 de PrometheOS pour la Xbox originale a été officiellement publiée hier, le 26 décembre 2024. Cette mise à jour apporte des ajouts et des améliorations significatifs aux outils PrometheOS. Parmi les nouveautés, on trouve des fonctionnalités de mise à jour basées sur le réseau, le support de l'ISO compressée, et des améliorations des performances du système. Cette version est compatible avec les configurations de RAM de 64MB, 128MB et 256MB. Il est désormais possible de formater le disque dur en mode compatible Cerbios, avec une seconde option disponible lorsque le double disque dur est activé. L'ensemble des tables de partition est alors sauvegardé dans le dernier secteur du disque dur. \n \n \n\n \n \n \n \nChangelog de PrometheOS V1.5.0 :\n \nCorrections de bugs :\n- Correction de la sauvegarde du score élevé dans le mini-jeu Snake.\n- Problèmes de caractères Unicode FTP résolus.\n- Correction d'un bug de liste FTP MMU.\n \nAméliorations de Cerbios :\n- Ajout de l'éditeur de configuration Cerbios INI pour une configuration simplifiée.\n- Nouvelle option de format de disque dur, incluant la prise en charge du double disque dur lorsqu'elle est activée.\n- Table de partition sauvegardée automatiquement lors du formatage du disque dur.\n \nCompatibilité matérielle :\n- Démarrage amélioré pour les périphériques clones RP2040.\n- Ajout de la prise en charge du Pico 2 officiel (RP2350) via ModXo.\n- Ajout du support XIAO RP2040.\n \nModifications du mode d'éclairage et de la vidéo RVB :\n- Ajout de la sélection du format de pixel RVB pour la configuration des bandes LED RVB et des effets d'éclairage.\n \nCombinaisons de boutons spéciaux :\n- LT+RT+Blanc – Activer/désactiver le paramètre VGA et redémarrer.\n- LT+RT+Noir – Basculer entre NTSC-M et PAL-50 et redémarrer.\n \nPrise en charge des puces et des périphériques :\n- Ajout de la prise en charge LCD pour ModXo et tous les modchips sur Xbox SMBus.\n- Ajout de SPI2PAR pour les modchips Aladdin.\n \nDéverrouillage du lecteur et DLC :\n- Ajout de la prise en charge VSC pour le déverrouillage des lecteurs WD (modèles 2002-2016).\n- Ajout de DLC/Update Signer pour une meilleure gestion du contenu.\n \nMise à jour de Promtools (V1.5.0) :\n- Nouvelle option Launch XBE pour le chargement direct des jeux et des applications.\n \n \nTéléchargement : xbox-scene.info / Team-Resurgent/PrometheOS-Firmware\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202125/in-xo-prometheos-v150-disponible-pour-la-xbox-originale-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202125/in-xo-prometheos-v150-disponible-pour-la-xbox-originale-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1202125/in-xo-prometheos-v150-disponible-pour-la-xbox-originale-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1202125/in-xo-prometheos-v150-disponible-pour-la-xbox-originale-4.png"
        }
    },
    "news_20": {
        "title": "[PS4] shadPS4 v0.5.0 nom de code squidwars disponible",
        "content": " \nL'équipe en charge du développement de shadPS4 vient de publier une nouvelle version de son émulateur PS4 pour PC Windows, MacOS, et Linux.\n \nDéveloppé par Georgemoralis, connu aussi sous le nom de shadow, l'émulateur PS4 arrive au moment des fêtes de fin d'année, parmi les nouveautés de cette version 0.5 portant le nom de code \"Squidwars\", la prise en charge d'AJM, la mise en oeuvre du décodage vidéo et la correction des couleurs des bords.\n \nCe n'est pas tout, l'émulation de thread a été réécrite afin d'améliorer les performances, la bibliothèque lippngdec a été portée vers libpng pour élargir la compatibilité. \n \nLa gestion du cache de textures, l'interface graphique, le nettoyage des bibliothèques, et des améliorations sur les jeux développés avec Unity sont autant de nouveautés apportées. \n \nLe support de Vulkan 1.4 est amené, là aussi permettant d'apporter de meilleurs graphismes, et des performances plus élevées. Pour information, la v0.5.1 est déjà sur les rails. \n \n \n\n \n \nChangelog : \n \n- Support Ajm\n- Mise en œuvre du vidéodec\n- Correction de la couleur des bordures\n- Réécriture de l'émulation pthread\n- Portage de libpngdec vers libpng\n- Amélioration du cache des textures\n- Corrections et améliorations de l'interface graphique\n- Nettoyage des bibliothèques\n- Corrections pour cmake\n- Nombreux correctifs pour les jeux Unity\n- Prise en charge de Vulkan 1.4\n- Edition de shaders\n- Tesselation\n- Refonte du processeur GPU\n- Plus de corrections pour la mise à jour séparée\n- Corrections des splashscreens\n- Correction gamma\n \n \nTéléchargement : shadPS4 v0.5.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202114/in-ps4-shadps4-v050-nom-de-code-squidwars-disponible-1.jpg"
        }
    }
}