{
    "news_1": {
        "title": "[PS4] GoldHen_v2.4b17.3 disponible",
        "content": " \nGoldHEN est un Homebrew ENabler pour la PS4, sous forme de payload, qui permet aux utilisateurs de débloquer certaines fonctionnalités et d’exécuter des homebrews sur leur console. Ce laoder ne prend en charge que les payloads ayant un point d’entrée dans le kernel. La version personnalisée de stage recherche d’abord le payload dans le répertoire racine de la clé USB, et s’il est trouvé, il est copié sur le disque dur interne à ce chemin : /data/GoldHEN/payloads/goldhen.bin. \n \n \n \n\n \n \nDans cette nouvelle version v2.4b17.3 : \n \n- Ajout de la prise en charge du firmware 9.60\n- Amélioration du serveur BinLoader (prise en charge d'un plus grand nombre de payloads)\n- Amélioration du serveur Klog (prise en charge de la déconnexion du réseau)\n- Modification de la configuration des serveurs réseau pour la rendre déclarative\n \nPour rappel, il supporte les firmwares 5.05, 6.71 / 6.72, 9.00, 9.60, 10.00 / 10.01 et le 11.00\n \n \nTéléchargement : GoldHen_v2.4b17.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192056/in-ps4-goldhen-v24b173-disponible-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS4/PS5] Demo d'un nouvel homebrew: The  Floors",
        "content": "Il y a quelques temps, je publiais un homebrew Beginning of the end, un jeu amateur mélangeant the last of us et resurgent, malheureusement ayant eu un soucis de PC, j'ai perdu tous le code source, d'où l'abandon de ce projet...\n \nJe reviens  donc aujourd'hui avec un nouveau projet: The Floors\n \nUn petit survival-horror 2d, développé sous gamemaker 1.4 pour PS4 et PS5. Le développement est en cours et avance doucement mais surement.\n \n\n \nJe profite de cette new pour vous partager une petite demo, assez courte mais vous proposant de découvrir le concept de mon nouvel homebrew en parcourant l'intro de ce dernier.\n \nJe donnerai plus d'info sur le jeu, ainsi que son concept dans une future release, seule chose que je peux dire pour l'instant, le but est de proposer un petit jeu court ( 2 à 3h ) mais avec une rejouabilité (plusieurs embranchements, plusieurs scénarios et plusieurs fins selon vos choix in-game).\n \n\n \nGarder à l'esprit que cette démo peut contenir des bugs qui seront ( qui sont déjà pour certains) corrigés dans la prochaine version publique, elle fonctionne sur toutes PS4/PS5 Jailbreak.\nElle comprend 2 langues, le français et l'anglais, cette dernière ayant été traduite du français à l'anglais avec Chat GPT.\n \nUne version Switch est également en cours et contiendra les mêmes options, et fonctionnement que cette version PS4/PS5...\n \n\n \nTélécharger  The Floors - Demo PS4/PS5\n \nPour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:\nhttps://www.paypal.com/paypalme/markus00095\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192053/in-ps4ps5-demo-dun-nouvel-homebrew-the-floors-1.jpg",
            "image_2": "https://playstation-3.logic-sunrise.com/images/news/1192053/in-ps4ps5-demo-dun-nouvel-homebrew-the-floors-1.png",
            "image_3": "https://playstation-3.logic-sunrise.com/images/news/1192053/in-ps4ps5-demo-dun-nouvel-homebrew-the-floors-3.jpg"
        }
    },
    "news_3": {
        "title": "[WiiU] La Wii U voit débarquer RetroArch sur Aroma",
        "content": " \nL'équipe LibRetro a de la concurrence, certains développeurs viennent de mettre à jour RetroArch afin que quelques builds puissent être proposées comme étant compatible avec le CFW Aroma pour la Nintendo Wii U. Il s'agit d'une bonne évolution pour RetroArch permettant ainsi à la Wii U de bénéficier encore de quelques évolutions. \n \n \n\n \n \nJusqu'à présent l'utilisation de RetroArch vient Aroma était chaotique, son utilisation était bloqué sur Tiramisu, une ancienne version de développement d'Aroma, qui ne livrait pas toutes les fonctionnalités offertes aujourd'hui par Aroma, RetroArch devait être lancé de façon indépendante, là où désormais il fonctionnera comme une application dans le menu d'accueil. \n \nPlusieurs minutes étaient nécessaires pour lancer un titre, parfois les utilisateurs étaient contraints de forcer le lancement d'un jeu dans le kernel, cette évolution va changer considérablement le lancement de RetroArch sur Nintendo Wii U qui se retrouve avec désormais des performances beaucoup plus modernes. \n \n \n\n \n \n \nLe développeur QuarkTheAwesome parle de la réorganisation opérée sur les packages et tous les actifs dans un seul fichier .wuhb ce qui permet de réduire considérablement les temps de chargement, la réécriture complète de la gestion ProcUI pour prendre en charge la superposition du menu Home, et aussi l'ajout de la prise en charge de boutons comme celui du bouton d'alimentation de la console. \n \n \n \n\n \n\n \n \n \nPour l'heure, il ne s'agit que de builds préliminaires, non officielles, et il y a fort à parier qu'il faut que la team LibRetro s'impreigne de ces évolutions pour fournir leur propre version stable, mais vu qu'il s'agit de fournir des versions plus performantes, et mieux intégrées, cela n'aurait aucun sens que l'équipe ne s'appuie pas sur ces améliorations pour fournir leur propre version, en s'appuyant même sur les développeurs impliqués QuarkTheAwesome , ploggy , Maschell , Vague Rant et quelques autres qui proposent leur savoir via le github de RetroArch ou via Gbatemp.net .\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191994/in-wiiu-la-wii-u-voit-debarquer-retroarch-sur-aroma-1.jpg"
        }
    },
    "news_4": {
        "title": "[XBS/X/O] Une solution Raspberry Pi Pico arrive sur Xbox One",
        "content": "Il semblerait qu'une alternative à l'utilisation de la faille sur Xbox One soit en préparation, du moins il est possible d'utiliser un Raspberry Pi Pico pour le convertir en Pico Ducky via le hack Xbox One. Les Raspberry Pi Pico sont vendus contre quelques euros, ils vont se retrouver très vite comme une alternative fiable et facile à mettre en oeuvre sur les Xbox. \n \n \n\n \n \nDes vidéos commencent déjà à tourner sur le sujet.\n \n \n \n\n \n \n \nCela faisait bien longtemps que la scène Microsoft attendait enfin une évolution en la matière, cela donne un nouveau souffle aux Xbox, à l'image de Michael Crump, que nous vous invitons à suivre et qui poste régulièrement de nombreux posts sur son profil X, à suivre ! \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191988/in-xbsxo-une-solution-raspberry-pi-pico-arrive-sur-xbox-one-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS4] PS4 HEN VTX se met à jour pour les firmwares 8.00 à 11.00",
        "content": "Le développeur StretchEcho vient de mettre à jour son payload PS4 HEN VTX afin de mettre à disposition une version spécifique à chaque firmware compris entre le firmware 8.00 et 11.00, ainsi il libère pas moins de 7 versions différentes de son HEN pour s'adapter à chaque firmware.\n \n \n\n \n \nLes payloads proposés : \n \nps4-hen-800-803-PPPwn-vtx-1079\nps4-hen-850-852-PPPwn-vtx-1080\nps4-hen-903-904-PPPwn-vtx-1088\nps4-hen-950-960-PPPwn-vtx-1082\nps4-hen-1000-1001-PPPwn-vtx-1083\nps4-hen-1050-1071-PPPwn-vtx-1084\nps4-hen-1100-PPPwn-vtx-1085\n \n \n \n\n \n \nTéléchargement : ps4-hen-vtx\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191986/in-ps4-ps4-hen-vtx-se-met-a-jour-pour-les-firmwares-800-a-1100-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1191986/in-ps4-ps4-hen-vtx-se-met-a-jour-pour-les-firmwares-800-a-1100-1.jpg"
        }
    },
    "news_6": {
        "title": "[XB] La faille déjà corrigée par Microsoft",
        "content": " \nAussitôt dévoilée, aussitôt corrigée, la faille qui vient d'être dévoilée est déjà corrigée par Microsoft, il n'aura fallu que quelques heures pour que la frirme de Redmond a dégainé un nouveau code afin de corriger le core du SystemOS.\n \nMicrosoft s'appuie sur la machine virtuelle de SystemOS, un environnement puissant du système d'exploitation qui exécute les applications lorsque vous activez le mode développeur sur les consoles Xbox One et Xbox Series X et S. \n \n \n\n \n \nLa faille a été officiellement corrigée comme nous l'annonce Microsoft ici : CVE-2024-30088\n \nL'exploit permet d'obtenir le contrôle total de la machine virtuelle sur laquelle les app peuvent être exécutées sans mode développeur.\n \nTout a été confirmé par le développeur : carrot_c4k3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191965/in-xb-la-faille-deja-corrigee-par-microsoft-1.png"
        }
    },
    "news_7": {
        "title": "[PS4] Icon Mask 1.15 disponible",
        "content": "Le développeur Lapy propose la mise à jour d'Icon Mask qui est maintenant proposé en v1.15. Icon Mask est une application Homebrew pour la PlayStation 4 qui vous permet de modifier l’apparence de vos icônes en leur appliquant un simple masque PNG. Vous pouvez ainsi ajuster la transparence, ajouter des bordures et afficher vos icônes dans une icône officielle “PS4 box”. \n \n \n\n \n \nCette nouvelle version, la 1.15, a été adaptée pour apporter 7 nouveaux masques qui proviennent d'Anubis. \n \n \nTéléchargement : Icon Mask 1.15\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191963/in-ps4-icon-mask-115-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[Switch] switch_AIO_LS_pack 5.12.0 disponible (MAJ)",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.12.0.Pour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.Le homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format).Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables. Depuis cette news les évolutions sont les suivantes:- Changelog pour la version 5.11.0:Dernier firmware compatible mis à jour en 18.1.0.Mise à jour d'Atmosphere, de Hekate et de SimpleModDownloader vers la dernière version de ceux-ci.Le module Sys-patch a été mis à jour pour fonctionner sur la dernière version d'Atmosphere car le module Loader de celui-ci a été modifié, entrainant un disfonctionnement des ldr_patches.- Changelog pour la version 5.12.0:Mise à jour des payloads de Hekate et d'Atmosphere pour corriger des bugs importants.Note: Pour traiter les problèmes particuliers de lancement de la sysnand en firmwares 17.0.0 et supérieurs c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.N'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets. Pour cela nous avons mis en place un questionnaire de satisfaction, en plus de pouvoir reporter les problèmes sur Github ou sur le forum vous pouvez utiliser ce questionnaire pour nous donner vos opinions de façon anonyme.Pour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe et vous avez aussi un tutoriel plus détaillé sur cette page, d'ailleurs ce dernier site contient aussi pas mal de tutoriels notamment sur la Switch.Si vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_9": {
        "title": "[Switch] Hekate 6.2.0 &#38; Nyx 1.6.2 disponibles",
        "content": " \nCe n'est pas tout, le développeur CTCaer quand à lui a proposé la mise à jour d'Hekate et de Nyx qui sont désormais affublés respectivement de la numérotation 6.2.0 et 1.6.2. \n \nL'idée là aussi est d'amener le support du dernier firmware qui vient d'être mis en ligne par Nintendo mais aussi d'apporter quelques modifications de fonds. \n \n \n\n \n \nChangements dans hekate v6.2.0 :\n \n- Prise en charge du firmware 18.1.0\n- hekate peut maintenant lancer HOS jusqu'à 70% plus rapidement dans de nombreux cas d'utilisation.\n- Seuls ces cas d'utilisation sont affectés. Les autres sont identiques/similaires.\n- Correction d'un problème avec l'écran bleu - code 01 sur T210 (Erista). - Téléchargement mis à jour.\n- Beaucoup d'améliorations et de corrections sous le capot (voir les changements dans le BDK) \n \n \nChangements Nyx 1.6.2 : \n \n- L'Easter Egg a fait l'objet d'une mise à jour massive\n- Ajout de la prise en charge du T210B01 et de toutes les UGS\n- Amélioration massive de la précision (code et audio). Toutes les bizarreries sont désormais prises en charge.\n- Améliorations massives des performances. 1583% plus rapide même avec une mise à l'échelle de 4x. Pour cette raison, la mémoire vive est ramenée à 204 MHz car elle n'est plus nécessaire pour être rapide.\n- L'autonomie de la batterie peut maintenant atteindre 20 heures pour T210B01 et 13 heures pour T210 ou Lite.\n- Non-couleur : Ajout de palettes à choisir pour la non-couleur\n- Couleur : ajout de filtres de couleur\n- Couleur : ajout d'un mode couleur spécial\n- Ajout de la mise à l'échelle 3x (ne prend pas en charge les filtres de couleur comme 2x et 4x)\n- Ajout de la prise en charge des vibrations\n- Ajout de la prise en charge du changement de luminosité\n- La configuration de l'horloge RTC est maintenant individualisée et plus appropriée\n- Beaucoup d'autres améliorations et corrections\n- Amélioration de la manette de jeu USB HID\n- Désormais, les paquets incomplets provenant du pilote d'entrée ne seront pas analysés.\n- De plus, le pilote n'enverra une nouvelle interruption que si un changement d'entrée a été détecté, réduisant ainsi la charge du processeur du côté de l'hôte.\n- L'identifiant du Touch fw est maintenant affiché de la même manière que sur le firmware.\n- Ajout de l'information OEM ID pour l'eMMC\n- La table de partition GPT de l'eMMC est désormais plus compacte et peut afficher jusqu'à 20 partitions.\n- L'UMS eMMC pour BOOT0/1 signale désormais les tailles > 4MB le cas échéant. Cela ne change aucune fonctionnalité. Tout logiciel sur PC devrait toujours utiliser des images flashables de 4MB.\n- emuMMC BOOT0/1, comme toujours, est forcée à 4MB, quoi qu'il arrive.\n- La fenêtre de la console indiquera également les valeurs de la clé de droite.\n \nChangements dans BDK : \n \nImportants : \nHWINIT : hw_reinit_workaround est maintenant renommé en hw_deinit\nUTILS : exec_cfg et cfg_op_t sont maintenant renommés en reg_write_array et reg_cfg_t\nFAN : set_fan_duty et get_fan_speed sont renommés en fan_set_duty et fan_get_speed\nAFFICHAGE : Certaines fonctions ont été renommées\n \nNormaux : \nDISPLAY : Améliorations massives et déduplication du pilote Partie 2\nTous les portages Nvidia (incorrects) sont maintenant réduits au strict nécessaire puisque nous connaissons l'état exact de toutes les parties du pilote.\nLes différences entre T210 et T210B01 sont également réduites au minimum.\nCorrection de plusieurs bogues Nvidia également. (Pas d'effet notable)\nAFFICHAGE : Utilisation du profil de base sur les panneaux Oled pour obtenir des couleurs sRGB (vraiment naturelles)\nDISPLAY : display_get_backlight_brightness renvoie maintenant correctement les droits pour les panneaux Oled également\nDISPLAY : Ajout des fonctions display_window_disable, display_set_framebuffer et display_move_framebuffer\nBPMP : Introduction de bpmp_clk_rate_relaxed pour faciliter la transition vers des downclocks/overclocks temporaires\nHWINIT : Optimisation et rationalisation de plusieurs bringups de régulateurs\nVIC : Support des formats P8 et R5G5B5\nJOYCON : Atténuation d'un bug Nvidia qui faisait qu'un Joycon n'était pas détecté\nJOYCON : Amélioration de la vérification des paquets et de leur rejet s'ils sont corrompus ou incomplets\nFAN : Ajout de la fonction fan_set_from_temp(temp) pour contrôler automatiquement le ventilateur en fonction de la température fournie\nSPRINTF : Ajout du support pour le padding droit et le padding de chaîne. Consultez la source pour savoir comment l'utiliser\nTYPES : Ajout des macros likely(x) et unlikely(x)\nUSB : utilisation de bpmp_clk_rate_relaxed lors de l'activation des horloges\nIRQ : suppression de la fonction _irq_ack_source utilisée incorrectement. C'est seulement pour les irqs sw forcés.\nBeaucoup d'améliorations et de corrections de bugs\n \n \n \nTéléchargement :  Hekate 6.2.0 et Nyx 1.6.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191933/in-switch-hekate-620-nyx-162-disponibles-1.png"
        }
    },
    "news_10": {
        "title": "[Switch] Atmosphère 1.7.1 disponible",
        "content": " \nFinalement il n'aura pas fallu attendre bien longtemps, SciresM vient de sortir une nouvelle version d'Atmosphere qui est désormais proposé en v1.7.1. Il s'agit de la 79ème version d'Atmosphere qui est livré avec hbl 2.4.4, et hbmenu 3.6.0.\n \n \n\n \n \nChangelog depuis la 1.7.0 : \n\n \n- Le support de la version 18.1.0 a été ajouté.\n- Atmosphère a été mis à jour pour utiliser GCC 14/newlib (dernières versions de devkitA64/devkitARM).\n- D'autres changements ont été effectués pour la version 18.0.0 :\n- le chargeur a été mis à jour pour refléter le dernier comportement officiel.\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \n\n \nTéléchargement : Atmosphere 1.7.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191931/in-switch-atmosphere-171-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] Un projet pour rendre open source le dumper du MigSwitch",
        "content": " \nIl semblerait que de nombreux utilisateurs soutiennent quelques développeurs qui ont bien l'intention de faire sauter les protections du dumper du MigSwitch. \n \nLe dumper du MigSwitch est la clé de nombreuses espérances, quelques personnes souhaitent inverser le code du dumper, des archives commencent à se constituer, pour tenter de casser les sécurités. \n \n \n\n \n \n \nL'idée est de forcer la team MigSwitch a rendre son code open-source et que chacun puisse en profiter, indirectement cela profitera aux équipes comme MigDiy ou enore UnlockSwitch qui propose une copie ou qui ont l'intention de proposer une alternative à la solution russe. \n \n \n\n \n \nQuelques fichiers sont proposés sur dropbox, certainement des fichiers dumpés du dumper en reverse engineering, reste à voir si tout cela sera réellement exploitable, la team UnlockSwitch quand à elle a réagit en disant qu'elle avait finalisé son propre code. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191892/in-switch-un-projet-pour-rendre-open-source-le-dumper-du-migswitch-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191892/in-switch-un-projet-pour-rendre-open-source-le-dumper-du-migswitch-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] Nintendo sort le firmware 18.1.0, Atmosphere ne fonctionne plus",
        "content": "Nintendo vient de mettre en ligne une nouvelle mise à jour firmware pour la Nintendo Switch, la plus grosse évolution est la suppression de l'intégration de Twitter. \n \nL'intégration de X \"Ex-Twitter\" a été supprimée, il n'est plus possible de télécharger des captures d'écran de Super Smash Bros Ultimate sur Smash World. \n \nLes amis ne peuvent plus être trouvés via les réseaux sociaux, mais il reste encore possible de trouver des amis 3DS, Wii-U ou encore via les smartphones. \n \n \n\n \n \nComme dans Splatoon 3, il n'est plus possible là encore de télécharger des images, seules celles présentes sur les serveurs de Nintendo peuvent l'être., fini Twitter ou Facebook.\n \nCoté hack, ScireM informe qu'Atmosphere nécessite une petite mise à jour et que donc le firmware 18.1.0 casse son fonctionnement, il va essayer d'apporter la solution rapidement en fournissant une nouvelle version de sa solution. \n \nLes rapports Yellows'8 sont ici : yls8.mtheall.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191891/in-switch-nintendo-sort-le-firmware-1810-atmosphere-ne-fonctionne-plus-1.png"
        }
    },
    "news_13": {
        "title": "[PS4/PS5] Chiaki4deck v1.7.2 disponible",
        "content": " \nLe célèbre fork de Chiaki fait du Steam Deck une alternative beaucoup plus efficace que la PlayStation Portal au travers du streaming de la PlayStation 5. \n \nChiaki4deck est de retour et les nouveautés apportent la séparation des paramètres locaux et distants, ainsi que des paramètres PS4/PS5 vous permettant de configurer correctement chaque connexion.\n \nDe nouvelles options sont présentes comme du décodage matériel automatique, le programme est désormais compatible avec l'ipv6 malgré le manque de support sur la PS5. \n \n \n\n \n \nNouvelles fonctionnalités :\n \n- Paramètres de flux uniques pour chaque console (PS4/PS5) en local et à distance.\n- Prise en charge de plusieurs types de réseau pour la connexion à distance via PSN (note : certaines fonctionnalités peuvent ne fonctionner qu’une partie du temps en raison des limitations imposées par Sony).\n- Option d’exportation/importation des paramètres pour les transférer entre différents appareils et plates-formes.\n- Option de décodage matériel automatique (défaut) pour choisir le meilleur décodeur disponible.\n- Compatibilité IPv6 (bien que non encore prise en charge par la lecture à distance sur la console de Sony).\n \nPlateformes prises en charge :\n \n- Version Linux disponible sur Flathub en tant que io.github.streetpea.Chiaki4deck.\n- Versions Windows, MacOS et Linux Appimage disponibles.\nNote : Pipewire est requis pour l’Appimage, et pour Linux, il est nécessaire pour les retours haptiques DualSense.\nPour Flatpak, vous pouvez exécuter avec --env=SDL_AUDIODRIVER=pulse pour utiliser PulseAudio au lieu de Pipewire (ce qui désactive les retours haptiques DualSense).\n \n \nTéléchargement : Chiaki4deck\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191880/in-ps4ps5-chiaki4deck-v172-disponible-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS4] EzPPPwn v1.11 par DjPopol avec PPPwn C++",
        "content": "EzPPPwn est programme Windows basé sur PPPwn qui vise à réduire les dépendances environnementales nécessaires à l'exécution de PPPwn et à implémenter le RCE de la manière la plus simple possible.\nL'application contrôle au démarrage que les pré-requis sont bien installés (sinon il proposera de les installer), ainsi que la configuration (si elle n'est pas complète alors il vous demandera de la compléter)\n\nTechnologie :\nC# .NET Framework 8.0 application Winform.\n\nPré-requis\n- Windows 7/8/10/11 (32bits et 64bits)\n- Un ordinateur avec un port Ethernet ou un adaptateur USB/Ethernet fonctionne également\n- Câble Ethernet\n- .Net 8.0.\n- Npcap (peut être installé par l'application)\n\n \nLes firmwares pris en charge sont :\nFW 7.00 / 7.01 / 7.02\nFW 7,50 / 7,51 / 7,55\nFW 8.00 / 8.01 / 8.03\nFW 8.50 / 8.52\nFW 9.00\nFW 9.03 / 9.04\nFW9,50 / 9,51 / 9,60\nFW 10.00 / 10.01\nFW10,50 / 10,70 / 10,71\nFW 11.00 \n\n \nChangeLog :\n-l'application se prénomme désormais EzPPPwn\n-Remplacement de pppwn python par la version C++.\n-Réécriture complète.\n-Simplification de l'application(plus de save log, save script...).\n-Suppression du paramètre stage1.bin\n-Ajout de l'installation des prérequis (Npcap, PPPwn C++, stage1.bin)\n-Ajout update PPPwn C++ avec la dernière version stable de PPPwn C++\n\n \nConfig :\n\n\n\n- Suppression de l'option pour sélectionner le stage1.bin.\n- Ajout des options PPPwn C++\n- Ajout d'un bouton pour initialiser les paramètres par default.\n- Nouvelle mise en page\n\nFormPPPwn :\n\n\n\n- Ajout d'un bouton pour cacher/afficher la console.\n- Ajout d'un bouton pour mettre à jour PPPwn C++\n- Ajout d'un bouton pour annuler le processus.\n- Nouvelle mise en page.\n\n\nSi vous n'avez pas les pré-requis l'application pourras les installer (Npcap, PPPwnC++, et les stage1.bin)\n\n\n\n\n\n\n\n- Ajout d'un bouton pour annuler.\n- Si l'installation est refusée ou annulée, l'application se fermera.\n\nTips :\n- Vous pouvez utiliser la versions de PPPwn C++ qui vous convient en la plaçant dans le répertoire C++\n- Idem pour les stage1.bin (Respecter l'organisation : ex: Firmware 11.00 => Stages1/11.00/stage1.bin) et si vous voulez revenir à celui utilisé par l'application par défaut, supprimer le stage1.bin correspondant à votre firmware\n\nEzPPPwn v1.0 By DjPopol\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191849/in-ezpppwn-v110-par-djpopol-avec-pppwn-c-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1191849/in-ezpppwn-v110-par-djpopol-avec-pppwn-c-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1191849/in-ezpppwn-v110-par-djpopol-avec-pppwn-c-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1191849/in-ezpppwn-v110-par-djpopol-avec-pppwn-c-4.png"
        }
    },
    "news_15": {
        "title": "[XBOX ONE] Hack du SystemOS bientôt public les instructions données",
        "content": "La Team Xbox One Research a publié une brève expliquant qu'une méthode serait bientôt publiée pour avoir accès a l'executionde code dans le SystemOS de la Xbox, ils donnent les instructions pour préparer la console a l'utiliser dans un communiqué disponible sur leur site.\n \nEn voiçi l'extrait qui nous interesse :\n \n Notice for users who would like code execution in SystemOS in the future\nOn 2024/06/08 a method for gaining user- and kernel-level code execution SystemOS was announced. It is likely to be patched soon (in next System Update).\nTo prepare, do the following:\nEnsure your Xbox Live account Login-Type is configured as “No barriers” aka. auto-login with no password prompt\n\tSet your console as “Home Console” for this account\n\tDownload the App Game Script\n\tStart the app (to ensure license is downloaded/cached)\n\tTake your console offline! To make extra sure it cannot reach the internet, set a manual primary DNS address of 127.0.0.1\n\tGet a device/microcontroller that can simulate a Keyboard (rubber ducky or similar) - otherwise you have to type a lot manually \n\n \n \nTraduction:\n \n\n \nAvis aux utilisateurs qui souhaiteraient exécuter du code dans SystemOS à l'avenir\nLe 08/06/2024, une méthode permettant d'obtenir l'exécution de code au niveau utilisateur et noyau dans SystemOS a été annoncée. Il est probable que celle-ci soit bientôt corrigée (dans la prochaine mise à jour système).\nPour vous préparer, voiçi les étapes a suivre :\nAssurez-vous que le type de connexion de votre compte Xbox Live est configuré sur « Sans barrières », c'est-à-dire connexion automatique sans demande de mot de passe.\n\tDéfinissez votre console comme « Console Principale » pour ce compte.\n\tTéléchargez l'application Game Script\n\tDémarrez l'application (pour s'assurer que la licence est téléchargée/stockée en cache).\n\tMettez votre console hors ligne ! Pour vous assurer qu'elle ne peut pas atteindre le net, définissez une adresse DNS primaire manuelle de 127.0.0.1.\n\tObtenez un appareil/microcontrôleur capable de simuler un clavier (rubber ducky ou similaire) - sinon, vous devrez taper beaucoup manuellement\n\n \nCe hack sera compatible avec toutes les Xbox One et Xbox Series.\nPour rappel cela ne permettra pas en soit de pirater quoique ce soit mais c'est une étape nécessaire vers un jailbreak complet de l'ecosystème Xbox, cela permettra cependant d'avoir accès aux mêmes fonctionnalitées qu'avec le mode developpeur en retail et un peu plus car il y a une execution de n'importe quel code possible pas que des applis UWP.\n \nVoilà une grande nouvelle!\nPeut-être que tout ça est le début d'une grande aventure pour la Xbox One, on ne peut que l'esperer, çela fait trop longtemps que les consoles de Microsoft sont a l'abri du hack...\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/forums/public/style_emoticons/default/biggrin.gif"
        }
    },
    "news_16": {
        "title": "[XB] Le projet SpiderBoard de Torus de eMMC sur XBO est libéré en open-source",
        "content": " \nLe développeur Torus vient de faire le choix de rendre open-source ses PCB pour la Xbox One, il vient de libérer en effet ses projets SpiderUnifiedBoard et SpiderCarrierBoard, des cartes de remplacement de l'eMMC de la Xbox One. \n \n \n\n \n\n \n \nMême si ces projets sont inachevés, il espère qu'ils puissent servir à d'autres développeurs qui reprendraient le flambeau. \n \nThéorie de fonctionnement :\n \nLe pont sud de la Xbox One utilise l'ensemble du bus 8 bits pour se connecter à la carte eMMC. Il ne peut donc pas être remplacé par des mémoires compatibles eMMC moins chères et plus faciles à utiliser (par exemple, des cartes microSD). Pour minimiser le dessoudage des circuits intégrés : Vous devez couper les traces de l'eMMC d'origine dans la carte jusqu'au pont sud. Ensuite, vous devez souder cette carte et connecter les nouvelles lignes de données et de contrôle, à partir de laquelle le pont sud commencera à communiquer avec la nouvelle eMMC sur la carte Spider (ou dans la carte porteuse).\n \n \n\n \n\n \nLa forme de la carte principale est compatible avec toutes les variantes du PHAT Xbox One (Durango/Graybull, Carmel, Silverton) et vous pouvez la réutiliser directement  (il s'agit du calque Edge Cuts dans KiCad), elle n'est par contre pas adaptée à la Xbox One S ni à la Xbox One X.\n \n \nTout est là : Spider-eMMC\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191795/in-xb-le-projet-spiderboard-de-torus-de-emmc-sur-xbo-est-libere-en-open-source-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191795/in-xb-le-projet-spiderboard-de-torus-de-emmc-sur-xbo-est-libere-en-open-source-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1191795/in-xb-le-projet-spiderboard-de-torus-de-emmc-sur-xbo-est-libere-en-open-source-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1191795/in-xb-le-projet-spiderboard-de-torus-de-emmc-sur-xbo-est-libere-en-open-source-3.png"
        }
    },
    "news_17": {
        "title": "[PS4] PS4 HEN supporte désormais le firmware 10.50",
        "content": " \nBonne nouvelle, le firmware 10.50 vient de tomber face au PS4 HEN, proposée par SiSTR0 la release v2.1.3 de Mars 2020 a souvent été forkée, il s'agissait d'ailleurs d'une proposition à l'origine de Xvortex pour le firmware 5.05 en Juillet 2018, mais avant pour le 4.55 en Mars 2018. \n \nLa dernière version proposée par BestPig, la 2.1.4, propose le support fonctionnel du firmware 10.50 et du 11.00.\n \n \n\n \n \nLe travail réalisé par Echo Stretch et BestPig est fascinant, ils ont travaillé sur le portage du HEN vers toutes les versions du firmware. Il s'agit d'une solution temporaire jusqu'à ce que Sistro publie la version officielle de GoldHEN. \n \n \nIl semblerait que le firmware 9.03 soit aussi de la partie. \n \nTout est là : \n \nhttps://github.com/EchoStretch/ps4-hen-vtx/releases\n \nhttps://github.com/BestPig/ps4-hen-vtx/releases/tag/2.1.4\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191776/in-ps4-ps4-hen-supporte-desormais-le-firmware-1050-1.jpg"
        }
    },
    "news_18": {
        "title": "[Switch] Sys-con enfin de retour avec la version 1.1.0",
        "content": " \nLe développeur français o0Zz a pris la suite de Cathery avec Sys-con, et il le fait plutôt bien puisque les versions s'enchainent et ajoutent de nombreuses fonctionnalités. Inspiré du projet sys-con de Cathery, ce nouveau fork a été réalisé pour ajouter le support de toutes les manettes compatibles PC (avec un profil HID). \n \n \n\n \n \nAinsi cette nouvelle version supporte l’ensemble des manettes compatibles PC tout en gardant la compatibilité d’origine avec les manettes Xbox et DualShock. Ce portage ouvre la porte à de nouveaux horizons, notamment le retrogaming avec des émulateurs tels que RetroArch (Arcade, NES, Snes, etc.). Le module Sys-Con permet d’utiliser des contrôleurs tiers sur votre console Nintendo Switch en connectant simplement vos manettes via les ports USB du dock ou via le port USB-C avec un adaptateur OTG.\n \nAvec Sys-Con vous profiter de ses fonctionnalités, telles que le support des joysticks et gamepads avec profil HID, la configuration des touches en fonction du VID/PID de la manette, la gestion de la deadzone et la personnalisation de la couleur des manettes.\n \n \nChangelog sys-con v1.1.0 :\n \n- Correction du fichier journal qui n'est pas créé automatiquement\n- Inversion du Y sur la manette XBOX S et la manette XBOX originale.\n- Correction du fix maison et de la capture qui ne fonctionne pas correctement\n- Correction de la connexion/déconnexion de la manette xbox360 sans fil ne fonctionnant pas correctement\n- Ajout d'un mode de découverte pour découvrir soit toutes les manettes, soit uniquement les manettes connues (pour éviter les problèmes avec les manettes officielles de la Switch).\n- Correction de la liaison incorrecte pour le joystick droit sur Generic HID.\n \n \nTéléchargement : Sys-con 1.1.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191772/in-switch-sys-con-enfin-de-retour-avec-la-version-110-1.png"
        }
    },
    "news_19": {
        "title": "[Switch] L'équipe UnlockSwitch progresse sur le développement de Xtractor",
        "content": " \nLa team UnlockSwitch nous informe que le développement de Xtractor progresse de façon excellente, voir exceptionnelle. L'équipe tient a remercier l'accueuil a qui fait au produit et sa solution software est tout aussi importante. \n \nL'équipe annonce qu'il va proposer chaque étape de l'évolution du logiciel, mais sans en dévoiler le contenu, ni même fournir de visuel.\n \n \n \n\n \n \n \nAucune photo ne sera partagée car elle souhaite attendre que le produit soit réellement disponible pour pouvoir le faire en toute quiétude, mais aussi car cette décision découle de quelques difficultés de copie. La team souhaite protéger un peu son travail. \n \nIl semblerait que la team parle de nombreuses solutions qui ont vu le jour, peut être des copies qui seraient en cours de déploiement, la copie de la copie.\n \nL'équipe explique qu'elle dévoilera bientôt les détails de cette histoire et de ce qui se passe, elle reste tout de même en lutte face à la Team MigSwitch dont elle accuse par exemple d'avoir repris son idée d'interrupteur permettant de changer de jeux sans devoir extraire le linker. \n \nDe son côté la team MigSwitch vient de laisser un message sur le tri des jeux sur son linker. Elle rappelle que par défaut, les jeux sont triés selon l'heure à laquelle ils ont été copiés sur la microSD mais que si vous souhaitez trier les jeux par ordre alphabétique, cela est possible, il faut passer par un outil qui va trier les fichier sur la partition. La team rappelle aussi que la V2 permet avec son bouton de passer au jeu suivant en poussant rapidement, mais qu'une poussée longue permet de revenir au jeu précédent. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191771/in-switch-lequipe-unlockswitch-progresse-sur-le-developpement-de-xtractor-1.jpg"
        }
    },
    "news_20": {
        "title": "[PS3] Nautilus Toolset v1.00 de DeViL303 disponible",
        "content": "Le développeur DeVil303 bien connu de la scène PlayStation 3 pour tous ces outils de personnalisation revient présenter un nouvel utilitaire, Natulis Toolset qu'il propose en v1.00. Il s'agit d'un fork de Multiserver3 d’AgentDark447. Nautilus est une interface graphique pour PC Windows conçue pour gérer les ressources de PlayStation Home à un niveau de profondeur inédit. \n \n \n\n \n \n\n \n \nChangelog 1.00 : \n- Home Archive Creator : Cet outil vous permet de créer des archives pour les ressources de PlayStation Home. Vous pouvez glisser-déposer des dossiers dans l’application et choisir le type d’archive souhaité. Il peut gérer des opérations étendues, comme la création de plus de 70 000 objets en une seule fois.\n \nTypes d’archives pris en charge :\n- BAR : L’archive la plus basique, historiquement utilisée dans les premières éditions de PlayStation Home. Elle est rapide à lire, monter, créer et télécharger.\n- BAR Secure : Une version cryptée de BAR utilisée avec SHA1 dans certaines versions pré-Sharc de Home.\n- SDAT : Similaire à BAR, mais avec une couche de chiffrement NPD.\n- SDAT SHARC : Un format d’archive sécurisé introduit dans la version 1.82 pour lutter contre le piratage.\n \nComme vous le savez les ressources de Home sont assez particulières, et très vastes, ce qui fait que cet homebrew ne sera jamais réellement \"terminé\". \n \n \nTéléchargement : Nautilus Toolset v1.00\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191724/in-ps3-nautilus-toolset-v100-de-devil303-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1191724/in-ps3-nautilus-toolset-v100-de-devil303-disponible-1.jpg"
        }
    }
}