{
    "news_1": {
        "title": "[PS3] CFW 4.91.2 Evilnat version stable disponible",
        "content": "Après 17 bêtas, voici enfin la version stable du CFW 4.91.2 d'Evilnat, enfin à l'occasion de Noël, le développeur sort des Bêtas pour présenter la version finale de son custom firmware pour la PS3. \n \nIl s'est donc atelé à proposer la version finale de son CFW 4.91.2 Evilnat, il intègre les fonctions Cobra 8.5. \n \nCela a pris plusieurs mois de développement, de recherche et de tests, mais c'est enfin là, via Psx-place.com.\n \nOutre les améliorations mentionnées dans le changelog, le développeur dévoilera des fonctionnalités dans les futures versions comme rap2bin - bin2rap par @esc0rtd3w dans Cobra 8.5, ou encore la tentative de patcher complètement la région du film DVD et bien plus encore. \n \nLes contournements de la \"brique du bip d'ambulance\" pendant que le core DEX est chargé avec CEX TargetID ont été réalisés avec succès et cela fonctionne bien, merci à Pusch3l de l'avoir testé ! Et encore plein d'autres choses. \n \n \n \n\n \n \n \nChangelog : \n \n- Core DEX patché pour contourner le bip de l'ambulance (noyau DEX chargé avec CEX TargetID)\n- Options [Convertir en CEX/DEX] mises à niveau avec plus de sécurité pour éviter les problèmes\n- Options [Activer/Désactiver la prise en charge de DEX OFW] mises à niveau avec plus de sécurité pour éviter les problèmes\n- Ajout d'informations sur le mode Cobra externe actuel dans [Informations Cobra]\n- Message PlayStation Home d'origine rétabli dans XMB (Merci à @DeViL303 )\n- Correction de l'erreur 80710A06 lors du téléchargement de la mise à jour des PKG/webMAN MODs depuis le XMB avec VSH DEX\n- Correction de la traduction italienne de xai_plugin (Merci à Weeddaa3)\n- Mise à jour du programme de mise à jour xai_plugin vers la version 1.5\n- Mise à jour xai_plugin disponible depuis le XMB\n- Mise à jour des options « Activer FTP » et « Désactiver FTP » de xai_plugin avec un serveur FTP plus récent\n- Ajout de l'option « Afficher les informations du lecteur BD » dans [Outils de base] dans xai_plugin\n- Émulateurs PS1 et PS2 mis à jour\n- Ajout de l'option « Afficher les informations PS3 » (demandée par Luanteles)\n- L'option « Cobra Information » affiche désormais l'étape 2 actuelle et l'appel système 8\n- Ajout des émulateurs PS1 et PS2 recherchés et développés par mrjaredbeta et kozarovv\n- Icônes et fichiers XML du plug-in de téléchargement étendu fixe\n- Correction du format « .ntfs[PS3ISO] » dans Cobra lors du chargement des ISO cryptés\n- Ajout du plugin de téléchargement étendu par DeViL3O3\n- CEX game_ext_plugin.sprx est revenu à DEX pour éviter les problèmes avec PS Plus\n- Correction de la vérification externe du noyau lors de l'utilisation de l'option [Swap Kernel] dans PEX/D-PEX\n- Correction d'un écran noir aléatoire lors de l'activation des indicateurs d'assurance qualité\n- Flags QA avancés mis à jour (merci à Zecoxao et Soul)\n- Correction du code d'erreur 0x800299D2 et de l'écran noir (lecture Blu-ray/DVD en mode CEX/DEX)\n \n \n \nTéléchargement : CFW 4.91.2 Evilnat / Liens Mega\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202063/in-ps3-cfw-4912-evilnat-version-stable-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[Vita] ONEMenu pour PS Vita v3.21 disponible",
        "content": "La Team ONElua propose une nouvelle version de ONEMenu pour PSVita qui passe en v3.21. OneMenu LUA est un manager qui sépare les jeux et les applications installés sur votre console en plusieurs catégories. Si vous connaissez déjà ONEmenu de la PSP, alors vous avez déjà un bon aperçu de ce que ONEMenu peut proposer. Onemenu est livré avec un explorateur de fichiers intégré, il a pris la suite d'App Manager Plus qui n'a plus été mis à jour.\n \n \n \n\n \n \nChangelog 3.21 :\n \n- Ajout d'étoiles à l'occasion de Noël\n- Correction de la détection de la Gamecard\n- Corrections de bugs et quelques improvisations.\n \n \nTéléchargement : ONEMenu-for-PSVita 3.21\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202061/in-vita-onemenu-pour-ps-vita-v321-disponible-1.png"
        }
    },
    "news_3": {
        "title": "[PS2] Apollo Save Tool v1.0.2 disponible",
        "content": "Le développeur Bucanero propose une nouvelle version d'Apollo Save Tool pour la PS2, proposé comme un défi il y a bientôt deux ans, cette version n'a finalement que très peu évoluée. \n \nAvec cette nouvelle mouture, le développeur a souhaité faire évoluer le format d'importation spécifique à la PS2 en amenant la conversion WMC pour les fichiers .MAX, .CBS, .XPS, et .SPS.\n \nEn plus de cela il a rendu la possibilité de charger à partir de cdfs:/ ou de mass:/ des sauvegardes hors ligne à partir d'une base de données. \n \n \n\n \n \nAjout :\n \n-> Prise en charge de formats d'enregistrement PS2 supplémentaires lors de l'importation dans des VMC PS2 : \n- Importation dans un VMC - Nouveaux formats pris en charge : .MAX, .CBS, .XPS, .SPS\n \n-> Ajout de la prise en charge du chargement d'une base de données de sauvegarde hors ligne (à partir de cdfs:/, mass:/) :\n- Remarque : le lecteur de masse doit être disponible pour décompresser les fichiers de sauvegarde.\n- Essayez le fichier sample-save-pack.zip comme pack de base de données hors ligne rapide.\n \nCorrection :\n \n- Résolution d'un problème lors de l'exportation de sauvegardes PS1 à partir de cartes mémoire\n \n \nTéléchargement : Apollo Save Tool v1.0.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202059/in-ps2-apollo-save-tool-v102-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[PS4] ps5debug v1.0b2 disponible",
        "content": "Il y a un peu plus d'un an, en Novembre 2023, SiSTR0 dévoilait la version v1.0b1 de PS5debug, et bien voici qu'en ce jour de Noël, un autre développeur bien connu ctn123 dévoile la version v1.0b2.\n \nComme sur PS4, PS5Debug est un payload qui permet de profiter d'un débogueur, il offre donc de nombreuses possibilités, il conserve d'ailleurs la même API que la version PS4, ce qui fait que la compatibilité est totale avec la bibliothèque libdebug. \n \nAvec PS5Debug vous allez pouvoir d'un programme vous permettant de supporter le mode repos, un scanner de console ou encore un serveur klog sur le port 3232. Il existe aussi des commandes permettant d'obtenir l'adresse de la base de la section exécutable.\n \n \n\n \n \n \nPs5debug v1.0b2 est maintenant disponible, le développeur s'excuse d'avoir mis autant de temps à sortir cette version, il n'avait pas réellement pris le temps de découvrir les bugs de la version PS5.  \n \nReaper studio v.1.0.4.2 et MultiTrainer II v.1.1.8.2 seront publiés peu après, pour profiter des nouvelles fonctionnalités. Le développeur tient à remercier Kameleonre pour son soutien, et Pharaoh2k pour les tests approfondis.\n \n \nChangelog ps5debug v1.0b2 :\n \n- Correction du problème d'attachement/détachement lorsque le jeu se termine pendant une session de débogage.\n- Amélioration de la prise en charge du débogage des processus multithreads.\n- Amélioration des allocations pour les cheats.\n- Améliorations générales de la stabilité.\n- Amélioration générale des performances.\n- Ajout de la prise en charge de la version 5.xx\n- Ajout de la prise en charge du chargeur elf 9021.\n- Implémentation de points d'arrêt matériels.\n- Optimisations pour kstuff.\n \n \n \nTéléchargement : ps5debug v1.0b2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202057/in-ps4-ps5debug-v10b2-disponible-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS4] Remote Lua Loader v3.0 disponible",
        "content": "Le développeur Master-s nous propose de découvrir la version 3.0 de Remote Lua Loader. les versions s'enchainent rapidement pour apporter quelques petites nouveautés de mouture en mouture mais là c'est autre chose ! \n \nComme vous le savez Remote Lua Loader est un script python déployé pour la PS4 et PS5 (et leur versions pro), permettant de charger des fichiers via l'utilisation de Lua dans les jeux construits autour du moteur Artemis. \n \nLe point d'entrée étant un jeu, ce loader ne dépend pas de la version du firmware installée, et fonctionne donc sur tous les firmwares, il a ainsi été testé avec succès sur le dernier firmware de la PS5 et de la PS5 Pro.\n \n \n\n \n \nCependant avec cette nouvelle version 3.0, c'est carrément le dump de jeu sur app0 qui vient d'arriver, ce n'est pas rien ! Oui vous avez bien lu, avec cette possibilité Lua vous pouvez désormais dumper des jeux. \n \nTéléchargement : Remote Lua Loader v3.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202056/in-ps4-remote-lua-loader-v30-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[DS/2DS/3DS] TWiLight Menu++ et nds-bootstrap en Christmas Release",
        "content": "Le développeur RocketRobz propose une version Christmas Release de TWiLightMenu et de nds-bootstrap qui respectivement sont proposés en v27.12.3 et en 2.3.0.\n \nDes correctifs pour les thèmes 3DS, résolvant un soucis de crashs, certains bugs liés à l'utilisation des linkers SuperCar Rumble, et d'autres sur l'EZ-Flash Vi. \n \nEnfin la prise en charge automatique a été désactivée jusqu'à ce qu'un correctif soit disponible. \n\nChangelog 27.12.3 de TWL\n \nChangelog 2.3.0 de nds-bootstrap\n \n \n \nTéléchargement : TWiLight Menu++ et nds-bootstrap\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202050/in-ds2ds3ds-twilight-menu-et-nds-bootstrap-en-christmas-release-1.png"
        }
    },
    "news_7": {
        "title": "Joyeux Noël à tous les lecteurs et lectrices de Logic-Sunrise.com",
        "content": "Chers amis Sunriseurs et Sunriseuses,\n \nCe soir c'est Noël, cela ne vous aura pas échappé, et nous tenons à vous souhaiter un merveilleux réveillon de Noël rempli de joie, de bonheur et de moments inoubliables avec vos proches. Que cette journée soit l'occasion de créer des souvenirs précieux et de partager des instants magiques avec ceux que vous aimez, ou juste un bon repas.\n \nLes rues sont illuminées par des décorations festives et l'esprit de Noël se fait ressentir partout, soudainement les queues se sont allongées dans les magasins pour les retardataires, et chez le poissonnier il faut désormais patienter pour être servi.\n \n \n\n \n \nDans l'univers du jeu vidéo, c'est également le moment de célébrer avec une multitude de surprises pour les joueurs du monde entier, notre art. Que vous le fêtiez de manière physique, vidéoludique ou virtuelle, profitez pleinement de cette période festive.\n \nEn ce 24 décembre 2024, nous sommes à quelques heures de la plus grande fête de l'année. Nous espérons que cette journée et que ce réveillon de Noël 2024 apportera de la joie à chacun, que ce soit à travers les cadeaux ou les moments passés en famille. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201984/in-joyeux-noel-a-tous-les-lecteurs-et-lectrices-de-logic-sunrisecom-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS4] Lapy va proposer probablement la mise à jour d'Easy PKG Extractor",
        "content": "Le développeur Lapy vient de mettre en ligne un post et une courte vidéo de ce qui serait la mise à jour d'Easy PKG Extractor. \n \nIl a annoncé sur son profil X qu'il va offrir à tout ceux qui l'ont soutenu un petit cadeau pour Noël sans préciser ce que c'est exactement. Cependant il a rajouté que cet outil sera compatible avec PS4-Xplorer 2.03 sur tous les firmwares, du 5.00 au 11.00. \n \n \n \n\n \n \n \nSi vous lui avez déjà fait un don, il suffira de lui envoyer un DM pour l'obtenir. \n \n \n\n \n \nCe cadeau semble être la mise à jour d'Easy PKG Extractor un logiciel qu'il ne souhaitez plus proposer pour des raisons éthiques comme nous vous l'avions expliqué en Mars 2022. \n \n \nDans mon pays, le piratage est pratiquement légal et beaucoup de mes amis vendent des PKG pour gagner leur vie. Mon application (NDLR : Easy PKG Extractor) leur était nuisible, c'est pourquoi je ne l'ai pas encore mise à jour.\n \n \nIl se pourrait que Lapy a donc évolué sur la question, et souhaite donc proposer la mise à jour de ce logiciel, espérons que cela soit cela, ce serait une excellente nouvelle tellement ce soft est utile. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1296316698.jpg"
        }
    },
    "news_9": {
        "title": "[PS3] PS3HEN 3.3.1 Bêta Test 6 d'esc0rd3w disponible",
        "content": " \n \nLe développeur esc0rd3w est de retour avec une nouvelle version de PS3HEN 3.3.1 qu'il souhaite mettre à jour afin de proposer les dernières nouveautés à la PS3. Ce sont pas moins de 6 versions tests qui ont été proposées via PSX-Place.com.\n \n \n \n\n \n \n \nLes changements sont nombreux après un mois de développement :\n \n- Le code lié à la création de fichiers RIF a été retravaillé de mappath vers les fichiers source et d'en-tête make_rif. OP a été mis à jour pour refléter les changements, et tous les anciens packages de test ont été archivés. \n \n- Il a aussi optimisé le code pour qu'il corresponde plus étroitement à la base du code COBRA actuel. Les fonctions mutex ont également été mises à jour dans mappath.\n \n- Cette mise à jour ajoute la prise en charge de la lecture du fichier rap.bin et la prise en charge de PS Home avec XML personnalisé de DeViL303\n \n- Ajout d'une version non-debug (test31b) et d'une autre pour laquelle @aldostools (test32) a apporté quelques modifications pour les performances\n \n- Mises à jour de make_rif depuis @aldostools pour les performances\n \n \nS'agissant de versions tests, ces versions sont à réserver à un public averti, qui pourraient rencontrer des bugs, il faut maitriser le sujet d'ailleurs l'URL dev devrait installer le package 3.3.1 uniquement si vous avez activé le mode développement dans HEN via HFW Tools -> Development.  \n \n \nLien de téléchargement : PS3HEN 3.3.1 Bêta Test 6\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-329717278.png"
        }
    },
    "news_10": {
        "title": "[Wii/GC] Swiss v0.6r1788 disponible avec de nombreuses nouveautés",
        "content": " \nLe développeur Extrems a travaillé énormément sur sa solution Swiss pour la Nintendo Wii et Nintendo Gamecube. \n \nComme vous le savez probablement Swiss est le digne successeur de SD-boot, il permet de lancer les homebrews GameCube mais aussi les backups stockés sur carte SD ou un disque dur, SDGecko, WODE, Wiikey Fusion et bien d'autres solutions. \n \nAu programme de cette version des changements imposants procédés par Extrems. \n \n \n\n \n \n \n \n \n \nChangelog : \n \n- Ajout le pilote de base du W5500 dans l'hyperviseur.\n- Ajout d'un pilote de base pour le W6100 dans l'hyperviseur.\n- Prise en charge du démarrage propre avec des jeux à 2 disques sur FlippyDrive.\n- Cacher les extensions .gcm.gcm et .iso.iso.\n- Ne copier le nouveau nom que si le renommage réussit.\n- Ne gérer les interruptions que lorsque c'est nécessaire.\n- Ajout de la sélection du profil RetroTINK-4K via ser2net.\n- Prise en charge du passage du lecteur de disque FlippyDrive.\n- Ajout d'un délai d'attente en cas de problème de couverture du FlippyDrive.\n- Tentative de décachetage du FlippyDrive lorsqu'un seul lecteur de disque est détecté.\n- Ne pas forcer le menu IPL à la sortie lorsque le FlippyDrive est présent.\n- Correction d'un masque de réseau erroné après un échec DHCP lors de la première installation.\n- Remplacer le cache FAT par libdvm.\n- Intégration du patch « contiguous clusters » de Wonderful Toolchain.\n- Correction d'une erreur de croissance de fichier sur exFAT.\n- Mise à jour de FatFs vers R0.15a.\n- Ne cacher que les fichiers cachés dans la vue triée.\n- Utiliser la vue non triée pour le démarrage automatique.\n- Appliquer la transparence à l'icône des fichiers cachés.\n- Ajout de Wii Swiss Booter.\n- Améliorer le transfert depuis le cMIOS.\n- Réécriture de la branche à la place.\n- Correction d'une coquille bizarre dans FSI_TrailSig.\n- Ajout d'une option permettant de réinitialiser les paramètres globaux/par défaut du jeu.\n- Mise à jour de la base de données No-Intro.\n- Mise à jour de la base de données Redump.\n- Déplacement de l'appel disk_shutdown vers f_mount.\n- Ajout de l'affichage du registre CID de la carte SD.\n- Ajustement pour les changements de libogc2.\n- Ajout de l'option hide file pour les périphériques FAT.\n- Cacher à nouveau le répertoire swiss.\n- Reconnaissance des fichiers .fdi sur FlippyDrive.\n- Ajout d'une solution de contournement pour la taille de fichier byteswapped.\n- Prise en charge du masquage des fichiers .dot sur tous les appareils.\n- Refonte des vérifications de la version de FlippyDrive.\n- Ajout d'un nom d'affichage pour les répertoires d'applications et de jeux.\n- Utilisation d'une vue non triée pour l'entrée de l'autoload.\n- Implémentation de statFile pour une utilisation future.\n- Compatibilité avec F-Zero GX Unleashed.\n- Ajout de l'affichage des classes de vitesse de la carte SD.\n- Affichage de la capacité totale de la carte SD.\n- Ajout d'une option pour désactiver un emplacement de carte mémoire.\n- Prise en charge du redémarrage sur FlippyDrive avec passthrough actif.\n- Retour anticipé si le périphérique n'a pas de répertoire.\n- Réduire le risque de blocage avec une liste récente vide.\n- Appliquer les graphiques appropriés pour ETH2GC Netcard+.\n- Éviter d'afficher une bannière factice dans le navigateur de fichiers.\n- Ajouter l'icône de fichier FPKG.\n- Activer le support du port série 1 dans l'hyperviseur.\n- S'assurer que tous les périphériques sont désinitialisés à la sortie.\n \n \nTéléchargement : Swiss v0.6r1788\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201968/in-wiigc-swiss-v06r1788-disponible-avec-de-nombreuses-nouveautes-1.jpg"
        }
    },
    "news_11": {
        "title": "[PS4] PPPwnUI 3.32a disponible avec GoldHEN 2.4b18.2",
        "content": "Le développeur Aldo Vargas, Aldostools, propose la mise à jour de PPPwnUI qui est maintenant déployé en v3.32a modded by aldostools.\n \nCette version a pour principale nouveauté l'intégration de la toute dernière version GoldHEN 2.4b18.2 de Sistr0. \n \n \n\n \n \n \nPPPwnUI 3.32a mis à jour avec la dernière version GoldHEN 2.4b18.2 par SiSTR0 :\n \n- Ajout du patch PPPoE pour éviter les exploitations multiples\n- Améliorations de l'analyse des packages :\n- Les dossiers commençant par un point et ceux contenant un fichier « .ignore » seront automatiquement ignorés.\n \n \n \nTéléchargement : PPPwnUI 3.32a\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201959/in-ps4-pppwnui-332a-disponible-avec-goldhen-24b182-1.png"
        }
    },
    "news_12": {
        "title": "[Wii/WiiU] Bluebomb Micro v1.1 disponible",
        "content": "Le développeur GaryOderNichts, à qui l'on doit des outils comme UDPIH, Bloopair, DNSpresso, Wii U recovery menu, ou encore BluUBomb, vient de mettre en ligne une nouvelle version de Bluebomb Micro. \n \nCette version est un portage de BlueBomb de BlueKitchen qui fonctionne sur divers systèmes embarqués et microcontrôleurs.\n \n \n\n \n \n \nCette nouvelle version ajoute le support des Raspberry Pi Pico 2 W, en plus des Raspberry Pi Pico W, et il supportait déjà les périphériques équipés de ESP32. \n \n \n\n \n \nUsage :\n \n- Assurez-vous que votre microcontrôleur est branché et que BlueBomb Micro est en marche.\n- Si votre microcontrôleur est équipé d'une LED, elle clignotera lentement à ce stade.\n- Démarrez votre Wii et accédez à l'application que vous exploitez. Pour le menu système, il vous suffit d'allumer la Wii, vous pouvez la laisser sur l'écran Santé et sécurité.\n- Éteignez votre Wiimote à ce stade. NE LAISSEZ RIEN d'autre se connecter à la console via Bluetooth.\n- Assurez-vous que votre console est proche de votre microcontrôleur. Vous devrez peut-être la rapprocher pour la mettre à portée, cela dépendra de votre microcontrôleur.\n- Cliquez sur le bouton SYNC de votre console. Vous devrez peut-être cliquer dessus plusieurs fois de suite avant qu'il ne voie le microcontrôleur.\n- Si votre microcontrôleur est doté d'une LED, vous saurez qu'il est connecté lorsque la LED commencera à clignoter rapidement. Arrêtez d'appuyer sur le bouton SYNC et attendez que BlueBomb s'exécute. BlueBomb Micro chargera un fichier boot.elf à partir de la racine d'une clé USB formatée en FAT32 et l'exécutera. Vous pouvez utiliser le fichier boot.elf de l'installateur HackMii à partir d' ici pour obtenir le canal Homebrew.\n \n \nTéléchargement : Bluebomb Micro v1.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201954/in-wiiwiiu-bluebomb-micro-v11-disponible-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS4] GoldHEN v2.4b18.2 disponible",
        "content": "Et voilà il n'aura pas fallu attendre bien longtemps, le nouveau GoldHEN est disponible, il s'agit de la version v2.4b18.2 qui est proposée par SiSTR0 contre un petit café ou bien vous pouvez aussi l'obtenir gratuitement, il suffit juste de rentrer son adresse email. Bien entendu certains hosts vont mettre à jour leur proposition pour l'intégrer directement.\n \n \n\n \n \n\n \n \nDescription : \n \nBonjour à tous ! La nouvelle version bêta est disponible ! Désolé pour l'attente mais comme toujours dans mon temps libre je continue à travailler sur GoldHEN pour l'améliorer et ajouter de nouvelles fonctionnalités utiles à tous.\n \nMerci à mes amis ctn et kameleon pour leur soutien continu, pas seulement technique ! \n \nMerci aussi à tous ceux qui ont soutenu mon projet sur kofi !\n \n \nChangelog v2.4b18.2 :\n \n- Ajout d'un correctif PPPoE pour éviter les exploitations multiples\n- Amélioration de l'analyse des paquets :\n- Ajout de la prise en charge de l'exclusion de dossiers lors de l'analyse des paquets. Les dossiers commençant par un point (par exemple, « .test ») et ceux contenant un fichier « .ignore » seront automatiquement ignorés.\n \n \nListe des choses à faire\n \n- Ajouter la prise en charge de la version 9.03 et d'autres versions\n- Ajouter d'autres fonctionnalités étonnantes\n \n \nComme toujours, je vous rappelle qu'il s'agit d'une version bêta et que malgré mes vérifications minutieuses et celles des testeurs, certains bugs peuvent émerger.\n \nMerci de les signaler sur le serveur discord si vous en trouvez.\n \n \nTout est là : GoldHEN v2.4b18.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201950/in-ps4-goldhen-v24b182-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201950/in-ps4-goldhen-v24b182-disponible-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS4] PPlay 4.01 disponible",
        "content": "Le développeur psbax4 propose une nouvelle version de PPlay via PSXhax.com à destination de la PS4. Cette nouvelle version se distingue car elle prend en charge le DLNA, le stream et le https. \n \nDe plus dans cette version les shaders sont précompilés et les options réseau ont été mises à jour. \n \n \n\n \n \nLisez le fichier readme.txt pour la configuration, le développeur souhaite regarder s'il peut intégrer le support CEC, mais il pense que le matériel HDMI ne soit pris en charge par les logiciels open source.\n \n \n \nTéléchargement : PPlay 4.01 (PKG)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201938/in-multi-pplay-401-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[WiiU] Le plugin Aroma Better Settings passe en version 1.2",
        "content": "Le développeur Fangal-Airbag propose la version 1.2 de Better Settings, il s'agit d'un plugin Aroma, qui permet d'afficher des informations importantes sur la TV et d'apporter le support des contrôleurs Wii U Pro et Wii Classic. Cela rend l'accès aux paramètres du système plus pratique et intuitif.\n \n \n\n \n \nCe plugin est particulièrement utile pour les utilisateurs cherchant à améliorer leur expérience avec les paramètres système de la Wii U. Il permet de :\n \n- Afficher des informations importantes directement sur la TV.\n- Utiliser différents contrôleurs pour naviguer dans les paramètres.\n- Améliorer l'ergonomie et la convivialité des paramètres système.\n \nInstallation :\n \nPour installer Better Settings, placez le fichier .wps dans sd:/wiiu/environments/aroma/plugins. Accédez au menu de configuration du plugin en appuyant sur L+D-Pad Bas+Moins sur le GamePad, le Pro Controller ou le Classic Controller.\n \nChangelog 1.2 : \n \nBetter Settings utilise désormais la nouvelle API de stockage pour stocker les paramètres du plugin. : \n \n- Mises à jour de la nouvelle API de stockage WUPS\n \n \n \nTéléchargement : Better Settings 1.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201937/in-wiiu-le-plugin-aroma-better-settings-passe-en-version-12-1.png"
        }
    },
    "news_16": {
        "title": "[Multi] ScummVM v2.9.0 disponible",
        "content": " \nDepuis début Novembre 2024 l'équipe en charge du développement de ScummVM travaillait sur une nouvelle version de leur émulateur et proposait à quelques bêtas testeurs de les pré-tester. Et bien voilà que cette nouvelle version débarque sous l'estampille 2.9.0. \n \n \n\n \n \nPrès d'un an après la dernière sortie de la dernière version majeure, voilà une nouvelle version importante, qui amène par exemple le support de 15 nouveaux jeux, et une nouvelle plateforme supportée, avec notamment la version iOS qui rajoute la prise en charge de l'Apple Pencil, mais aussi le portage officiel pour Sailfish OS.\n \nFaisons le tour du changelog pour comprendre les améliorations de cette version 2.9.0 :\n \nLe support de 15 nouveaux jeux : \n \nThe Adventures of the Good Soldier Schweik\nBackyard Basketball\nCastle Master\nMarvellous Mice Adventures: Meeting Sea Rat\nMarvellous Mice Adventures: Sea Rat's Birthday\nMask Show\nMoonbase Commander\nOrion Burger\nRise of the Dragon\nThe Space Bar\nThimbleweed Park[^1]\nTotal Eclipse\nTotal Eclipse 2\nUnrest\nWait for it! Issue 3. Song for a Hare\n \n \nNouvelle plateforme :\n \nScummVM dispose désormais d'un portage officiel pour Sailfish OS. En attendant l'apparition des versions officielles, les utilisateurs aventureux sont invités à créer leur propre copie très personnalisée !\n \nAméliorations notables du moteur :\n \nLe moteur AGS a été mis à jour vers la version 3.6.1.30 en amont, ce qui ajoute la prise en charge de certains jeux récemment sortis, tels que Stranger in Utopia, The Phantom Fellows et It Takes Two to Tangle.\n \nLa prise en charge de Keymapper a été ajoutée à plus de 20 moteurs, permettant la personnalisation des touches, des boutons de la souris et des boutons du joystick utilisés pour jouer aux jeux.\n \nLe moteur SCI bénéficie de nombreuses corrections de scripts pour divers jeux et d'une impressionnante fonction de réparation vocale pour Gabriel Knight 1 CD.\n \nLe moteur SCUMM apporte des améliorations graphiques et audio pour la version Macintosh de plusieurs jeux.\n \n \nAméliorations notables de la plateforme :\n \nLa version macOS pour les systèmes Intel et Apple Silicon récents a été signée et notariée, elle a donc été acceptée par Apple Gatekeeper.\n \nLa version Android prend désormais en charge Android 15 et offre une prise en charge améliorée de la manette de jeu.\n \nLa version iOS ajoute la prise en charge de l'Apple Pencil, qui était l'une des fonctionnalités les plus demandées.\n \n \n \nTéléchargement : ScummVM v2.9.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201936/in-multi-scummvm-v290-disponible-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] Apollo Save Tool v2.0.0 disponible",
        "content": "A l'occasion de Noël, Damina Parrino, alias Bucanero, nous propose la version 2.0.0 d'Apollo Save Tool qu'il dévoile comme un cadeau pour le réveillon. \n \nVoici une version anticipée de Noël de la PS4 Apollo Save Tool v2.0.0, Apollo prend prend désormais en charge tous les firmwares PS4 actuels/passés/futurs sans aucun correctif ShellCore. \n \nAttention il convient de bien lire l'encadré selon les firmwares si vous souhaitez jouer avec les trophées. \n \n \n\n \n \nChangelog 2.0.0 : \n \nAjout : \n- Support complet du firmware PS4 (fonctionne sur tous les FW) - merci à hzhreal / Team-Alua\n- Agnostique au niveau du firmware\n- Pas besoin de GoldHEN, PS4HEN, ou ps4debug payload\n \nGestion des trophées :\n- Liste, montage et exportation des trophées\n- Fake trophées XMB (verrouiller/déverrouiller)\n- Exportation et sauvegarde des trophées\n- Suppression de jeux de trophées\nSupprimer les sauvegardes PS4\nAffiche la date et l'heure de la dernière modification de la sauvegarde\n \nRemarque : la suppression d'un ensemble de trophées supprime les fichiers de trophées critiques du compte de l'utilisateur, et le fait d'essayer de jouer à nouveau au jeu ne permettra pas d'obtenir les trophées de cet utilisateur.\n \nRemarque : le faux déverrouillage des trophées ne modifie pas les fichiers de trophées sécurisés ; il ne fait que modifier la base de données du XMB. Si vous jouez au jeu après avoir appliqué les modifications, les faux résultats peuvent être réinitialisés par le système.\n \nTéléchargement : Apollo Save Tool v2.0.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201901/in-ps4-apollo-save-tool-v200-disponible-1.jpg"
        }
    },
    "news_18": {
        "title": "[Switch] SaltyNX 1.2.0 et FPSLocker 2.1.0 disponibles",
        "content": " \n \nLe développeur Masagrator a publié des mises à jour pour SaltyNX et pour FPSLocker, la communauté des moddeurs de la Nintendo Switch a été récemment mise au courant de la sortie de nouvelles versions de SaltyNX et FPSLocker, deux outils essentiels pour améliorer les performances et la compatibilité des jeux sur la console. \n \n \n \n\n \n \n \nSaltyNX est un processus en arrière-plan qui permet l'injection et la modification de code. Il est utilisé par divers outils tels que ReverseNX-Tool, ReverseNX-RT, et Status Monitor en conjonction avec NX-FPS, UnityGraphics, et plusieurs mods de Smash. SaltyNX est basé sur shinyquagsire23 et inclut de nombreuses améliorations l'expérience utilisateur (QoL) ainsi que le support des plugins.\n \nSaltyNX est particulièrement utile pour les moddeurs et les joueurs qui souhaitent optimiser leurs jeux sur la Nintendo Switch. Il permet de :\n \n- Afficher la fréquence d'images des jeux via le Status Monitor Overlay.\n- Modifier les paramètres de rendu pour améliorer les performances visuelles.\n- Faciliter le modding en affichant les résolutions utilisées par les jeux.\n- Exécuter des mods et des plugins pour des jeux 64-bit non compatibles avec les plugins externes\n \n \nChangelog 1.2.0 : \n \n- Ajout du support pour le changement des taux de rafraîchissement en mode docké, de 40 à 60 Hz.\n- Le symodule supporte maintenant la dernière version de libnx.\n- Le core est désormais totalement indépendant des nouvelles versions de libnx.\n- La formule mathématique pour changer le taux de rafraîchissement en mode portable a été considérablement améliorée.\n- Dans NX-FPS, diverses fonctions liées à l'envoi des images à l'affichage partagent maintenant une fonction commune pour compter les FPS, ce qui permet d'éviter les situations où différentes API pourraient avoir des problèmes différents.\n- Le taux de rafraîchissement est écrit dans le pointeur displaySync de NX-FPS chaque fois que le jeu fonctionne avec la synchronisation d'affichage activée.\n- Désactiver SaltyNX dans SaltyNX-Tool ne causera plus de problèmes avec dmnt.gen2 lorsqu'il est attaché avec l'application monitor wait.\n- Merci à toutes les personnes qui ont testé cela au cours des trois dernières semaines.\n \n \nTéléchargement : SaltyNX 1.2.0 \n \n \n\n \n \n \nIl a également mis à jour FPSLocker, cela n'avait pas été le cas depuis plus de 2 mois. FPSLocker est une superposition qui, en conjonction avec SaltyNX, permet aux utilisateurs de définir des taux de rafraîchissement personnalisés et des FPS dans les jeux Nintendo Switch. Cela permet d'améliorer les performances visuelles et de réduire les problèmes de latence.\n \n \nChangelog 2.1.0 : \n \n- Ajout de la prise en charge de la modification des taux de rafraîchissement en mode ancré. Pour en savoir plus, consultez le fichier README.\n- Modification de certains choix de conception de libtesla pour le rendre moins gourmand en ressources CPU. Correction de problèmes où l'ouverture de FPSLocker pouvait entraîner une baisse visible des performances dans certains jeux.\n- Chaque fois que le patch FPSLocker force actuellement 60 Hz, la superposition en informera dans le menu principal\n- SaltyNX 1.2.0+ est OBLIGATOIRE ! L'utilisation d'anciennes versions de SaltyNX peut et va probablement causer des problèmes !\n- Pour les jeux Xenoblade Chronicles et The Legend of Zelda, il est nécessaire de retélécharger la configuration et de la convertir en patch, sinon attendez-vous à des problèmes.\n \n \nTéléchargement : FPSLocker 2.1.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201892/in-switch-saltynx-120-et-fpslocker-210-disponibles-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201892/in-switch-saltynx-120-et-fpslocker-210-disponibles-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS4] Une nouvelle version de GoldHEN sur PS4 pour Noël",
        "content": "Le développeur SiSTR0 propose une nouvelle version de GlodHEN, le plugin magique de la PS4 débarque dans une version Noël qui répond aux attentes de certains utilisateurs. \n\n \nAvant toute chose, le développeur souhaite un Joyeux Noël à ceux qui le fête, mais concernant GoldHEN il dit avoir préparé une version qui devrait améliorer l'expérience pour ceux qui utilisent PPPwn. Il semble qu'il existe plusieurs implémentations qui tentent à plusieurs reprises d'exploiter la console, provoquant une instabilité importante. La nouvelle version inclut une fonctionnalité optionnelle qui corrige PPPoE pour empêcher de nouvelles tentatives d'exploitation.\n \nDans cette version, il a également implémenté une fonctionnalité demandée sur GitHub par certains utilisateurs : la possibilité de définir des règles d'exclusion de dossiers lors de l'analyse des paquets. Tous les dossiers commençant par un point et ceux contenant un fichier \".ignore\" seront ignorés, y compris leur contenu, lors de la recherche. \n \n \n\n \n \nIl publiera bientôt cette mini mise à jour et il espère qu'elle aidera beaucoup d'entre vous. Enfin il conclut en disant qu'il travaille aussi sur d'autres nouvelles fonctionnalités majeures qu'il publiera dès qu'elles seront prêtes et testées.\n \nTout est là si vous souhaitez supporter le développeur : ko-fi.com\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201859/in-ps4-une-nouvelle-version-de-goldhen-sur-ps4-pour-noel-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201859/in-ps4-une-nouvelle-version-de-goldhen-sur-ps4-pour-noel-2.png"
        }
    },
    "news_20": {
        "title": "[Switch] Sphaira proposé en version 0.4.1",
        "content": "L'alternative au hbmenu sur Nintendo Switch, Sphaira, vient d'évoluer sous les traits de son développeur TotalJustice. \n \nIl y a un peu moins d'une semaine, notre ami sunriseur dotmedhdi nous présenté Sphaira, la solution de remplacement du hbmenu proposant des fonctionnalités inédites, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \n \n\n \n\n \n \nLe soft a déjà pas mal évolué TotalJustice ayant proposé une build v0.4.0 assez riche, avec notamment une contribution de notre ami shadow256 qui a amélioré la traduction française, ainsi qu'une v0.4.1 qui vient corriger quelques bugs, notamment sur l'affichage de l'heure. \n \n \n\n \n\n \n \nChangelog v0.4.0 : \n \n- Amélioration de la traduction portugaise par ninstaren \n- Utilisation de la traduction du chinois natif par WE1ZARD\n- Traduction italienne ajoutée par LNLenost\n- Amélioration de la traduction française par shadow256\n- Traduction chinoise par do-kiss\n- Traduction japonaise par ITotalJustice\n- i18n : Amélioration des paramètres régionaux fr par acuteaura\n- Nouvelle icône par ninstar\n- Ajout du thème noir OLED par Sanrax\n- Traduction coréenne par Yorunokyujitsud\n- Mise à jour de fr.json par Battosai94\n- Mise à jour ajoutée\n- Extrait de texte dans le navigateur de fichiers \n- Correction des effets sonores incohérents \n- Ajout de temps au menu principal\n- Correction de Sphaira qui ne sort pas du menu d'accueil lorsqu'il est lancé en tant que hbmenu\n- Ajout de la prise en charge du chargement des traductions localement dans/config/sphaira/i18n/\n- Ajout d'une option pour installer un gestionnaire nro via le navigateur de fichiers\n \nChangelog v0.4.1 :\n \n- Correction de l'heure affichée en heure GM, au lieu de l'heure locale\n- Mise à jour de ru.json par J0hnTR\n \nTéléchargement : Sphaira v0.4.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201851/in-switch-sphaira-propose-en-version-041-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1201851/in-switch-sphaira-propose-en-version-041-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1201851/in-switch-sphaira-propose-en-version-041-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1201851/in-switch-sphaira-propose-en-version-041-4.jpg"
        }
    }
}