{
    "news_1": {
        "title": "[Switch] TegraExplorer v4.1.0-b1 disponible",
        "content": "Le développeur suchmememanyskill vient de mettre en ligne en cette fin du mois de Juillet 2023 une version correctrice de son superbe outil TegraExplorer comme vous le savez il s'agit d'un programme qui est un gestionnaire de fichiers qui vous permet de naviguer dans la partition système sysnand / sysmmc, de copier, de supprimer ou de créer des fichiers ou des dossiers, et de télécharger le firmware actuel sur la SD. \n \nL'outil n'avait pas été mis à jour depuis Février 2023, cette version apporte le support de la version OLED.\n \n \n\n \n \nChangelog : \n \n- Prise en charge de l'OLED Préversion\n- Cette version ajoute le support de la Switch OLED. Il s'agit d'une version très expérimentale, n'hésitez pas à signaler un problème via l'onglet problèmes ou via Discord. Si possible, utilisez la dernière version stable (v4.0.1).\n- Mise à jour du BDK vers Lockpick-RCM 1.19.10\n- Nouvelle stratégie de keydump, avec l'espoir d'atténuer les hotfixes du pkg1\n- Merci beaucoup à @JeffVi pour m'avoir aidé à porter le BDK Lockpick_RCM sur TegraExplorer !\n \n \n \n\n \n \n \nTéléchargement : TegraExplorer v4.1.0-b1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176473/in-switch-tegraexplorer-v410-b1-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176473/in-switch-tegraexplorer-v410-b1-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PS5] Interview de Flat_z suite au dump du PS5 bootrom PSP (Platform Security Processor)",
        "content": "Le développeur Flat_z hier a répondu à de nombreuses questions sur le discord PS5 sur l'image qu'il a proposé sur Twitter, faisons le tour de ce qu'il a découvert.\n \nNous vous proposons l'interview croisée, un résumé de questions réponses que Flat_Z a tenu sur le discord PS5. \n \n \n\n \n \n \n \nInterview croisée :\n \n \n\n \n \nQ : Cette image \" ROM : FFF0000 \" c'est ce que l'on pense, le dump du PSP (Platform Security Processor) ? \nR (Flat_z) : oui, c'est un dump du Platform Security Processor de la PS5.\n \nQ : Il y a beaucoup de clés importantes, il y a d'autres clés mineures dans le système\nR : Je ne publierai jamais d'informations confidentielles mais je veux essayer de l'implémenter (et divulguer si ça marche) des méthodes ou des trucs comme les fpkgs, comme je l'ai déjà fait pour la PS4.\n \nQ : Il y a des clés seeds dedans ? \nR : Je n'ai aucune idée, je viens de recevoir le dump il y a quelques minutes, mais ce que je sais c'est que le psp est la racine de la confiance, il contient le code du boot system, les key seeds, etc.\n \nQ : Obtenu à partir d'un logiciel comme fail0verflow ?\nR: Oui, c'est vrai\n \nQ : Vous en avez parlé à fail0verflow ?\nR : Oui, nous avons comparé nos dumps aujourd'hui\n \nQ : Le partagerez-vous avec d'autres personnes pour qu'elles puissent également travailler dessus ? Je suppose que non.\nR : L'idée est d'obtenir des clés pour l'IPL, puis des clés pour le SSD, de sorte que je puisse décrypter mon IPL à partir du dump du SSD et faire de la rétro-ingénierie dessus afin d'obtenir des clés, etc.\n \nQ : A quel firmware cela serait-il lié, ou parce que c'est une puce, c'est pertinent pour n'importe quel firmware qui a déjà un accès au kernel ? Ou bien vous concentrez-vous sur les versions 2.30-2.50 ?\nR : il s'agit plus de la révision du matériel que de la version du logiciel. Je ne sais pas si ou quand ils ont corrigé ce problème, mais d'habitude ils changent les clés entre les révisions de matériel, donc je suppose que les dumps de bootrom des révisions plus récentes ont d'autres clés.\n \nLe bug utilisé est d'ordre logiciel, aucun matériel hardware n'a été utilisé, je suis sur que cela fonctionne sur les firmware 2.xx, je suis actuellement sur firmware 2.50. Il dit qu'il a acheté sa PS5 en 2021, certainement un modèle de référence 1015 mais cela n'a que peu d'importance finalement. \n \nQ : C'est ce que j'essaie de comprendre. Il n'y a pas d'autre solution que de faire appel à l'ATM, car il s'agit d'une ATM spécifique au matériel (très probablement).\nR : Le but de cela est d'avoir des clés pour tous les firmwares (clés de tout sauf de l'IPL), l'objectif est aussi de fournir le même niveau de possibilité pour les fpkg. \n \nQ : Si cela est rendu public, cela pourrait-il signifier l'arrivée d'un CFW (custom firmware) ? Ou parce que Sony semble avoir tellement de puces qui ont besoin de se serrer la main, non ? \nR : Je sais pas si l'accès au bootrom pour certains appareils peut nécessairement signifier CFW ,et je ne sais pas si c'est le cas pour le ps5.\nLe problème, c'est qu'il n'y a pas d'autre solution que d'inverser le processus, il faudrait que d'autres vulnérabilités soient trouvées pour exploiter le bootrom. \n \nQ : Tous les bugs sont répertoriés sous https://www.psdevwiki.com/ps5/Bugs_%26_Vulnerabilities il vient de là ? \nR : Aucun de cette liste\n \nQ : Le ou les bugs seront un jour dévoilé(s) ? \nR : Bon, fail0verflow a été le premier à le faire, c'est donc à cette Team de décider de le publier ou non. Je pense que j'ai juste trouvé leur méthode. \n \nQ : Quels modèles sont affectés, il faudra du matériel ?\nR : J'ai un teskit et une PS5 Retail sous le dernier firmware également, cependant pour le dump, je reste sur le fimware 2.50 car j'ai tout implémenté pour elle, mais peut-être que je commencerai à travailler sur des firmwares plus récents à l'avenir, et j'ai aussi des trucs pour les 1.xx\n \nQ : Cela peut être porté sur des firmwares plus récents ? \nR : Qui peut le savoir. nous ne savons pas s'ils ont corrigé les bugs, ou quand ils l'ont fait. Mais avec les firmwares ou les révisions plus récentes ils ont probablement fait quelque chose.\n \nQ : Un CFW (Custom Firmware) ? \nR : Afin de permetre l'exécution de code, la ps4 n'a pas de firmware personnalisé, c'est juste des mods en temps réel, c'est la même chose ici.\n \nQ : Des plans pour SAMU (sur PS4), et donc un CFW sur PS4 ?\nR : Non, j'ai arrêté de travailler sur la ps4 il y a longtemps, j'ai tout ce qu'il y a dessus.\n \nJe suppose que les fpkgs peuvent être mis en oeuvre sur PS5 sans Hyperviseur, mais je n'en suis pas sûr, on ne peut pas savoir tant qu'on n'a pas essayé de l'implémenter.\n \nQ : On parle d'une solution un peu comme Okage ? \nR : Non, mais j'ai utilisé sur PS5 un jeu PS4, tout simplement parce que la ps4 est meilleure parce qu'il n'y a pas de xom userland. \nLe système fonctionne aussi sur la ps4, il est donc facile à déboguer. Je charge une sauvegarde corrompue qui exploite le jeu.\n \nSpecter rajoute à ce sujet : Le cryptage des sauvegardes et l'encrytage et signature sont en partie nécessaires, de même que le fait qu'il faille un très bon bug, car les bugs de type analyseur sont difficiles à exploiter dans les environnements ASLR.\n \nFlatz quand à lui rajoute que l'exploitation de l'hyperviseur peut se faire directement à partir de la sauvegarde, mais de rajouter qu'il s'agit d'un jeu original sur disque PS4. \n \nQ : Un jeu PSN ça marcherait ?\nR : Je ne veux pas utiliser les jeux PSN car ils nécessitent des act.dat ... (entendez par là des licences d'activation), de plus un jeu sur disque pourrait éventuellement marcher sur tous les firmwares si les offsets sont adaptés.\n \nQ : Il y a aussi un point d'entrée pour l'emu de la ps4. Nous ne sommes pas encore sûrs d'avoir besoin d'un exploit kernel pour ça, mais si Flatz n'en a pas besoin pour leur hack PSP, ça devrait être bon.\nR : Vous pouvez utiliser tout le reste, je suppose, Sony peut juste corriger les bugs importants comme dans le kernel/ Hyperviseur, les exploits dans les jeux sont hors de portée, et ceux dans les webkits. \n \n \n \nVoilà c'est tout pour le moment, en espérant que cette interview croisée vous a plu, et que nous en sachions davantage d'ici quelques jours ou semaines. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176427/in-ps5-interview-de-flat-z-suite-au-dump-du-ps5-bootrom-psp-platform-security-processor-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176427/in-ps5-interview-de-flat-z-suite-au-dump-du-ps5-bootrom-psp-platform-security-processor-2.jpg"
        }
    },
    "news_3": {
        "title": "[PS5] Flat_z dumpe le SP de la PS5",
        "content": "Le développeur Flat_z vient d'annoncer avoir réussi à dumper le Secure Processor (SP) de la PS5, ce qui confirme tout simplement qu'il dispose d'un exploit Hyperviseur.\n \n \n\n \n \n \nExplications ! \n \nFlat_z affirme avoir eu accès au processeur sécurisé de la plate-forme (PSP) de la PS5, cela signifie qu'il a accès à la plupart des clés de décryptage sur la console. Le pirate a également confirmé qu'il avait un exploit Hypervisor et a ajouté que toute la chaîne avait été déclenchée via un logiciel (pas de piratage matériel) via un jeu PS4 basé sur disque, cela confirme une nouvelle fois que pour hacker les consoles, il faut éviter les modèles digitaux sans lecteur.\n \nPar contre, et afin de se protéger de Sony, aucun détail n'a été donné que ce soit sur le firmware, et il n'a pour le moment pas l'intention de diffuser quoique ce soit. \nFlat_z revendique le piratage de l'hyperviseur PS5 par des moyens logiciels, et quand on connait sa renommée, nous ne pouvons que le croire, il dit simplement avoir réussi avec une toolchain déclenchée via un exploit sur un jeu PS4 sur disque. \n \n \n\n \n \nIl a dévoilé une capture confirmant qu'il a obtenir les accès ROM, et qu'il peut dumper les clés, clairement Flat_z a désormais accès à toutes les clés de décryptage PS5. Il a donc théoriquement l'accès au décryptage des fichier intégrés dans les firmwares, et des fichiers de jeu.\n \n \nLa suite ? \n \nRien n'est sûr, Flat_z si ça se trouve ne publiera jamais rien, on le connait sur PS4 il avait attendu des années avant de proposer certains de ses outils. Nous pouvons penser qu'il a trouvé un exploit similaire à celui de Fail0verflow mais l'arrivée d'un hack probable pourrait venir d'ailleurs, nombreux sont ceux à penser que la possibilité de lancer des fpkg pourrait venir d'autres possibilités que de devoir passer par un exploit hyperviseur. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176387/in-ps5-flat-z-dumpe-le-sp-de-la-ps5-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176387/in-ps5-flat-z-dumpe-le-sp-de-la-ps5-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1176387/in-ps5-flat-z-dumpe-le-sp-de-la-ps5-3.jpg"
        }
    },
    "news_4": {
        "title": "[PS5] Une nouvelle PS5 CFI-1300 va bientôt arriver",
        "content": "Il semble que Sony ait décidé de faire une nouvelle fois évoluer sa PS5, le modèle CFI-1300 vient d'être dévoilé dans les référencements. La CFI-1300, qui promet d'établir une nouvelle référence pour la PlayStation 5 disposerait d'un APU gravé chez TSMC en 5 nm, les précédents modèles CFI-1000 et CFI-1100 étaient gravés en 7 nm, tandis que le CFI-1200 disposait d'un APU gravé en 6 nm, ainsi avec cet AMR Ryzen amélioré et plus fin, moins de chaleur, donc la console n'aurait plus besoin de métal liquide. \n \nIl faut dire que le modèle de base consomme presque 200 watts, là où ce nouveau modèle CFI-1300 de PS5 lui ne consommerait que 120 à 140 watts. \n \nBien entendu les rumeurs vont bon train, et certains annoncent déjà qu'il s'agit du modèle Slim de la console, mais pour le moment rien n'est encore confirmé de ce côté là, mais s'agissant de la quatrième révision, si Sony fait comme pour la PS4, ce serait la SLIM.\n \n \n \n\n \n \n \nLe doute subsiste dans le fait que le modèle SLIM porte toujours la référence de série 2xxx, ce serait là aussi une première, qu'une série 1x00 soit une SLIM.\n \nLes remises commerciales récentes de toute façon laisse penser que Sony souhaite laisser le temps aux revendeurs d'écouler leur stock qu'ils avaient enfin commencer à constituer après 3 années chaotiques. De plus, il se pourrait aussi que ce modèle fasse l'impasse sur le lecteur optique, ce qui clairement serait une catastrophe, mais cela permettrait à Sony d'alléger le poids de la console, la consommation et les frais d'expédition, une bonne nouvelle quand on sait que la console vient de passer la barre des 40 millions d'unités vendues. \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176379/in-ps5-une-nouvelle-ps5-cfi-1300-va-bientot-arriver-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176379/in-ps5-une-nouvelle-ps5-cfi-1300-va-bientot-arriver-2.jpg"
        }
    },
    "news_5": {
        "title": "[Series X/S et XO] La toute nouvelle interface Xbox est disponible",
        "content": "Cher sunriseur, cher sunriseuse, aujourd'hui, les joueurs du monde entier peuvent enfin découvrir la nouvelle interface de la Xbox, offrant une expérience de jeu plus fluide et conviviale que jamais auparavant. Microsoft a déployé la mise à jour tant attendue, apportant une pléthore de fonctionnalités passionnantes pour les propriétaires de la console.\n \n \n \n\n \n \n \n \nVoici les principales caractéristiques de la toute nouvelle interface Xbox :\n \nFacilité d'accès à la bibliothèque, au MS Store, au Game Pass et aux Paramètres\n \nLa refonte de l'interface met l'accent sur la simplicité et la convivialité. Les joueurs peuvent désormais accéder facilement à leur bibliothèque de jeux, au Microsoft Store, au Game Pass et aux paramètres de leur console. Tout est pensé pour être intuitif et rapide, permettant aux utilisateurs de se plonger instantanément dans l'action sans tracas.\n \n \n\n \n \nNouvelle disposition des jeux et des éléments\n \nLa mise à jour apporte également une nouvelle disposition des jeux et des éléments sur l'écran d'accueil. Les icônes sont plus grandes et plus nettes, offrant une expérience visuelle améliorée. Les joueurs peuvent personnaliser leur disposition préférée pour un accès rapide à leurs titres et fonctionnalités les plus utilisés.\n \n \n\n \n \nFond d'écran mis en valeur\n \nL'esthétique est également au rendez-vous avec la nouvelle interface Xbox. Les fonds d'écran sont mis en valeur pour donner à l'écran d'accueil une ambiance unique et personnalisable. Les joueurs peuvent choisir parmi une variété de thèmes dynamiques, offrant ainsi une immersion totale dans leur univers de jeu préféré.\n \nCette mise à jour marque un tournant majeur pour la console Xbox, offrant aux joueurs une expérience améliorée, tant sur le plan de la fonctionnalité que de la présentation visuelle. \n \nBien entendu cela ne change rien au hack, les consoles Xbox semblent verrouillées et ce n'est pas la disponibilité de mise à jour qui va changer quelque chose. \n \n \nTout est là : news.xbox.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-131082183.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-881415111.jpg"
        }
    },
    "news_6": {
        "title": "[PS4] PS4Dumper 1.0 disponible",
        "content": "Le développeur codemasterv partage une nouvelle application pour faciliter le dump de contenu d'une PS4 vers un PC Windows. \n \nAinsi avec PS4Dumper vous allez pouvoir facilement dumper un jeu, mais il est également possible d'injecter différents payloads, y compris le payload GoldHEN.\n \n \n\n \n \nIl y a pas moins de 23 payloads intégrés dans le répertoire Bins, qui peuvent donc être mis à jour très facilement, en l'écrasant tout simplement. \n \n \n \n\n \n \nProcédure : \n \n- Téléchargez le fichier Release.zip\n- Décompressez le sur votre PC\n- Démarrez GoldenHEN et le serveur FTP sur votre ps4 \n- Démarrez votre jeu \n- Entrez vos informations IP et de port que votre PS4 \n- Cliquez sur Download\n \n \nTéléchargement : PS4Dumper 1.0 / Github\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176331/in-ps4-ps4dumper-10-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[WiiU] Tiramisu 0.1.2 et Aroma Bêta 15 disponibles",
        "content": "Il y a du mouvement pour la Nintendo Wii U puisque le développeur Maschell propose les mises à jour de Aroma et de Tiramisu. \n \nAroma, qui est l'environnement homebrew pour la Wii U, évolue une nouvelle fois avec de nouvelles options et corrections. \n \n \n\n \n \n \nChangelog : \n \n- Recompilation de tout avec les derniers wut, devkitppc, wums/wups pour améliorer la stabilité et arrêter le softlocking sur les erreurs FS\n- Mise en place d'un support pour l'appairage des contrôleurs et des GamePads dans le module Autoboot\n- Prise en charge de l'utilisation d'une Wiimote ou d'une manette Pro dans le module Autoboot (les combinaisons de boutons pour ouvrir ces menus ne fonctionnent que sur le GamePad)\n- Correction du chargement des fichiers .rpl depuis la carte SD\n- Toujours éviter la confirmation \"close app\" lors du lancement d'un homebrew\n- CURLWrapperModule utilise maintenant curl 8.0.1\n- Enregistrement de la version du module pour plus de modules à chaque démarrage de l'application.\n \nTéléchargement : Aroma Bêta 15\n \n \nDu côté de Tiramisu, qui est l'environnement qui peut être démarré avec l'EnvironmentLoader a lui aussi connu une mise à jour. Mais ici pas d\"éffusion de nouveautés car là le développeur n'a pas ajouté de nouvelles fonctionnalités. Cette version met à jour l'EnvironmentLoader et l'AutobootModule afin qu'ils utilisent la même version qu'Aroma. Il dit avoir corrigé quelques petits bugs sans préciser lesquels. \n \n \n\n \n \nTéléchargement : Tiramisu v0.1.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176265/in-wiiu-tiramisu-012-et-aroma-beta-15-disponibles-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176265/in-wiiu-tiramisu-012-et-aroma-beta-15-disponibles-2.jpg"
        }
    },
    "news_8": {
        "title": "[Vita/PSTV] FuHEN lancé, Eldritch proposé et Autoplugin mis à jour",
        "content": "L'actualité PlayStation Vita s'enchérit, et cela va perdurer dans le temps avec ce concours FuHEN qui relance la machine à homebrews sur PS Vita et PSTV pour notre plus grand plaisir. \n \n3 petites nouveautés pour la PS Vita, la première est l'ouverture officielle du concours FuHEN depuis le 22 Juillet 2023, rappelons que ce concours se tiendra jusqu'au 22 Septembre 2023, ensuite durant une semaine il y a aura des votes pour une annonce des gagnants le 29 Septembre 2023.\n \n\n \n \nCertains ne vont pas attendre, comme Rinnegatamante qui vient déjà de proposer son jeu, qui porte le titre de Eldritch. Il s'agit là d'un portage d'Eldritch pour PSVita basé sur le remaster Reanimated du jeu. Eldritch est un jeu d'action à la première personne inspiré des roguelikes, des simulations immersives et de H. P. Lovecraft.\n \n \n\n \n\n \n\n \n \nTéléchargement : Eldritch (Portage)\n \n \nAutre nouveauté, l'arrivée d'une mise à jour pour AutoPlugin II, mais ceci n'a rien à voir avec le concours FuHEN. Le logiciel AutoPlugin a été l'homebrew le plus téléchargés de la scène PlayStation Vita développé par theheroGAC et qui permettait d’installer facilement des plugins. L'équipe Onelua a ensuite repris le flambeau dans cette version II qui ajoute encore des caractéristiques plus complètes.\n \n \n\n \n \nCette version apporte la correction d'une erreur lors de l'installation du plugin Quicklauncher.\n \n \nTéléchargement : AutoPlugin2 2.07\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176249/in-vitapstv-fuhen-lance-eldritch-propose-et-autoplugin-mis-a-jour-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176249/in-vitapstv-fuhen-lance-eldritch-propose-et-autoplugin-mis-a-jour-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1176249/in-vitapstv-fuhen-lance-eldritch-propose-et-autoplugin-mis-a-jour-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1176249/in-vitapstv-fuhen-lance-eldritch-propose-et-autoplugin-mis-a-jour-3.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1176249/in-vitapstv-fuhen-lance-eldritch-propose-et-autoplugin-mis-a-jour-2.jpg"
        }
    },
    "news_9": {
        "title": "[PS3] Aldo Vargas (Aldostools) met à jour webMAN MOD 1.47.45",
        "content": "Vous êtes encore nombreux à disposer d'une PS3, il faut dire que la console propose de bons jeux dont certains n'ont pas pris une ride, le développeur Aldo Vargas nous a informé dans la nuit qu'il a mis à jour il y a 2 jours le célèbre plugin webMAN MOD dans sa version 1.47.45 dans l'objectif de corriger quelques bugs. \n \nwebMAN est un plugin développé par Deank qui permet de lancer des backups de jeux PS3, PS2, PS1, PSP ainsi que des Blu-ray ou des DVD, stocké sur disque dur (y compris en NTFS) ou sur le réseau local, au format JB ou ISO. M@tsumot0 et Aldostools ont proposé une version MOD de webMan, apportant notamment le support de 21 langages utilisant des fichiers externes, un installer/updater pour CFW Cobra et NonCobra, le spoof IDPS/PSID, la désactivation des syscalls du cfw, et de nombreuses autres évolutions qui se sont succédées.\n \n \n \n\n \n \nSans aller jusqu'à proposer une nouvelle numérotation, il a remis à jour la version 1.47.45 afin de corriger une régression qui faisait crasher la PS3 si vous utilisiez le combo SELECT + L1 our SELECT + R1 pour monter les jeux dernièrement joués.\n \nLe développeur conseille par ailleurs d'utiliser l'outil de mise à jour intégré (le online updater) afin de profiter des dernières corrections. \n \n \n\n \n \nTéléchargement : webMAN_MOD_1.47.45_Installer.pkg (13.3 MB)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176247/in-ps3-aldo-vargas-aldostools-met-a-jour-webman-mod-14745-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1176247/in-ps3-aldo-vargas-aldostools-met-a-jour-webman-mod-14745-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS4/PS5] BwE PS4 NOR Validator &#38; Syscon, Nor Tool et PS4 Wee Tools",
        "content": "En ce beau lundi nous vous proposons au menu les mises à jour de PS4 NOR Validator & Syscon Patcher, de PS5 NOR Tool et de PS4 Wee Tools, au boulot ! \n \nHier en fin de journée, le développeur BwE a annoncé qu'il avait mis à jour quelques un de ces outils, le premier est PS4 NOR Validator & Syscon Patcher qui est désormais proposé en version 2.3.3 car le logiciel a bénéficié d'une mise à jour du correctif Syscon, d'une mise à jour de la détection Southbridge (type de puce), il a aussi réorganisé le menu, et apporté d'autres modifications mineures.\n \n \n\n \n \nTéléchargement : ps4-nor-validator 2.3.3\n \n \n \nNous en profitons pour vous informer qu'il propose un guide qu'il met à jour régulièrement :  sce_syscon.html\n \nIl a mis à jour également PS5 NOR Tool en version 1.1.1, cette version vient apporter quelques corrections à des bugs selon lui. \n \n\n \n \nTéléchargement : BwE_PS5_NOR_Tool\n \n \nEnfin dernière nouveauté du lundi matin, l'arrivée de la version 0.8 de PS4 Wee Tools, avec comme d'habitude un énorme lot de nouveautés et de corrections.\n \n \n\n \n \n\n \n \nv0.8 (le fichier exe est également disponible)\n- Reconstruction du SNVS (Syscon)\n- Le correctif manuel de Syscon permet d'enlever un bloc entier.\n- Conseils pour le patching syscon\n- Patch syscon supplémentaire (bloqué sur la mise à jour du FW)\n- Améliorations de la classe NVStorage\n \nTéléchargement : ps4-wee-tools 0.8\n \n \nUne bonne journée, où que vous soyez. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176246/in-ps4ps5-bwe-ps4-nor-validator-syscon-nor-tool-et-ps4-wee-tools-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176246/in-ps4ps5-bwe-ps4-nor-validator-syscon-nor-tool-et-ps4-wee-tools-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1176246/in-ps4ps5-bwe-ps4-nor-validator-syscon-nor-tool-et-ps4-wee-tools-2.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1176246/in-ps4ps5-bwe-ps4-nor-validator-syscon-nor-tool-et-ps4-wee-tools-3.jpg"
        }
    },
    "news_11": {
        "title": "[PS4] Le switch entre firmware officiel et exploitable est une réalité",
        "content": "Avec toutes les possibilités de downgrade possibles, nous en avons quasiment oublié l'essentiel et le meilleur à savoir profiter du dernier firmware officiel et donc d'internet, mais aussi d'un firmware exploitable permettant de lancer tous les backups. \n \nEt bien Modded Warfare s'est posé la bonne question, pourquoi ne pas tenter de créer une console disposant des deux possibilités. \n \nDans sa vidéo il montre que sa PS4 dispose du dernier firmware 10.70, de l'accès internet et au PSN, et donc il bascule vers le firmware 9.00.\n \n \n \n\n \n\n \n \n \nIl est parti de l'idée que le firmware tout comme le système d'exploitation sont stockés sur le disque dur, et bien avec un petit Teensy connecté au Syscon de la NOR, il dispose d'une PS4 réversible, bien entendu c'est complexe comme opération, cela ne prend qu'un quart d'heure pour changer de firmware, et il faut disposer deux disques durs, mais cela fonctionne. \n \n \n \n\n \n \nPetite information, il rajoute qu'il faut dessouder les fils sinon la console ne boote pas, mais il parle de l'E4 Flasher, qui pourrait intégrer cette possibilité. Il précise bien que cette console a la base était en 9.00, et qu'elle a été mise à jour en 10.70.\n \nEnsuite il montre comment il flash la Nor et le syscon, puis il démarre la console, tout cela promet un bel avenir encore pour la scène PS4. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176214/in-ps4-le-switch-entre-firmware-officiel-et-exploitable-est-une-realite-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176214/in-ps4-le-switch-entre-firmware-officiel-et-exploitable-est-une-realite-2.jpg"
        }
    },
    "news_12": {
        "title": "[PS4] USB ELF Loader, USB PS2 Game Laoder, mast1c0re PS4 pour le 10.70",
        "content": "Le développeur McCaulay propose toutes les mises à jour possibles pour son exploit mast1c0re pour la PS4, mais surtout de tous les outils qui y sont rattachés. \n \n \n\n \n \nIl vient en effet de mettre en ligne la mise à jour de l'exploit en lui même rajoutant les offsets Ghidra, mais en plus de cela il a mis à jour USB ELF Loader et USB PS2 Game Laoder qui passent tous les deux en v0.1.1. Il a mis aussi à jour les versions Network de ces propositions. \n \n \nTéléchargement : \n \nmast1c0re PS4 Firmware 10.70 support\n \nNetwork ELF Loader PS4 FW v10.70\n \nNetwork PS2 Game Loader PS4 FW v10.70\n \nUSB ELF Loader PS4 FW v10.70\n\n \nUSB PS2 Game Loader PS4 FW v10.70\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176208/in-ps4-usb-elf-loader-usb-ps2-game-laoder-mast1c0re-ps4-pour-le-1070-1.png"
        }
    },
    "news_13": {
        "title": "[PS5] Un prototype de Projet Q de Sony en leak vidéo",
        "content": "Pour une fois qu'une vidéo semble assez légitime proposée par Zuby_Tech, il peut s'agir d'un prototype de la Sony Projet Q, vous savez l'écran disposant LCD disposant d'une manette Dual Sense sur chacun de ses côtés. \n \nMême si cela reste un peu surprenant de ne pas voir marquer quelque part Sony ou Prototype, il pourrait s'agir de pré-série de prototype, mais même dans ce cas normalement ils sont estampillés.\n \n \n \n\n \n \n \nQuoiqu'il en soit, c'est l'occasion de reparler de la \"console\" de 8 pouces, qui comme vous le savez nécessitera une PS5 puisqu'elle se destine uniquement au remote play de celle-ci.\n \n \n \n\n \n \n \n\n \nComme nous pouvons le voir sur la vidéo, on remarque le logo PlayStation, mais il est difficile pour nous de traduire les icônes. \n \n \n\n \n \nCet écran n'est plus ni moins qu'une tablette insérée dans une manette Dual Sense coupée en deux\n \n \n\n \n \n\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176185/in-ps5-un-prototype-de-projet-q-de-sony-en-leak-video-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176185/in-ps5-un-prototype-de-projet-q-de-sony-en-leak-video-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1176185/in-ps5-un-prototype-de-projet-q-de-sony-en-leak-video-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-1212505689.jpg"
        }
    },
    "news_14": {
        "title": "[Wii/WiiU] Aroma Updater, PriiLoader et Swiss à jour",
        "content": "Le développeur Maschell propose une mise à jour d'Aroma Updater, l'outil qui permet d'installer et de mettre à jour Aroma sur Nintendo Wii U.\n \nGrâce à son application, vous pourrez mettre à jour directement certains modules, ce qui rendra inutile le PC, et qui permettra de mettre à jour Bloopair, FTPiiU, ou encore SDCafiine. \n \nCette dernière version a été construire avec la dernière mouture de wut et devkitPPC permettant ainsi de profiter de la meilleure stabilité utilisateur. \n \n \n\n \n \nTéléchargement : Aroma Updater v0.2.2\n \n \nPour la WiiU et sa petite soeur la Wii, c'est PriiLoader qui a été mis à jour en v0.10.0 RC3, le programme compatible Wii, Wii U et Wii Mini. \n \nCette nouvelle version porte le nom de code \"Kappa\". \n \nNouvelles fonctionnalités :\n- Ajout de la compatibilité vWii !\n- Ajout de la possibilité de charger des disques Wii et gamecube (ceci ne tient pas compte de la région des disques, et ceci n'applique pas non plus les hacks)\n- Ajout d'un paramètre pour donner la priorité à l'accès USB par rapport à l'accès SD\n- Priiloader peut faire revivre vos plantes grâce au zombisme\n- Ajout de la prise en charge du menu système 1.0\n- Afficher Priiloader après l'installation\n- Priiloader se lancera au démarrage du Menu Système\n- Ajout de nouveaux hacks\n- Bloquer le démarrage automatique du disque\n- Supprimer Deflicker\n- Refonte de l'accès aux périphériques\n- Priiloader n'attend plus que le lecteur usb réponde lors du montage\n- Ajout d'un fichier de retour à l'installation\n \nCorrections et améliorations :\n- Correction du lancement de chaînes à partir d'une autre région (ceci ne s'applique qu'aux chaînes lancées par Priiloader)\n- Refactorisation des hacks sans région sur SM < 4.3\n- Correction des mises à jour en ligne après que mon hébergeur l'ait cassé (encore une fois)\n- Vérification correcte du drapeau d'arrêt du gamecube\n- Correction de l'effacement de la section bss avec les fichiers .elf\n- Correction d'une faute de frappe dans l'installeur\n- Correction du lancement de SM sur IOS < 28\n- Correction de la vérification de l'activité du dvd\n- Refactorisation de l'analyse meta.xml\n- Refactoriser le versioning dans priiloader\n- Mise en noir de l'écran avant le chargement du titre ou du binaire\n- Correction des hacks qui ne sont pas chargés correctement de manière aléatoire\n- Divers changements dans hacks_hash\n \nTéléchargement : priiloader 0.10.0-RC3\n \n \n \n\n \nEnfin au chapitre des petites nouveautés c'est Swiss qui lui aussi a été mis à jour. Comme vous le savez Swiss c'est le couteau suisse de la Nintendo Wii, et c'est Extrems qui a opéré de nombreux changements. \n \nChangelog : \n- Correction d'une erreur d'analyse avec D&D Apploader V2.00.\n- Vérifier l'intégrité du fichier patché que nous chargeons.\n- Correction de quelques fuites de mémoire.\n- Ajout d'un checksum pour GC Loader 2.0.1.BETA.\n- Ajout d'un support minimal pour démarrer des disques sans licence.\n- Utilisation correcte de l'en-tête BS2.\n- Ajouter les hashs des images BS2 pour une utilisation future.\n- Correction d'une fuite de mémoire dans l'interface graphique.\n- Correction de la taille de aram.bin à la taille réelle de l'ARAM.\n- Ajouter aram_internal.bin.\n- Utiliser ARQ pour lire l'ARAM.\n- Vérifier la présence d'une image BS2 connue.\n- Vérifier l'intégrité de l'exécutable du jeu avec les images NKit.\n- Amélioration de la gestion des erreurs.\n- Refonte de l'affichage du message d'erreur.\n- Permettre l'écriture dans aram.bin, aram_internal.bin et sram.bin.\n- Ajout de aram_expansion.bin\n- Corrections mineures.\n- Correction du correctif execD.img après a3b3066.\n- Inclure appl2.img, appl2D.img et exec.img.\n- Ajout des sommes de contrôle des en-têtes NKit pour distinguer les légères différences.\n- Liste complète des fichiers qui doivent être réencodés.\n- Suppression des faux positifs multi-disques.\n- Mise à jour de la base de données No-Intro.\n- Filtrer les fichiers système.\n- Mise à jour de la base de données Redump.\n- Vérification des erreurs lors de la configuration des fragments du GC Loader.\n- Augmentation de la version du firmware du GC Loader à 2.0.1.\n \n \nTéléchargement : Swiss v0.6r1515\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1482842661.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-970796421.jpg"
        }
    },
    "news_15": {
        "title": "[PS4] L'exploit Mast1c0re fonctionnel sous firmware 10.70",
        "content": "Nous apprenons que l'exploit Mast1c0re est pleinement fonctionnel sous le tout dernier firmware 10.70, le tout dernier firmware de Sony ne protège pas la console contre cet exploit.\n \n \n\n \n \n\n \nIl est donc tout à fait possible de lancer des jeux PS2 sur PS5 avec cet exploit.\n \nA noter que l'exploit a été mis à jour il y a quelques heures afin d'ajouter les offsets du script permettant de dump libkernel_sys.sprx sous Ghidra.\n \n \n\n \n \nTout est là : Mast1c0re\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2006936272.jpg"
        }
    },
    "news_16": {
        "title": "[Multi] La Team Dolphin s'explique sur l'échec Steam",
        "content": "Vous le savez si vous lisez nos lignes, l'équipe en charge du développement de Dolphin a proposé sur Steam son émulateur, mais cela n'a pas du tout était au goût de Nintendo qui a envoyé en simultané une demande de retrait DMCA. S'en est suivi un message de déception de la part de la Team Dolphin expliquant rapidement pourquoi la page Dolphin avait été retirée de Steam. \n \nPremier chapitre ici : Nintendo a envoyé un DMCA à Valve pour l'émulateur Dolphin\n \nSecond chapitre c'est maintenant : La Team Dolphin s'explique dans un long billet\n \n \n \n \n\n \n \n \n \n \nSur son blog, la Team Dolphin vient de publier un article dans lequel elle explique ce qu'il s'est passé de son point de vue étant très transparente avec son public. De nombreuses conclusions ont été tirées, et la Team a souhaité se défendre, c'est bien légitime. \n \nLa Team tient tout d'abord à remercie Kellen Voyer, de Voyer Law, qui nous a fourni des conseils juridiques s'appuyant sur le droit américain.\n \n \nQue s'est-il réellement passé ?\n \nTout d'abord, Nintendo n'a pas envoyé à Valve ou Dolphin une notification de la section 512© du Digital Millenium Copyright Act (DMCA) (communément appelée DMCA Takedown Notice) à l'encontre de notre page Steam. Nintendo n'a engagé aucune action en justice contre Dolphin Emulator ou Valve.\n \nEn réalité, le service juridique de Valve a contacté Nintendo pour s'enquérir de la sortie annoncée de l'émulateur Dolphin sur Steam. En réponse, un avocat représentant Nintendo of America a demandé à Valve d'empêcher la sortie de Dolphin sur le Store Steam, en citant le DMCA comme justification. Valve a alors transmis la déclaration des avocats de Nintendo à la Team Dolphin, et a demandé de trouver un accord avec Nintendo pour pouvoir sotir Dolphin sur Steam. \n \nLa Team explique avoir communiqué de manière assez frénétique, ce qui n'a fait qu'attiser les spéculations, mais elle explique dans son article arrêter ses efforts pour tenter de sortir Dolphin sur Steam. C'est tout, la Team Dolphin a perdu trop de temps dans cette bataille et souhaite se pencher sur des sujets plus accessibles que la sortie de Dolphin sur Steam. \n \n \nUne sombre histoire de clés\n \n \nAu cours des dernières semaines, beaucoup de choses ont été dites à propos de Dolphin et de la Common Key de la Wii, et on sent bien que la Team Dolphin souhaite clairement s'expliquer là dessus.  \n \n \n\" Comme vous le savez peut-être, les jeux Wii sont cryptés et la Wii utilise la Common Key qui est gravée dans la console pour décrypter les disques Wii. Le logiciel de la Wii n'a aucun accès à cette clé, mais il a suffit de quelques ingénieurs intelligents et d'une pince à épiler pour l'extraire. \n \nSi vous n'avez jamais entendu parler de cette histoire, nous vous recommandons vivement de jeter un coup d'oeil à la présentation du 25c3 sur l'exploit Tweezer qui a donné son nom à la Team Twiizers. Il s'agit d'une vidéo incroyablement divertissante qui vaut la peine d'être visionnée. Si vous ne connaissez pas la Team Twiizers, vous la connaissez peut-être sous son nom moderne : fail0verflow.\n \nL'extraction de la Common Key de la Wii n'a suscité aucune réaction juridique de la part de qui que ce soit. Elle a été librement partagée partout, et a finalement fait son chemin dans la base de code de Dolphin il y a plus de 15 ans (commis par un membre de la Team Twiizers, rien de moins).\n \nCes clés sont accessibles au public depuis des années et personne ne s'en est vraiment soucié. La loi américaine en la matière n'a pas changé, et pourtant de nombreux avocats de salon sont venus dire à quel point nous avions été stupides d'envoyer la Common Key de la Wii. La lettre de Nintendo à Valve, qui cite les dispositions anti-contournement du DMCA (17 U.S.C. § 1201), notamment parce que Dolphin doit décrypter les jeux Wii, alimente ce débat. \" \n \n \nLa Team explique disposer d'arguments très solides pour affirmer que Dolphin n'est pas principalement conçu ou produit dans le but de contourner la protection. \n \n \n\" Dolphin est conçu pour recréer le matériel du GameCube et de la Wii sous forme de logiciel et pour fournir à l'utilisateur les moyens d'interagir avec cet environnement émulé. Seule une infime partie du code est réellement liée au contournement. En outre, les jeux GameCube ne sont pas du tout cryptés, et Dolphin peut également lire des homebrews et est utilisé dans le développement de mods de jeux. Il existe même des homebrews et des mods qui ciblent spécifiquement Dolphin comme sa propre plateforme, étant donné qu'il a la capacité d'émuler plus de mémoire et de puissance de traitement que ce qui est possible sur les consoles d'origine. C'est pourquoi il existe des \"mode Dolphin\" dans de nombreux jeux homebrews modernes !\n \nÉtant donné que seule une petite partie de ce que nous faisons implique le contournement, nous pensons que l'affirmation selon laquelle nous sommes \"principalement destinés au contournement\" est exagérée. Nous ne pensons pas que cet angle d'attaque serait couronné de succès dans un tribunal américain, si jamais on en arrivait là. La raison pour laquelle les avocats représentant Nintendo font un tel saut est qu'ils souhaitent créer un récit dans lequel les exemptions du DMCA ne s'appliquent pas à nous, alors que ces exemptions sont puissantes et largement en notre faveur. Pour Dolphin, il est particulièrement intéressant de noter l'ingénierie inversée.\n \nNous ne pensons pas que Dolphin soit en danger juridique. Il suffit de lire la fin du message que Valve nous a transmis pour s'en convaincre. Après tous ces propos effrayants, Nintendo n'a rien exigé et n'a fait qu'une seule demande à Valve. Nous demandons spécifiquement que la mention \"bientôt disponible\" de Dolphin soit supprimée et que vous vous assuriez que l'émulateur ne soit pas mis en vente sur le magasin Steam à l'avenir.\n \nEn fin de compte, c'est Valve qui gère la boutique Steam et qui a le droit d'autoriser ou d'interdire tout ce qu'il veut sur cette boutique, quelle qu'en soit la raison. Quant à Nintendo, cet incident ne fait que confirmer sa position actuelle à l'égard de l'émulation. Nous ne pensons pas que cet incident doive changer l'opinion de quiconque à l'égard de l'une ou l'autre de ces sociétés.\n \nEn revanche, certaines des fonctionnalités développées pour la version Steam fonctionneront toujours dans les versions normales de Dolphin, et sont toujours en cours de développement. L'une des fonctionnalités que nous attendons avec le plus d'impatience est une interface graphique \"Big Picture\" complète qui peut être utilisée directement avec une manette. Cela va se produire indépendamment d'une sortie sur Steam, en même temps que plusieurs petites fonctionnalités qui étaient censées être des améliorations pour les builds Steam.\n \nLa dernière chose que nous aimerions faire avant de conclure est de remercier les développeurs qui ont consacré beaucoup d'efforts à la version Steam. OatmealDome en particulier a été l'architecte de l'intégration Steam de Dolphin, travaillant avec l'infrastructure de Dolphin et Steam pour passer de la théorie à une version pleinement fonctionnelle de Dolphin. Nous aimerions également remercier delroth pour l'immense quantité de travail de CI de ces derniers mois, qui a donné à OatmealDome une base solide sur laquelle s'appuyer. Enfin, MayImilae a fourni une grande quantité de travail médiatique pour la sortie de Steam, tout en travaillant sur une fonctionnalité majeure à venir. \"\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176134/in-multi-la-team-dolphin-sexplique-sur-lechec-steam-1.png"
        }
    },
    "news_17": {
        "title": "[3DS] Wumiibo 4.2 et rehid 4.0 disponibles",
        "content": "Le développeur hax0kartik vient de mettre en ligne une nouvelle version de Wumiibo, il s'agit là de la septième release publique de Wumiibo. Pour rappel, il s'agit d'un outil qui permet d'émuler les Amiibo sur la Nintendo 3DS et ses grandes et petites soeurs. En fait, sous ce nom se cache une réécriture intégrale du module NFC utilisé pour activer l'émulation Amiibo.\n \nCette v4.2 apporte surtout des correctifs sur l'environnement et des changements pour supporter la toute dernière version de Luma v13.0 sorti il y a quelques heures. \n \n\n\n\n \n \nChangelog 4.2 : \n \n- Mise à jour de Wumiibohelper et Wumiibo pour supporter le luma v13.0 récemment sorti.\n- Correction des entrées amiibo pour Hey Pikmin !\n- Pour installer/mettre à jour WumiiboHelper, vous pouvez scanner le code QR suivant avec FBI.\n\n \n- Un guide d'utilisation/installation de wumiibo peut être trouvé ici.\n- Pour tout problème/question ou suggestion, vous pouvez rejoindre ce serveur discord ou utiliser la page des problèmes/discussions du github. \n \n \nTéléchargement : Wumiibo 4.2\n \n \nAutre information, l'arrivée de la version 4.0 de rehid du même développeur. \n \n\n \n- Ajout de la prise en charge du debugpad.\n- Correction de bugs dans les remappings CPAD>DPAD et DPAD>CPAD.\n- Correction d'un bug où les remappages globaux n'étaient pas appliqués au menu d'accueil après la fermeture d'un titre.\n- Rehidhelper a été réécrit et devrait être plus stable.\n- Rehidhelper est maintenant disponible en tant que CIA et peut être installé sur l'écran d'accueil directement.\n- Ajout d'un support expérimental pour turbofire/autofire. Pour plus de détails, vous pouvez consulter cet article.\n- Le support de Luma v13.0 a été ajouté en passant à un patching basé sur CXI. Cette version ne fonctionnera qu'avec luma v13.0 et plus.\n \n\n \nTéléchargement : rehid 4.0\n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176131/in-switch-wumiibo-42-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176131/in-switch-wumiibo-42-disponible-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1176131/in-switch-wumiibo-42-et-rehid-40-disponibles-1.png"
        }
    },
    "news_18": {
        "title": "[3DS] Luma3DS v13.0.1 disponible",
        "content": "Nouvelle mise à jour de Luma3DS, le Custom Firmware à destination de la Nintendo 3DS développé à l'origine par AuroraWright et repris par TuxSH.\nPour rappel Luma3DS  est un programme permettant de corriger le logiciel système des consoles portables (New) Nintendo (2)3DS \"à la volée\", en ajoutant des fonctionnalités telles que les paramètres de langue par jeu, des capacités de débogage pour les développeurs et en supprimant les restrictions imposées par Nintendo telles que le verrouillage régional.\n \nLa version 13.0 sortie est une version \" majeur \" car il fusionne le code de Luma 3GX, une version de Luma customisé à l'origine par Nanquitas et repris par PabloMK7 le développeur de CTGP7 un mod customisé de Mario Kart 7.\nLuma3GX sert principalement pour l'usage de plugin / mod ainsi qu'un module de cheat plus complet.\n\n \nChangelog : \n \n\n \n\n \n- Fusion de la version 3GX de @PabloMK7 et @Nanquitas, ajoutant le support des plugins. Cela permet de jouer des mods comme CTGP-7.\n \nNOTE : En raison de changements planifiés (tels que la réimplémentation du noyau), les plugins plus anciens qui ne sont plus maintenus ou les plugins fermés\npeuvent soudainement cesser de fonctionner à un moment donné dans le futur. Nous vous conseillons d'utiliserdes plugins open source et/ou activement maintenus par des sources fiables.\n \n- Ajout d'un support pour remplacer le filtre d'upscaling TWL_FIRM (c'est-à-dire le logiciel DS(i)) basé sur la convolution par le contenu de /luma/twl_upscaling_filter.bin.\n- Vous pouvez trouver des exemples de matrices ici et le code Python pour les convertir au format attendu ici.\n- Ajout du support pour autoriser les combos de touches Gauche+Droite et Haut+Bas dans TWL_FIRM, bien que les jeux DS(i) commerciaux empêchent généralement ces combos d'eux-mêmes.\n- Ajout de la prise en charge de TWL_FIRM et AGB_FIRM de taille arbitraire et non compressés, lorsqu'ils sont chargés de manière externe à partir du dossier /luma.\n- Simplification du chargement des CXI des sysmodules et des correctifs IPS/BPS : le bit N3DS est maintenant effacé lors du choix du fichier CXI à charger à partir de /luma/sysmodules. Le chemin pour les correctifs IPS/BPS pour les sysmodules, et les sysmodules seulement, a été déplacé vers /luma/sysmodules/<titleId sans bit N3DS>.ips (resp. .bps). Il s'agit d'un changement important\n- Suppression de l'option \"Use EmuNAND FIRM if booting with R\" et de toute la logique associée. Il s'agit d'un reliquat de l'ère Gateway qui n'a plus sa place en 2023.\n- Correction d'un bug rare où la console démarrait avec 2 écrans blancs.\n- Autres changements mineurs\n\n \n\nMise à jour de Luma 3DS en version 13.0.1 qui fix une régression apparu dans la version 13.0 qui empêchais des modules de fonctionné comme celui gérant le widescreen sur TwilightMenu++\nChangelog : \n \n\n\n \nCorrection d'une régression de la v13.0 où le chargement de modules FIRM externes (tels que TwlBg) était interrompu.\n\n \n\nLien de téléchargement : Luma 3DS 13.0.1",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176110/in-3ds-luma3ds-v13-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS4/PS5] Sony sort les firmwares 10.70 (PS4) et 7.60 (PS5)",
        "content": "Sony vient tout juste de mettre en ligne des nouveaux firmwares à destination de la PlayStation 4 / PlayStation 4 Pro, et de la PlayStation 5. \n \nA l'occasion du 20eme jour du mois de Juillet 2023, la firme japonaise propose un tout nouveau firmware 10.70 pour la PS4 et le firmware 7.60 pour la PS5.\n \nCôté PS4, ce nouveau PUP a pour ambition d'améliorer les performances système de la console, tout un programme ! Bon comme vous le savez très bien il ne s'agit là que d'un message bateau pour dire qu'ils ont corrigés un ou deux bugs par ci-par là qui ne pourront plus être utilisé par les hackers. \n \n \n\n \n \n \nVersion 10.70\n \nPrincipales caractéristiques du logiciel système mise à jour :\n- Cette mise à jour du logiciel système améliore les performances du système.\n \n \nCôté PS5, et bien cela peut paraitre étonnant, c'est exactement la même chose, de là à dire que la performance va être de mise désormais il n'y a qu'un pas ! \n \n \nVersion 7.60\n \nPrincipales caractéristiques du logiciel système mise à jour :\n- Cette mise à jour du logiciel système améliore les performances du système.\n \n \n \nCette version 7.60, ou 23.01-07.60.00, vient donc corriger exactement la même chose que sur PS4, comme c'est étrange ! \n \n \nSource : FwPs5\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176098/in-ps4ps5-sony-sort-les-firmwares-1070-ps4-et-760-ps5-1.png"
        }
    },
    "news_20": {
        "title": "[Switch/PS4] Pikmin 4 leaké, FF Pixel Remaster Collection et F1 23 backportés",
        "content": "C'est l'été, il fait chaud, et cela chauffe aussi du côté de nos amis développeurs et dumpers qui proposent les jeux. \n \n \n\n \n \n \nNous venons d'avoir la confirmation que Pikmin 4 vient d'être dumpé sur Nintendo Switch. Ce n'est pas non plus très surprenant, le jeu est attendu officiellement pour le 21 Juillet 2023, mais c'est bel et bien le jeu complet qui a été dumpé et mis en ligne au téléchargement. Des captures d'écran, de vidéos commencent à sortir, ce qui gâche toujours un peu le plaisir du jeu.\n \n \n-------------\n \n \nAutres propositions, celle de Final Fantasy Pixel Remaster Collection sur PlayStation 4 et PlayStation 4 Pro backporté sur PS4 par CyB1K & Xmrallx, qui regroupe pas moins de 6 Final Fantasy dans une seule galette, enfin oui et non car les jeux sont proposés un par un dans l'ultime remaster en pixels 2D et profitant d'une bande-son magnifiquement réarrangée.\n \n \n \n\n \n \n \nLa jouabilité est améliorée grâce à une interface modernisée, et des extras tels qu'un bestiaire, une galerie d'illustrations et un lecteur de musique permettent de s'immerger encore plus dans l'univers du jeu. De quoi découvrir ou redécouvrir Final Fantasy I à VI.\n \n \n\n \n \nChaque jeu pèse entre 500 et 1 Go, ce qui fait que vous pouvez choisir selon celui que vous souhaitez découvrir, sachant que chacun des titres sera proposé avec sa mise à jour 1.01 ou 1.02 pour les 3 derniers (de Final Fantasy 4 à Final Fantasy 6).\n \n \n \n\n \n \n \nEnfin, le dernier titre dont nous parlerons ici est F1 2023 qui est sorti le 15 juin 2023, il a lui aussi été backporté pour les firmwares 5.05, 6.72, 7.02 et 9.00 par CyB1K, grâce à sa mise à jour 1.06. Il faudra être patient car le jeu pèse pas moins de 43 Go, et 27 Go pour son update. \n \n \n\n \n \nBref, de quoi faire chauffer nos consoles ! \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176071/in-switchps4-pikmin-4-leake-ff-pixel-remaster-collection-et-f1-23-backportes-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176071/in-switchps4-pikmin-4-leake-ff-pixel-remaster-collection-et-f1-23-backportes-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1176071/in-switchps4-pikmin-4-leake-ff-pixel-remaster-collection-et-f1-23-backportes-3.jpg"
        }
    }
}