{
    "news_1": {
        "title": "[Switch] Un projet pour rendre open source le dumper du MigSwitch",
        "content": " \nIl semblerait que de nombreux utilisateurs soutiennent quelques développeurs qui ont bien l'intention de faire sauter les protections du dumper du MigSwitch. \n \nLe dumper du MigSwitch est la clé de nombreuses espérances, quelques personnes souhaitent inverser le code du dumper, des archives commencent à se constituer, pour tenter de casser les sécurités. \n \n \n\n \n \n \nL'idée est de forcer la team MigSwitch a rendre son code open-source et que chacun puisse en profiter, indirectement cela profitera aux équipes comme MigDiy ou enore UnlockSwitch qui propose une copie ou qui ont l'intention de proposer une alternative à la solution russe. \n \n \n\n \n \nQuelques fichiers sont proposés sur dropbox, certainement des fichiers dumpés du dumper en reverse engineering, reste à voir si tout cela sera réellement exploitable, la team UnlockSwitch quand à elle a réagit en disant qu'elle avait finalisé son propre code. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191892/in-switch-un-projet-pour-rendre-open-source-le-dumper-du-migswitch-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191892/in-switch-un-projet-pour-rendre-open-source-le-dumper-du-migswitch-1.png"
        }
    },
    "news_2": {
        "title": "[Switch] Nintendo sort le firmware 18.1.0, Atmosphere ne fonctionne plus",
        "content": "[Switch] Nintendo sort le firmware 18.1.0 pour la Switch pour supprimer Twitter\n \nNintendo vient de mettre en ligne une nouvelle mise à jour firmware pour la Nintendo Switch, la plus grosse évolution est la suppression de l'intégration de Twitter. \n \nL'intégration de X \"Ex-Twitter\" a été supprimée, il n'est plus possible de télécharger des captures d'écran de Super Smash Bros Ultimate sur Smash World. \n \nLes amis ne peuvent plus être trouvés via les réseaux sociaux, mais il reste encore possible de trouver des amis 3DS, Wii-U ou encore via les smartphones. \n \n \n\n \n \nComme dans Splatoon 3, il n'est plus possible là encore de télécharger des images, seules celles présentes sur les serveurs de Nintendo peuvent l'être., fini Twitter ou Facebook.\n \nCoté hack, ScireM informe qu'Atmosphere nécessite une petite mise à jour et que donc le firmware 18.1.0 casse son fonctionnement, il va essayer d'apporter la solution rapidement en fournissant une nouvelle version de sa solution. \n \nLes rapports Yellows'8 sont ici : yls8.mtheall.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191891/in-switch-nintendo-sort-le-firmware-1810-atmosphere-ne-fonctionne-plus-1.png"
        }
    },
    "news_3": {
        "title": "[PS4/PS5] Chiaki4deck v1.7.2 disponible",
        "content": " \nLe célèbre fork de Chiaki fait du Steam Deck une alternative beaucoup plus efficace que la PlayStation Portal au travers du streaming de la PlayStation 5. \n \nChiaki4deck est de retour et les nouveautés apportent la séparation des paramètres locaux et distants, ainsi que des paramètres PS4/PS5 vous permettant de configurer correctement chaque connexion.\n \nDe nouvelles options sont présentes comme du décodage matériel automatique, le programme est désormais compatible avec l'ipv6 malgré le manque de support sur la PS5. \n \n \n\n \n \nNouvelles fonctionnalités :\n \n- Paramètres de flux uniques pour chaque console (PS4/PS5) en local et à distance.\n- Prise en charge de plusieurs types de réseau pour la connexion à distance via PSN (note : certaines fonctionnalités peuvent ne fonctionner qu’une partie du temps en raison des limitations imposées par Sony).\n- Option d’exportation/importation des paramètres pour les transférer entre différents appareils et plates-formes.\n- Option de décodage matériel automatique (défaut) pour choisir le meilleur décodeur disponible.\n- Compatibilité IPv6 (bien que non encore prise en charge par la lecture à distance sur la console de Sony).\n \nPlateformes prises en charge :\n \n- Version Linux disponible sur Flathub en tant que io.github.streetpea.Chiaki4deck.\n- Versions Windows, MacOS et Linux Appimage disponibles.\nNote : Pipewire est requis pour l’Appimage, et pour Linux, il est nécessaire pour les retours haptiques DualSense.\nPour Flatpak, vous pouvez exécuter avec --env=SDL_AUDIODRIVER=pulse pour utiliser PulseAudio au lieu de Pipewire (ce qui désactive les retours haptiques DualSense).\n \n \nTéléchargement : Chiaki4deck\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191880/in-ps4ps5-chiaki4deck-v172-disponible-1.jpg"
        }
    },
    "news_4": {
        "title": "EzPPPwn v1.10 par DjPopol avec PPPwn C++",
        "content": "EzPPPwn est programme Windows basé sur PPPwn qui vise à réduire les dépendances environnementales nécessaires à l'exécution de PPPwn et à implémenter le RCE de la manière la plus simple possible.\nL'application contrôle au démarrage que les pré-requis sont bien installés (sinon il proposera de les installer), ainsi que la configuration (si elle n'est pas complète alors il vous demandera de la compléter)\n\nTechnologie :\nC# .NET Framework 8.0 application Winform.\n\nPré-requis\n- Windows 7/8/10/11 (32bits et 64bits)\n- Un ordinateur avec un port Ethernet ou un adaptateur USB/Ethernet fonctionne également\n- Câble Ethernet\n- .Net 8.0.\n- Npcap (peut être installé par l'application)\n\n \nLes firmwares pris en charge sont :\nFW 7.00 / 7.01 / 7.02\nFW 7,50 / 7,51 / 7,55\nFW 8.00 / 8.01 / 8.03\nFW 8.50 / 8.52\nFW 9.00\nFW 9.03 / 9.04\nFW9,50 / 9,51 / 9,60\nFW 10.00 / 10.01\nFW10,50 / 10,70 / 10,71\nFW 11.00 \n\n \nChangeLog :\n-l'application se prénomme désormais EzPPPwn\n-Remplacement de pppwn python par la version C++.\n-Réécriture complète.\n-Simplification de l'application(plus de save log, save script...).\n-Suppression du paramètre stage1.bin\n-Ajout de l'installation des prérequis (Npcap, PPPwn C++, stage1.bin)\n-Ajout update PPPwn C++ avec la dernière version stable de PPPwn C++\n\n \nConfig :\n\n\n\n- Suppression de l'option pour sélectionner le stage1.bin.\n- Ajout des options PPPwn C++\n- Ajout d'un bouton pour initialiser les paramètres par default.\n- Nouvelle mise en page\n\nFormPPPwn :\n\n\n\n- Ajout d'un bouton pour cacher/afficher la console.\n- Ajout d'un bouton pour mettre à jour PPPwn C++\n- Ajout d'un bouton pour annuler le processus.\n- Nouvelle mise en page.\n\n\nSi vous n'avez pas les pré-requis l'application pourras les installer (Npcap, PPPwnC++, et les stage1.bin)\n\n\n\n\n\n\n\n- Ajout d'un bouton pour annuler.\n- Si l'installation est refusée ou annulée, l'application se fermera.\n\nTips :\n- Vous pouvez utiliser la versions de PPPwn C++ qui vous convient en la plaçant dans le répertoire C++\n- Idem pour les stage1.bin (Respecter l'organisation : ex: Firmware 11.00 => Stages1/11.00/stage1.bin) et si vous voulez revenir à celui utilisé par l'application par défaut, supprimer le stage1.bin correspondant à votre firmware\n\nEzPPPwn v1.0 By DjPopol\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191849/in-ezpppwn-v110-par-djpopol-avec-pppwn-c-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1191849/in-ezpppwn-v110-par-djpopol-avec-pppwn-c-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1191849/in-ezpppwn-v110-par-djpopol-avec-pppwn-c-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1191849/in-ezpppwn-v110-par-djpopol-avec-pppwn-c-4.png"
        }
    },
    "news_5": {
        "title": "[XBOX ONE] Hack du SystemOS bientôt public les instructions données",
        "content": "La Team Xbox One Research a publié une brève expliquant qu'une méthode serait bientôt publiée pour avoir accès a l'executionde code dans le SystemOS de la Xbox, ils donnent les instructions pour préparer la console a l'utiliser dans un communiqué disponible sur leur site.\n \nEn voiçi l'extrait qui nous interesse :\n \n Notice for users who would like code execution in SystemOS in the future\nOn 2024/06/08 a method for gaining user- and kernel-level code execution SystemOS was announced. It is likely to be patched soon (in next System Update).\nTo prepare, do the following:\nEnsure your Xbox Live account Login-Type is configured as “No barriers” aka. auto-login with no password prompt\n\tSet your console as “Home Console” for this account\n\tDownload the App Game Script\n\tStart the app (to ensure license is downloaded/cached)\n\tTake your console offline! To make extra sure it cannot reach the internet, set a manual primary DNS address of 127.0.0.1\n\tGet a device/microcontroller that can simulate a Keyboard (rubber ducky or similar) - otherwise you have to type a lot manually \n\n \n \nTraduction:\n \n\n \nAvis aux utilisateurs qui souhaiteraient exécuter du code dans SystemOS à l'avenir\nLe 08/06/2024, une méthode permettant d'obtenir l'exécution de code au niveau utilisateur et noyau dans SystemOS a été annoncée. Il est probable que celle-ci soit bientôt corrigée (dans la prochaine mise à jour système).\nPour vous préparer, voiçi les étapes a suivre :\nAssurez-vous que le type de connexion de votre compte Xbox Live est configuré sur « Sans barrières », c'est-à-dire connexion automatique sans demande de mot de passe.\n\tDéfinissez votre console comme « Console Principale » pour ce compte.\n\tTéléchargez l'application Game Script\n\tDémarrez l'application (pour s'assurer que la licence est téléchargée/stockée en cache).\n\tMettez votre console hors ligne ! Pour vous assurer qu'elle ne peut pas atteindre le net, définissez une adresse DNS primaire manuelle de 127.0.0.1.\n\tObtenez un appareil/microcontrôleur capable de simuler un clavier (rubber ducky ou similaire) - sinon, vous devrez taper beaucoup manuellement\n\n \nCe hack sera compatible avec toutes les Xbox One et Xbox Series.\nPour rappel cela ne permettra pas en soit de pirater quoique ce soit mais c'est une étape nécessaire vers un jailbreak complet de l'ecosystème Xbox, cela permettra cependant d'avoir accès aux mêmes fonctionnalitées qu'avec le mode developpeur en retail et un peu plus car il y a une execution de n'importe quel code possible pas que des applis UWP.\n \nVoilà une grande nouvelle!\nPeut-être que tout ça est le début d'une grande aventure pour la Xbox One, on ne peut que l'esperer, çela fait trop longtemps que les consoles de Microsoft sont a l'abri du hack...\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/forums/public/style_emoticons/default/biggrin.gif"
        }
    },
    "news_6": {
        "title": "[XB] Le projet SpiderBoard de Torus de eMMC sur XBO est libéré en open-source",
        "content": " \nLe développeur Torus vient de faire le choix de rendre open-source ses PCB pour la Xbox One, il vient de libérer en effet ses projets SpiderUnifiedBoard et SpiderCarrierBoard, des cartes de remplacement de l'eMMC de la Xbox One. \n \n \n\n \n\n \n \nMême si ces projets sont inachevés, il espère qu'ils puissent servir à d'autres développeurs qui reprendraient le flambeau. \n \nThéorie de fonctionnement :\n \nLe pont sud de la Xbox One utilise l'ensemble du bus 8 bits pour se connecter à la carte eMMC. Il ne peut donc pas être remplacé par des mémoires compatibles eMMC moins chères et plus faciles à utiliser (par exemple, des cartes microSD). Pour minimiser le dessoudage des circuits intégrés : Vous devez couper les traces de l'eMMC d'origine dans la carte jusqu'au pont sud. Ensuite, vous devez souder cette carte et connecter les nouvelles lignes de données et de contrôle, à partir de laquelle le pont sud commencera à communiquer avec la nouvelle eMMC sur la carte Spider (ou dans la carte porteuse).\n \n \n\n \n\n \nLa forme de la carte principale est compatible avec toutes les variantes du PHAT Xbox One (Durango/Graybull, Carmel, Silverton) et vous pouvez la réutiliser directement  (il s'agit du calque Edge Cuts dans KiCad), elle n'est par contre pas adaptée à la Xbox One S ni à la Xbox One X.\n \n \nTout est là : Spider-eMMC\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191795/in-xb-le-projet-spiderboard-de-torus-de-emmc-sur-xbo-est-libere-en-open-source-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191795/in-xb-le-projet-spiderboard-de-torus-de-emmc-sur-xbo-est-libere-en-open-source-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1191795/in-xb-le-projet-spiderboard-de-torus-de-emmc-sur-xbo-est-libere-en-open-source-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1191795/in-xb-le-projet-spiderboard-de-torus-de-emmc-sur-xbo-est-libere-en-open-source-3.png"
        }
    },
    "news_7": {
        "title": "[PS4] PS4 HEN supporte désormais le firmware 10.50",
        "content": " \nBonne nouvelle, le firmware 10.50 vient de tomber face au PS4 HEN, proposée par SiSTR0 la release v2.1.3 de Mars 2020 a souvent été forkée, il s'agissait d'ailleurs d'une proposition à l'origine de Xvortex pour le firmware 5.05 en Juillet 2018, mais avant pour le 4.55 en Mars 2018. \n \nLa dernière version proposée par BestPig, la 2.1.4, propose le support fonctionnel du firmware 10.50 et du 11.00.\n \n \n\n \n \nLe travail réalisé par Echo Stretch et BestPig est fascinant, ils ont travaillé sur le portage du HEN vers toutes les versions du firmware. Il s'agit d'une solution temporaire jusqu'à ce que Sistro publie la version officielle de GoldHEN. \n \n \nIl semblerait que le firmware 9.03 soit aussi de la partie. \n \nTout est là : \n \nhttps://github.com/EchoStretch/ps4-hen-vtx/releases\n \nhttps://github.com/BestPig/ps4-hen-vtx/releases/tag/2.1.4\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191776/in-ps4-ps4-hen-supporte-desormais-le-firmware-1050-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] Sys-con enfin de retour avec la version 1.1.0",
        "content": " \nLe développeur français o0Zz a pris la suite de Cathery avec Sys-con, et il le fait plutôt bien puisque les versions s'enchainent et ajoutent de nombreuses fonctionnalités. Inspiré du projet sys-con de Cathery, ce nouveau fork a été réalisé pour ajouter le support de toutes les manettes compatibles PC (avec un profil HID). \n \n \n\n \n \nAinsi cette nouvelle version supporte l’ensemble des manettes compatibles PC tout en gardant la compatibilité d’origine avec les manettes Xbox et DualShock. Ce portage ouvre la porte à de nouveaux horizons, notamment le retrogaming avec des émulateurs tels que RetroArch (Arcade, NES, Snes, etc.). Le module Sys-Con permet d’utiliser des contrôleurs tiers sur votre console Nintendo Switch en connectant simplement vos manettes via les ports USB du dock ou via le port USB-C avec un adaptateur OTG.\n \nAvec Sys-Con vous profiter de ses fonctionnalités, telles que le support des joysticks et gamepads avec profil HID, la configuration des touches en fonction du VID/PID de la manette, la gestion de la deadzone et la personnalisation de la couleur des manettes.\n \n \nChangelog sys-con v1.1.0 :\n \n- Correction du fichier journal qui n'est pas créé automatiquement\n- Inversion du Y sur la manette XBOX S et la manette XBOX originale.\n- Correction du fix maison et de la capture qui ne fonctionne pas correctement\n- Correction de la connexion/déconnexion de la manette xbox360 sans fil ne fonctionnant pas correctement\n- Ajout d'un mode de découverte pour découvrir soit toutes les manettes, soit uniquement les manettes connues (pour éviter les problèmes avec les manettes officielles de la Switch).\n- Correction de la liaison incorrecte pour le joystick droit sur Generic HID.\n \n \nTéléchargement : Sys-con 1.1.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191772/in-switch-sys-con-enfin-de-retour-avec-la-version-110-1.png"
        }
    },
    "news_9": {
        "title": "[Switch] L'équipe UnlockSwitch progresse sur le développement de Xtractor",
        "content": " \nLa team UnlockSwitch nous informe que le développement de Xtractor progresse de façon excellente, voir exceptionnelle. L'équipe tient a remercier l'accueuil a qui fait au produit et sa solution software est tout aussi importante. \n \nL'équipe annonce qu'il va proposer chaque étape de l'évolution du logiciel, mais sans en dévoiler le contenu, ni même fournir de visuel.\n \n \n \n\n \n \n \nAucune photo ne sera partagée car elle souhaite attendre que le produit soit réellement disponible pour pouvoir le faire en toute quiétude, mais aussi car cette décision découle de quelques difficultés de copie. La team souhaite protéger un peu son travail. \n \nIl semblerait que la team parle de nombreuses solutions qui ont vu le jour, peut être des copies qui seraient en cours de déploiement, la copie de la copie.\n \nL'équipe explique qu'elle dévoilera bientôt les détails de cette histoire et de ce qui se passe, elle reste tout de même en lutte face à la Team MigSwitch dont elle accuse par exemple d'avoir repris son idée d'interrupteur permettant de changer de jeux sans devoir extraire le linker. \n \nDe son côté la team MigSwitch vient de laisser un message sur le tri des jeux sur son linker. Elle rappelle que par défaut, les jeux sont triés selon l'heure à laquelle ils ont été copiés sur la microSD mais que si vous souhaitez trier les jeux par ordre alphabétique, cela est possible, il faut passer par un outil qui va trier les fichier sur la partition. La team rappelle aussi que la V2 permet avec son bouton de passer au jeu suivant en poussant rapidement, mais qu'une poussée longue permet de revenir au jeu précédent. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191771/in-switch-lequipe-unlockswitch-progresse-sur-le-developpement-de-xtractor-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS3] Nautilus Toolset v1.00 de DeViL303 disponible",
        "content": "Le développeur DeVil303 bien connu de la scène PlayStation 3 pour tous ces outils de personnalisation revient présenter un nouvel utilitaire, Natulis Toolset qu'il propose en v1.00. Il s'agit d'un fork de Multiserver3 d’AgentDark447. Nautilus est une interface graphique pour PC Windows conçue pour gérer les ressources de PlayStation Home à un niveau de profondeur inédit. \n \n \n\n \n \n\n \n \nChangelog 1.00 : \n- Home Archive Creator : Cet outil vous permet de créer des archives pour les ressources de PlayStation Home. Vous pouvez glisser-déposer des dossiers dans l’application et choisir le type d’archive souhaité. Il peut gérer des opérations étendues, comme la création de plus de 70 000 objets en une seule fois.\n \nTypes d’archives pris en charge :\n- BAR : L’archive la plus basique, historiquement utilisée dans les premières éditions de PlayStation Home. Elle est rapide à lire, monter, créer et télécharger.\n- BAR Secure : Une version cryptée de BAR utilisée avec SHA1 dans certaines versions pré-Sharc de Home.\n- SDAT : Similaire à BAR, mais avec une couche de chiffrement NPD.\n- SDAT SHARC : Un format d’archive sécurisé introduit dans la version 1.82 pour lutter contre le piratage.\n \nComme vous le savez les ressources de Home sont assez particulières, et très vastes, ce qui fait que cet homebrew ne sera jamais réellement \"terminé\". \n \n \nTéléchargement : Nautilus Toolset v1.00\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191724/in-ps3-nautilus-toolset-v100-de-devil303-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1191724/in-ps3-nautilus-toolset-v100-de-devil303-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[Wii/GG] Swiss v0.6 r1664 disponible",
        "content": " \n3 mois, il aura fallu attendre 3 mois pour que nos amis Emukidid et Extrems proposent une nouvelle version de Swiss. Voilà que débarque donc la v0.6 r1664 du célèbre couteau suisse de la Nintendo Wii et Nintendo GameCube. \n \n \n \n\n \n \n \nEmukidid :\n \n- Assainissement de la liste récente pour éviter un crash lorsque recent.ini n'existe pas\n- Proportionner le texte des bannières de manière cohérente en se basant sur la plus petite échelle requise.\n \nExtrems :\n \n- Correction de bugs stupides dans le serveur HTTP.\n- Test de la fonctionnalité de streaming audio.\n- Ajout d'une vérification supplémentaire.\n- Synchronisation des modifications du cache FAT.\n- Filtrer les fichiers de plus de 4 GiB-1 pour le moment.\n- Ajout d'une option pour optimiser l'affichage pour le RetroTINK-4K.\n- Ajustement pour les changements de libogc2.\n- Correction de efbHeight dans Marvel Nemesis : Rise of the Imperfects.\n- Désactiver la mise à l'échelle verticale pour RetroTINK-4K.\n- Correction de l'erreur d'étiquetage ENC28J60 dans Serial Port 1.\n- Désactivation plus complète de la mise à l'échelle verticale.\n- Empêcher la configuration d'un second disque s'il n'est pas pris en charge.\n- Amélioration mineure de la précision.\n- Correction des drapeaux de région dans la vue carrousel.\n- Mise à jour de XZ Embedded.\n- Optimisation du mixage audio.\n- Consolidation en un seul callback EXI.\n- Déplacement du déverrouillage en dehors de la coroutine.\n- Optimisation de la sélection des périphériques EXI.\n- Activation de la prise en charge des slots de mémoire A et B dans l'hyperviseur.\n- Refonte de la recherche de l'emplacement du BBA.\n- Permettre au verrouillage de périphérique EXI d'être demandé par plusieurs callbacks.\n- Utilisation de gxtexconv.\n- Suppression de l'indicateur de mode progressif pour les jeux PAL.\n- Utiliser la nouvelle extension dirent lorsqu'elle est disponible.\n- Masquer les interruptions non désirées.\n- Correction de la régression e8911d3.\n- Retravailler la détection des périphériques DI.\n- Rendre l'initialisation du réseau asynchrone.\n- Vérifier l'existence d'une adresse IP liée avant d'entrer dans l'appareil.\n- Attendre le réseau avant de gérer les paramètres.\n- Afficher l'adresse MAC alors qu'il n'y a pas d'IP liée.\n- Affichage de l'adresse MAC/IP pour d'autres emplacements de périphériques.\n- Mise à jour de la base de données Redump.\n- Prise en charge de ETH2GC Sidecar+ et de l'hypothétique SD2SP1.\n- Affichage du nom du matériel pour ETH2GC Sidecar+.\n- Affichage de l'icône de chargement lorsque le fil de métadonnées est actif.\n- Modification de la taille du cache FAT.\n- Corriger le conflit entre la SD2SP1 et la carte mémoire physique.\n- Toujours mettre à jour la SRAM à la sortie.\n \nTéléchargement : swiss-gc\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191717/in-wiigg-swiss-v06-r1664-disponible-1.jpg"
        }
    },
    "news_12": {
        "title": "[XBO/XB360] FATXplorer v3.0 Bêta 31 disponible",
        "content": "Une nouvelle version Bêta de FATXplorer a été dévoilée, il s'agit de la v3.0 Bêta 31 qui vise à apporter pas mal de nouveautés. \n \nCette nouvelle version a été publiée le 31 Mai 2024, et vient à améliorer la gestion des mots de passes, car elle permet notamment la gestion de la restauration des mots de passe sur les disques durs Western Digital sur la Xbox originale. \n \n\n \nComme le savent de nombreuses personnes ayant effectué n’importe quel type de modding Xbox original, le disque dur interne est verrouillé à l’aide de la fonction de sécurité ATA. Cela a été fait par Microsoft comme première ligne de défense pour empêcher les moddeurs d'entrer au début des années 2000. Cette proposition a été rapidement rejetée, mais elle reste encore aujourd’hui un sujet de préoccupation. Pour déverrouiller un lecteur, la Xbox calcule le mot de passe ATA à partir d'un hash HMACSHA1 en utilisant les informations du disque avec une clé unique appelée clé HDD. La clé du disque dur doit être obtenue à partir de l'EEPROM de la Xbox afin de déverrouiller le lecteur. Si la Xbox meurt, il devient beaucoup plus difficile d'obtenir cette clé.\n \n \n \n\n \n \n \nFATXplorer 3.0 beta 31 introduit une fonction spéciale pour récupérer le mot de passe ATA du lecteur sans avoir besoin du tout de la Xbox associée. D'un simple clic sur un bouton, vous pouvez obtenir le mot de passe et déverrouiller le lecteur pour afficher son contenu.\n \nLes outils de sécurité du disque dur disposent d'un nouveau bouton Options : Récupérer le mot de passe WD . Lorsque vous cliquez dessus, le mot de passe s'affichera après quelques secondes. C'est aussi simple que ça!\n \nA noter que la date d'expiration a été modifiée au 27 novembre 2024. \n \n \nTéléchargement : FATXplorer v3.0 Bêta 31\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191704/in-xboxb360-fatxplorer-v30-beta-31-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1191704/in-xboxb360-fatxplorer-v30-beta-31-disponible-2.png"
        }
    },
    "news_13": {
        "title": "[Multi] PS Multi Tools v14.2.1 disponible",
        "content": " \nLe développeur SvenGDK vient de publier une nouvelle version de son outil PS Multi Tools qui est désormais livré en v14.2.0. \n \nComme vous le savez probablement cet utilitaire s'adresse à tout ceux qui dispose d'une console Sony, de la PSP à la PS5 en passant par toutes les générations. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \nCette nouvelle version met à jour PS4 PKG Extractor, l'interface GUI PS Vita PFS Tools (psvpfstools), ainsi que PS5 PKG Sender, qui doit être utilisé avec etaHEN et le service Direct PKG Installer. \n \n \n\n \n\n \n \n \nGénéral\nPS Multi Tools est désormais disponible en édition [Full] ou [Classic].\nL'édition complète inclut les émulateurs nécessaires pour jouer à un jeu sélectionné dans la bibliothèque.\nL'édition classique est identique à l'édition complète mais n'inclut pas les émulateurs.\nDéplacement de PS3 & PS Vita PKG Browser&Downloader vers PSMT-Library\nMise à jour du paquet WebView2 (1.0.2478.35 -> 1.0.2535.41)\n \nPS1\nCorrection critique de Backup Manger : Correction de la lecture des fichiers .bin des jeux si 'strings' n'a jamais été utilisé auparavant\nCeci a probablement empêché le chargement des sauvegardes de jeux pour presque tous les nouveaux utilisateurs jusqu'à aujourd'hui.\nAjout de la possibilité de lancer le jeu PS1 sélectionné avec ePSXe\nNécessite au moins 1 fichier BIOS configuré dans Emulators\\ePSXe\\bios\nPS Multi Tools propose de copier un fichier BIOS dans Emulators\\ePSXe\\bios\nConfigurer le fichier BIOS en utilisant Emulators\\ePSXe\\ePSXe.exe -> Config -> BIOS\n \n \n \nPS2\nSuppression des options inutilisées du menu contextuel\nAjout de la possibilité de lancer le jeu PS2 (ISO) sélectionné avec PCSX2\nNécessite au moins 1 fichier BIOS dans Emulators\\PCSX2\\bios\nPS Multi Tools propose de copier un fichier BIOS dans Emulators\\ePSXe\\bios et de lancer le jeu ensuite.\n \nPSP\nAjout de la possibilité de lancer le jeu PSP sélectionné avec PPSSPP\n \nPS3\nAjout de la possibilité de lancer le jeu PS3 sélectionné avec rpcs3\nNécessite l'installation du micrologiciel PS3\nPrend en charge la lecture des dossiers de sauvegarde des jeux, des ISO PS3 et des fichiers PKG PS3 (nécessite un fichier .rap supplémentaire pour les jeux).\nPS Multi Tools propose d'installer un fichier firmware PS3UPDAT.PUP directement dans rpcs3\nPS Multi Tools propose d'installer un jeu au format .pkg avec son fichier .rap et de démarrer le jeu par la suite.\nPS Multi Tools détectera si un jeu au format .pkg est déjà installé et le démarrera si c'est le cas.\nSi vous avez oublié d'installer le fichier .rap, vous devez le faire manuellement en utilisant Emulators\\rpcs3\\rpcs3.exe -> File -> Install Packages/Raps/Edats\n \n \nPS Vita\nBibliothèque : Correction d'un problème qui empêchait le chargement de jeux dans la bibliothèque\nAjout de la possibilité de lancer le jeu PS Vita sélectionné avec vita3k\nNécessite l'installation du firmware de la PS Vita\nPrise en charge de la lecture de dossiers de sauvegarde de jeux et de fichiers PKG cryptés et décryptés (nécessite zRIF pour l'installation)\nPS Multi Tools proposera d'installer un fichier PSP2UPDAT.PUP firmware fonts package directement dans vita3k\nPS Multi Tools vous propose d'installer un fichier firmware PSVUPDAT.PUP directement dans vita3k\nPS Multi Tools proposera de récupérer automatiquement une clé zRIF lors de l'installation d'un jeu au format .pkg.\nLes jeux .pkg déjà installés démarreront automatiquement\nNouvelle interface graphique PSVPFSTools pour décrypter le contenu des dossiers de jeux\nLa clé zRIF peut être obtenue après qu'un dossier d'entrée a été spécifié, il suffit de cliquer sur « Get ».\nInclut le journal de décryptage\nAjout d'une sortie de journal dans l'interface graphique de PKG Extractor\nAjout d'une sortie de journal dans l'interface graphique de l'extracteur RCO\nRenommé l'élément de menu 'SUPRX' en 'Plugins - SUPRX'.\nRenommé l'élément de menu « VPK » en « Apps - VPK ».\nAjout d'un nouvel élément de menu « Game Ports - VPK ».\nAjout de nouveaux téléchargements (NoNpDrm, reF00D, keys.bin)\nMise à jour du téléchargement PKGj (v0.55 -> v0.57)\nInterne : Utilisation de la propriété de jeu .PackagezRIF au lieu de .PackageRAP\nInterne : Remplacement de VitaRCOMage par PS5RcoExtractor (corrige l'erreur d'extraction)\n \n \n \nPS4\nAjout de la possibilité de lancer le jeu PS4 sélectionné avec psOff\nL'émulateur est encore en phase de développement et la plupart des jeux ne fonctionnent pas encore correctement.\nNe fonctionne que sur les dossiers de sauvegarde PS4 -> Nouvelle option du menu contextuel « Jouer avec psOff ».\nBibliothèque : Supporte maintenant le chargement des dossiers de sauvegarde PS4 (nécessite sce_sysys\\param.sfo)\nBibliothèque : Nouvelle option de menu contextuel pour extraire le PKG du jeu/app sélectionné\nBibliothèque : Ajout du code manquant sur l'option du menu contextuel pour copier le jeu/l'application sélectionné(e)\nBibliothèque : Changement pour un menu contextuel dynamique pour le jeu/app sélectionné\nNouvel extracteur PKG\nExtrait les fichiers PS4 .pkg avec ou sans code d'accès\nAffiche des informations sur le fichier .pkg sélectionné\nComprend le journal d'extraction\n \nPS5\nNouveau etaHEN Direct PKG Installer\nInstaller des fichiers .pkg à partir d'URL\nInstaller des fichiers .pkg à partir d'un PC en utilisant un serveur web local (ne fonctionne pas encore correctement - affiche l'erreur -2...)\nMise à jour du configurateur etaHEN\nAjout de la configuration « testkit\nAjout de la configuration « Allow_data_in_sandbox ».\nAjout de la configuration « DPI\nSuppression de la configuration « Itemzflow\nMise à jour du téléchargement cassé pour Homebrew Store (PS5)\nMise à jour du téléchargement cassé pour Itemzflow (PS5)\nMise à jour du téléchargement PS5-Xplorer en v1.02\n \n \n \nTéléchargement : PS-Multi-Tools\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191690/in-multi-ps-multi-tools-v1420-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191690/in-multi-ps-multi-tools-v1420-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] Le hardware de l'UnlockSwitch au grand complet",
        "content": "L'équipe en charge du développement du linker UnlockSwitch MSK a dévoilé les premières images du linker au grand complet, à savoir le PCB recouvert de son packaging transparent.   La particularité du boitier transparent est qu'il ne présente pas de vis, selon la team ce boitier a été conçu avec des éléments de qualité, il n'en reste pas moins qu'il ne s'agit pas de la version finale du boitier, la team souhaite une version encore plus transparente.",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191687/in-switch-le-hardware-de-lunlockswitch-au-grand-complet-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191687/in-switch-le-hardware-de-lunlockswitch-au-grand-complet-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1191687/in-switch-le-hardware-de-lunlockswitch-au-grand-complet-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1191687/in-switch-le-hardware-de-lunlockswitch-au-grand-complet-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1191687/in-switch-le-hardware-de-lunlockswitch-au-grand-complet-5.jpg"
        }
    },
    "news_15": {
        "title": "[PS4] L'émulation PS4 s'améliore avec psOff v0.5 (version publique)",
        "content": " \nL'émulation PlayStation 4 s'améliore, psOff semble tirer son épingle des nombreux protagonistes, il semble faire des progrès impressionnants ! Bien que le projet soit encore en développement, il montre déjà des résultats prometteurs. \n \nL’objectif de psOff est simple il s'agit de de créer un émulateur PlayStation 4 pour Windows.\nLe projet utilise également cet émulateur pour exécuter des binaires “Linux” sur Windows, bien que psOff ne soit pas encore pleinement fonctionnel, il peut déjà exécuter certains jeux. Par exemple, il peut faire tourner Sonic Mania Plus à 1449 fps, Worms WMD à 234 fps et Blackhole à 32 fps.\n \n \n\n \n \nComme vous le savez il existe plus de 6 projets d'émulation PS4 en développement, mais psOff est un grand projet où les développeurs sont motivés et les changements et améliorations sont très nombreux. \n \n \n \n \n\n \n \n\n\n \nChangelog versus v0.4 Bêta :\n \nlibSceSaveData things by @igor725 in #52\nlibSceSharePlay initial implementation by @TylerJaacks in #51\nAnother libSceSaveData thing by @igor725 in #54\nImplement ioctl+fcntl IFile functions by @igor725 in #56\nDo not close the emulator if message box failed by @igor725 in #58\nImplement some deprecated SaveData API by @igor725 in #59\nStub libSceVrTracker + Cleanup + libSceNgs2 things by @igor725 in #60\nMove zlib by @SysRay in #62\nSome libScePngDec by @igor725 in #63\nSome libSceNet functions by @igor725 in #64\nImplementation attempt: sceNetEpoll things by @igor725 in #65\nGamereport by @igor725 in #66\nWork by @SysRay in #67\nintercepts, + window resize, + fullscreen config by @SysRay in #69\nSome functions to get the original libSceNgs2 wroking by @igor725 in #68\nRemember window position and size by @igor725 in #70\nFix libScePngDec implementation by @igor725 in #71\nGamereport request by @igor725 in #72\nunittest + frame limiting by @SysRay in #73\nUnit tests action by @igor725 in #74\nRework GameReport a bit by @igor725 in #75\nStub sceRazorIsLoaded by @igor725 in #76\nFix /dev/random creation by @igor725 in #77\nFixes by @igor725 in #78\nMove initialization of /dev/zero and /dev/null, meet POSIX standard by @minecraft8997 in #79\nNpToolkit2, NpParty, Voice stubs by @igor725 in #80\nFix deps for core + config_emu|pthread|appcontent things by @igor725 in #81\nlibSceNet| Resolver by @igor725 in #82\nGameReport| Locales by @igor725 in #83\nWork -> feature by @SysRay in #85\nStubs and functions by @igor725 in #86\nMore translations for GameReport by @igor725 in #84\nProper multiple display support by @igor725 in #88\nStub some funcs by @igor725 in #89\nMoved third_party to new repo by @SysRay in #91\nSymbol stubs by @kr1spy2115 in #90\nSavedata backups by @igor725 in #87\nFormat inplace by @igor725 in #92\nvideout| fix image handling race condition by @SysRay in #94\nFromat inplace fix by @igor725 in #93\nLet ffmpeg decide by @igor725 in #95\nadd emulator version by @SysRay in #97\nAutofill emulator version in game report by @igor725 in #98\nWork by @SysRay in #99\nlibSceGameLiveStreamingSetMaxBitrate + libSceUsbd symbols by @Ordinary205 in #101\nCleanup + Json things by @igor725 in #100\nUpdate window title by @igor725 in #102\nDiscord release notifier by @igor725 in #103\nFix vsync description + ngs2 things by @igor725 in #106\nMultiple Symbols by @Ordinary205 in #105\nRevert audio change by @igor725 in #108\nwork -> features by @SysRay in #109\nlibSceVoice Symbols by @Ordinary205 in #110\nMultiple Symbols (Part 2) by @Ordinary205 in #112\nWiki thing by @igor725 in #55\nlibSceHttp early implementation by @minecraft8997 in #104\nFix wiki action by @igor725 in #113\nSome libc missing syms by @igor725 in #114\nMoving net code to core by @igor725 in #111\nMultiple gamepads support by @igor725 in #115\nSome config range checks and wiki update by @igor725 in #116\nMultiple stubs and implementations by @igor725 in #117\nToggle fullscreen keybind by @igor725 in #118\nMinor libSceUlt research by @igor725 in #119\nWork by @SysRay in #121\nMore stubs, libc implementations and scePadOpen fix by @igor725 in #120\nMultiple Symbols (Part 3) by @Ordinary205 in #122\nFix all kinds of bugs across libScePad by @igor725 in #124\nAdd json validation schemas to config files by @igor725 in #123\nError codes cleanup + more scePad fixes by @igor725 in #125\nUpdate wiki info and json schemas by @igor725 in #126\nNgs2 things again by @igor725 in #128\nHandle ps_regs==nullptr case by @igor725 in #127\nCustom verbosity level for each logging module by @igor725 in #129\nWork by @SysRay in #130\nlibScePad and libScePthread fixes + some stubs by @igor725 in #131\nWork by @SysRay in #133\nrender| v.0.5-nightly_27.04.24 by @SysRay in #134\nGet rid of pad's backend aliases by @igor725 in #132\nFix OpenFile formatting by @igor725 in #135\nFix other strings too by @igor725 in #136\nmove runtime + main to public by @SysRay in #137\nFix renderer version displaying by @igor725 in #138\nfix vulkan limits by @SysRay in #139\nMemoryManager + Missing Symbols fix by @SysRay in #140\nsmall fixes by @SysRay in #141\nvulkanSetup fixes, + exception(more infos) by @SysRay in #143\nStubs again by @igor725 in #142\nfix exception handling by @SysRay in #144\nlibScePngEnc implementation by @igor725 in #146\nCorrect libSceAudioOut behavior by @igor725 in #145\nMultiple Symbols (Part 4) by @Ordinary205 in #148\nFix gmtime_s stack corruption and distorted FLOAT_8CH sound by @igor725 in #147\nsceNpSignaling library stub and log fix by @kr1spy2115 in #150\nwork -> features by @SysRay in #151\nfix imgui resize crash by @SysRay in #152\nTrophies system by @igor725 in #149\nRework hotkey handling + cleanup by @igor725 in #153\nFix unused iterator by @igor725 in #154\nSet of logarithm funcs + config fix by @igor725 in #156\nTrophies list by @igor725 in #155\nAdd symbol names and paths to stacktrace by @igor725 in #157\nDisable IO vbuffer by @igor725 in #158\nMissing symbols and minor fixes by @igor725 in #159\nWork by @SysRay in #160\nFix sampling rate for ngs2 sound by @igor725 in #161\nMultiple Symbols (Part 5) by @Ordinary205 in #162\nFix language detection for trophies by @igor725 in #163\nAnother Ngs2 fix by @igor725 in #164\nTrophies fix by @igor725 in #166\nHandle zero-cases by @igor725 in #165\nbugfixes for libc malloc by @SysRay in #167\nFix POSIX_CALL return value + Library fix by @igor725 in #168\nfixes by @SysRay in #169\nStub some sceNp apis by @igor725 in #170\ngraphicsDriver| use shader regs size by @SysRay in #172\nWork -> features by @SysRay in #173\nWindow size + Thread name bugfix by @igor725 in #174\nFeatures -> main by @SysRay in #175\n \n\n \n\n \nLa liste des compatibilités se trouve ici : psOff_compatibility\n \nTéléchargement : psOff v0.5 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191661/in-ps4-lemulation-ps4-sameliore-avec-psoff-v05-version-publique-1.png"
        }
    },
    "news_16": {
        "title": "[Switch] L'UnlockSwitch commence à être livré et son boitier arrive",
        "content": "Les premières livraisons de l'UnlockSwitch commencent à arriver, les premiers utilisateurs voient arriver dans leur boite aux lettres la première version du linker UnlockSwitch, comme vous le savez la team a sélectionné 40 personnes pour recevoir cette première version, il en reste encore une dizaine.\n \nS'agissant des échantillons tests, cette version est livrée nue sans son boitier transparent qui vient d'ailleurs d'arriver chez UnlockSwitch d'après leur dernier message sur X.\n \n \n\n \nLe linker est livré avec son programmeur permettant de le flasher, cependant pour l'heure il n'est pas encore possible de le flasher faute de logiciel, ce qui ne devrait plus tarder. \n \nLa team s'est engagé à montre le boitier transparent aujourd'hui, celle-ci met en avant le fait que la petite vis présente sur le Mig Switch abime le chariot de chargement de la console en dévoilant une photo. \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191660/in-switch-lunlockswitch-commence-a-etre-livre-et-son-boitier-arrive-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191660/in-switch-lunlockswitch-commence-a-etre-livre-et-son-boitier-arrive-2.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] PPPwn Lite disponible en v5.1 Beta",
        "content": "PPPwn Lite est une version allégée du projet PPPwn, basée sur PPPwn CPP et PPPwn-Loader.\n \n \n \n\n \n \nVoici les principales fonctionnalités de PPPwn Lite :\n \n- Démarrage automatique avec Windows : PPPwn Lite peut être configuré pour démarrer automatiquement avec Windows, ce qui facilite son utilisation.\n- Surveillance du démarrage de la PS4 : PPPwn Lite surveille le démarrage de la PS4 et s’active lorsque la console est allumée.\n- Exécution automatique du payload CPP : PPPwn Lite exécute automatiquement le payload CPP (code d’exploit) nécessaire pour le jailbreak.\n- Arrêt automatique du PC après le jailbreak : Une fois le jailbreak réussi, PPPwn Lite peut éteindre automatiquement votre PC.\n- Mise à jour en ligne : PPPwn Lite peut mettre à jour les fichiers Lite, stage.bin et goldhen directement depuis Internet, sans nécessiter de manipulations manuelles.\n- Sélection automatique du fichier stage.bin : Vous n’avez plus besoin de sélectionner manuellement le fichier stage.bin lors de l’utilisation de PPPwn Lite.\n- Pas besoin de configurer la connexion Internet de test : Contrairement à d’autres méthodes, PPPwn Lite ne nécessite pas que la PS4 soit configurée pour le test de connexion Internet.\n \nPour utiliser PPPwn Lite, voici les étapes générales :\n \n- Téléchargez la dernière version de PPPwn Lite depuis les releases.\n- Décompressez l’archive et exécutez PPPwn Loader.exe.\n- Sélectionnez le port Ethernet auquel vous connectez votre PS4.\n- Choisissez la version système actuelle de votre PS4 dans le menu déroulant.\n- Sélectionnez le fichier stage2.bin que vous souhaitez charger (vous pouvez utiliser celui de la branche PPPwn de @LightningMods ou celui du dossier stage2 dans le répertoire PPPwn à des fins de test).\n- Cliquez sur le bouton “START” pour lancer le processus.\n- Suivez les instructions pour configurer une connexion PPPoE sur votre PS4.\n \nGardez à l’esprit que le taux de réussite de l’exploit actuel n’est pas très élevé, mais PPPwn Lite simplifie grandement le processus.\n \nDans cette nouvelle version de nombreuses modifications ont été effectuées, le code a largement été optimisé et les supports sont élargis. \n \nTéléchargement : PPPwn Lite v5.1 Beta\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191643/in-ps5-pppwn-lite-disponible-en-v51-beta-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] sys-con 1.0.0 disponible",
        "content": "\nUn nouveau projet vient de voir le jour. Inspiré du projet sys-con de Cathery, ce nouveau fork a été réalisé pour ajouter le support de toutes les manettes compatibles PC (avec un profil HID).\n \nCette nouvelle version 1.0.0 (Pour se différencier de l'original 0.6.x) vient supporter l’ensemble des manettes compatibles PC tout en gardant la compatibilité d'origine avec XBOX et DualShock. Ce nouveau portage ouvre donc la porte à de nouveaux horizons, dont le retrogaming avec RetroArch par exemple (Arcade, NES, Snes, etc…)\n \nSys-Con est un module système pour Nintendo Switch, qui vous permet d'utiliser des contrôleurs tiers sur votre console Nintendo Switch. Sys-con a juste besoin que vous connectiez vos contrôleurs en utilisant les ports USB de votre dock, mais le module fonctionne aussi via le port USB C avec un adaptateur OTG.\n \n \n \n\n \n \nInstructions :\n \n- Extrayez le fichier zip et copiez son contenu sur votre carte SD.\n- Si vous n'utilisez pas Atmosphere, renommez le dossier atmosphere/ avec le nom CFW souhaité.\n- Redémarrez votre console Nintendo Switch\n \nFonctionnalités de cette nouvelle version :\n\nSupport des Joysticks et Gamepads avec profil HID. (Autrement dit, toutes les manettes compatibles PC)\n\n\nPossibilité de mapper les touches en fonction du VID/PID de la manette.\n\n\nConfiguration de la deadzone (Déjà disponible dans le module de base)\n\n\nConfiguration de la fréquence de polling.\n\n\nConfiguration de la couleur des manettes en utilisant le standard #RGBA\n\n\nLes vibrations ne sont pas encore fonctionnelles, mais devraient arriver prochainement.\n\nTéléchargement : sys-con 1.0.0\n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191641/in-switch-sys-con-100-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[Wii/Wii U] De nouveaux exploits pour la Wii et la Wii U : ISFShax et szsHaxx",
        "content": " \nLe développeur MikeIsAStar vient de lancer il y a quelques jours un tout nouvel exploit à destination de la Wii, et comme nous allons le voir, la Wii U elle aussi n'est pas avare en nouveauté en matière de hack. \n \nUn nouvel exploit pour la Nintendo Wii\n \nszsHaxx est un exploit récent, puisqu'il a été dévoilé la semaine dernière, pour la Wii qui permet d’exécuter du code arbitraire à partir de la carte SD en utilisant le fichier de sauvegarde de Mario Kart Wii. L’exploit tire parti des données de compétition stockées dans les fichiers de sauvegarde du jeu.\n \n \n\n \n \n \nExplication, dans Mario Kart Wii, les données de compétition sont stockées dans les données de sauvegarde. Les données de prix correspondantes sont compressées à l'aide d'un format propriétaire. L'exploit s'appuie sur un débordement de tampon lors de la décompression de ces données pour exécuter du code non signé.\n \nCependant, pour l'exploit, vous devez supprimer votre sauvegarde de Mario Kart Wii , car il n'existe aucun moyen de la sauvegarder au préalable dans les jeux en ligne. Une vidéo valant de longs discours, en voilà deux, le développeur propose une démonstration de szsHaxx v1.0.0.0 : \n \n \n \n\n \n \n\n \n \n \nTutoriel : \n \n- Trouvez une carte SD d’une capacité de 2 gigaoctets ou moins.\n- Formatez la carte SD en utilisant le système de fichiers FAT16 ou FAT32.\n- Créez le chemin d’accès sd:/private/wii/title/RMC[E|P|J|K] sur la carte SD.\n- Le dernier caractère doit correspondre à la version de Mario Kart Wii que vous utiliserez.\n- Copiez le fichier data.bin correspondant à la version de Mario Kart Wii dans le dossier mentionné ci-dessus.\n- Placez le fichier boot.elf à exécuter à la racine de la carte SD (chemin : sd:/).\n- Activez la fonctionnalité WiiConnect24 sur votre Wii.\n- Supprimez les données de sauvegarde de la version de Mario Kart Wii que vous utiliserez.\n- Transférez les données de sauvegarde depuis la carte SD vers la Wii.\n- Démarrez Mario Kart Wii.\n- Commencez la compétition dans le jeu.\n \n \nTout est là : szsHaxx v1.0.0.0\n \n \n \n \nMais aussi pour la Nintendo Wii U \n \nLa console qui a succédé avec un moindre succès à la Nintendo Wii n'est pas en reste puisque la Nintendo Wii U a vu débarqué aussi un nouvel exploit en Octobre 2023 qui vient d'évoluer avec l'arrivée de nouvelles options. Cet exploit se nomme ISFShax, ISFShax est un coldboot pour la Wii U, il s'appuie lui sur le boot1 avec un superblock ISFS (le système de fichiers du SLC) spécialement conçu. Une fois installé, ISFShax offre des fonctionnalités similaires à de_fuse.\n \n \n\n \n \nIl se lance avant IOSU, ce qui permet d’appliquer des correctifs à IOSU et de réparer la plupart des bricks. Cependant, il ne protège pas contre les bricks causées par la rupture de boot1, les bricks seeprom ou l’installation d’un superblock ISFShax défectueux, c'est pourquoi comme toujours, il est recommandé de se pas se lancer dans la manipulation si vous ne maitrisez pas le sujet parfaitement. De toute façon vous l'aurez compris, ISFShax ne vous aidera pas non plus si vous avez déjà briqué la Wii U.\n \nEn résumé ISFShax permet :\n \n- Reconstruction / mise à niveau du MLC.\n- Suppression de la limite de 64 Go du MLC et désactivation du SCFM.\n- Protection contre les bricks (par exemple, avant de changer de région).\n- Coldboot redNAND (utile lorsque l’eMMC est défaillant).\n- Il offre un CFW minimal, qui peut lancer d’anciens homebrews à l’aide du homebrew launcher (bien que nous ayons maintenant Aroma et Tiramisu).\n \nTutoriel de Sauvegarde :\n \n- Aller vers Backup and Restore\n- Dump SEEPROM & OTP\n- Dump SLC.RAW\n- Retour au menu principal\n \nTutoriel Installation d'ISFShax :\n \n- Choisissez Boot `ios.img`(5x puissance, 1x éjection)\n- Le programme d'installation d'ISFShax devrait maintenant se lancer (cela prend quelques secondes)\n- Suivez les instructions à l'écran, les boutons sont les mêmes qu'en minute. (3x éjection, 1x alimentation, 3x éjection)\n- La console devrait maintenant s'éteindre.\n- [Tiramisu | Navigateur | DNSpresso] remplacez le (crypté) fw.imgsur la SD par le fw.img( PAS celui crypté ) de https://github.com/jan-hofmeier/minute_minute/releases\n- Si l'installation a réussi, la Wii U devrait démarrer directement en une minute une fois que vous la rallumerez.\n \nSauvegarde ISFShax :\n \n- Dumpez à nouveau le SLC.RAW. Cela écrasera le fichier SLC.RAW précédent sur la SD. Ceci est requis si vous devez restaurer le SLC pour le déblocage, sans perdre ISFShax. Conservez cette sauvegarde dans un endroit sûr.\n \n \n \nTout est là : ISFShax et un post ultra complet ici how-to-set-up-isfshax ou des tutos pour corriger des erreurs mémoire\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191591/in-wiiwii-u-de-nouveaux-exploits-pour-la-wii-et-la-wii-u-isfshax-et-szshaxx-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191591/in-wiiwii-u-de-nouveaux-exploits-pour-la-wii-et-la-wii-u-isfshax-et-szshaxx-2.jpg"
        }
    },
    "news_20": {
        "title": "[Multi] Libretro dévoile retroArch 1.19.1",
        "content": " \nL'équipe Libretro vient de dévoiler l'existence de la version 1.19.0 de RetroArch, après la version 1.18.0 lancée le 22 Mars 2024, voilà donc la semaine version de 2024 du célèbre émulateur. \n \nPlus de deux mois après la version précédente voilà donc la v1.19.0 qui débarque avec énormément de nouveautés et de corrections. \n \nPetit retour en arrière sur l'IA qui a été introduite sur les traductions car cela posait de nombreux problèmes, les cores fonctionnent mal, sur les appareils Apple la langue par défaut du sytème sera utilisée, et le support des contrôleurs Switch Online a été amélioré via MFi. \n \n \n\n \n \n \nChangelog 1.19.0 : \n \nAI : Revenir à la version précédente de la traduction de l'IA (correction du fait que la traduction ne fonctionnait pas avec les cœurs rendus HW)\nAPPLE : Essayer d'utiliser la langue préférée du système\nAPPLE : Enregistrement correct des types de fichiers de manière unique\nAPPLE/MFI : Amélioration de la prise en charge de la manette Switch Online par MFi\nAUDIO : Rétablir le basculement audio sur le basculement du menu\nCHEEVOS : Construction d'une carte mémoire RetroAchievements par défaut lorsqu'aucun jeu RetroAchievements n'est chargé\nCHEEVOS : Mise à jour vers rcheevos 11.3\nCHEEVOS : Correction du hardcore agissant comme s'il était activé alors qu'il ne l'est pas\nCLANG : Correction de l'erreur clang incompatible-pointer-types-discards-qualifiers\nCLOUDSYNC/LINUX : Activer Cloud Sync par défaut sur les builds Linux avec réseau (#16456)\nCLOUDSYNC/WEBOS : Activer Cloud Sync par défaut sur les builds Linux avec réseau (#16456)\nCORE : Configurer la journalisation des statistiques compute fps au niveau debug\nEMSCRIPTEN : Ajout de M2000 à la liste déroulante de sélection des noyaux\nFFMPEG : Ajouter la compatibilité avec FFMPEG 7.0\nGLSLANG : Supprime le code ENABLE_HLSL inutile de glslang\nGENERAL : Fuite de mémoire : L'allocation dynamique de msg_hash_get_help_us_enum n'a pas été libérée.\nINPUT/KEYBOARD : Ajout du support pour les touches multimédia - Extension des valeurs RETROK_ avec 18 nouveaux éléments, communément trouvés sur les claviers « multimédia ». Mapping ajouté pour les keymaps SDL, X11, Wayland, dinput, winraw.\nINPUT/MFI : Déclencheurs gauche/droite sensibles à la pression\nINPUT/MFI : Correction des combinaisons Start + L1/L2/R2\nINPUT/MFI : Prise en charge des grondements forts et faibles\nINTL : Récupérer les traductions de Crowdin\nINTL : Ajout du galicien et du norvégien à la liste des langues\nLAKKA : Afficher le message de redémarrage/arrêt même si la configuration n'est pas sauvegardée à la sortie\nLAKKA : Fournir l'URL de mise à jour et le nom de la cible au moment de la construction\nLIBRETRO : Ajout d'un message de débogage pour le callback SET_ROTATION\nmacOS : Accessibilité par défaut activée si VoiceOver est activé\niOS : synchronisation audio par défaut à nouveau activée, également plus de journalisation mfi\niOS : Correction de l'importation de contenu\niOS : Correction du crash de la nightly build ios-arm64\niOS : Importation de contenu depuis iCloud\niOS : Correction du crash #16485 au démarrage\niOS : Afficher l'icône de l'application dans le sélecteur d'icône de l'application dans materialui\niOS/tvOS : Diverses améliorations QoL\niOS/tvOS : Correction de quelques bugs supplémentaires de manipulation des noms de chemin\niOS/tvOS : Meilleure façon d'empaqueter les Frameworks\niOS/tvOS : définir PACKAGE_VERSION pour être App Store MARKETING_VERSION\niOS/tvOS : Correction de la gestion du clavier pour les builds de l'App Store\niOS/tvOS : Correction de la sortie de la sandbox pour les appareils jailbreakés\niOS/tvOS : accessibilité par défaut si la voix est activée\niOS/tvOS : meilleure façon de rapporter la mémoire disponible\nmacOS/iOS/tvOS : activer la synthèse vocale en utilisant AVSpeechSynthesizer.\ntvOS : Correction de la mise à l'échelle pour 720p\nMENU : Nouvelle fonction dans le menu rapide : Ajouter à la liste de lecture\nMENU/XMB : Nouveau thème : FlatUX, conçu pour fusionner les thèmes FlatUI et Retroactive en un seul design unifié.\nNETWORKING/RETROPAD CORE : Correction de la méthode de fermeture de socket\nPIXMAN : Mise à jour de pixman-private.h - patch pour corriger un problème de construction avec musl\nPLAYLIST : Nettoyage de 'Add to Playlist' (#16495)\nSCANNING : Correction pour le scan des ISOs PSP (et probablement quelques autres)\nSAUVEGARDE : Correction de la sauvegarde de la configuration de base\nSAUVEGARDE : Correction de l'enregistrement du nouveau nom de la configuration lorsque le noyau est chargé\nSAVESTATES : Augmenter la taille du chunk de l'état de sauvegarde pour toutes les plateformes - Même une carte SD de classe 6 ou de classe 10 peut gérer des lectures et des écritures de l'ordre du MB/s, ce qui signifie qu'une taille de chunk de 4KB est juste une perte de temps dans les appels syscall. Cela pourrait être corrigé avec un lecteur de mémoire tampon, mais je ne me sens pas à l'aise pour modifier le VFS de libretro-common pour gérer cela. A la place, j'ai pensé qu'il serait bon de supprimer un ifdef et d'augmenter la taille du chunk à 128KB. Pour les cœurs avec de petits états, cela devrait rendre la sauvegarde d'état virtuellement instantanée, et pour les cœurs avec de grands états, cela devrait être une accélération de 32x.\nVIDÉO : Correction d'un crash lors de l'utilisation de la vidéo threadée - pour Mesa 23.2 et ultérieures\nVIDEO/GL : Correction de la réinitialisation des pilotes gl threadés\nVIDEO/VULKAN : ajout de la prise en charge du format HDR A2R10G10B10\nVIDEO/VULKAN : implémenter la lecture HDR - support des captures d'écran\nWAYLAND : Ignorer les évènements de configuration pendant le splash (corrige le fait de ne pas se souvenir de la taille de la fenêtre)\nWAYLAND : Utiliser le gestionnaire de signal du frontend pour quitter (corrige le fait de quitter en fermant la fenêtre)\nWAYLAND : Commit viewport resizes (le redimensionnement de la fenêtre est plus réactif)\nUWP : Aligner MESA sur alpha-2-resfix - Supprimer le traitement spécial de mauvaise résolution pour OPENGL\nUWP : Correction 4K : aligner la lecture MESA de ClientRect sur la procédure retroarch, ceci corrige la résolution maximale fixée à 1080p. Comme la lecture doit être faite à l'intérieur d'un thread de l'interface utilisateur et qu'il s'agit en fait d'une opération asynchrone qui peut retarder la génération d'images, la lecture elle-même est faite une seule fois et mise en cache, ce qui fait que le changement de résolution pendant que l'application est en cours d'exécution est un cas d'utilisation peu probable.\nWINDOWS : Windows mouse ungrab must release the mouse instead of confine it to the current desktop (#16488)\nWINDOWS : Correction des événements de relâchement des touches numlock/pause\n \n \nTéléchargement : retroarch.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191574/in-multi-libretro-devoile-retroarch-1190-1.png"
        }
    }
}