{
    "news_1": {
        "title": "[Switch] MissionControl supporte le dernier firmware 19.0.0",
        "content": "MissionControl est un module sysmodule pour la Nintendo Switch qui permet de connecter des contrôleurs Bluetooth d’autres consoles sans avoir besoin de dongles ou de matériel externe, pour en profiter il faut bien entendu que votre Switch soit hackée.\n \nVoici ses principales fonctionnalités, notamment les contrôleurs supportés : \n \n- Nintendo : Wii Remote + extensions, WiiU Pro Controller\n- Sony : DualShock 3, DualShock 4, DualSense (PS5)\n- Microsoft : Xbox One S/X Controller\n- Autres : NVidia Shield Controller, 8BitDo SN30 Pro, GameSir G3s, et bien d’autres\n \n \n\n \n \nChangelog : \n \n- Support pour le firmware 19.0.0 : Cette version est compatible avec la dernière mise à jour du firmware de la Nintendo Switch.\n- Amélioration de la précision du HD Rumble : La décodification des vibrations a été réécrite pour fonctionner sans erreurs.\n- Correction des problèmes de vibration : Les contrôleurs ne vibreront plus de manière erratique dans certains jeux.\n- Correction des erreurs liées aux amiibo : Certains jeux ne se bloqueront plus lors de la lecture des données amiibo avec des contrôleurs non officiels.\n- Cette mise à jour nécessite Atmosphère v1.8.0 ou une version ultérieure\n \n \nTéléchargement : MissionControl v0.12.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197415/in-switch-missioncontrol-supporte-le-dernier-firmware-1900-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS5] PS5 PKG Tool v1.0.5 disponible",
        "content": "Le développeur Master-s a mis en ligne il y a quelques heures une nouvelle version de PS5 PKG Tool, le fork de l'outil de DNNDHH, qui permet de construire des PKG pour la PS5. \n \n \n\n \n \n\n \n \n \nIl améliore son outil en y apportant des options de configurations supplémentaires, ainsi il a dévoilé une vidéo dans laquelle il modifie le fonds d'écran selon l'icone utilisée au sein même de l'app. \n \n \n \n\n \n \n \nIl ne nous donne pas de réel changelog de cette version, tout comme pour la version 1.04, ce qui est dommage, mais comme vous le savez sous PS5 PKG Tool se cache un outil qui va vous permettre de créer et gérer des fichiers de package (PKG) pour la PlayStation 5. Il comprend des fonctionnalités pour construire, modifier et installer des fichiers PKG, qui sont essentiels pour le développement de jeux et le modding.\n \n \nTéléchargement : PS5 PKG Tool v1.0.5\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197405/in-ps5-ps5-pkg-tool-v105-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1197405/in-ps5-ps5-pkg-tool-v105-disponible-2.png"
        }
    },
    "news_3": {
        "title": "[PS3] webMAN MOD v1.47.47e disponible",
        "content": "Le développeur Aldo Vargas, connu aussi sous le pseudonyme d'Aldostools, propose une nouvelle version de son plugin webMAN MOD, il s'agit de la version v1.47.47e qui comme vous le savez se destine à la PlayStation 3.\n \n \n\n \n \nAu programme, de nouvelles options et de nouvelles commandes : \n \n- Nouvelle option dans /setup.ps3 pour afficher l'URL actuelle sous forme de code QR\n- Nouvelle commande Web /qr.ps3<texte>\n- Mise à jour cumulative (inclut plus de 54 modifications apportées à la suite d'outils après la publication initiale de la version 1.47.46).\n- La combinaison R2+O annule désormais le processus de balayage du contenu en cours \n- Scan pour les couvertures de ROMS dans covers_retro de multiMAN\n- Amélioration de l'algorithme de balayage du contenu (les groupes ROMS et jeux permettent maintenant de trouver plus de jeux) \n- Ajout de nouvelles étiquettes de nom de fichier $RND$, $000$, $NEW$\n- Correction des entrées CUE/BIN dupliquées dans le dossier ROMS\n- Correction d'une erreur de segmentation lors de l'analyse d'un grand nombre de ROMS\n \n \nTéléchargement : webMAN MOD v1.47.47e\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197404/in-ps3-webman-mod-v14747e-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[XBX] Les nouveaux modèles Xbox Series X ont une puce 6 nm",
        "content": " \nComme vous le savez certainement les consoles Xbox et PlayStation partagent leur APU (processeur central) sur les chaînes de production de TSMC, sans pour partager le même processus de production, ils profitent de la même finesse de gravure. \n \n \n\n \n \nAinsi les nouveaux modèles Xbox Series X, sans disque et de 2 To, dispose d'une puce plus petite que celle des versions précédentes, un peu comme les nouvelles puces présentes dans la PS5 Pro, nous comprenons que Microsoft a fait l'impasse sur un nouveau modèle là où Sony a engagé la course à la puissance. \n \n \n\n \n \nUne fois cela confirmé, il faut noter que cette puce de 6 nm consomme moins d'énergie puisqu'elle permet d'économiser 10 watts lorsqu'elle tourne au ralenti, et jusqu'à 16 watts pendant une session de jeu. La console originale de la Xbox Series X fonctionne à environ 61 watts au repos sur le dashboard Xbox, mais sur le nouveau modèle en édition spéciale de 2 To, ce chiffre tombe à environ 51 watts au repos et à seulement 38 watts sur la Xbox Series X numérique. Pendant le jeu, la Xbox Series X originale fonctionne à 167 watts, le modèle sans disque à 156 watts et le modèle 2 To à 151 watts.\n \n \n\n \n\n \n \nCette nouvelle puce permet également à Microsoft de changer le système de refroidissement, et également de revoir techniquement la carte mère qui a été totalement repensée. \n \n \nTout est là : Theverge.com\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197403/in-xbx-les-nouveaux-modeles-xbox-series-x-ont-une-puce-6-nm-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197403/in-xbx-les-nouveaux-modeles-xbox-series-x-ont-une-puce-6-nm-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1197403/in-xbx-les-nouveaux-modeles-xbox-series-x-ont-une-puce-6-nm-3.jpg"
        }
    },
    "news_5": {
        "title": "[Switch] Atmosphere 1.8.0 officiellement disponible (prerelease)",
        "content": " \nSciresM est de retour et propose officiellement la version 1.8.0 d'Atmosphere sur son github, il s'agit de la version c6014b5 qui est la prerelease, ainsi même s'il s'agit de la quatre-vingtième version officielle d'Atmosphère, pour le moment il s'agit d'une préversion, et des problèmes peuvent être trouvés qui doivent être corrigés avant la sortie de la version complète.\n\n \nSi des bugs sont signalés pendant la préversion d'Atmosphère, ils seront corrigés et la version sera mise à jour. Merci à switchbrew, Atmosphère 1.8.0 est fourni avec hbl 2.4.4, et hbmenu 3.6.0.\n\n \n \n\n \n \n\nChangelog : \n \n- Le support de base a été ajouté pour le firmware 19.0.0.\n- La console devrait démarrer et l'atmosphère devrait être pleinement fonctionnelle. - Cependant, tous les modules n'ont pas été entièrement mis à jour pour intégrer les derniers changements.\n- Il ne devrait rien en résulter de visible pour l'utilisateur, mais ce problème sera traité dans une prochaine mise à jour d'atmosphère. Il reste également un point d'action de la version 18.0.0 à traiter.\n- Exosphère a été mis à jour pour intégrer les dernières évolutions du moniteur sécurisé.\n- Mesosphère a été mis à jour pour disposer des derniers changements du kernel.\n- Le loader a été mis à jour pour disposer des dernières évolutions.\n- pm a été mis à jour pour disposer des dernières évolutions.\n- ro a été mis à jour pour disposer des dernières évolutions.\n- Les modèles d'accès aux fichiers de creport ont été optimisés, ce qui améliore grandement les performances lors de la génération d'un rapport de crash.\n- Atmosphère utilise maintenant les relocalisations relr lorsque c'est possible.\nCela réduit la taille des fichiers d'un certain nombre de modules d'atmosphère.\n- Un certain nombre de problèmes mineurs ont été corrigés et des améliorations ont été apportées :\n- Le support a été corrigé pour faire fonctionner Atmosphère sur des unités plus récentes avec des puces DRAM Hynix/Micron spécifiques.\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \n\n \nTéléchargement : Atmosphere 1.8.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2146576139.png"
        }
    },
    "news_6": {
        "title": "[Switch] sys-clk, SaltyNX, sigpatch-updater et sys-botbase disponibles",
        "content": "Cela bouge sur le firmware 19.0.0 de la Switch, après la sortie de la mise à jour des Sys-patch, une version moddée des Sys-patch modifiant le patch ES FW18 + 19, et ajoutant le patch FS taillé pour le firmware 19.0.0. Les autres patchs restent les mêmes.\n \nA noter que si vous avez installé IPS/Patches.ini et que vous l'utilisez en même temps - sur FW19 - nocntchk_FW19_1 dira qu'il n'est pas corrigé, même s'il l'est. \n \n \n\n \n \nSys-clk et sys-botbase ont également été mis à jour apportant le support du firmware 19.0.0 et aussi d'Atmosphere 18.x. Pour rappel, sys-botbase est un module qui permet de prendre le contrôle à distance de votre Switch via une connexion WiFi, afin de lire ou d'écrire par exemple dans la mémoire du jeu. \n \n \n \nTéléchargement : Sys-patch (de Miniminx) / switch/off_switch.nro / sys-botbase / sys-clk / sigpatch-updater\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-601525428.jpg"
        }
    },
    "news_7": {
        "title": "[WiiU] Gamepad Volume Changer v2.0 disponible",
        "content": "Gamepad Volume Changer v2.0 est un homebrew développé par Fangal-Airbag pour la Nintendo Wii U. Cette version permet maintenant de changer le volume même lorsque des écouteurs sont branchés. De plus, elle corrige des plantages rencontrés dans de nombreux jeux et utilise la nouvelle API de configuration WUPS pour des améliorations générales de stabilité.\n \nPar exemple, ce plugin peut être utile lorsque votre curseur de volume est cassé. Pour construire ce fichier, assurez-vous que wut et wups sont installés. Ensuite, lancez simplement make dans le même répertoire que le Makefile et placez le .wps résultant dans sd:/wiiu/envioronments/aroma/plugins.\n \n\n\n\n \nChangelog : \n \n- Corrige les plantages rencontrés dans de nombreux titres \n- Ajout de la prise en charge des écouteurs\n- Passage à la nouvelle API WUPS Config\n- Améliorations générales de la stabilité\n \n \nTéléchargement : Gamepad Volume Changer v2.0\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-173636159.jpg"
        }
    },
    "news_8": {
        "title": "[PS5] Flat_z travaille sur le portage d'UMTX via l'exploit BD-J sur le firmware 7.61",
        "content": "Le développeur russe Flat_z confirme qu'il a réussi a faire tourner l'exploit UMTX via l'exploit BD-J sous le firmware 7.61, et il dit qu'il a juste testé le 7.61 et que cela semble fonctionner correctement. \n \nFlat_z a déjà confirmé vouloir publier l'exploit quand il aura le temps, il faudra être patient, il dit vouloir améliorer la vitesse d'une manière ou d'une autre, ce qui signifie que tout n'est pas encore pleinement opérationnel ou du moins mal optimisé. \n \n \n\n \n \nIl faut désormais développer Kstuff et etaHEN, mais clairement il s'agit ici d'une nouvelle étape importante dans la construction du hack PS5. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197317/in-ps5-flat-z-travaille-sur-le-portage-dumtx-via-lexploit-bd-j-sur-le-firmware-761-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS4] L'émulateur psOff archivé par son développeur mais repris par d'autres",
        "content": "Le développeur SysRay a officialisé la fin du développement de psOff il y a 3 jours, il a mis en effet un terme au github en charge de psOff en archivant ce dernier. Après avoir informé la communauté sur Discord de ses intentions d'abandonner le projet, quelques développeurs ont voulu reprendre le flambeau, ce qui est une bonne chose malgré la domination de la concurrence comme ShadPS4.\n \n \n\n \n \nAinsi les développeurs igor725, GamingDuck ou encore VKokielov, à priori d'origine russe, ont confirmé la reprise du projet, sur un nouvel espace dédié, facilitant les suivis et les étapes du développement. \n \n \n\n \n \nLe développement de ce genre d'émulateur est long, et la communauté est importante pour ceux qui passent des heures à s'acharner à améliorer le code, \" Vous êtes la principale raison pour laquelle le projet continue\". Nous ne pouvons que lui souhaitait le même succès technique que ShadPS4, mais le chemin sera long. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197246/in-ps4-lemulateur-psoff-archive-par-son-developpeur-mais-repris-par-dautres-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1197246/in-ps4-lemulateur-psoff-archive-par-son-developpeur-mais-repris-par-dautres-2.png"
        }
    },
    "news_10": {
        "title": "[Switch] Le plus gros leak de l'histoire de Game Freak (Pokemon) revèle le nom de code de la Switch 2",
        "content": "La hantise de tout développeur, éditeur ou constructeur, le leak est une mauvaise étape, mais quand il s'agit du plus gros leak de l'histoire de l'entreprise, cela fait mal fait. Un piratage en août 2024 chez Game Freak (le studio derrière Pokemon) montre le plus gros leaks de ces dernières années, après avoir parlé de données personnelles des membres de l'équipe, ce que l'on appelle désormais Teraleak implique Pokemon. \n \n \n \n\n \n \n- Des informations sur Légendes Pokemon Z-A\n- Le nom de code de la Nintendo Switch 2 : Ounce , en fait nous y apprenons que Gaia, le prochain Pokemon est en développement pour la Ounce. \n- Des informations sur sa date de sortie\n- Les codes sources de Pokemon Heart Gold / Soul Silver mais aussi sur Pokemon Noir et Blanc\n- La roadmap de The Pokemon Company sur les prochains films et séries sur Pokemon\n- Un nouveau titre en développement s'inspirant de Splatoon 2\n- Des concepts art inconnus et exclusifs \n \n \n\n \n \nBref vous l'aurez compris, il s'agit là d'une véritable catastrophe pour Nintendo, Pokemon et pour Game Freak.\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197243/in-switch-le-plus-gros-leak-de-lhistoire-de-game-freak-pokemon-revele-le-nom-de-code-de-la-switch-2-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197243/in-switch-le-plus-gros-leak-de-lhistoire-de-game-freak-pokemon-revele-le-nom-de-code-de-la-switch-2-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1197243/in-switch-le-plus-gros-leak-de-lhistoire-de-game-freak-pokemon-revele-le-nom-de-code-de-la-switch-2-1.png"
        }
    },
    "news_11": {
        "title": "[Wii/GC] Disponibilité de Swiss v0.6r1742",
        "content": "Le logiciel couteau suisse d'Emukidid est de retour, la version v0.6r1742 de Swiss amène son lot de nouveautés. Véritable couteau suisse de la Wii et de la GameCube, Swiss est un utilitaire homebrew tout-en-un, surtout déstiné à la Gamecube et qui permet la lecture de Carte SDSC / SDHC / SDXC via SDGecko ou SD2SP2, la lecture de DVD (- / + R) ou disques GameCube originaux via le lecteur de disque, il permet aussi de lire une Mémoire flash Qoob Pro, de réaliser du stockage de fichiers à distance via USB Gecko, d'émuler des cartes mémoire et bien plus encore.\n \nSwiss permet aussi de lire des documents texte, de lancer des homebrews, de lancer de la musique ou même, et c'est aussi ce qu'on lui demande, de lancer des jeux. La nouvelle version qui vient d'arriver amène de nombreux changements ! \n \n \n\n \n \n \nChangelog : \n \n- Cette version introduit la prise en charge initiale des contrôleurs Ethernet WIZnet W5500 et W6100 et résout un problème de compatibilité avec les cartes SD SanDisk contrefaites.\n- Correction de la régression de fc2cd66 .\n- Restructurer un peu le package.\n- Niveau de déclenchement zéro par défaut pour les jeux prenant en charge les DK Bongos.\n- Corriger la lecture du hachage Git des versions antérieures à la v0.6r1614.\n- Essayez de trouver des versions plus récentes dans des emplacements communs.\n- Réactiver la vérification CRC à la sortie de l'hyperviseur.\n- Lorsque vous maintenez B, ignorez uniquement la détection du périphérique DI.\n- Lors du démarrage automatique, transmettez les arguments de ligne de commande actuels.\n- Ajuster les modifications de libogc2.\n- Mettre à jour la base de données Redump.\n \nTéléchargement : Swiss v0.6r1742\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197241/in-wiigc-disponibilite-de-swiss-v06r1742-1.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] La version limitée de l'UnlockSwitch et le paiement par crypto-monnaies",
        "content": " \nLa team UnlockSwitch finalise sa solution et son premier kit, appelé UnlockSwitch Solo, la première version de l'appareil qui sera vendu dans un kit proposé à 24,90 $, et ce qui sera uniquement accessible via les utilisateurs de X (ex Twitter).\n \nLes abonnés devront fournir le nom de leur compte X lors du paiement lors de la finalisation de l'achat. \n \nLe stock est limité à 10 000 unités, après cela il faudra acheter le kit UnlockSwitch PBS. La team a précisé lors d'une réunion sur X les conditions de vente et d'expédition. \n \n \n\n \n\n \n \nL'expédition par avion coutera 7 $, avec suivi en ligne, livrable dans le monde entier, une autre expédition par DHL coutera 25 $ pour des commandes entre 5 à 10 pièces (uniquement accessible lors de la vente de l'UnlockSwitch PBS et l'Xtractor. \n \nMais c'est sur le mode de paiement que la team surprend puisqu'elle annonce que les paiements devront se faire uniquement via des crypto-monnaies, que ce soit l'USDT ou le BTC. \n \nL'équipe souhaite justifier le fait que ce choix se fait car bien que non illégal, le produit se site dans une \"zone grise\" du marché. Devant les perturbations d'éthiques que cela peut susciter, la team a informé qu'elle va réfléchir à proposer un type de paiement par carte de crédit à partir de lundi. \n \nTout est là : UnlockSwitch\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197193/in-switch-la-version-limitee-de-lunlockswitch-et-le-paiement-par-crypto-monnaies-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197193/in-switch-la-version-limitee-de-lunlockswitch-et-le-paiement-par-crypto-monnaies-2.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] Atmosphère Pre-Pre-Release v1.8.0 disponible",
        "content": "\nLe développeur SciresM a mis en ligne une première version \"pre-release\" d'Atmosphere en version v1.8.0 qui supporte désormais le firmware 19.0.0.\n \nIl s'agit de la version atmosphere-1.8.0-preprerelease-5717ea6c0.zip qui permet d'établir un premier lien avec le firmware 19.0.0 mais comme vous pouvez vous en doutez il manque une partie du travail à effectuer. \n \n \n\n \n \nComme déjà exprimé, il s'agit de la pré-pré version, elle n'est pas encore stable mais elle fonctionne. L'utilisation de certains modules système personnalisés (y compris sys-clk) peut entraîner le blocage du système lors de la sortie du mode veille. Il ne s'agit pas d'un bug d'Atmosphère. De plus, certains modules système peuvent nécessiter d'être compilés avec un switch-tools mis à niveau pour fonctionner correctement, en particulier s'ils utilisent des SVC de débogage.\n \n \nTéléchargement : atmosphere-1.8.0-preprerelease-5717ea6c0 / fusee.bin\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197190/in-switch-atmosphere-pre-pre-release-v180-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] Hekate 6.2.2 et Nyx 1.6.4 disponibles",
        "content": " \nComme à chaque arrivé de nouveaux firmwares, une nouvelle version d'Hekate et de Nyx sont nécessaires pour apporter le support et intégrer les derniers offsets. \n \nLe développeur CTCaer a anticipé la sortie officielle d'Atmosphere et propose donc le support du firmware 19.0.0 mais aussi d'autres nouveautés. \n \n \n\n \n \n \nChangelog : \n- Support du firmware 19.0.0 \n- L4T : Mise à jour de l'ARC vers la version 6\n- Ajout du découplage de latence via ram_oc_opt.\n- Correction d'un problème sur les skus Oled qui ne pouvaient pas redémarrer automatiquement en OFW en cas d'échec du stock.\n \nChangelog emuMMC\n- Support du firmware 19.0.0\nComme toujours basé sur https://github.com/m4xw/emuMMC\n \n \nChangelog Nyx : \n- Support du firmware 19.0.0\n- Easter Egg a été mis à jour en v2.5.3\n- Réduction de la consommation d'énergie lors de la mise en veille de chaque image.\n- Le bouton Flash Android affiche désormais la version sélectionnée dans le schéma de partition.\n- La partition GPT dans le résumé MBR est maintenant violette afin de ne pas être confondue avec les partitions Android.\n- Les informations sur la batterie peuvent maintenant afficher jusqu'à 6 profils PD.\n \nChangelog BDK :\n- DIRLIST : BREAKING Dirlist a été amélioré en vitesse et retournera désormais une structure au lieu d'un tableau de caractères.\n- JOYCON : Amélioration de la gestion de l'identification des paquets pour améliorer la latence\n- UART : Correction du nettoyage fifo et ne force pas à la fois tx et rx\n- IRQ : Ne pas réactiver l'irq en cas d'erreur de gestion\n- BPMP : Ajout d'un support d'état (pour une meilleure économie d'énergie si nécessaire)\n- TIMER : les fonctions de mise en veille utilisent à nouveau les timers RTC\n \n \n \nTéléchargement : Hekate 6.2.2 et Nyx 1.6.4\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197169/in-switch-hekate-622-et-nyx-164-disponibles-1.png"
        }
    },
    "news_15": {
        "title": "[Switch] SciresM recommande d'attendre sa version d'Atmosphere",
        "content": " \nLe développeur SciresM recommande d'attendre sa version d'Atmosphere, en effet, il ne recommande pas de compiler ou d'utiliser d'autres versions que la sienne car il affirme que cela nécessite des modifications de certains outils de build pour fonctionner correctement.\n \nIl parle notamment des cheats, des creports, et il y a eu un changement dans la façon dont fonctionnent les indicateurs de débogage, ses outils annexes seront eux aussi à modifier. \n \nSelon lui sa version taillée pour le firmware 19.0.0 est finalisée mais il y eu des changements très importants dans ce firmware, aussi Nintendo a réécrit la logique de la table des pages du kernel. Il informe qu'il va probablement y avoir une pré-version pendant quelques jours afin de tester au maximum ses changements. \n \n \n\n \n \nVoici comment il planifie la disponibilité d'Atmosphere : \n \n- Ma première version « Je pense que cela fonctionne » est disponible sur RS dès maintenant pour les personnes qui m'aident à tester.\n- Cette première version sera proposée demain sur GitHub, si tout se passe bien.\n- Pré-version à la fin du week-end, si rien n'est cassé entre temps. \n \nCela dit il affirme que tout semble correctement fonctionner pour le moment, il est prudent voilà tout et préfère que certains fassent des tests pour élargir toutes les possibilités de corrections avant de rendre disponible au plus grand nombre sa solution Atmosphere. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197070/in-switch-sciresm-recommande-dattendre-sa-version-datmosphere-1.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] Un clone du Mig Flash qui reprend le nom de R4",
        "content": "Un produit qui va diviser, une nouvelle proposition assez particulière dont nous avons beaucoup de mal à comprendre l'intérêt, d'une part il s'agit d'une copie pure et simple du Mig Flash, donc il n'y a clairement ici aucune nouveauté si ce n'est le sticker sur la cartouche qui pour l'occasion est devenue noire. \n \nMais surtout ce clone veut aussi surfer sur le nom historique et célèbre de l'emblématique linker R4 de la DS et 3DS. Le packaging est basé sur une boite de jeu de Switch et la boite est plutôt belle, bien que dépourvue de toute documentation. \n \n \n \n \n\n \n \n\n \n \n \nMais c'est sur le prix que la R4 Games surprend, sauf que c'est dans le mauvais sens, qui ira mettre 130 $ , et encore elle est en promo, car normalement elle serait proposée à 210 $. Une vidéo montre la bête en fonctionnement. \n \n \n\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197052/in-switch-un-clone-du-mig-flash-qui-reprend-le-nom-de-r4-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1197052/in-switch-un-clone-du-mig-flash-qui-reprend-le-nom-de-r4-2.png"
        }
    },
    "news_17": {
        "title": "[PS4/PS5] PKG Tool Box v1.2.0 disponible",
        "content": "Le développeur Seregonwar a proposé une mise à jour de son outil PKG Tool Box en version 1.2.0. \n \nIl a amélioré son outil en fonction des retours utilisateurs, les changements principaux portent sur des problèmes liés à l'extraction des informations des fichiers de trophées PS4, qui sont nommés en .TRP sur PS4, et il a ajouté le support des fichiers .UCP sur la PS5. \n \nLes nouveautés de cette version sont nombreuses, cela passe par un support partiel des PKG PS5, avec la possibilité de tester sans compromettre les fichier originaux, à noter que le reverse dump n'est pas encore opérationnel. \n \nLe développeur a aussi ajouté une fonction de force brute pour rechercher les mots de passer des fichiers PKG, là encore son efficacité reste à démontrer. \n \nDes informations sur les jeux PS5 ont été ajoutées, avec notamment la prise en charge du décryptage des fichiers eboot.bin, et de la vérification de l'authenticité des fichiers PKG. \n \nCertaines opérations de lecture hexadécimale ou encore d'extraction ont été améliorées, avec notamment une amélioration de l'extraction des fichiers du sce_sys.\n \n \n\n \n \n \nChangelog : \n \n- Correction de l'extraction des trophées : Correction du problème d'extraction des informations des packs de trophées .TRP (PS4) et ajout de la prise en charge des fichiers .UCP (PS5).\n \n- Prise en charge partielle des fichiers PS5 .pkg : Le reverse dump n'est pas encore opérationnel, mais vous pouvez le tester sans compromettre le fichier .pkg original.\n \n-Passcode bruteforce : Ajout d'une attaque par force brute pour la bibliothèque afin de rechercher les mots de passe des fichiers .pkg. Cette fonctionnalité a été ajoutée à la demande, mais son utilité n'est pas garantie.\n \n- Fonction d'injection non opérationnelle : La fonction d'injection n'est pas encore opérationnelle dans cette version. Je me suis concentré sur l'extraction des fichiers .TRP, et elle sera mieux développée dans la prochaine version.\n \n- Ajout d'informations sur les jeux PS5 : Ajout de la prise en charge du décryptage des fichiers eboot.bin sur PS5. Il peut maintenant vérifier si un fichier est un vrai ou un faux .pkg.\n \n- Amélioration du navigateur de fichiers : Dans la section du navigateur de fichiers, les trois opérations (extraction, lecteur de texte et lecteur hexadécimal) sont maintenant entièrement fonctionnelles. L'extraction de fichiers supplémentaires a été améliorée, y compris tous les fichiers du dossier sce_sys.\n \n \nTéléchargement : PKG Tool Box v1.2.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197028/in-ps4ps5-pkg-tool-box-v120-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] Atmosphere 1.8.0 Experimental pour le firmware 19.0.0",
        "content": "Une version expérimentale 1.8.0 d'Atmosphere vient d'être publiée, elle supporte le firmware 19.0.0, elle s'adresse avant tout à celles et ceux qui veulent donwgrade. \n \nComme vous le savez Nintendo a publié un firmware 19.0.0 qui a bloqué Atmosphere, et il faut attendre encore un peu pour que SciresM propose sa version officiellement, demain ou après demain.\n \n \n\n \n \nTéléchargement : Atmosphère 1.8.0 Experimental / fuse.bin\n \nMerci Linkynimes pour les liens \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196987/in-switch-atmosphere-180-experimental-ainsi-que-lockpick-pour-le-firmware-1900-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] Flat_Z en dit davantage sur l'Hyperviseur",
        "content": " \nLe développeur Flat_Z vient de confirmer qu'il existe plusieurs façons de vaincre l'Hyperviseur de la PS5. L'une des méthodes qu'il a trouvé était liée à APIC. \n \nSes pistes sont nombreuses, il explique que la structure APIC, pour Advanced Programmable Interrupt Controller, située dans le segment RW (de lecture) des données du kernel, peut être exploité via un accès en lecture/écriture.\n \n \n\n \n \nAinsi en réindexant un pointeur tel que xapic_mode il serait possible d'exécuter un chaine ROP, et donc du code arbitaire. Selon lui, après une boucle, le code injecté s'exécuterait avant le redémarrage de l'Hyperviseur, permettant ainsi de patcher le kernel. \n \nIl a apporté la précision que cette méthode n'est pas celle qui a été corrigée sur le firmware 5.00 de la PS5, même s'il reconnait ne pas avoir tester sur des firmwares plus récents, il est même possible qu'elle marche sur des firmwares au delà du 5.00.\n \n \n \nTout est là : Flat_Z\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196977/in-ps5-flat-z-en-dit-davantage-sur-lhyperviseur-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] Mise à jour urgente pour les utilisateurs du Mig Dumper",
        "content": "La team Mig Flash vient de poster un billet sur son site qui informe qu'une mise à jour urgente pour les utilisateurs du Mig Dumper sous Windows vient d'être publiée. \n \nLe firmware 1.1.6 apporte une mise à jour urgente du Mig Dumper pour les utilisateurs disposant de Windows 11 23H2 ou 24H2, ou supérieure, qui implémente une nouvelle vérification de collision de signature de disque. \n \n \n\n \nAvec les récentes mises à jour de Windows 11, le lecteur Mig Dumper n'apparaîtra plus à cause d'une collision de signature de disque, ce firmware 1.1.6 vient corriger ce problème, cependant les utilisateurs confrontés à ce problème ne peuvent pas mettre à jour le firmware car le lecteur n'apparait plus.\n \n \n\n \n \n \nPour résoudre ce problème, la team Mig Flash recommande quelques options :\n- Emprunter un ancien système Windows à un ami pour mettre à jour Mig Dumper vers le firmware 1.1.6\n- Télécharger un ISO Windows 10 et créer une clé USB Windows To Go avec Rufus, puis démarrer dans Windows To Go et effectuer la mise à jour du firmware \n- Télécharger un ISO Linux pour lancer un système Live Boot afin d'effectuer la mise à jour du firmware. \n \nSi vous utilisez toujours un ancien système Windows, nous vous recommandons d'installer le firmware pour éviter le problème ci-dessus à l'avenir.\n \nVous l'aurez compris il faut mettre à jour, surtout qu'à l'avenir ces signatures seront toujours présentes dans Windows. \n \n \nTéléchargement : Firmware 1.1.6\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196920/in-switch-mise-a-jour-urgente-pour-les-utilisateurs-du-mig-dumper-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1196920/in-switch-mise-a-jour-urgente-pour-les-utilisateurs-du-mig-dumper-1.jpg"
        }
    }
}