{
    "news_1": {
        "title": "[Switch] Mise à jour Switch en 20.0.0, SciresM nous prévient",
        "content": "Nintendo vient de mettre en ligne cette nuit la nouvelle version du firmware pour la Nintendo Switch, il s'agit de la v20.0.0 qui vient d'être déployée sur les serveurs de big N, et le développeur SciresM nous prévient, \" il s'agit d'une version majeure, donc Atmosphere est cassé et doit être mis à jour \". \n \nComme à chaque nouvelle branche de numérotation, Nintendo change pas mal de paramètres, et surtout des clés qui empêche le fonctionnement d'Atmosphere, mais qui ne va pas réellement le bloquer, d'ailleurs SciresM rajoute qu'il faut être juste patient. \n \n \n \n\n \n \n \nLe rapport Yellow's 8 se trouve ici\n \n \n \nLe changelog est présent : \n \nLes icônes suivantes pour les nouvelles fonctionnalités ont été ajoutées au menu HOME :\n \nCarte de jeu virtuelle.\n \nLes logiciels numériques Nintendo Switch achetés, les DLC et certains logiciels gratuits sont désormais des cartes de jeu virtuelles et affichés dans une liste dans ce menu.\nVous pouvez charger et éjecter virtuellement des cartes de jeu virtuelles entre deux consoles Nintendo Switch maximum.\nLes cartes de jeu virtuelles peuvent être prêtées à d'autres personnes du même groupe familial de compte Nintendo. Pour plus d'informations, consultez le guide des cartes de jeu virtuelles. Les logiciels compatibles\n \n \nGameShare\n \npeuvent être partagés d'une console Nintendo Switch 2 vers d'autres consoles à proximité pour jouer ensemble.\n \nVous ne pouvez jouer ensemble que via une connexion sans fil locale, et la console Nintendo Switch 2 doit lancer GameShare.\nCette fonctionnalité ne peut pas être utilisée entre deux consoles Nintendo Switch, Nintendo Switch - Modèle OLED et/ou Nintendo Switch Lite.\n \n \nDes paramètres de vérification de l'utilisateur ont été ajoutés sous Utilisateur > Paramètres utilisateur.\n \nVous pouvez restreindre l'accès au menu Carte de jeu virtuelle en exigeant la saisie d'un code PIN ou en vous connectant à votre compte Nintendo.\n \n \nDes paramètres de licence en ligne ont été ajoutés.\n \nLorsque la console est activée, vous pouvez jouer aux logiciels téléchargés ou aux DLC que vous avez achetés lorsque la console est connectée à Internet, même si la carte de jeu virtuelle n'est pas chargée.\nPour plus d'informations, veuillez consulter les détails de cette option dans les Paramètres de la console.\n \n \nLes couleurs des icônes du Nintendo eShop et des Actualités Nintendo Switch dans le menu HOME ont été modifiées.\nVous pouvez sélectionner et transférer simultanément plusieurs données de sauvegarde dans le menu « Transférer vos données de sauvegarde ».\nLe transfert de la console vers la Nintendo Switch 2 a été ajouté dans Paramètres de la console > Console.\n \nVous pouvez effectuer un transfert de la console de votre Nintendo Switch vers la Nintendo Switch 2 via la communication locale.\n \nPour les utilisateurs qui perdront l'accès à leur Nintendo Switch avant de recevoir leur Nintendo Switch 2, il existe une option pour télécharger les données de transfert du système sur un serveur dédié qui peuvent ensuite être récupérées sur leur Nintendo Switch 2. Après avoir téléchargé vos données de transfert du système sur le serveur dédié, la console Nintendo Switch sera initialisée aux paramètres d'usine, donc n'effectuez ce transfert que si vous pouvez terminer le transfert sur Nintendo Switch 2.\nSi vous souhaitez continuer à utiliser votre Nintendo Switch jusqu'à ce que vous ayez une Nintendo Switch 2, nous vous recommandons d'effectuer le transfert du système en utilisant la communication locale après avoir acquis une console Nintendo Switch 2.\n \n \nUne connexion Internet et un compte Nintendo sont nécessaires pour effectuer le service de transfert de système local et basé sur le serveur.\nPour plus d'informations, consultez la section « Transfert de console de Nintendo Switch vers Nintendo Switch 2 ».\n \n \nL'apparence de certaines icônes utilisateur a été mise à jour.\n \nPour plus d'informations sur la Nintendo Switch 2, consultez le site web de Nintendo.\nNotez que l'utilisation de « Console principale » a été abandonnée avec le passage aux cartes de jeu virtuelles, et que « Console compatible avec le Pass » sera désormais utilisée. Sur une console configurée comme « Console compatible avec le Pass » pour un utilisateur, tous les utilisateurs de la console peuvent accéder à certains abonnements ou passes pour certains logiciels. Pour plus d'informations, consultez la section « Comment configurer ou modifier la console compatible avec le Pass pour un compte Nintendo ».\n \n \n \nVous l'aurez compris, il convient d'attendre si vous le pouvez avant de mettre à jour ou d'utiliser des versions alternatives d'Atmosphere. \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206004/in-switch-mise-a-jour-switch-en-2000-sciresm-nous-previent-1.png"
        }
    },
    "news_2": {
        "title": "[Multi] RetroArch v1.21.0 disponible",
        "content": " \nL'équipe LibRetro vient de mettre en ligne une nouvelle version de leur émulateur multi-plateforme RetroArch qui est désormais proposé en version 1.21.0 depuis quelques heures directement sur leur serveur. Le site internet officiel n'est pas encore à jour, mais il est possible de télécharger cette nouvelle version stable directement sur leur site ici pour chacune des plates-formes concernées. La toute dernière version qui avait été livrée était la 1.20.0 le 03 janvier 2025.\n \n \n\n \n \nAvec cette nouvelle version, de nombreuses corrections ont été apportées, sur la 3DS, TLS (HTTPS) a été activé et un blocage de l'interface utilisateur a été corrigé lorsque le rendu threadé est actif. Les plantages lors du chargement du contenu appartiennent également au passé. Sur Lakka, MacOS, Windows, ou encore la Wii et Wii U là aussi de nombreuses corrections ont été apportées. \n \n \n\n \n \nChangelog 1.21.0 :\n \n- 3DS: Fix unique IDs for newer cores\n- 3DS: Enable TLS (SSL)\n- 3DS: Fix UI freeze when threaded rendering is enabled\n- 3DS: Fix crash on load content\n- 3DS: Other minor fixes\n- APPLE: Enable Vulkan emulated mailbox\n- APPLE: Include b2 core in App Store builds\n- APPLE: CoreMIDI driver for IOS/MacOS\n- APPLE: CoreLocation driver for IOS/MacOS\n- AUTOCONF: Enable alternative display name in autoconfig files\n- AUTOCONF: Make autoconfig failure messages optional\n- AUDIO: Option to mute on rewind\n- AUDIO/PIPEWIRE: Fix app launch when pipewire service is stopped\n- AUDIO/PIPEWIRE: Fix speedup with threaded video mode\n- AUDIO/PIPEWIRE: Fix latency setting and microphone handling\n- AUDIO/PIPEWIRE: Pass the new rate to the audio driver\n- CAMERA: Add PipeWire camera driver\n- CAMERA: Add ffmpeg camera driver\n- CHEAT: Rewrite part of cheat_manager_load_cb_second_pass()\n- CHEEVOS: Include achievement state in netplay states\n- CHEEVOS: Fix crash when entering achievements in quick menu while client is not present\n- CHEEVOS: Restore cheevos_badges_enable for HAVE_GFX_WIDGETS builds\n- CLI: Allow --entryslot to fall back to normal states\n- CLOUDSYNC: Fix Windows path issues\n- CLOUDSYNC: Workaround for duplicated requests bug\n- CLOUDSYNC: Workaround for 301 redirects\n- CLOUDSYNC: Handle ignored directories properly\n- EMSCRIPTEN: Added new AudioWorklet driver, a fast callback-based audio driver\n- EMSCRIPTEN: Scale window to correct size\n- EMSCRIPTEN: Additional platform functions\n- EMSCRIPTEN: Add new default video context driver: emscriptenwebgl_ctx\n- EMSCRIPTEN: Add new audio driver: AudioWorklet\n- EMSCRIPTEN: Add new modernized web player which will eventually replace the existing one\n- EMSCRIPTEN/RWEBINPUT: Add touch input support\n- GAMECUBE: Fixes\n- GENERAL: Fix save state auto increment\n- GENERAL: Fix softpatching with periods/dots in the file name\n- GENERAL: Fix compilation with --enable-videocore\n- GENERAL: Allow asset directory redefinition and other directory overrides via environment variables\n- GENERAL: Allow override of player 1/2 input with machine learning models (needs recompilation and external library)\n- GENERAL: Fix performance counter option not remembered between sessions\n- GENERAL: Create security statement\n- GENERAL: Fix crash when core is not selected\n- GENERAL: Use core fps instead of screen refresh for calculating dropped frames\n- INPUT: Fix a crash when initializing illuminance sensor on Linux\n- INPUT: Analog-to-digital refactor, fixing behavior when analogs are assigned to keys\n- INPUT: Turbo fire overhaul. See #17633\n- INPUT/ANDROID: Fix game focus and pause handling\n- INPUT/COCOA: Include gravity in acceleration sensor values\n- INPUT/COCOA: Fix relative mouse input\n- INPUT/COCOA: Allow mouse input while mouse overlay is active\n- INPUT/WINRAW: Invert mouse index order\n- IOS: Ensure webserver notice can be dismissed\n- IOS: Fix rescanning manual playlists after app update\n- IOS: Fix clean playlist function\n- IOS: Fix crash when scanning\n- IOS: Fix jump back to selected item when closing content\n- IOS: Fix shared GL context setup\n- IOS: Update Launch Screen\n- IOS: Screen orientation lock through display server\n- IOS: Fix rescanning manual playlists after app update\n- LAKKA: Remove bluetooth device after disconnection\n- LINUX/X11: Extend X11 input driver with XInput2 extensions for multi-mouse\n- MACOS: Fix some sandbox handling in App Store builds\n- MACOS: Reset keyboard state when focus is lost\n- MENU: Add SSL support to the information list\n- MENU: Add warning to BFI and related menu items\n- MENU: Fix latency statistics when using runahead\n- MENU: Fix opening file inside archive with core selection\n- MENU: Main menu unified between different menu drivers\n- MENU: Visibility toggle for playlist tabs\n- MENU: Color the notification icon by message category\n- MENU: Gray Dark+Light theme adjustments\n- MENU/GLUI: Menu back button switches tabs like in other menu drivers\n- MENU/GLUI: Tab selection option is honored\n- MENU/GLUI: Fix CD icon appearing when no icon is specified\n- MENU/GLUI: Allow fullscreen thumbnail browsing\n- MENU/GLUI: Save state thumbnails\n- MENU/PLAYLISTS: Random selection/shuffle function\n- MENU/QT: Fix desktop menu crash with Cheevos disabled\n- MENU/RGUI: Cleanups of certain menu items\n- MENU/RGUI: Thumbnail fixes\n- MENU/OZONE: Fix messagebox background\n- MENU/XMB: Fix Light theme, font shadow\n- MENU/XMB: Appearance menu cleanup\n- MENU/XMB: Icon thumbnail can be any of the existing types\n- MISC: Guard nanosleep prototype behind _POSIX_TIMERS\n- MISC: Use fabsf and intended threshold for refresh rate check\n- MISC: Use platform-specific checks for invalid descriptors\n- MIDI: Add dropdown items for midi device selection\n- NETWORK: Refactor of net_http, improvements for task blocking and performance\n- NETWORK: Follow http redirects in net_http\n- NETWORK: Expire failed DNS lookups much faster\n- NETWORK: Fix netplay when using netpacket interface with recent cheevos\n- NETWORK/HTTP: Fix crash in net_http_resolve() in single-thread mode\n- OVERLAY: Fix overlay lightgun, mouse & pointer\n- OVERLAY: Preferred overlay loading is now default only on mobile platforms\n- OVERLAY: Improve analog recentering when touching the area just outside the recentering zone\n- QT: Enable non-png thumbnails also for Qt interface\n- REPLAY: Fix issue when replaying old format input recordings in newer RetroArch\n- TTS: Fix initial text-to-speech on Windows\n- TVOS: Fix 720p display\n- TVOS: Fix refresh rate fetching on tvOS 13/14\n- TVOS: Update Top Shelf art\n- SAVESTATES: Reset state index when loading new content\n- UWP: Fix slang shader compilation\n- VIDEO: Enable BFI setting for mobile platforms (mind the warnings)\n- VIDEO/OpenGLES: Fix FP/sRGB FBO support\n- VIDEO/SHADERS: Allow exact refresh rate sync with shader subframes\n- VIDEO/SHADERS: FIX shader wildcards\n- VIDEO/VULKAN: Enable adaptive vsync\n- VIDEO/V4L2: Added resolution picker/forcing.\n- VIDEO/V4L2: Rewrote logic for finding ALSA audio devices in enumerate_audio_devices function\n- VIDEO/V4L2: Added a skip for some of the interface queries that fail and aren't required for magewell usb.\n- VITA: Fixes\n- WINDOWS: Win32 socket improvements\n- WII: Fixes\n- WIIU: Fixes\n- WEBPLAYER: Update core list for 1.20.0\n \n\n \n\n \nTéléchargement : RetroArch v1.21.0 (changelog) et les liens de téléchargement ici\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205972/in-multi-retroarch-v1210-disponible-1.png"
        }
    },
    "news_3": {
        "title": "[Multi] Apollo CLI Tools v1.3.0 disponible",
        "content": "Le développeur Bucanero propose une nouvelle version de son outil appelé Apollo CLI Tools, comme vous le savez Bucanero est à l'origine d'Apollo Save Tool sur PS3, PS4 et Vita, mais là c'est un peu particulier puisque CLI Tools est multiplateforme. \n \nApollo CLI Tools permet d'appliquer l'assistant de sauvegarde et les codes de patch BSD à un fichier de données. La bibliothèque et les outils de ligne de commande implémentent un moteur de sauvegarde de données qui prend en charge les codes Save Wizard/Game Genie et les scripts Bruteforce Save Data.\n \nL'arrivée de nouveautés est très rare pour Apollo CLI Tools, l'objectif est de corriger des bugs et d'ajouter un nouveau support de paramètres. Cette version 1.3.0 n'échappe pas à cette règle, elle a pour ambition de rajouter le support des hash djb2, d'améliorer le support de sélection des fichiers .savepatch, et d'ajouter le support de SaveWizard et d'options multiples sur les codes BSD. \n \n \n\n \n \n \nChangelog 1.3.0 : \n \n- Ajout d'une fonction de hash djb2\n- Ajout la prise en charge des balises pour les options sélectionnées par l'utilisateur sur .savepatchles fichiers\nPar exemple,{ZZ}val=name;03E7=999 gold;...;270F=9999 gold{/ZZ}\n- Prise en charge de SaveWizard et des codes BSD avec plusieurs options\n \n \nTéléchargement : Apollo CLI tools v1.3.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205969/in-multi-apollo-cli-tools-v130-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] Itemzflow (PS5) a été mis à jour en v1.10",
        "content": "Le développeur LightningMods a également mis à jour son manager Itemzflow qui est maintenant proposé en v1.10. Là aussi il a mis à jour le plugins afin d'ajouter le support pour les firmwares 7.xx. \n \nIl a aussi intégré les dernières optimisations afin de charger kstuff en moins de 10 secondes là où auparavant il fallait parfois jusqu'à 2 minutes. \n \n \n\n \n \nChangelog : \n \n- ajout de plugins mis à jour pour 7.xx \n- amélioration de la vitesse d'injection de la toolbox avec kstuff de 2 minutes à 10 secondes.\n- Si vous ne pouvez pas ouvrir cette version, assurez-vous de supprimer l'ancien PKG, puis d'installer cette version, ne pas l'écraser.\n \nTéléchargement : Itemzflow (PS5) 1.10\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205965/in-ps5-itemzflow-ps5-a-ete-mis-a-jour-en-v110-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS5] etaHEN 2.1 disponible",
        "content": "Le développeur LightningMods dévoile avec le plus grand plaisir sa nouvelle version officielle et finale d'etaHEN qui est désormais proposée en v2.1. La grosse nouveauté de cette version est le support de kstuff et d'etaHEN pour les firmwares 7.xx. \n \nMais les nouveautés sont très nombreuses, au delà de ce \"simple\" support. \n \n \n\n \n \n\n \n \nChangelog 2.1 : \n \n- Ajout de la possibilité de mettre en pause/reprendre kstuff dans la toolbox (section Utilitaires)\n- Mise à jour de kstuff et etaHEN pour la prise en charge des firmwares 7.xx\n- Stabilité améliorée lors du chargement automatique de la boîte à outils (nouvelle méthode de chargement, devrait être 20 fois plus stable) nécessite kstuff, l'ancienne méthode sera utilisée comme solution de secours lorsque kstuff ou byepervisor n'est pas disponible\n- Ajout d'erreurs plus approfondies à DPIv2 par @cragson\n- Correction de kstuff modifiant inutilement les identifiants cibles *kit (obligeant les devkits à passer par défaut en mode de publication)\n- Ajout de l'adresse IP DBG0 au panneau du menu d'accueil pour les devkits\n- Correction du démarrage automatique de klog même lorsqu'il est désactivé via la boîte à outils/config\n- Correction de /data dans les sandbox pour les pare-feu qui avaient des problèmes avec cette option\nsuppression de la création de fichiers inutiles lors du démarrage d'etaHEN (devrait légèrement accélérer les temps de démarrage)\n- Ajout d'une option pour recharger le cache des codes de triche et ajouter automatiquement de nouveaux codes de triche aux fichiers de cache\n- Mise à jour de PS5Debug par GHEN et réactivation de PS5Debug pour 5.xx\n- Ajout d'une vérification pour voir si une opération telle que le téléchargement du Store/Cheats ou le rechargement du cache des cheats est déjà en cours avant de démarrer une nouvelle opération\n- Ajout d'une option pour charger etaHEN sans kstuff (UTILISATEURS AVANCÉS UNIQUEMENT) c'est-à-dire des cheats ou des plugins (un fichier nommé \"no_kstuff\" sur la racine USB ou /data/etaHEN/ désactivera le chargement de kstuff)\n- Ajout des patchs du programme PKG Installer pour 2.xx et 3.xx-4.xx\n \n \nTéléchargement : etaHEN 2.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205964/in-ps5-etahen-21-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205964/in-ps5-etahen-21-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[Switch] Sphaira 0.8.1 disponible",
        "content": "Assez actif en ce moment, ITotalJustice vient de mettre en ligne la version 0.8.0 de Sphaira, sa solution de remplacement du hbmenu intégrant des fonctionnalités inédites dont nous vous avons déjà parlé. \n \nMalgré que cette nouvelle version arrive une petite dizaine de jours après la version 0.7.0, elle n'est pas avare en nouveautés avec des évolutions très intéressantes. \n \n \n\n \n\n \n \nChangelog 0.8.0 : \n \n- Ajout de la prise en charge des installations de flux.\n- Ajout du menu d'installation ftp.\n- Ajout du menu d'installation de GameCard.\n- Correction de l'autorisation de capture d'écran qui n'est pas définie en mode applet (vous pouvez désormais prendre des captures d'écran en mode applet).\n- Ajout de la vitesse de transfert et le temps restant à la barre de progression.\n- Ajout du support de transfert pour Mame et Neogeo.\n \nEdit 30.04.25\n \nTéléchargement : Sphaira 0.8.1\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205939/in-switch-sphaira-080-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205939/in-switch-sphaira-080-disponible-2.jpg"
        }
    },
    "news_7": {
        "title": "[PS5] AirPSX 0.13 disponible",
        "content": "AirPSX est un payload PS5 qui permet la gestion à distance d'une PlayStation 5 jailbreakée via un environnement de bureau Web similaire à AirDroid.\n \nDans cette version 0.13 le développeur a voulu rajouter une fonction importante, l'installation de package, mais cela reste instable, via PKG Installer. \n \nPour rappel, AirPSX est une projet similaire à AirDroid, mais adapté pour la PS5 via une interface web, offrant des fonctionnalités comme la gestion des fichiers, l’exécution de scripts, et bien plus encore.\n \nLe développeur précise qu’il n’est pas responsable des dommages causés à la console ou de l’utilisation abusive de l’outil. AirPSX est construit avec le framework web hxwell, le code source est écrit en Haxe, qui est transpilé en C++ et compilé à l’aide du PS5 Payload SDK.\n \n \n\n \n \nChangelog 0.13 : \n \n- Le programme d'installation du package a été ajouté.\n- Cette fonctionnalité est expérimentale, signalez tout bug trouvé.\n \n\n \n \nTéléchargement : AirPSX 0.13\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205938/in-ps5-airpsx-013-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205938/in-ps5-airpsx-013-disponible-2.png"
        }
    },
    "news_8": {
        "title": "[Wii] La Homebrew Channel archivée par FailOverflow (vol de code)",
        "content": "L'équipe Fail0verflow vient d'archiver officiellement la Homebrew Channel, tout du moins son code source, l'un des projets les plus importants jamais créé vient en effet d'être mis au placard, explications. \n \nLa décision d'archiver la Homebrew Channel est la suite de difficultées rencontrées avec libogc, la principale bibliothèque de développement de la Nintendo Wii qui a été volé à la fois à Nintendo et à RTEMS en charge du développement open source de l'OS. \n \nDe nombreuses composantes de libogc étaient composé de code original du SDK de Nintendo, ainsi au fil du temps FailOverflow avait signalé le vol du code, comme l'implémentation du threading qui avait été volé à RTEMS.\n \nCet archivage marque clairement une partie de l'histoire du jeu vidéo vu son importance, « La communauté des homebrews Wii s'est construite sur un tas de mensonges et de violations de droits d'auteur. »\n \nTout est dans le readme ici.\n \n \n\n \n \n \nComme la plupart des logiciels Wii homebrew, ce logiciel dépend de libogc . Après le début du développement de The Homebrew Channel, nous avons découvert que de larges portions de libogc avaient été volées directement depuis le SDK Nintendo ou des jeux utilisant ce dernier (décompilés et nettoyés). Nous pensions qu'au moins des parties importantes de libogc, comme son implémentation des threads, étaient originales, et avons continué à utiliser le projet à contrecœur, tout en nous en distanciant.\n \nIl a récemment été révélé que l'implémentation threading/OS de libogc a en réalité été volée à RTEMS . Les auteurs de libogc n'ont pas seulement volé du code propriétaire de Nintendo, mais ont également jugé opportun de voler un RTOS open source et d'en supprimer toute mention d'attribution et de copyright. Cela va bien au-delà de l'ignorance des implications de la rétro-ingénierie des binaires Nintendo en matière de copyright, et relève directement du vol de code délibéré et malveillant et de la violation du copyright.\n \nLes développeurs actuels de libogc ne souhaitent pas suivre ce problème, ni trouver une solution, ni informer la communauté du statut problématique du projet en matière de droits d'auteur. Lorsque nous avons signalé un problème à ce sujet, ils l'ont immédiatement clôturé, ont réagi par des insultes, puis l'ont complètement supprimé du site.\n \nPour cette raison, nous considérons qu'il est impossible de compiler légalement et légitimement ce logiciel à ce stade, et ne pouvons encourager aucun développement ultérieur.\n \nLa communauté des homebrews Wii s'est construite sur un tas de mensonges et de violations de droits d'auteur, et tout cela grâce à Shagkur (le responsable du vol) et au reste de l'équipe (qui a permis le vol et n'a rien fait une fois découvert). Ensemble, les développeurs ont trompé tout le monde en leur faisant croire que leur travail était original.\n \nVeuillez exiger que les dirigeants et les principaux contributeurs aux SDK et boîtes à outils de console ou d'autres appareils propriétaires que vous utilisez et avec lesquels vous travaillez fassent les choses légalement et ne tolèrent pas ce genre de comportement.\n \nSi vous souhaitez vérifier par vous-même, vous pouvez par exemple comparer cette fonction de libogc à celle d'une ancienne version de RTEMS. Bien que le code ait été simplifié et que de nombreux identifiants aient été renommés, il est clair que la version libogc est une descendante directe de la version RTEMS. Il est impossible que deux implémentations de code soient aussi similaires par pur hasard.\n \n \nPour le moment, il faut reconstruire une confiance, qui à première vue, n'a jamais réellement existé.\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205937/in-wii-la-homebrew-channel-archivee-par-failoverflow-vol-de-code-1.png"
        }
    },
    "news_9": {
        "title": "[PS5] etaHEN 2.1B preview s'invite un peu partout",
        "content": "Le développeur LightningMods, même n'a pas réellement lancé la version finale d'etaHEN 2.1B, a donné les binaires à Zecoxao, de fait il est possible d'intégrer la version preview dans la plupart des outils mis à la disposition des utilisateurs PS5.\n \nLe développeur a dévoilé que dans etaHEN 2.1B l'option de mettre en pause et de reprendre kstuff à tout moment a été intégrée, ainsi dans une petite vidéo, il montre cette fonctionnalité en action avec un test de performance dans itemzflow montrant l'énorme différence entre la pause et la reprise.\n \n \n\n \n \nUne nouvelle méthode de chargement de la toolbox sera ajoutée à etaHEN 2.1B, cette méthode devrait être 20 fois plus stable que la méthode actuelle et ne prendra que 10 secondes pour rajouter la toolbox AVEC kstuff actif, au lieu de 2 minutes. Voici un aperçu sur 4.03. \n \n \n\n \n \nLa dernière version d'etaHEN est désormais hébergée par Zecoxao sur idlesauce, idlesaucedev, luasauce et ps5jb. Tous ces hôtes s'afficheront comme 2.0b, mais c'est en fait 2.1b qui est hébergé suite à une petite paresse de sa part.  \n \nhttp://zecoxao.github.io/idlesauce\n \nhttp://zecoxao.github.io/luasauce\n \nhttp://zecoxao.github.io/luasaucedev\n \nhttp://zecoxao.github.io/ps5jb\n \n \nAldostools quand à lui à mis à jour PS5 Payloads MOD en intégrant là aussi etaHEN 2.1B dans sa version preview. \n \n \n\n \n \n \nTéléchargement : PS5 Payloads MOD (1.8a) \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1355009220.png"
        }
    },
    "news_10": {
        "title": "[Multi] PS Multi Tools v15.3 intègre l'outil de markus95",
        "content": " \nLe développeur SvenGDK avait annoncé il y a quelques jours l'arrivée imminente d'une nouvelle version de PS Multi Tools avec pas mal de nouveautés. \n \nLa nouvelle mise à jour de PS Multi Tools qui est désormais disponible ajoute l'utilitaire Auto_backport de notre ami sunriseur Markus00095.\n \n \n\n \n \nAutre évolution l'outil MakefakeSELFs pour PS5 ne nécessite toujours pas Python. Des téléchargements pour PS5 ont également été ajoutés et mis à jour. Les backups 6.00 et suivant pourraient ne pas fonctionner et nécessiter un correctif supplémentaire.\n \nComme nous pouvons le voir dans le changelog, cette nouvelle version 15.3 s'adresse essentiellement à la PS5. \n \n \n\n \n \n \nChangelog 15.3 (PS5)\n \nTéléchargements mis à jour : \n \n- Suppression de l'ancien téléchargement de kstuff\n- Mise à jour de kstuff par sleirsgoevy et EchoStretch vers la version 1.4 (pour 3.XX - 7.XX)\n- Mise à jour de SHSrv par john-tornblom v0.14 -> v0.15\n- Charge utile kstuff-toggle ajoutée par EchoStretch\n \nMise à jour de l'outil MakefSELFs :\n \n- Ajout de l'utilitaire Auto_backport de @Markus00095\n- Vérifie désormais les fichiers de sauvegarde et définit la version de base du SDK en fonction de param.json pour la nouvelle option de correctif\n- Nouvelle option permettant de corriger la version de base du SDK vers une version cible du SDK avant de signer de faux fichiers\n- Lorsque l'option de correctif est cochée, il vous sera demandé de restaurer les fichiers d'origine à partir des fichiers .esbak avant de continuer (s'ils existent - ou précédemment corrigés)\n- Créer une sauvegarde des fichiers originaux avant l'application du correctif (conserve 3 versions [originale, corrigée, faussement signée] de la sauvegarde)\n \nPackages mis à jour : \n \n- AvalonEdit v6.3.0.90 -> v6.3.1.120\n- Microsoft.Data.Sqlite.Core v9.0.3 -> v9.0.4\n- Microsoft.Web.WebView2 v1.0.3124.44 -> v1.0.3179.45\n- WinSCP v6.3.7 -> v6.5.0\n \n \nTéléchargement : PS Multi Tools v15.3\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205830/in-multi-ps-multi-tools-v153-integre-loutil-de-markus95-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205830/in-multi-ps-multi-tools-v153-integre-loutil-de-markus95-1.png"
        }
    },
    "news_11": {
        "title": "[PS4] Les firmwares 11.02, 11.50 et 11.52 désormais hackés sur PS4",
        "content": "Et on continue dans la joie et la bonne humeur, voilà que la scène PlayStation va être ravie d'apprendre que le développeur Echo Strech vient de mettre en ligne les versions HEN au travers de PS4-HEN-VTX pour les firmwares 11.02, 11.50 et 11.52. \n \nIl a dévoilé une première version 1.0336 en disant qu'il s'agissait d'une mouture peut être un peu anticipée, il a d'ailleurs rapidement publiée la 1.0337 car il avait oublié un sous-module. \n \n \n\n \n \nLes payloads commencent désormais à être déployés, le premier proposé se destine au firmware 11.52, mais les autres vont suivre ce n'est qu'une question d'offsets désormais. \n \nNous pouvons donc désormais considéré que la PS4 est libérée jusqu'au firmware 11.52. \n \n \n \nTéléchargement : HEN-1.0337  /  PS4-Payloads-1.019\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205829/in-ps4-les-firmwares-1102-1150-et-1152-desormais-hackes-sur-ps4-1.jpg"
        }
    },
    "news_12": {
        "title": "[Switch 2] Le travail de documentation sur la Switch 2 commence",
        "content": "La Nintendo Switch 2 commence à intéresser pas mal de monde, les premiers pas d'un travail de documentation ont commencé, et il semblerait que Nintendo commence à annoncer des ruptures, au Japon elle s'est déjà vendu à plus de 2.2 millions d'exemplaires, imposant désormais la mise en place d'un tirage au sort. \n \nUn utilisateur de X, Kurnalsalts, vient de publier quelques images, en assez mauvaise qualité il faut bien le reconnaitre, du PCB de la nouvelle console de Nintendo. \n \n \n\n \n \nLe premier des éléments qui surprend est la taille du SoC ARM T239, qui porte la référence GMLX30-A1, il mesure 214.5 mm2, il faut dire que Nintendo a fait appel à nVidia pour ce SoC et que celui-ci utilise l'une des usines de Samsung en 8 nm, une processus de fabrication utilisé il y a 5 ans pour produire les GeForce RTX de la série 3000. \n \n \n\n \n \nComme l'avait annoncé les leaks des spécifications, nous sommes donc bel et bien en présence d'un SoC nVidia T239 gravé sur une architecture Ampère. Niveau architecture, nous sommes sur une technologie éprouvée, par contre si l'on compare à la Switch de première génération, c'est une puce assez différente, le T239 était une version allégée du T234, une puce lancée au premier trimestre 2022 pour la robotique et les systèmes embarqués de certains véhicules. \n \nAinsi le T239 s'appuie sur 8 cores ARM Cortex-A78c avec 1536 Cuda Cores, là où le X1 avait 4 Cortex-A57 + 4 Cortex-A53 avec 256 Cuda Cores. La RAM passe de 4 Go LPDDR4 à 12 Go LPDDR5X permettant une bande passante jusqu'à 102,4 Go/s en mode dockée, enfin le stockage est confié à SK Hynix avec 256 Go de UFS3.1, exit donc la mémoire eMMC. \n \n \n\n \n \nOn le voit, Nintendo a joué la prudence avec la Switch 2, en assemblant du matériel éprouvé et fiable, avec des marques et des technologies qui sont implantées depuis des années, la fiabilité avant tout, si l'on exclut le joy-con drift. \n \nPour information, le leaker informe qu'il publiera avec l'autorisation de sa source une vidéo dans 4 jours. \n \n\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205770/in-switch-2-le-travail-de-documentation-sur-la-switch-2-commence-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205770/in-switch-2-le-travail-de-documentation-sur-la-switch-2-commence-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1205770/in-switch-2-le-travail-de-documentation-sur-la-switch-2-commence-1.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1205770/in-switch-2-le-travail-de-documentation-sur-la-switch-2-commence-3.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-1610537687.jpg"
        }
    },
    "news_13": {
        "title": "[PS5] Sony dévoile son nouveau firmware pour la PS5",
        "content": "Sony, avec Shuzo Kikuchi, Vice-président de la gestion des produits, Sony Interactive Entertainment vient d'annoncer la mise en ligne d'un nouveau firmware pour la PS5 et son déploiement à partir de demain de façon progressive. La nouvelle mise à jour du logiciel système PS5 propose une mise au point audio et le retour des personnalisations classiques de l'interface utilisateur de la console.\n \n \n\n \n \nAvec ce firmware, Sony montre que les développeurs continuent de proposer de la nouveauté, avec notamment la fonction Audio Focus qui améliore l'immersion grâce à des préréglages amplifiant les sons faibles selon vos préférences auditives, garantissant une expérience audio plus claire avec un casque ou un micro-casque. Cette fonctionnalité favorise une plus grande accessibilité aux expériences audio.\n \n \n\n \n \nAvec cette nouvelle option, lorsqu'elle est activée, vous pouvez choisir parmi une gamme d'options prédéfinies qui facilitent la distinction des sons tels que les dialogues des personnages du jeu, les effets sonores subtils tels que les pas et le bruissement de l'herbe, ainsi que les voix dans les discussions de groupe pour une expérience de jeu plus immersive.\n \n \n\n \n\n \n \nAvec cette mise à jour, Sony propose aussi le retour des designs de consoles classiques pour l'interface utilisateur de la PS5, avec des personnalisations  PlayStation, PlayStation 2, PlayStation 3 et PlayStation 4 que nous avions découvert lors du 30e anniversaire.\n \nTout cela sera proposé à partir de demain, dommage que l'intro PS1 ne soit pas de la partie. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205750/in-ps5-sony-devoile-son-nouveau-firmware-pour-la-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205750/in-ps5-sony-devoile-son-nouveau-firmware-pour-la-ps5-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1205750/in-ps5-sony-devoile-son-nouveau-firmware-pour-la-ps5-3.png"
        }
    },
    "news_14": {
        "title": "[PS4] shadps4 v0.8.0 disponible",
        "content": " \nAprès une version 0.7.0 qui a été largement optimisée durant un gros mois avec de nombreuses mise à jour et corrections, le développeur George Moralis propose la version 0.8.0 de shadps4 le célèbre émulateur PS4 qui tire clairement le meilleur de la console. Ils sont très nombreux, les émulateurs PS4, mais aucun n'arrive à la cheville de shadPS4, tout simplement. \n \nUne nouvelle version qui a coup sûr marquera l'histoire de l'émulation de la console de Sony, elle est dédiée à l'un de nos derniers développeurs Uber, « Stephen ». De nombreux correctifs et fonctionnalités ont été ajoutés à cette version. \n \n \n\n \n \nChangelog : \n \nCore : \n- lseek : laisser le système d'exploitation hôte définir des erreurs lseek -\n- Nettoyage du code du système de fichiers\n- Émuler le mappage sceKernelInternalMemory\n- Correction de sceKernelAllocateDirectMemory et sceKernelAvailableDirectMemorySize\n \nBibliothèques :\n- sceDiscMap est maintenant HLE.\n- Travail initial ngs2 HLE.\n- Implémentation du passthrough libusb\n- Stubs ulobjmgr appropriés\n- Implémentation initiale d'Audio3d\n- Stub de bibliothèque NpAuth\n \nGPU :\n- Réinitialiser l'étiquette de tampon précédente au lieu de l'étiquette actuelle\n- Gérer les paquets de calcul qui sont divisés entre les extrémités de deux tampons de commande\n- Implémenter DmaDataSrc::MemoryUsingL2 et DmaDataDst::MemoryUsingL2\n- renderer_vulkan : utiliser un état dynamique de pochoir de profondeur plus important.\n- renderer_vulkan : mettre à jour l'état dynamique uniquement lorsqu'il est modifié.\n- renderer_vulkan : rendre certains états primitifs dynamiques.\n- Implémenter sceVideoOutGetEventCount et sceVideoOutDeleteVblankEvent\n- vk_rasterizer : contrôler l'accès aux plages mappées avec un verrou partagé.\n- renderer_vulkan : améliorer la gestion des extensions obligatoires et facultatives.\n- vk_rasterizer : améliorer les calculs de profondeur de la fenêtre d'affichage.\n- texture_cache : assouplir le type d'image incompatible de l'assertion à l'échec de cache.\n- renderer_vulkan : prendre en charge le chargement des couches Vulkan sur la version SDL de macOS.\n \nRecompilateur de shaders :\n- Amélioration de la gestion des divergences et l'élimination des voies de lecture\n- Ajout  S_SETPRIO à EmitFlowControl\n- Utilise  VK_AMD_shader_trinary_minmax lorsqu'il est disponible\n- resource_tracking_pass : ajouter une heuristique pour détecter les tampons pointus mal suivis\n- Implémentation S_FLBIT_I32_B32 et V_MUL_HI_I32\n- Implémentation l'instruction S_SUBB_U32\n- Remplir les variantes IMAGE_GATHER4_* dans le tableau\n- Implémentation de DS_SUB_U32, DS_INC_U32, DS_DEC_U32.\n- Implémentation de l'instruction SET_PC_B64\n \nInterface graphique :\n- Ajout d'une option pour activer/désactiver les dossiers de jeu individuellement\n- Gérer \"-patch\" comme suffixe pour les dossiers de mise à jour du jeu\n- Visionneuse de trophées - Sélectionner un jeu\n- Suppression de la prise en charge de fpkg.\n- Correction de la prise en charge des chemins Unicode pour les répertoires d'installation du jeu\n- Comme d'habitude, beaucoup de nouvelles traductions\n \n \nTéléchargement : shadps4 v0.8.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205748/in-ps4-shadps4-v080-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[Switch 2] MigSwitch confirme la compatibilité du MigFlash avec la Switch 2",
        "content": "L'équipe en charge du développement du MigFlash, la team MigSwitch, vient d'annoncer au travers de leur profil X.com que leur solution de contournement est bien compatible avec la Switch 2. \n \nPour cela elle annonce que \"la compatibilité du Mig Flash avec les jeux Nintendo Switch 1 sur Nintendo Switch 2 est confirmée grâce à la rétrocompatibilité de la console.\" \n \n \n\n \n \n \nAutre information importante, elle annonce qu'un nouveau Mig Dumper (ou une mise à jour firmware, cela reste à préciser) est en cours de développement, afin de permettre potentiellement la sauvegarde des jeux Switch 2. \n \nBien entendu, tant que la console n'est pas officiellement entre les mains des utilisateurs et détenteurs du MigFlash, il est difficile d'affirmer que tout fonctionnera de la même manière, mais il est clair que cette information va probablement accélérer les ventes, vu le prix des jeux de la Switch 2, en plus en tenant compte de la particularité de la microSD Express. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205745/in-switch-2-migswitch-confirme-la-compatibilite-du-migflash-avec-la-switch-2-1.png"
        }
    },
    "news_16": {
        "title": "[Switch 2] Une Switch 2 volée sur la chaîne de fabrication en Chine",
        "content": "Le pire qui devait arriver pour Nintendo, une Nintendo Switch 2 a été volée sur l'une des chaines de fabrication de Nintendo. \n \nDans le cas de la Switch, une partie de la fabrication avant 2019 était uniquement basée en Chine, puis après 2019, la Switch (notamment la OLED) a été fabriquée en partie au Vietnam. \n \n \n\n \n \nComme nous l'avons vu précédemment, de nombreux leaks des usines chinoises ont eu lieu, mais là une console a été volée dans une des nombreuses usines mises à contribution en Chine. \n \n \n\n \n \nDans la vidéo, on peut voir le menu de contrôle qualité, la preuve que la console est tuout fraichement sortie de la chaine. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205743/in-switch-2-une-switch-2-volee-sur-la-chaine-de-fabrication-en-chine-1.png"
        }
    },
    "news_17": {
        "title": "[PS4/PS5] Save Transfer Wizard v2.0.0 disponible",
        "content": "Le développeur Rajesh dévoile une toute nouvelle version de Save Transfer Wizard, et pas des moindres, il s'agit de la version v2.0.0 qui apporte beaucoup de nouveautés, il faut dire que la dernière update daté de décembre 2024.\n \nSon outil qui se destine à l'utilisation sur PlayStation 5, est un utilitaire PC qui va vous permettre de transférer facilement les sauvegardes entre votre PS5 et votre PC. Livré avec une interface sobre, il en dispose néanmoins des fonctions avancées, il vous permet de copier, télécharger, supprimer des sauvegardes via la connexion FTP. \n \n \n \n\n \n \n \nChangelog v2.0.0 - 2025-04-22 \n \n- Console Directory Explorer : Nouveau navigateur de répertoire FTP basé sur l'arborescence ajouté avec des icônes de dossier et la navigation de sous-dossier extensible.\n- Fonctionnalité de téléchargement : Télécharger des fichiers ou des dossiers directement dans les répertoires sélectionnés de la console via le menu contextuel.\n- Option de suppression : Le menu contextuel du clic droit comprend désormais une option de suppression avec une demande de confirmation pour éviter les suppressions accidentelles.\nLogique de rafraîchissement de l'interface utilisateur : Les actions post-chargement et post-suppression rafraîchissent désormais automatiquement l'arborescence.\n- Persistance des nœuds : Après le rafraîchissement, l'arborescence conserve le focus sur le nœud précédemment sélectionné.\n- Détection intelligente des dossiers : Seuls les dossiers apparaissent comme extensibles dans l'arborescence ; les fichiers sont correctement affichés sans icône de dossier.\nAmélioration de\n- Interface utilisateur plus propre : Suppression des boutons de téléchargement en faveur d'une interface de menu contextuel simplifiée.\n- Gestion des erreurs : Amélioration du retour d'information pour les erreurs de connexion et d'opération de fichier.\n- Maintient l'utilisation de FluentFTP sans ajouter de DLL externes.\n \nTéléchargement : Save Transfer Wizard v2.0.0 \n \n \n \n",
        "images": {}
    },
    "news_18": {
        "title": "[PS4/PS5] Deux bugs pour le prix d'un, et un PoC de corruption",
        "content": "Le développeur Zecoxao dévoile une preuve de concept sur un bug \"double free\" de corruption de mémoire, mais ce sont pas moins de 2 bugs qui ont été dévoilés !\n \nZecoxao vient de dévoiler un Poc de corruption de mémoire pour la PS4, ce bug a été patché sur le firmware 12.50, ce qui semble signifier que cette faille est présente sur le firmware 12.02 et 12.00 mais aussi sur les firmwares en dessous, il reste à confirmer quels sont les firmwares inférieurs concernés. \n \nLe Poc est disponible ici : Double Free (PS4)\n \n \n \n\n \n \nAutre chose, ce bug serait corrigé sur le firmware 12.50 sur PS4 mais il est aussi présent sur PS5 jusqu'au firmware 11.00. Sur PS4, d'après les premiers fichiers qui circulent, les ELFs sont proposés sur les firmwares 11.02, 11.50, 11.52, 12.00 et 12.02.\n \nMais encore plus fort, il semblerait qu'un autre bug kernel aurait été découvert, il porte le nom d'UAF est serait présent jusqu'au firmware 10.40 sur PS5. Nous ne savons pas si cet exploit est en lien avec celui dévoilé par TheFlow, peut être n'a-t-il rien à voir, ce qui potentiellement pourrait donc porter à 3 le nombre de bugs utilisables. \n \nReste à confirmer que tout ces bugs soient réellement exploitables. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205696/in-ps4ps5-deux-bugs-pour-le-prix-dun-et-un-poc-de-corruption-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] OrbisPro Beta 0.4.1 disponible",
        "content": " \nLe développeur SvenGDK propose une nouvelle version d'OrbisPro Beta qui est désormais estampillée 0.4.1. Après une v0.4, le développeur a rapidement proposée la v0.4.1 qui vient corriger la navigation, des crashs et utiliser la nouvelle URL pour les nouvelles mises à jour. \n \nLe changelog est tout simplement stratosphérique, OrbisPro est une plateforme en développement visant à centraliser et optimiser la gestion des jeux et applications sur PC, avec une interface intuitive et des fonctionnalités avancées.\n \n \n\n \n \n \nChangelog v0.4.1 :\n \n- Sera installé lors de la première exécution si vous avez déjà la version v0.4.0 - Les fichiers de la version actuelle ont déjà été mis à jour vers la version v0.4.1\n- Corrige la navigation à la manette lors de la sélection du contenu d'un dossier\n- Corrige un plantage dans le menu d'accueil lors de la sélection d'un dossier contenant une application système\n- Utiliser la nouvelle URL de mise à jour pour les nouvelles mises à jour\n- Mise à jour de l'OrbisProUpdater\n \nChangelog 0.4.0 : \n \nMises à jour des fonctionnalités\n- La configuration permet désormais de choisir davantage de lecteurs à analyser pour les jeux et les applications\n- Ajout de l'émulateur PS4 depuis shadPS4\n- Le menu Accueil charge désormais également les jeux PS4 enregistrés\n- Nouveau menu d'options pour l'écran d'accueil\n- Ajouter l'application ou le jeu sélectionné à un dossier\n- Supprimer un dossier sélectionné\n- Les applications, jeux et dossiers enregistrés sont désormais stockés dans un fichier au format JSON\n- Nouveaux paramètres de manette de jeu\n- Ajustez le taux d'interrogation des manettes 1 à 4 (une seule fonctionne actuellement)\n- Option « Tester l'entrée de la manette »\n- Définir la disposition des boutons de la manette de jeu\n- L'explorateur de fichiers marque désormais les sauvegardes PS4 avec un logo shadPS4\n- L'explorateur de fichiers peut désormais ouvrir des images avec le nouveau visualiseur d'images système\n- La visionneuse d'images système ne peut actuellement que faire pivoter l'image et la mettre en plein écran (et inversement)\n- L'explorateur de fichiers permet désormais d'exécuter des sauvegardes avec un émulateur spécifique lors de l'ouverture du menu OPTIONS\n- L'explorateur de fichiers dispose désormais d'une option permettant d'installer les fichiers PKG PS4 dans le répertoire shadps4\\games\n- Le répertoire d'installation ne peut pas encore être modifié et est corrigé dans OrbisPro\n- OrbisPro charge désormais les dossiers enregistrés sur l'écran d'accueil\n- Un dossier peut être créé/supprimé de la même manière que sur la console PS4\n- Ajout des touches de clavier manquantes lors de l'utilisation d'un clavier uniquement\n- Nouveau programme d'installation PKG pour les jeux PS4\n- L'installateur PKG vérifie la compatibilité du jeu et renvoie l'état de fonctionnement actuel du jeu dans une boîte de dialogue\n- Vous pouvez accepter le message et installer le PKG ou annuler l'action\n- Nouveau testeur d'entrée de manette de jeu\n- Affiche le bouton enfoncé, les valeurs Y/X du pouce gauche/droit, les valeurs du déclencheur gauche/droit\n \nAjouts :\n- Ajout de 12 nouvelles icônes de jeu et de 12 nouveaux arrière-plans de jeu\n- Ajout de 2 nouveaux arrière-plans animés pour OrbisPro (Blue Bokeh Dust et Golden Dust)\n- Ajout de nouvelles dispositions de boutons\n-> PS3\n-> PS4\n-> PS5\n-> PS Vita\n-> Steam (style Xbox plus récent)\n-> Pont à vapeur\n-> Xbox 360\n- Ajout d'une disposition de clavier noire\n \nCorrections :\n- Les touches du clavier étaient toujours acceptées dans certaines fenêtres lorsque la saisie était suspendue\n- Les manettes de jeu n'avaient pas ce problème\n- Boutons de manette manquants dans certaines fenêtres\n- OrbisPro acceptait toujours tous les types d'entrées lorsqu'un jeu/une application était démarré à partir de l'explorateur de fichiers ou de la bibliothèque de jeux.\n- ReduceUsage() manquait également et a été ajouté maintenant\n- Le retour à l'accueil depuis la bibliothèque de jeux peut interrompre le focus sur la fenêtre principale.\n- La bibliothèque a instantanément supprimé un jeu/une application sans confirmation\n- Une nouvelle boîte de dialogue de confirmation apparaît maintenant pour confirmer la suppression\n- Son de déplacement manquant dans la bibliothèque\n- L'entrée n'a pas été interrompue lorsqu'un message d'exception a été généré\n- Le retour à l'accueil à partir du navigateur Web peut interrompre le focus sur la fenêtre principale\n- Aucune saisie supplémentaire n'est possible lorsque ReloadHome() a été utilisé\n- Les paramètres avec des cases à cocher étaient enregistrés avant la vérification/décochage visuelle, ce qui entraînait l'enregistrement de l'état précédent\n- Correction d'un crash qui bloquait l'Explorateur de fichiers lors de la tentative d'ouverture du premier dossier sélectionné\n- Correction de la fin de la configuration lors de l'appui sur une touche spécifique\n \nChangements internes :\n- Nouvelle classe « DirveListViewItem » utilisée pour la liste des lecteurs\n- Nouvelles classes « ExistingFolderListViewItem », « FolderContentListViewItem » et « FolderContentSelectionListViewItem » utilisées pour les dossiers\n- Nouvelles classes « OrbisAppList » et « OrbisGamesList » pour gérer les nouveaux fichiers au format JSON\n- Nouvelle classe « OrbisFolders » pour gérer les dossiers\n- Fonctions « CreateNewFolder », « RemoveFolder », « ChangeFolderNameOfAppGame » et « GetFolderContentNames »\n- Vérifiez les extensions de fichiers avec « .ToLower() »\n- GameStarter -> Démarrer le jeu\n- Ajout d'une option pour démarrer le jeu avec un émulateur sélectionné\n- Ajout d'une propriété Platform pour démarrer les fichiers « .bin », « .elf » et « .iso » avec l'émulateur correct\n- Ajout de la possibilité de démarrer les fichiers .bin et .elf avec l'émulateur sélectionné\n- Nouvelle classe « OrbisPS4 » qui gère actuellement la compatibilité ShadPS4\n- Remplacement de « AppPath » par « AppExecutableFilePath » dans « OrbisStructures.AppDetails »\n- Certaines fonctions ont été déplacées vers « OrbisUtils »\n- Modifications de la classe « OrbisUtils » :\n- Nouvelle fonction « CreateFolderImage » qui crée des icônes de dossier\n- Sélectionne les 4 premières icônes de jeu/application disponibles dans un groupe\n- Nouvelle fonction « GetFolderItemsCount » pour obtenir le nombre d'éléments du dossier\n- Nouvelle fonction « GetFolderItems » qui renvoie les éléments d'un dossier donné\n- Nouvelles fenêtres « CreateNewFolderDialog », « ExistingFolders » et « SelectFolderContentDialog »\n- La fenêtre « ExistingFolders » répertorie les options permettant de créer un nouveau dossier et des dossiers déjà existants\n- « CreateNewFolderDialog » affiche un aperçu du dossier, ici vous pouvez définir le nom du dossier et son contenu\n- « SelectFolderContentDialog » permet de sélectionner le contenu d'un dossier et renvoie la valeur à « CreateNewFolderDialog »\n- « SystemDialog » ajusté pour afficher des messages et demander une confirmation pour des actions spécifiques\n- L'explorateur de fichiers utilise désormais un cache d'icônes pour charger les icônes d'extension de fichier\n- Le « FileExplorer » vérifie désormais les extensions de fichiers avec « .ToLower() »\n- Le « FileExplorer » peut désormais ouvrir les fichiers « .jpg », « .jpeg », « .png », « .webp », « .bmp », « .tif », « .tiff », « .gif », « .apng », « .heif » avec le nouveau « SystemImageViewer »\n- Le « FileExplorer » utilise désormais une nouvelle fonction ShowSideSettingButtons pour afficher la quantité requise de boutons de menu d'options\n- Le menu d'options de « FileExplorer » permet désormais d'exécuter des fichiers « .bin », « .elf », « .iso » avec différents émulateurs\n- Nouvelles icônes d'extension de fichier « FileExplorer »\n- La « MainWindow » possède désormais l'ombre/la boîte noire manquante sous l'icône du jeu/de l'application (« StartRect »)\n- Ajout des variables « HomeGroupAppsCount » et « GroupAppsOnHome » pour suivre les éléments du dossier\n- \"HomeAnimation\" ajusté pour permettre le chargement de Home sans effet sonore (actuellement utilisé uniquement lors du rechargement de Home)\n- Un « RightMenu » (menu d'options) a été ajouté à la « MainWindow »\n- Fonction « AddNewApp » ajustée pour permettre l'ajout de dossiers sur l'écran d'accueil\n- « ReloadHome() » recharge désormais la page d'accueil sans effet sonore et supprime également les éléments de dossier visibles\n- Nouvelles fonctions « ShowGroupAppsOnHome » et « RemoveGroupAppsOnHome » pour afficher ou masquer des applications ou des jeux dans un dossier\n- Le déplacement vers le bas sur un dossier déplacera les principales icônes d'accueil vers le haut et permettra de parcourir les éléments du dossier.\n- Pour revenir aux icônes principales de la page d'accueil, le focus doit être sur le PREMIER élément\n- Le déplacement vers le haut sur le PREMIER élément du dossier restaurera les principales icônes d'accueil\n- Fonctions « MoveAppsLeft » et « MoveAppsRight » ajustées pour afficher les éléments du dossier lors du déplacement vers un dossier\n- Les deux fonctions permettent désormais également de parcourir les éléments du dossier\n- La « MainWindow » utilise désormais également une nouvelle fonction « ShowSideSettingButtons » pour afficher la quantité requise de boutons de menu d'options\n- La « MainWindow » dispose désormais d'une nouvelle fonction « EnsureHighestZIndex » pour garantir que le menu d'options et les boutons requis sont toujours au-dessus des autres éléments.\n- La « MainWindow » vérifie désormais directement si une batterie ou un réseau Wi-Fi est disponible et l'enregistre dans « IsBatteryPresent » et « IsWiFiAvailable ».\n- Le « SystemTimer » qui surveille l'état de la batterie/du Wi-Fi ne démarrera pas si « IsBatteryPresent » et « IsWiFiAvailable » sont définis sur « False ».\n- La fonction « ChangeBackgroundImage » de « MainWindow » permet désormais de charger une image d'arrière-plan à partir de la propriété JSON « BackgroundPath » d'un jeu/d'une application\n- Le nom de « SystemGallery » a été modifié en « SystemImageViewer » pour la nouvelle visionneuse d'images.\n- Ne définissez pas « PauseInput=False » deux fois lorsque vous revenez à une fenêtre, car « Activate() » le fera dans la fenêtre de retour.\n- « Gestion des comptes » a été renommé en « Gestion des utilisateurs » dans « Paramètres généraux ».\n- « Paramètres généraux » charge désormais les nouveaux paramètres de la manette de jeu et de l'émulateur PS4\n- Nouvelles fonctions « ChangePS4ConfigValue » et « GetTOMLValue » pour lire/modifier le fichier de configuration de l'émulateur PS4\n- Fenêtres « SetupApps » et « SetupGames », « GameLibrary » et « FileExplorer » ajustées pour enregistrer les informations de jeu/application avec le nouveau format JSON\n- Nouvelle fenêtre « SetupDrives » qui répertorie les lecteurs connectés qui peuvent être sélectionnés pour être traités dans le prochain processus des fenêtres « SetupGames » et « SetupApps »\n- \"WelcomeToSetup\" -> Suppression de la configuration \"supplémentaire\" pour l'Asus ROG Ally et du message de bienvenue lors du premier démarrage d'OrbisPro\n- « GameLibrary » charge désormais également les jeux PS4 enregistrés\n- Fonction « PauseProcessThreads » ajustée dans « ProcessUtils » pour suspendre désormais tous les threads de chaque processus en cours d'exécution avec le nom du processus en cours d'exécution actif\n- Ne quittez pas non plus la boucle si « OpenProcessThread = IntPtr.Zero » mais continuez\n- Nouvelle fenêtre « PKGInstaller » qui gère les installations de packages PS4\n- Actuellement sans réelle progression du fichier mais une barre de progression indéterminée jusqu'à la fin\n- Récupère l'état de compatibilité de ShadPS4 à l'aide de la fonction « FetchShadPS4Compatibility »\n- Les PKG installés avec succès seront ajoutés à GamesList.json\n- Un rechargement de Home est nécessaire pour afficher le package nouvellement installé\n- Déplacement de « SystemDialog » vers le nouveau dossier « Dialogs » -> « Dialogs\\SystemDialog »\n \nMises à jour des packages et des bibliothèques : \n- LibVLCSharp v3.9.2 -> v3.9.3\n- LibVLCSharp.WPF v3.9.2 -> v3.9.3\n- Wifi natif géré v2.7.0 -> v2.7.1\n- Microsoft.Web.WebView2 v1.0.3124.44 -> v1.0.3179.45\n- Gestion du système v9.0.3 -> v9.0.4\n- Ajout de Tomlyn v0.19.0\n- Ajout de SharedMemory v2.3.2\n- Ajout de SharpZipLib v1.4.2\n- Ajout de GameArchives v0.1.138\n- Ajout de HtmlAgilityPack v1.8.10\n- Ajout de PARAM.SFO v1.0.0\n- Ajout de PS4_Tools v1.0.0\n \nRappels de combinaison de boutons/touches :\n- Pour recharger l'écran d'accueil, appuyez simplement simultanément sur les boutons L + R d'une manette ou sur la touche F1 d'un clavier.\n- Pour revenir à l'écran d'accueil après une partie en cours, appuyez simplement simultanément sur les boutons START + SELECT sur une manette ou sur la touche HOME sur un clavier.\n- Pour revenir au jeu en cours, appuyez simplement simultanément sur les boutons START+SELECT ou à nouveau sur la touche HOME\n- Pour ouvrir les options/menu latéral sur l'écran d'accueil, appuyez simplement sur DÉMARRER sur une manette de jeu ou sur la touche F2 d'un clavier tout en vous concentrant sur un jeu/une application\n \nModifications d'installation/d'archivage :\n- Passé d'une archive .7z à une archive .exe auto-extractible de 7Z (SFX - parties de 1,25 Go) en raison de la limitation de la taille de téléchargement de GitHub (2 Go)\n- Pour installer/extraire, téléchargez simplement les 3 fichiers requis et exécutez « OrbisPro Beta v0.4.exe » une fois téléchargé :\n- OrbisPro Beta v0.4.exe\n- OrbisPro Beta v0.4.7z.001\n- OrbisPro Beta v0.4.7z.002\n \n \n \nTéléchargement : OrbisPro Bêta 0.4.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205676/in-ps4-orbispro-beta-041-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS4-PS5] Retroarch en un clic sur vos PS4 et PS5",
        "content": "Petite mise à jour de mon outil  de création d'émulateur en un clic, fonctionne sur toutes les PS5 et PS4 jailbreakés.\n \n\n \nGrâce à ce petit GUI (toujours en batch) il vous sera très très simple de créer un FPKG d'émulateur rétro pour vos PS5 4.xx, 6.xx  et 7.xx , et PS4, un simple clic sur l'émulateur voulu et tous se fera automatiquement, juste à patienter... Je ne peux pas faire plus simple ^^...\n \nIl utilise retroarch PS2, ce sont donc des versions PS2 que vous allez lancer sur vos PS4 et PS5...\nCertains me diront c est pas du natif et c est de la ps2 blablabla, le plus important est que cela fait le taf et permet de jouer à nos vieux jeux retro, non ?!\n \nVous pourrez donc en un clic créer un FPKG comprenant un émulateur GameBoy - Color, Nes, Snes, GameGear, Master System, Megadrive, Atari 800, Lynx, WonderSwam ou NeoGeo Pocket.\n \nUne seule chose à faire copier/coller vos roms dans le dossier Games, puis cliquer sur l' émulateur voulu, rien d'autre...\n \nAttention !!! Avant le premier lancement du .bat il vous faudra régler imgburn afin qu il crée l' ISO ps2, sans ce réglage, l' émulateur ne trouvera pas vos roms une fois lancé sur vos PS5 et PS4...Cette manip n' est à faire qu' une fois avant le premier lancement du .bat...\n \n\n- Lancer imgburn.exe  dans le dossier tools/\n- Sélectionner Create image file from files/folders\n- Puis l'onglet Advanced\n- Puis l' onglet Restrictions\n- Et sélectionner bien Level 2 - 31 characters\n- Fermer imgburn\n- Voilà il est bien configuré...\n \n\n \n \n\n \n \n \nTuto:\n \n\n- Copier/coller vos roms dans le dossier Games/\n- Cliquer sur l' émulateur de vos roms\n- Patienter\n- Installer le pkg sur votre PS5\n- Lancer l app une fois sur le menu appuyer O\n- Selectionner CDFS:/ puis core\n- Lancer le .elf\n- Une fois le menu vert ouvert séléctionner load content\n- Lancer la rom voulue\n- Jouer\n\n \nTélécharger PS4-PS5 retroarch.rar\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205645/in-ps4-ps5-retroarch-en-un-clic-sur-vos-ps4-et-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175709/in-ps4-creer-un-fpkg-demulateur-en-un-clic-2.png"
        }
    }
}