{
    "news_1": {
        "title": "[PS5] Nihonium : Un framework C++ pour la manipulation de la mémoire sur PlayStation 5",
        "content": "La PlayStation 5 est une console de jeu qui offre des possibilités techniques impressionnantes. Pour les développeurs souhaitant explorer les couches profondes du système, la manipulation de la mémoire est un aspect crucial. C'est dans ce contexte que Nihonium, un framework C++ en cours de développement, se distingue comme un outil puissant pour interagir avec la mémoire du kernel de la PS5.\n \nActuellement testé sur le firmware 2.00, Nihonium est conçu pour fonctionner sur toutes les versions de firmware prises en charge par le SDK officiel. Ce framework s'appuie sur le SDK développé par John Törnblom, un outil essentiel pour la création de payloads sur PS5. \n \n \n \n\n \n \n \n \nVoici un aperçu des principales caractéristiques :\n \nKernelMemory :\nCette classe permet d'accéder à des fonctions pour lire et écrire dans la mémoire du noyau. Par exemple, il est possible de récupérer l'adresse de base du segment texte ou des données du noyau, ou encore de modifier directement la mémoire.\n \nILibKernel - Interface pour Libkernel : Nihonium intègre une interface pour interagir avec des fonctions système essentielles, telles que :\n- sceKernelSendNotificationRequest\n- sceKernelGetHwModelName\n- sceKernelGetHwSerialNumber\n- sceKernelGetCpuFrequency\n- sceKernelGetCpuTemperature\n- sceKernelGetSocSensorTemperature\n \nExemples pratiques :\n- Le framework inclut des exemples de code pour illustrer son utilisation. Par exemple :\n- Récupérer l'adresse de base du segment texte du noyau.\n- Lire ou écrire dans la mémoire du noyau.\n- Modifier les protections d'une région mémoire.\n- Récupérer un processus par son PID.\n \n \nNihonium est un framework prometteur pour les développeurs souhaitant explorer les fonctionnalités avancées de la PS5. Bien qu'il soit encore en cours de développement, il offre déjà des outils puissants pour la manipulation de la mémoire du kernel, avec des exemples clairs permettant de récupérer certains codes, lire la mémoire du kernel, écrire dans la mémoire du kernel, ou encore modifier les protections d'une région de la mémoire, et bien entendu en s'appuyant sur une documentation en évolution, Nihonium pourrait devenir un outil incontournable pour la communauté des développeurs PS5.\n \n \nTéléchargement : nihonium\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203524/in-ps5-nihonium-un-framework-c-pour-la-manipulation-de-la-memoire-sur-playstation-5-1.png"
        }
    },
    "news_2": {
        "title": "[PS3] L'émulateur PSN RPCN sort en v1.4",
        "content": "La team RPCS3 vient de mettre à jour l'émulateur PSN RPCN et propose la v1.4. Pour rappel RPCN est un serveur qui ajoute netplay à RPCS3, l'un des meilleurs émulateurs PS3. \n \n \n\n \n \nChangelog RPCN 1.4 : \n \nAjouts :\n- Ajout du support pour les slots privés et les mots de passe des salles.\n- Ajout d'un indice pour le nom du jeu dans le suivi des jeux.\n- Ajout d'un cache pour le suivi des jeux.\n- Ajout du support pour IPv6 pour la signalisation.\n- Ajout du support pour les groupes.\n- Ajout d'une commande pour réinitialiser l'état du client sans le déconnecter.\n \nChangements :\n- Suppression de la cible dans les logs.\n- Arrêt de l'affichage des erreurs si la connexion s'arrête en raison de la fin d'une connexion TCP.\n- Suppression des Arc inutiles autour des atomiques dans le suivi des jeux.\n- Nettoyage des logs.\n \nCorrectifs :\n- Les informations de signalisation sont maintenant fournies à la personne rejoignant une salle dans la réponse de la salle et dans la notification qu'un utilisateur a rejoint, au lieu d'être envoyées séparément.\n- Correction de l'annonce de la présence qui n'était pas envoyée aux amis lors de sa première définition.\n \nDivers :\n- Mise à jour des dépendances vers leurs dernières versions majeures.\n \n \nTéléchargement : RPCN v1.4.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203523/in-ps3-lemulateur-psn-rpcn-sort-en-v14-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS4] PS4 Linux avec kernel 6.6 supporte AMDGPU",
        "content": "Le développeur crashniels a porté le kernel Linux 6.6 pour la console PS4, amenant au passage la prise en charge d'AMDGPU.\n \nJusqu'alors la PS4 était bloqué sur le kernel 5.15 notamment sur les consoles équipées de SoC Belize et sur le kernel 5.4 pour les consoles équipées de SoC Baikal. Et bien voilà, cela va changer puisque le kernel 6.6 porté ici permet d'ouvrir le monde de la PS4 qui se rapproche encore un peu plus d'un PC. \n \nPour y parvenir, les efforts ont été importants, le développeur a d'abord essayé de porter le kernel 6.12, mais il a fait face à de trop nombreuses erreurs, des problèmes de stabilité qui ont été introduit entre la 5.15.110 et la 5.15.111.\n \n \n \n\n \n \nEn creusant, il a réussi à faire fonctionner le kernel 6.1 sur la PS4. Par défaut, AMDGPU n'est pas supporté par la PS4, de fait la sortie vidéo n'est pas supporté, il a du identifier et adapter certains problèmes d'horloge GPU afin de modifier le fichier System.map. \n \nPour parvenir à une compatibilité partielle, il a désactivé AMDGPU et il s'appuie sur un pilote Radeon, il a ensuite restaurer partiellement la prise en charge AMDGPU qui reste à améliorer, en souhaitant notamment corrigé d'autres problèmes liés à IRQ et APCIe. \n \nSi vous voulez tout de même tester ce nouveau kernel 6.6 sur votre PS4 l'article est par ici.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203520/in-ps4-ps4-linux-avec-kernel-66-supporte-amdgpu-1.png"
        }
    },
    "news_4": {
        "title": "[PS4] PPPwnUI 3.32b moddé par aldostools disponible",
        "content": "Le développeur Alod Vargas, plus connu sous le pseudonyme Aldostools, vient de publier une nouvelle version de PPPwnUI, l'interface Python qui facilite l'exécution de l'exploit PPPwn. \n \nCette mise à jour a surtout intégré la toute dernière version de PS4HEN VTWX 2.15 PPPwn-1.332 qui apporte le support de nouveaux firmwares, notamment les firmwares 10.00 et 10.01. \n \n \n \n\n \n \nCe sont donc désormais 23 firmwares qui sont supportés par PPPwn. Il en a profité pour mettre à jour pppwn_cpp en version 1.1.0. \n \n \nTéléchargement : PPPwnUI 3.32b moddé par aldostools\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203516/in-ps4-pppwnui-332b-modde-par-aldostools-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS4] ps4-hen-vtx PPPwn-1.0332 pour firmware 10.00 et 10.01",
        "content": "Le développeur BestPig a mis à jour ps4-hen-vtx en y ajoutant quelques offsets pour supporter de nouveaux firmwares. Ce sont donc les offsets des firmwares 7.50, 8.03, 10.00 et 10.01 qui ont été ajoutés. \n \n \n\n \n \n \nLa bonne nouvelle est que certains autres outils vont pouvoir être mis à jour avec le support de ces nouveaux firmwares PS4. \n \nChangelog : \n \n- Offsets 7.50\n- Offsets 8.03\n- Offests 10.00 et 10.01\n \n \nTéléchargement : ps4-hen-vtx PPPwn-1.0332 \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203510/in-ps4-ps4-hen-vtx-pppwn-10332-pour-firmware-1000-et-1001-1.jpg"
        }
    },
    "news_6": {
        "title": "[PS5] ps5-jar-loader v4.0.1 corrige le bug 7.xx",
        "content": "Le développeur Hammer-83 a corrigé les bugs sur les firmwares 7.xx après avoir reconnu que la version 4.00 subit des bugs critiques sur ces firmwares. \n \n \n\n \n \n \nNouvelles fonctionnalités :\n \n- Mise en œuvre de primitives de lecture/écriture du noyau basées sur AGC pour permettre l'accès en écriture aux données du kernel sur le firmware 6.00+. Un grand merci à flat_z.\n- Ajout de la charge utile pour activer le menu Paramètres de débogage. Crédit à CryoNumb.\n- Diverses améliorations et refactorisations du SDK.\n- Ajout de la sortie des numéros de version pour le chargeur JAR et pour les charges utiles (basées sur la version du projet Maven).\n \n \nRemarques\n \n- La version v4.0.0 a été supprimée car elle contenait un bug critique sur le firmware 7.00+.\n- Les nouveaux payloads ne sont pas compatibles avec la version précédente du JAR Loader et vice-versa.\n- L'ISO complet inclut un menu et tous les fichiers JAR de cette version. L'ISO réduit inclut uniquement le chargeur JAR distant, les charges utiles doivent être envoyées via le réseau.\n- L'ISO complet n'inclut pas les JAR de jailbreak et de klogserver car le jailbreak ne fonctionne pas bien avec le chargeur de menu.\n- Certains répertoires ne sont pas accessibles dans BD-J, même avec le jailbreak. Il s'agit d'un problème connu, aucune solution n'a encore été trouvée pour résoudre ce problème.\n \n \nTéléchargement : ps5-jar-loader v4.0.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203498/in-ps5-ps5-jar-loader-v401-corrige-le-bug-7xx-1.png"
        }
    },
    "news_7": {
        "title": "[PSP/Vita] PSP Ark-4 r160 compatible wpa2psp",
        "content": "Certains d'entre vous ont peut-être déjà entendu parler du plugin wpa2psp qui a été publié il y a une semaine. Le développeur du plugin, connu sous le nom de Moment sur le serveur Discord, a eu la gentillesse de partager avec les développeurs d'Ark-4 le code source, et ils ont pu l'intégrer dans le CFW en tant que paramètre.\n \nEn dehors de cela, a été également corrigé un problème de crash de veille affectant 1.50 ARK via Time Machine, cela permet de se rapprocher encore plus d'un CFW 1.50 ARK entièrement fonctionnel.\n \n \n\n \n \nEnfin, quelques remaniements sur la section des paramètres CFW, certains paramètres ont été simplifiés, d'autres ont été améliorés et d'autres encore ont été complètement remaniés. \n \n \n \nTéléchargement : PSP Ark-4 r160\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203473/in-pspvita-psp-ark-4-r160-compatible-wpa2psp-1.png"
        }
    },
    "news_8": {
        "title": "[PS4] Direct Package Installer 8.1.0 disponible",
        "content": "Le développeur marcussacana vient de publier une nouvelle mise à jour pour DirectPackageInstaller, il s'agit de la version 8.1.0. Comme vous le savez l'outil Direct Package Installer vous permet de prévisualiser et d'envoyer des PKG sur votre PS4 via Remote Package Installer à partir de liens directs.\n \nS'appuyant sur le serveur de GoldHEN ou de Remote Package Installer, Direct Package Installer est compatible avec des services d'hébergement comme Alldebrid, Realdebrid, Google Drive, Mediafire, PixelDrain ou encore beaucoup d'autres. \n \n \n \n\n \n \n \nChangelog : \n \n- Correction de l'installateur de payloads sur Android ( #74 )\n- Correction de RemotePackageInstaller sur Android ( #74 )\n- Implémentation de la prise en charge de PS4 IP Finder pour Android\n- Correction d'un bug sur Auto Updater ( #76 )\n- Permet de définir un portage de payload personnalisé dans le Settings.ini ( #66 )\n- Correction de la persistance en arrière-plan sur Android 13 ou plus récent\n \n \nTéléchargement : DirectPackageInstaller 8.1.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203465/in-ps4-direct-package-installer-810-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[PS5] PS5 Jar Loader v4.0.0 disponible",
        "content": "Le développeur Hammer-83 annonce la sortie de la version 4.0.0 de son outil de développement pour PS5, PS5 Jar Loader, qui dispose de nouvelles fonctionnalités comme l'implémentation de primitives de lecture et d'écriture du kernel basées sur AGC, le payload pour activer le menu des Debug Settings ou encore des améliorations et des refontes sur le SDK comme en atteste le changelog. \n \n \n\n \n \n \nNouveautés de la version 4.0.0 :\n \n- Implémentation de primitives de lecture/écriture du noyau basées sur AGC : Cette fonctionnalité permet désormais un accès en écriture aux données du noyau sur les firmwares 6.00 et ultérieurs. Un grand merci à flat_z pour cette contribution.\n \n- Payload pour activer le menu des Debug Settings : Une nouveauté rendue possible grâce à CryoNumb.\n \n- Améliorations et refontes du SDK : Le kit de développement a été optimisé pour une meilleure expérience utilisateur.\n \n- Affichage des numéros de version : Les versions du JAR Loader et des payloads sont désormais affichées, basées sur la version du projet Maven.\n \nNotes importantes :\n \nLes nouvelles payloads ne sont pas compatibles avec les versions précédentes du JAR Loader, et vice-versa. L'ISO complet inclut un menu et tous les JARs de cette version, tandis que l'ISO allégé ne contient que le JAR Loader distant, nécessitant l'envoi des payloads via le réseau.\n \nCette version introduit plusieurs payloads essentiels pour les développeurs :\n \n- UMTX bug implementations : Adaptées par flat_z, Cryptogenic et cheburek3000, ces payloads permettent d'obtenir un accès en lecture/écriture du noyau. UMTX1 est recommandé pour sa stabilité.\n \n- Byepervisor : Une implémentation de Cryptogenic pour des fonctionnalités avancées.\n \n- Kernel dumper : Permet de dump le noyau une fois l'accès en lecture/écriture obtenu.\n \n- Jailbreak : Libère le processus BD-J avec des privilèges superutilisateur et l'échappe de la prison /app0.\n \n- Serveur FTP : Offre un accès root après le jailbreak.\n \n- Serveur Klog : Moins stable lorsqu'un client est connecté.\n \n- Debug Settings : Active ou désactive les paramètres de débogage.\n \n \n\n \n \nPour aider les développeurs à prendre en main les nouvelles fonctionnalités, plusieurs exemples sont fournis :\n \n- Un mini-jeu de tennis.\n \n- Un outil pour afficher les propriétés du système.\n \n- Un dump du classpath actuel de la JVM.\n \n- Une liste de tous les répertoires du système de fichiers utilisant des appels natifs.\n \n \n \n \nTéléchargement : PS5 Jar Loader v4.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203446/in-ps5-ps5-jar-loader-v400-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203446/in-ps5-ps5-jar-loader-v400-disponible-1.jpeg"
        }
    },
    "news_10": {
        "title": "[PS5] PS5 Payload SDK v0.25 disponible",
        "content": "Le développeur John Tornblom a publié une nouvelle version de son PS5 Payload SDK qui est proposé en v0.25, la toolbox évolue donc une nouvelle fois sous les traits du développeur.\n \nComme vous le savez, ce SDK a pour ambition de faciliter le portage et le développement de payloads qui pourront s'exécuter sur les consoles bénéficiant du loader ISO BD-JB ELF, mais aussi sur celles utilisant l'exploit \"ipv6 uaf\" basé sur le webkit.\n \n \n\n \n \n \nChangelog : \n \nrtld : Restructuration majeure et améliorations apportées au chargeur de bibliothèques partagées (SO loader).\n \ncrt : Correctif appliqué pour les permissions d'appels système directs.\n \nlibc : Ajout de la fonction backtrace() et des fonctions associées.\n \nlibc : Ajout de la fonction getprotobyname().\n \nlibc : Ajout des fonctions fts_open() et des fonctions associées.\n \nlibc : Découplage de la bibliothèque standard C (libc) par rapport au crt (C Runtime).\n \nCes modifications apportent des améliorations significatives en termes de fonctionnalités, de performance et de modularité.\n \n \n \n \nTéléchargement : PS5 Payload SDK v0.25\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1905281131.png"
        }
    },
    "news_11": {
        "title": "[PS5] PS5-Self-Decrypter v0.1 d'idlesauce disponible",
        "content": "Le développeur idlesauce propose un nouveau programme qui se nomme PS5 Self Decrypter qui est numéroté 0.1.\n \nPour l'heure, le développeur précise qu'il doit être considéré comme une bêta, car il n'a pas été testé en profondeur. \n \n \n\n \n \n \nLe programme sert à dumper /mnt/sandbox/pfsmnt une partie /data/dumpdu stockage interne de la PS5.\n \nUtilisez socat-le pour envoyer pour voir les journaux, vous devriez voir [+] done quand c'est terminé.\n \nA l'origine, PS5-Self-Decrypter est un payload de Specter qui utilise la lecture/écriture arbitraire du kernel pour décrypter les ELF signés (SELF) du système de fichiers et dumper les ELF en texte clair sur la clé USB.\n \n \nTéléchargement : PS5-Self-Decrypter v0.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1615444283.png"
        }
    },
    "news_12": {
        "title": "[Multi] Flycast fait le bilan sur toutes ses dernières évolutions",
        "content": " \nFlycast est un émulateur multiplateforme pour les Sega Dreamcast, Sega Naomi et Atomiswave, et quand on fait le bilan, de toutes les nouveautés et améliorations apportées durant une année, cela reste impressionnant. \n \nCela fait 11 ans que Flycast nous régale, dérivé de Reicast, l'émulateur a connu des évolutions importantes.Flycast a connu une année incroyable : nouvelles fonctionnalités, émulation VMU, Google Play Store, jeux en ligne et bien plus encore ! Flycast est le meilleur émulateur Dreamcast pour la plupart des configurations matérielles. Il offre une compatibilité exceptionnelle avec les jeux (99 %+) et avec le BIOS intégré (97 %+), bien que l'utilisation d'un BIOS réel soit recommandée, notamment pour DCnet. Flycast ne se contente pas de faire tourner les jeux : grâce à la fonction d'overclocking, les jeux non optimisés avec des ralentissements peuvent être corrigés. De plus, il prend en charge les packs de textures et l'upscaling xBR intégré. Flycast fonctionne sur plus de périphériques que tout autre émulateur Dreamcast (et même que la plupart des émulateurs pour d'autres systèmes). Il bénéficie également d'une communauté active pour vous aider en cas de besoin. Après 11 ans, Flycast reçoit toujours des mises à jour régulières et continue de nous surprendre avec de nouvelles fonctionnalités. Grâce à la possibilité de réduire sa précision pour nécessiter moins de ressources, même les appareils bas de gamme peuvent profiter de Flycast.\n \n \n\n \n \nLes nouveautés et mises à jour récentes :\nDCnet pour le jeu en ligne : \n- Une solution simplifiée pour le multijoueur en ligne, contournant les limitations des serveurs natifs de la Dreamcast.\n- Fonctionne avec presque toutes les connexions Internet, même sur les réseaux mobiles lents.\n- Permet de jouer plus de 70 heures avec seulement 1 Go de données.\n- Disponible uniquement via la version Dev de Flycast, téléchargeable sur la page CI de Flycast.\n \nL'expérience complète du VMU :\n- Flycast permet désormais de jouer aux mini-jeux du VMU (Visual Memory Unit) grâce à des outils comme Dream Explorer ou Elysian Emu.\n- Idéal pour les fans des mini-jeux Chao ou d'autres jeux VMU.\n \nDisponibilité sur le Google Play Store :\n- Flycast est désormais disponible sur le Google Play Store, facilitant son accès pour les utilisateurs Android.\n- Une version Dev est également disponible pour des mises à jour automatiques.\n \nSupport des succès Retro Achievements :\n- Flycast intègre désormais un système de succès, de classements et de défis via Retro Achievements.\n \nRetour de force natif (Force Feedback) :\n- Une immersion accrue avec le support du retour de force pour les jeux d'arcade de course comme F355 Challenge, Initial D et 18 Wheeler.\n \nPacks de textures HD :\n- La communauté, notamment RomRevival, travaille sur des packs de textures remasterisés pour améliorer l'expérience visuelle.\n \nSupport des contrôleurs et VMU officiels :\n- Des solutions comme Dreamconn et VM2/VMUpro permettent d'utiliser des contrôleurs et VMU Dreamcast réels.\n- Une alternative moins chère utilisant un Pico Pi est en développement.\n \nCorrections des artworks de jeux :\n- La communauté travaille à compléter la base de données des artworks de jeux Dreamcast. Les utilisateurs peuvent contribuer en téléchargeant les artworks manquants sur TheGamesDB.\n \nComment commencer ?\nTéléchargez Flycast : Rendez-vous sur la page CI de Flycast pour obtenir les dernières versions.\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203430/in-multi-flycast-fait-le-bilan-sur-toutes-ses-dernieres-evolutions-1.png"
        }
    },
    "news_13": {
        "title": "[PS4/PS5] Que se passe-t-il avec le PSN en panne depuis plus de 10 heures",
        "content": "Depuis ce matin, cela fait plus de 10 heures, que le PSN est hors service, les accès PSN de la PS4 et de la PS5 ne sont plus fonctionnels, il est impossible de se connecter au PlayStation Network, et accessoirement de jouer en ligne. \n \nC'est une panne de grande ampleur qui empêche plusieurs millions de joueurs de profiter de leur jeu en ligne ou du PlayStation Store. La frustration est élevée, les joueurs payent pour y avoir accès.\n \nAu début le PSN a été signalé comme étant en maintenance, puis plus de 2 heures après PlayStation Japon a commenté l'incident en déclarant une panne. 3h00 après la panne, Sony a enfin modifié \"Ask PlayStation\", le service d'assistance pour reconnaitre le problème. \n \n\n \n \n \nMalheureusement cela tombe mal, en plein week-end, en début de vacances pour certains, et pour le moment cela dure, il est possible qu'on soit face à un hack ou une attaque DDOS. \n \nMerci Darkdogg93 pour l'information\n \n \nTout est là : https://status.playstation.com/fr-fr/\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203428/in-ps4ps5-que-se-passe-t-il-avec-le-psn-en-panne-depuis-plus-de-10-heures-1.png"
        }
    },
    "news_14": {
        "title": "[PS5] Specter et zi prévoient une formation sur les attaques des hyperviseurs",
        "content": "Comme vous le savez la conférence Hardware.io est surtout l'occasion pour de nombreux acteurs de se rencontrer et d'exposer leurs travaux, mais c'est surtout l'occasion durant 3 à 4 jours de se former sur la sécurité informatique.\n \nC'est pourquoi les développeurs Specter et Zi, qui pour information est co-fondateur de Dayzerosec, ont décidé de proposer une formation sur les attaques des hyperviseurs lors d'une présentation à la Hardwear.io. \n \n \n\n \n \nL'idée est avant tout de fournir aux étudiants une compréhension approfondie de l'architecture de virtualisation moderne et des moyens d'attaquer les hyperviseurs. Ces attaques mettront l'accent sur la machine virtuelle basée sur le kernel (KVM), la protection du kernel en temps réel sur Samsung Know (RKP), l'environnement d'exécution de l'hyperviseur Huawei (HHEE) et Microsoft Hyper-V. \n \nIl n'est donc pas question directement de la protection de la PS5, mais l'axe qui est pris à savoir les attaques sur les hyperviseurs, plus larges seront les connaissances, plus larges seront les attaques envisageables. \n \nLa formation aura lieu du 27 au 29 Mai 2025 à Santa Clara au Marriott, les séances se dérouleront de 9h00 à 17h30 et sont destinés uniquement aux participants de niveau intermédiaire à avancé. \n \nTout est là : hardwear.io\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203427/in-ps5-specter-et-zi-prevoient-une-formation-sur-les-attaques-des-hyperviseurs-1.jpg"
        }
    },
    "news_15": {
        "title": "[DS/3DS] L'émulateur NesDS se perfectionne en v2.0",
        "content": "Le développeur RocketRobz est ravi d'annoncer la sortie d'une nouvelle version de NesDS, l'émulateur de Nintendo Entertainment System (NES) pour Nintendo DS. \n \nCette mise à jour apporte son lot d'améliorations et de corrections de bugs pour une expérience de jeu encore plus fluide et fidèle.\n \nLes nouveautés de cette version :\n \nAmélioration de la compatibilité : Plus de jeux sont désormais parfaitement jouables, avec une meilleure gestion des graphismes et du son.\n \nOptimisation des performances : Les ralentissements ont été réduits, offrant une expérience plus stable, même sur les jeux les plus exigeants.\n \nCorrection de bugs : Plusieurs problèmes techniques ont été résolus, notamment des crashs occasionnels et des erreurs d'affichage.\n \nInterface utilisateur améliorée : Des ajustements ont été apportés pour rendre la navigation plus intuitive.\n \n \n\n \n \n \n \nChangelog v2.0 : \n \n- Initialement prévu pour une sortie pendant les vacances, le développeur nous informe avoir oublié de la publier à cause de son travail sur d'autres projets.\n \nInstallation pour les utilisateurs de TWLMenu++ :\n \n- Placer nesDS.nds dans sd:/_nds/TWiLightMenu/emulators/.\n \nChangelog :\n \n- De nombreuses améliorations par@FluBBaOfWard. (ex. corrections du mappeur, ajout de l'émulation du verrou de bus ppu, ajout de l'émulation du registre d'adresses et de données OAM.)\n- Émulation RP2C02 corrigée pour corriger l'arrière-plan dans Punch-Out .\n- Échelles retravaillées et préréglages ajoutés.\n- Correction du problème 3DS CIA essayant de démarrer Slot-1 au lieu de nesDS.\n \n \nTéléchargement : NesDS v2.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203397/in-ds3ds-lemulateur-nesds-se-perfectionne-en-v20-1.jpg"
        }
    },
    "news_16": {
        "title": "[PSP] Le Wifi WPA2 arrive sur la PSP grâce à un plugin",
        "content": "\nDe la nouveauté sur PSP, oui c'est possible en 2025, et pour cause, c'est l'arrivée de la prise en charge d'un nouveau système de cryptage de données Wifi, le WPA2-AES. A l'époque de la PSP, le Wifi avec cryptage WPA2-AES n'existait pas, de fait la console ne l'a jamais supporté. \n \nCette limitation est désormais levée, avec notamment le développeur Moment qui propose un tout nouveau plugin qui permet d'amener la connectivité réseau Wifi WPA2-AES. \n \nAppelé wpa2psp, ce plugin peut etre installé de manière permanente en modifiant le fichier TXT des plugins, ainsi cette connectivité fonctionnera dans tous les modes in-game, XMB et VSH.\n \n \n \n\n \n \n \nIl y a quelques spécifications : \n \n- Fréquence 2,4 GHz uniquement, fonctionne uniquement avec un WiFi en 2,4 GHz.\n- Si votre routeur utilise un seul SSID pour les réseaux 2,4 GHz et 5 GHz, vous devrez peut-être les séparer et connecter votre PSP au réseau 2,4 GHz.\n- WPA2 AES uniquement : Nécessite le chiffrement WPA2 avec AES (AES-CCMP).\n- Le chiffrement TKIP n'est pas pris en charge et ne fonctionnera pas.\n- Lorsque le plugin est activé, les chiffrements WEP et WPA ne fonctionneront pas.\n- Pour utiliser à nouveau WEP ou WPA, désactivez le plugin, et ils fonctionneront normalement.\n- Si votre routeur est configuré en mode mixte WPA2/WPA3, votre PSP pourrait avoir des difficultés à obtenir une adresse IP.\n- Essayez de configurer manuellement l'adresse IP au lieu d'utiliser le DHCP en mode [AUTO].\n \n \n \nTout est là : reddit.com\n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203392/in-psp-le-wifi-wpa2-arrive-sur-la-psp-grace-a-un-plugin-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS5] Kstuff a été porté sur les firmwares 5.xx (update)",
        "content": "D'un côté c'est un message de Zecoxao, de l'autre c'est une confirmation directe de EchoStretch qui annonce son intention de chercher les offsets pour les firmwares 5.xx pour kstuff. L'intention est bonne et louable, mais il semblerait que tout ne soit pas aussi simple qu'on voudrait y croire.\n \nLe développeur EchoStretch, qui travaille beaucoup sur la scène PS5, avec notamment des version personnalisée de Self Dumper, des correctifs Byepervisor, se penche sérieusement sur le portage de kstuff sur les firmware 5.xx de la PS5.\n \n \n\n \n \n \nIl semblerait qu'il ne manque pas grand chose pour y parvenir, de l'ouverture de quelques offsets, et de références utiles du script de portage de Sleirsgoevy, pour rappel kstuff permet d'exécuter des jeux sans avoir à modifier l'Hyperviseur de la PS5.\n \nL'autre confirmation vient de Zecoxao qui informe avoir partagé des bonnes pistes sur le kernel pour trouver les offsets sur les firmwares 5.xx, la seule chose qui reste à faire est d'implémenter nmap dans MAP_SELF avec les scripts de Sleirsgoevy.\n \n \n \n\n \n \n \nRappelons ceci, Sleirgoevy a proposé des outils de scripts pour faciliter le portage de kstuff sur les firmwares 3.00 à 4.51, au dessus il y a des références \"parasites\" qui complexifient le portage et le fonctionnement du payload kstuff. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203385/in-ps5-kstuff-bientot-porte-sur-les-firmwares-5xx-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203385/in-ps5-kstuff-bientot-porte-sur-les-firmwares-5xx-2.png"
        }
    },
    "news_18": {
        "title": "[Switch] Sudachi 1.0.14 est là",
        "content": "L'arrivée d'une nouvelle version de Sudachi ne se fait pas sans nouveautées, voilà que débarque la version 1.0.14, désormais disponible pour les plateformes Windows, Linux et Android. Cette mise à jour apporte plusieurs améliorations, corrections de bugs et nouvelles fonctionnalités pour enrichir votre expérience avec Sudachi, l'analyseur de texte japonais puissant et polyvalent.\n \nLe développeur Jarrod Norwell propose une mise à jour de Sudachi en version 1.0.14. On vous a déjà parlé, et c'est une première malgré les injonctions de Nintendo, le développeur continue le développement de l'émulateur. \n \n \n\n \n \n \nChangelog 1.0.14 : \n \n- Ajout de la prise en charge pour lancer l'écran de configuration initiale via -setup\n- Disponible uniquement sur Linux, macOS et Windows via le terminal ou Outils > Ouvrir la configuration initiale.\n- Pour le moment, seule une prise en charge partielle est disponible, mais elle sera améliorée à l'avenir.\n- Ajout de plusieurs fonctions manquantes pour permettre le lancement de l'écran de configuration initiale.\n- Correction d'un problème empêchant le démarrage de certains jeux récents.\n- Résolution d'un problème avec mm:u où Get et GetOld ne retournaient pas après avoir atteint la valeur minimale d'une session trouvée.\n- Début de la refonte de caps, caps:a et caps:su pour améliorer la précision.\n \nTéléchargement : Sudachi 1.0.14\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203379/in-switch-sudachi-1014-est-la-1.png"
        }
    },
    "news_19": {
        "title": "[WiiU] Cemu 2.6 disponible",
        "content": "La dernière version de Cemu, l'émulateur Wii U, vient d'être publiée par l'équipe en charge de son développement. Cette mise à jour apporte des corrections de bugs, des améliorations de performance et de compatibilité avec plusieurs jeux. Les utilisateurs peuvent télécharger la version directement depuis la page des releases : Cemu Releases. A titre d'information, cette version 2.6 est la pre-release sachant qu'elle est distribuée pour MacOS, Ubuntu, Windows x64 et Linux\n \nParmi les nouveautés :\n \n- Améliorations de stabilité : Résolution de plusieurs crashs et bugs rencontrés dans les versions précédentes.\n \n- Optimisations graphiques : Meilleure prise en charge des shaders et des effets visuels pour une expérience plus fluide.\n \n- Compatibilité étendue : Ajout du support pour de nouveaux jeux et corrections pour des titres déjà pris en charge.\n \n \n \n\n \n \n \nChangelog version 2.6 : \n \n \nExportation des sauvegardes : L'exportation des sauvegardes via le gestionnaire de titres ne plante plus lorsque le chemin d'exportation contient des caractères Unicode.\n \nCorrection d'une régression : Un problème dans les titres DS Virtual Console a été résolu (#1440).\n \nCorrection d'un bug : L'option de débogage des shaders (debug shader dumping) essayait d'écrire des fichiers dans le mauvais répertoire. Ce problème est maintenant corrigé.\n \nAmélioration du débogueur : Un menu contextuel (clic droit) a été ajouté à la vue désassemblage du débogueur PPC, et quelques petits bugs dans le débogueur ont été corrigés.\n \nChangement de backend pour HID/USB : Libusb est maintenant utilisé comme backend pour les périphériques HID/USB sous Windows (#1471).\n \nOptimisation de la mémoire Vulkan : Réduction du nombre d'objets d'échantillonnage (sampler objects) créés avec Vulkan. Cela diminue légèrement l'utilisation de la mémoire et évite les plantages sur les pilotes ayant une limite basse pour ces objets.\n \nAmélioration de la mise en cache des données d'index sur Vulkan : Cela peut apporter un très léger gain de performance dans certains jeux.\n \nCorrection de l'option --force-interpreter : L'option de ligne de commande --force-interpreter utilise maintenant toujours l'émulation CPU mono-thread comme prévu initialement.\n \n \n \nTéléchargement : Cemu 2.6 (Pre-release)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203371/in-wiiu-cemu-26-disponible-1.jpg"
        }
    },
    "news_20": {
        "title": "[PS5] LightningMods dévoile une nouvelle version de son store pour etaHEN 2.0b Pre-release",
        "content": "La scène du jailbreak PlayStation 5 est en effervescence, bon il faut avouer qu'on commence un peu à tourner en rond, mais LightningMods continue de vouloir faire bouger les choses, cette nuit il a dévoilé qu'ils ont réussi à localiser pourquoi kstuff (avec ou sans etaHEN) ne finissait pas son chargement tant que l'application du lecteur de disque n'était pas fermée, c'est pas grand chose, mais cela permettra d'améliorer son lancement sur ISO. Autre chose, hier il a dévoilé une nouvelle version de son store, spécialement conçue pour etaHEN 2.0b Pre-Release. Cette mise à jour marque une étape importante pour les utilisateurs de PS5 jailbreakées, offrant un accès simplifié à une multitude de homebrews, applications et outils personnalisés.\n \n \n\n \n \nQuoi de neuf dans cette version ?\n \nLa nouvelle version du store LightningMods apporte plusieurs améliorations et fonctionnalités clés :\n- Compatibilité avec etaHEN 2.0b : Optimisé pour fonctionner parfaitement avec la version préliminaire d’etaHEN, le store offre une expérience fluide et stable.\n- Interface utilisateur améliorée : Une interface plus intuitive et réactive facilite la navigation et la découverte de nouveaux contenus.\n- Contenu enrichi : Le store propose désormais une bibliothèque élargie de homebrews, de mods et d’utilitaires pour PS5, répondant aux besoins des joueurs et des développeurs.\n \nLes utilisateurs peuvent désormais profiter de mises à jour automatiques pour les applications et les outils disponibles sur le store. Pour rappel, etaHEN est une avancée majeure, c'est une version préliminaire du célèbre exploit pour PS5, permettant l’exécution de homebrews et de logiciels personnalisés. Avec cette version, les utilisateurs peuvent explorer de nouvelles possibilités sur leur console, et l’intégration du store LightningMods vient renforcer cette liberté en centralisant l’accès aux outils et applications.\n \nComment accéder au store ?\n \nPour profiter du nouveau store LightningMods, les utilisateurs doivent disposer d’une PS5 jailbreakée avec etaHEN 2.0b Pre-Release installé. Une fois l’exploit activé, le store peut être téléchargé et installé directement depuis la console, offrant un accès instantané à une multitude de ressources. \n \n \nTéléchargement : Store apps\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203353/in-ps5-lightningmods-devoile-une-nouvelle-version-de-son-store-pour-etahen-20b-pre-release-1.jpg"
        }
    }
}