{
    "news_1": {
        "title": "[PS5] PS5 Payload SDK supporte maintenant les firmwares 8.xx, 9.xx et 10.x",
        "content": "Le développeur John Törnblom a mis à jour PS5 Payload SDK en version 0.31. \n \nComme vous le savez, ce SDK a pour ambition de faciliter le portage et le développement de payloads qui pourront s'exécuter sur les consoles bénéficiant du loader ISO BD-JB ELF, mais aussi sur celles utilisant l'exploit \"ipv6 uaf\" basé sur le webkit, mais il bénéficie aussi des dernières trouvailles liées à Parse.\n \nAvec cette mise à jour 0.31, le développeur a introduit des fonctionnalités importantes comme le support des firmwares 8.xx, 9.xx et 10.0x, mais aussi des options plus spécialisés comme l'ajout de l'adresse de structure bus_data_devices telle que défini dans le code source de FreeBSD.\n \n \n\n \n \nChangelog : \n \n- kernel : ajout des offsets des firmwares 8.xx, 9.xx et 10.0x\n- ajout d'une adresse absolue à bus_data_devices\n- suppression du stacktrace automatique sur les signaux fatals\n- ajout de l'implémentation des threads c11 à partir de freebsd 11.4\n- réduction de la taille des fichiers des payloads\n \n \nTéléchargement : PS5 Payload SDK 0.31\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207068/in-ps5-ps5-payload-sdk-supporte-maintenant-les-firmwares-8xx-9xx-et-10x-1.jpg"
        }
    },
    "news_2": {
        "title": "[Switch] MissionControl supporte le dernier firmware 20.1.0",
        "content": "La vingt-huitième version officielle de MissionControl vient d'être mise en ligne par son développeur ndeadly, deux semaines après la version précédente, cette version vient rajouter le support du nouveau type de contrôleur Lic3 Pro, mais surtout le support du tout dernier firmware 20.1.0.\n \nMissionControl pour ceux qui le connaitrait pas est un module système personnalisé qui permet de profiter de contrôleurs Bluetooth tiers qui peuvent être utilisés de manière native sur la Switch, et tout cela sans dongle ni autre matériel externe.\n \n \n\n \n \nCette version 0.13.2 ajoute la prise en charge complète du firmware 20.1.0 et autorise un nouveau type de contrôleur officiel introduit dans le nouveau firmware. \n \n \nTéléchargement : MissionControl 0.13.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207067/in-switch-missioncontrol-supporte-le-dernier-firmware-2010-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS5] etaHEN 2.2B teasé par LightningMods",
        "content": "Le développeur LightningMods propose de découvrir ce que la prochaine version d'etaHEN qui intègrera de nouveaux raccourcis pour améliorer l'expérience utilisateur. Ce plugin est tout simplement similaire à GoldHEN sur PlayStation 4 de SiStr0, il intègre plusieurs fonctionnalités, notamment un serveur FTP, un serveur klog, ou encore PS5-kstuff.\n \nComme le montre LightningMods, une nouvelle fonctionnalité va être déployée, il s'agit de fonctions de raccourcis de contrôleurs, permettant aux utilisateurs un accès rapide aux menus du jeu sans l'interrompre. \n \nCette nouveauté permettra aux utilisateurs d'accéder directement aux menus cheats, Kstuff Toggle, le menu de la Toolbox ou encore aux menu webMAN, sans pour autant sortir des jeux en question.\n \nLe développeur faisant toujours très bien les choses, il propose un post ici ainsi qu'une vidéo de démonstration, en attendant la disponibilité officielle qui interviendra après la phase de tests. \n \n \n\n \n \n \n \n \n",
        "images": {}
    },
    "news_4": {
        "title": "[Switch] hekate v6.3.1 &#38; Nyx v1.7.0 disponibles",
        "content": "Le développeur CTCaer propose de découvrir une nouvelle version d'Hekate et de Nyx, il s'agit clairement d'une version de maintenance qui a pour ambition d'apporter le support du tout dernier firmware 20.1.0. \n \nComme vous le savez, Hekate est un custom bootloader largement utilisé pour la Nintendo Switch, Hekate sert de point d'entrée pour de nombreux utilisateurs souhaitant explorer les capacités personnalisées de leur console Nintendo Switch. Depuis sa création, il a été utilisé pour lancer des homebrews, des backups de jeux, et d'autres logiciels personnalisés, offrant ainsi aux joueurs une expérience différente de celle prévue par Nintendo.\n \n \n\n \n \nSa mise à jour avec l'arrivée du firmware 20.1.0 est toujours nécessaire pour de nombreux homebrews.\n \n \nTéléchargement : hekate v6.3.1 & Nyx v1.7.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206987/in-switch-hekate-v631-nyx-v170-disponibles-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] Atmosphère 1.9.1 disponible",
        "content": "Quelle réactivité de la part de SciresM qui propose déjà la mise à jour d'Atmosphere en version 1.9.1, il s'agit de la quatre-vingt-deuxième version officielle d'Atmosphère.\n \nCette version 1.9.1 intègre HBL 2.4.4 et hbmenu 3.6.0.\n \n \n\n \n \nLes éléments suivants ont été modifiés depuis la dernière version :\n \n- Un support de base a été ajouté pour le firmware 20.1.0.\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \nEt ce qui suit a été modifié dans la version 1.9.0 :\n \n- Un support de base a été ajouté pour le firmware 20.0.0.\n- La console devrait démarrer et Atmosphère devrait être pleinement fonctionnelle. Cependant, tous les modules n'ont pas été entièrement mis à jour pour refléter les dernières modifications.\n- Il ne devrait rien y avoir de visible pour l'utilisateur en résultant, mais cela sera résolu dans une future mise à jour d'Atmosphère.\n- La même action que celle de la version 18.0.0 est toujours en cours ( je suis convaincu qu'elle sera finalement résolue. Quelqu'un m'a dit y travailler).\n- Il n'y a plus (à ma connaissance) d'éléments 19.0.0 en suspens.\n- Remarque : en raison des modifications apportées aux logiciels Nintendo dans la version 20.0.0, il y a environ 10 Mo de mémoire en moins disponible pour les modules système personnalisés.\n- Nous ne pouvons voler qu'un maximum de 14 Mo du pool d'applets, contre 40 Mo auparavant.\n- Pour compenser cela, ams.mitm l'utilisation du tas de a été réduite de 20 Mo.\n- Pour faciliter cela, un nouveau module d'aide ( memlet) a été ajouté, afin que la mémoire puisse être temporairement volée pendant le processus de construction du romfs.\n- Espérons que cela entraînera relativement peu de casse, mais il est possible que les mods utilisateur qui remplacent un nombre extrêmement important de fichiers dans The Legend of Zelda: Tears of the Kingdom ne fonctionnent plus.\n- Si vous êtes concerné par ce problème, vous verrez « Data abort (0x101) » lorsque vous tenterez de lancer le jeu avec des mods.\n- Si cela se produit, veuillez nous contacter sciresmsur Discord pour partager votre rapport d'erreur binaire. Cependant, certains problèmes peuvent être impossibles à résoudre. (Je m’excuse sincèrement si le problème est impossible à résoudre, mais j’ai été obligé de faire des compromis ici, et je pense que c’est le meilleur équilibre à trouver)\n- exosphère a été mis à jour pour intégrer les derniers changements du moniteur sécurisé.\n- mesosphère a été mis à jour  \n- loader a été mis à jour pour refléter  les derniers changements .\n- pm a été mis à jour pour refléter les derniers changements .\n- ncm a été partiellement mis à jour pour refléter les derniers changements .\n- erpt a été mis à jour pour refléter les derniers changements .\n- Atmosphère a été mis à jour pour utiliser GCC 15/newlib (dernières versions de devkitA64/devkitARM).\n- Un certain nombre d'améliorations ont été apportées au moteur de triche dmnt.\n- De nouvelles instructions ont été ajoutées et des instructions ont été mises à jour pour des fonctionnalités améliorées/nouvelles.\n- Veuillez consulter les documents pour plus de détails - merci@tomvita!\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \nTéléchargement : Atmosphere\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206986/in-switch-atmosphere-191-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[Switch] Firmware 20.1.0 disponible pour préparer l'arrivée de la Switch 2",
        "content": "Nintendo vient de mettre en ligne un nouveau firmware à destination de la Switch, l'ambition étant d'apporter quelques fonctionnalités audiovisuelles, et de préparer également l'arrivée de la Switch 2. \n \n \n\n \n \n \nQuelques changements liés aux thèmes ont été apportés dans la version 20.1.0 :\n \n- Les thèmes « Basic White » et « Basic Black » ont été renommés en « Basic Light » et « Basic Dark ».\n- L'applet Nintendo Switch Online prend désormais en charge le thème Basic Dark.\n \nNintendo précisé que pour transférer des données de la Switch vers la Switch 2 via le local, vous devez mettre à jour vers la version firmware 20.1.0.\n \nA noter que comme vous vous l'imaginez, les développeurs sont déjà sur le pont pour mettre à jour leur proposition comme Atmosphere, Hekate ou Nyx. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206985/in-switch-mise-a-jour-firmware-2010-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[Switch] SaltyNX 1.2.6 et FPSLocker 2.1.5 disponibles",
        "content": " \nLe développeur Masagrator a une nouvelle fois travaillé ses propositions pour la Nintendo Switch, il dévoile en effet SaltyNX 1.2.6 et FPSLocker 2.1.5, deux nouvelles moutures de ses outils qui lui permettent d'offir de la nouveauté et des corrections de bugs. Pour rappel, SaltyNX est un processus en arrière-plan qui permet l'injection et la modification de code. Il est utilisé par divers outils tels que ReverseNX-Tool, ReverseNX-RT, et Status Monitor en conjonction avec NX-FPS, UnityGraphics, et plusieurs mods de Smash. SaltyNX est basé sur shinyquagsire23 et inclut de nombreuses améliorations l'expérience utilisateur (QoL) ainsi que le support des plugins.\n \n \n\n \n \nSaltyNX 1.2.5 :\n \nAjout d'une option pour forcer le jeu à se mettre en veille personnalisée dans le menu d'accueil (nécessite FPSLocker 2.1.3+).\n \nSaltyNX 1.2.6 :\n \n- Lire les paramètres ancrés à partir du fichier ini au lieu du vidage EDID (il s'agit d'une étape nécessaire pour introduire un overclocking approprié de l'affichage ancré à l'avenir).\n- Nécessite FPSLocker 2.1.5+ pour la prise en charge, les anciens paramètres seront remplacés par le vidage EDID brut\n- Passe à la lecture de l'EDID avec la libnx déjà corrigée\n \nTéléchargement : SaltyNX 1.2.6\n \n \n \nFPSLocker 2.1.5: \n \n- Stocke les paramètres ancrés dans un fichier ini au lieu d'un vidage EDID (il s'agit d'une étape nécessaire pour introduire un overclocking approprié de l'affichage ancré à l'avenir)\n- Utilisez SaltyNX 1.2.6+ pour un support approprié\n- Imprime le nom de configuration de votre écran dans les paramètres Docked\n- Pour ceux qui souhaitent savoir quelle configuration correspond à quoi lors de l'exploration des fichiers, j'ai ajouté la clé « tvName ». Sa valeur est modifiable et sera conservée. N'utilisez pas d'espaces ; ils seront supprimés lors de vos prochaines modifications.\n \nFPSLocker 2.1.4/3:\n \n- Amélioration des lectures « Taux de rafraîchissement maximal signalé » dans les paramètres d'affichage ancré.\n- Ajout « Arrêter le jeu non focalisé » dans les paramètres avancés (pour fonctionner correctement, il nécessite SaltyNX 1.2.5+).\n- Certains jeux ne sont pas suspendus lorsque votre Switch est dans le menu d'accueil (par exemple, Tales of Graces f). Activer cette option déplace le thread responsable de l'affichage des images dans une boucle infinie lorsque vous êtes dans le menu d'accueil. L'activation de cette option peut entraîner divers problèmes selon le jeu ; veillez donc à ne pas l'utiliser à la légère.\n \n \n \nTéléchargement : FPSLocker 2.1.5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206958/in-switch-saltynx-126-et-fpslocker-215-disponibles-1.png"
        }
    },
    "news_8": {
        "title": "[Multi] ScummVM v2.9.1 disponible",
        "content": " \n5 mois après la version précédente, voilà que débarque une nouvelle mouture de ScummVM qui est maintenant proposé en v2.9.1. Comme d'habitude, plusieurs moteurs et plateformes ont reçu leur juste part de corrections de bugs et d'améliorations : AGI, AGS, Asylum, BAGEL, Bladerunner, Hopkins, MADS, NGI, SCI, SCUMM, Sky, Sword1, Tetraedge, Tinsel, Tucker, TwinE et TWP.\n \nLes porteurs sont également partis à la chasse aux bugs, la Nintendo 3DS dispose désormais d'une interface graphique correctement affichée si elle est configurée pour utiliser uniquement l'écran supérieur.\n \nAndroid propose désormais une option permettant de sauvegarder et de restaurer votre fichier de configuration et vos sauvegardes de jeu. La grande majorité des anciens appareils Android bénéficieront de performances accrues grâce aux optimisations ARM NEON, désormais activées par défaut. De plus, le jeu Beneath a Steel Sky ne plante plus dès l'intro !\n \nLe portage Atari a bénéficié de quelques correctifs internes au backend, à l'interface utilisateur et au son. \n \n \n\n \n \n \nFaisons le tour du changelog pour comprendre les améliorations de cette version 2.9.1 :\n \n \n \nAGI:\n \nAjout de la prise en charge de la première version de la carte de Noël 1986 avec des publicités pour le matériel Tandy.\nCorrection de nombreux bugs graphiques et amélioration de la réactivité dans Mickey's Space Adventure, Winnie l'ourson dans la forêt des rêves bleus et Troll's Tale.\nLes parties sauvegardées dans Mickey's Space Adventure sont désormais restaurées sur la planète sur laquelle elles ont été sauvegardées au lieu de la Terre.\n \nAGS :\n \nAjout du support officiel pour Old Skies et Rosewater.\nAjout de la prise en charge de la variation de vitesse du clip sonore, utilisée dans certains jeux pour ralentir la musique de fond ou d'autres effets audio.\nCorrection de certains changements de volume audio qui n'étaient pas déclenchés dans certaines situations (par exemple, baisse automatique du volume de la musique pendant le commentaire du développeur ou lorsqu'un personnage parle, dans la série Blackwell).\nEntrées de détection ajoutées/mises à jour pour divers jeux AGS.\n \nAsile:\n \nCorrection d'un crash dans le menu principal du Sanitarium, lors du déplacement du curseur vers la partie supérieure de l'écran.\n \nBAGEL:\n \nCorrection d'un crash lors de l'insertion de la carte de crédit dans la machine à sous.\n \nBlade Runner :\n \nMise à l'échelle 2x fixe et prise en charge plein écran dans la démo non interactive.\nCorrection des fuites de mémoire qui pouvaient entraîner des problèmes de mémoire insuffisante sur certains ports.\nCorrection d'un problème de recherche de chemin qui pouvait provoquer un verrouillage logiciel dans certains cas rares.\n \nHopkins :\n \nCorrection d'un crash lors de l'utilisation de l'ascenseur pour accéder à d'autres étages.\n \nFOU :\n \nCorrection de l'inventaire Rex Nebular et des interfaces utilisateur de la zone verbale qui ne se mettent pas à jour.\n \nIGN :\n \nChargement optimisé des ressources de jeu, améliorant les performances sur Android.\n \nSCI:\n \nCorrection du crash du CD KQ6 lors d'une conversation avec Rotten Tomato depuis la fenêtre d'inventaire en mode haute résolution. (Bug ScummVM 2.9.0)\nCorrection du problème de saut de l'écran titre sur Amiga KQ4. (Bug ScummVM 2.8.0)\nCorrection du crash de QFG4 v1.0 dans la Guilde des voleurs (bug ScummVM 2.1.0).\nCorrection d'un bug de messages disparaissant toutes les 18,2 minutes dans BRAIN1, LSL5 et SQ1. (Bug du jeu original)\nCorrection du bug d'introduction de SQ5 qui n'apparaissait pas sur les machines plus rapides qu'un 386. (Bug du jeu original)\nCorrection du blocage de LSL1 à l'entrée du casino. (Bug du jeu original)\nCorrection d'un crash de LSL6 à l'entrée de l'hôtel. (Bug du jeu original)\nCorrection du problème de disparition du tramway LSL6-HIRES après le redémarrage du jeu. (Bug du jeu original)\nCorrection du problème d'affichage du curseur d'aide LSL6. (Bug du jeu original)\nCorrection du blocage du QFG1 EGA lors d'un trébuchement sur un fil de déclenchement. (Bug du jeu original)\nCorrection du blocage du KQ1 en cas de noyade dans une grotte. (Bug du jeu original)\nCorrection du problème de blocage du téléphone au cinquième jour de GK1 dans toutes les versions du jeu, quelle que soit la vitesse. (Bug du jeu original)\nCorrection d'un motif de tramage bleu incorrect dans les images vectorielles EGA. (Tous les outils SCI depuis SCI Decoder en 1992)\n \nRACINE :\n \nRestauration du comportement de ScummVM 2.7.0 permettant à tous les titres EGA DOS v2-v4 (c'est-à-dire Maniac Mansion à Monkey1) d'être à nouveau joués avec la palette Amiga, en utilisant l'option de jeu en mode Rendu.\nCorrection de la plupart des pistes iMUSE silencieuses dans le Booty Store, dans Monkey2.\nCorrection d'un problème de précision concernant le positionnement de certains personnages dans SCUMMv2 et versions antérieures. Ce problème survenait par exemple lors d'une interaction avec le fidèle à l'aéroport de Zak McKracken (toutes les versions sauf celle de FM-TOWNS).\nCorrection du mode multijoueur de Moonbase Commander qui faisait planter les invités au démarrage du jeu.\nCorrection des pops dans les effets sonores de Sega CD Monkey1.\nSauvegarde fixe sur une sauvegarde existante dans COMI.\nCorrection des messages MIDI excessifs envoyés pendant la réduction du volume de la musique iMUSE (par exemple dans l'intro de Sam & Max), ce qui pouvait entraîner un discours ralenti et brouillé lors de l'utilisation d'un matériel MIDI plus ancien et réel.\nCorrection d'un crash d'iMUSE lors du chargement d'une ancienne sauvegarde avec un fondu sonore en cours.\nCorrection de l'amélioration Jolly Roger pour Monkey1 ; l'activation de cette amélioration empêcherait ce drapeau d'apparaître alors qu'il ne devrait plus être visible, mais le correctif était incomplet dans certaines versions de disquettes VGA.\nCorrection de l'amélioration de la fumée de cigare de Smirk dans Monkey1 FM-TOWNS.\n \nCiel:\n \nCorrection d'un crash dans l'intro de Beneath a Steel Sky sur certaines plateformes, comme Android.\n \nÉpée 1 :\n \nProblème d'équilibre audio corrigé lors de l'utilisation de l'option exécutable Windows.\n \nTétraedge :\n \nPrise en charge améliorée du rendu OpenGL par rapport au rendu logiciel, empêchant le moteur de générer des erreurs sur Android et certaines autres plates-formes.\n \nClinquant:\n \nCorrection du problème de menu de sauvegarde/chargement du Disque-monde devenu inaccessible.\n \nTucker :\n \nCorrection du saut des cinématiques lorsque la touche Échap est mappée.\n \nFicelle:\n \nCorrection d'un crash lors du redémarrage d'un jeu à partir du lanceur une deuxième fois.\nCorrection du problème d'appui sur la barre d'espace en mode normal qui ne déclenche pas l'action Utiliser/Parler.\nMouvement fixe du pingouin méca.\nProblèmes liés au son résolus.\n \nTWP:\n \nAjout d'un message d'erreur lors de la tentative de lecture de Thimbleweed Park sur des plates-formes ne prenant pas en charge OpenGL avec des shaders.\nPort 3DS :\n \nCorrection du problème de rendu incomplet de l'écran supérieur dans certains cas.\n \nPort Android :\n \nAjout d'une fonctionnalité permettant aux utilisateurs de sauvegarder et de restaurer leur configuration et leurs sauvegardes.\nPrise en charge NEON activée par défaut, ce qui se traduit par de meilleures performances pour la grande majorité des anciens appareils Android.\nNous avons contourné un bug dans ARMv7a Android 6.0 et versions antérieures, qui pouvait entraîner l'absence de certaines options de jeu, par exemple.\nAugmentation de l'allocation de pile pour le thread Java Android, bénéficiant aux moteurs de jeu qui utilisent beaucoup la pile.\n \nPort Atari :\n \nEnvoi fixe des messages MIDI SysEx.\nCorrection d'un crash et d'un son déformé avec certains paramètres audio.\nProblèmes de performances résolus avec les jeux SCI32 comme Phantasmagoria ou KQ7.\nDivers correctifs et optimisations de l'interface utilisateur graphique / du backend.\nPort iOS/iPadOS :\n \nCorrection de l'échec de la vérification de l'existence de la police sonore Fluidsynth avec les systèmes de fichiers sandboxés.\n \nPort macOS :\n \nCorrection du problème de démarrage de ScummVM lorsque les paramètres du moniteur ne sont pas définis sur « Millions de couleurs », sur les anciennes versions de macOS.\nPrise en charge fixe des CD audio lors de la lecture à partir de disques originaux sur Snow Leopard et versions antérieures.\n \nPort Windows :\n \nPrise en charge FLAC restaurée dans le port Windows 9x.\n \n \n \nTéléchargement : ScummVM\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206957/in-multi-scummvm-v291-disponible-1.jpg"
        }
    },
    "news_9": {
        "title": "[Switch] Sphaira 0.11.1 disponible",
        "content": " \nLe développeur ITotalJustice a dévoilé il y a quelques jours une version majeure de Sphaira, la version 0.10.0 qui a successivement été mis à jour en 0.10.1 puis 0.10.2 et 0.10.3. Rappelons que le développeur propose sa solution de remplacement du hbmenu intégrant des fonctionnalités inédites pour la Switch, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \n \n\n \n \nChangelog 0.10.0 : \n \n- Mise à jour pt.json  \n- Mise à jour zh.json  \n- Ajout des options de mise en page (liste, icônes, grille) à tous les menus basés sur une grille (homebrew, jeux, appstore).\n- Elimination des bulles.\n- Correction de la build pour gcc 15.\n- haze (mtp) s'exécute désormais sur son propre thread, plutôt que sur le thread principal.\n- Ajout des options d'activation de l'installation sysmmc / emummc, pour permettre l'installation à basculer selon la configuration.\n- [menu des jeux] le chargement des données de contrôle s'exécute sur son propre thread, il ne bloque pas le thread principal. permet un défilement fluide comme le menu d'accueil de Nintendo.\n- [menu des jeux] sur fw20+, sphaira analyse manuellement les données de contrôle, plutôt que d'utiliser ns. l'analyse manuelle prend 20 à 40 ms, ce qui est plus rapide que ms qui peut prendre 50 à 500 ms.\n- [Menu des jeux] Sur FW19 et versions antérieures, si les données de contrôle ne sont pas dans le cache NS, Sphaira les analyse manuellement, car il est deux fois plus rapide que NS. Vous pouvez constater cette rapidité en chargeant le - menu de la carte de jeu : il analyse tout manuellement et charge la carte de jeu plus rapidement que le menu d'accueil.\n- optimisation du chargement des méta-thèmes.\n- [gc menu] essaie de charger les données de contrôle à partir du cache ns avant le chargement manuel.\n- Correction de l'échec de l'installation lors de la configuration si prod.keys n'est pas trouvé. Merci à Marulv pour son aide au débogage de ce problème.\n- N'échouera pas si le contrôle nca ne peut pas être analysé pendant l'installation, car cela peut dépendre d'un ticket pas encore installé.\n- [menu jeux] ajouter le vidage de jeu.\n- [menu jeux] ajouter un transfert de jeu USB (switch 2 switch).\n- Ajout de la prise en charge des emplacements de téléchargement personnalisés (http, ftp, webdav, etc.).\n- [menu des jeux] ajout de la prise en charge du vidage du jeu vers un emplacement de téléchargement personnalisé.\n- [navigateur de fichiers] ajoute la prise en charge du téléchargement de fichiers/dossiers vers des emplacements de téléchargement personnalisés.\n \nChangelog 0.10.1 : \n \n- Correction du dump de la carte SD dû à la non-création du chemin de sortie.\n \nChangelog 0.10.2 : \n \n- Ajout de la langue ukrainienne par@rashevskyvdans #139\n- Correction du problème de mise à jour du menu hb à la sortie en raison d'une comparaison de chaîne défectueuse.\n \nChangelog 0.10.3 : \n \n- Correction d'un crash potentiel lors de la tentative de chargement d'une icône nro si elle avait une entrée d'actif non valide.\n- Patchs Pt par ninstar\n- Correction de la gestion des noms de fichiers Unicode dans usb_install_pc.py par DCNick3\n \nTéléchargement : Sphaira 0.10.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206897/in-switch-sphaira-0103-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[Multi] PS Multi Tools v15.5 disponible",
        "content": " \nLe développement de PS Multi Tools continue et son développeur SvenGDK nous propose de découvrir la version 15.4 de son outils multifonctions. \n \nConcernant les nouveautés de cette version, il a ajouté notamment Avatar Changer v1.00 de Lapy, ou encore les dernières mises à jour d'Itemzflow, etaHEN, Kstuff ou WebSRV. \n \n \n\n \n \nPas de grandes nouveautés côté PS4, mais par contre du neuf pour la PS3 avec des fonctionnalités de renommages facilitées, la dernière version MultiMAN Mod 04.85.01, de webMAN Mod 1.47.48i ou encore de nombreuses fonctions liés à Evilnat Cobra 8.5 PEX 4.92. \n \n\n \n\n \n\nInternal Changes :\nReplaced Rijndael with Aes\nReplaced MD5CryptoServiceProvider (currently unused)\nAdded new ISOEncryption property for PS3 backups\nCleaned up Utils\nNew ISO Tools icons\nReplaced remaining WebClient with HttpClient in\nPKGBrowser\nPPPwner\nPKGExtractor\nPSVPFSTools\nPSXMainWindow\nPSXAdvancedEditor\nThe PS3 & PS5 Backup Library now loads the backup files in a Task instead of BackgroundWorker\n \nPS3 Updates :\nNew Batch Rename Utility\nRename multiple files or folders with a single click\nFilter by renaming only folders or files\nFilter by renaming only ISO/PKG files or both\nSelect a predefined scheme or use your own\nAvailable scheme words: \"GAMETITLE\", \"GAMEID\", \"REGION\" without/with \"[]\" or \"()\" around the words\nCustom examples:\n[GAMEID] GAMETITLE (REGION)\nGAMETITLE-[GAMEID] (REGION)\nRenaming folders may not always work, an admin prompt will appear to force renaming\nThe Backup Library now shows if a locally loaded PS3 ISO is encrypted/decrypted\nAdded new context menu option to decrypt a selected encrypted PS3 ISO (ISO Tools -> Decrypt)\nPS3 ISO Tools GUI updated\nAdapted to system theme and re-arranged all controls\nNew option to decrypt an ISO file\nAll operations now show a waiting cursor and disable the interface until the operation is done\nAdded new downloads\nMissing KEY & DKEY downloads\nMultiMAN MOD 04.85.01\nRetroArch CE (WebMAN MOD) Edition download\nEvilnat Cobra 8.5 [PEX] 4.92 CFW\n[PEX]\n[PEX] [OC]\n[PEX] [noBD]\n[PEX] [noBT]\n[PEX] [noBD]+[noBT]\nUpdated webMAN MOD download 1.47.46b -> 1.47.48i\nUpdated ps3netsrv download 20240210 -> 2025050\nUpdated prepISO, PS2 Classics Launcher, PS2Config, PSP Minis Launcher & PSP Remasters Launcher to latest 1.47.48 release\n \nPS5 Updates :\nAdded new downloads\nAdded Avatar Changer v1.00 by Lapy\nUpdated Downloads\nItemzflow by LightningMods v1.09 -> v1.10\netaHEN by LightningMods v2.0b -> v2.1b\nkstuff by sleirsgoevy & EchoStretch (3.XX - 7.XX) v1.4 -> v1.5\nkstuff-Toggle by EchoStretch v0.1 Beta -> v0.2 Beta\nWebSrv by john-tornblom v0.22 -> v0.23.1\n \nFixes :\nFixed a possible crash in the PARAM.SFO Editor when checking/unchecking Bootable in the PSP tab\nFixed getting the output of PS3 ISO tools\nFixed the ISO Tools context menu in the PS3 Backup Library\nFixed possibility to Play/Stop the soundtrack of ISO backups in the PS3 Backup Library\n\n \n\n \n\n \nEdit 23.05.25\n \nTéléchargement : PS Multi Tools v15.5 \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206843/in-multi-ps-multi-tools-v154-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] PS5 BDJ HEN Loader v2.0b disponible",
        "content": "Comme nous venons de le voir, le développeur Viktorious-x a intégré la version 2.0b de PS5 BDJ HEN Loader dans la version 1.16 de PS5 BDJB Modified ISOs, mais de quoi s'agit-il ? \n \nPS5 BDJ HEN Loader permet le chargement automatique d'etaHEN et/ ou de Kstuff depuis le lecteur blu-ray de la PS5, et cela sans avoir à quitter manuellement le lecteur de disque. \n \nC'est une évolution importante car tout se fera automatiquement, même s'il arrive que l'écran d'accueil reste bloqué après la fermeture du lecteur de disque. Dans ce cas, attendez que la notification « Lecteur de disque a été arrêté » s'affiche, cela peut prendre quelques secondes.\n \nDans le même ordre d'idée, il peut arriver que le lecteur de disque plante à la fermeture, vous pouvez alors rencontrer un kernel panic ou un message indiquant qu'un problème est survenu avec ce jeu ou cette application. Dans ce cas, cliquez simplement sur OK et tout devrait se charger correctement.\n \n \n\n \n \nConfiguration \n \nIl existe plusieurs configurations que vous pouvez utiliser :\n \n1. Par défaut : etaHEN sera chargé à partir du disque et vous n'avez rien à modifier.\n2. etaHEN uniquement : Copiez un fichier etaHEN.bin à la racine d'une clé USB (priorité 1) ou dans le répertoire /data/ (priorité 2) sur la PS5, et il sera chargé à la place de celui du disque .\n3. Kstuff uniquement : identique à ci-dessus, mais avec kstuff. Copiez kstuff.elf à la racine d'une clé USB (priorité 1) ou dans le répertoire /data/ (priorité 2) de la PS5, et il sera chargé à la place de etaHEN .\n4. Combinaison : placez etaHEN.bin et kstuff.elf à la racine d'une clé USB (priorité 1) ou dans le répertoire /data/ (priorité 2) de la PS5, puis un fichier no_kstuff à la racine de la clé USB ou dans /data/etaHEN/ . EtaHEN sera alors chargé, suivi de kstuff.\nIl est également possible qu'etaHEN et kstuff soient placés à des emplacements différents. Par exemple, etaHEN peut être sur la clé USB et kstuff dans le répertoire /data/.\n \n \nChangelog 2.0b :\n \n- Une fonction de fermeture automatique du lecteur de disque est désormais disponible pour tous les firmwares. Plus besoin de quitter le lecteur, tout se fera automatiquement.\n- De plus, a été ajouté la possibilité de charger etaHEN et/ou Kstuff depuis plusieurs chemins. - Publication du code source du projet \n- Viktorious_x intégrera également cela dans sa prochaine version iso  \n- Compilé avec ps5-payload-sdk v0.30 pour le ps5-jar-loader v4.1.1 de hammer-83.\n \n \nTéléchargement : PS5 BDJ HEN Loader v2.0b\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206769/in-ps5-ps5-bdj-hen-loader-v20b-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[PS5] PS5 BDJB Modified ISOs v1.16 disponible",
        "content": "Le développeur Viktorious-x propose une nouvelle version de sa solution PS5 BDJB Modified ISOs qui est maintenant livré en v1.16.\n \nDe nombreux changements ont été introduits dans cette version comme la mise à jour de BDJ Hen Loader de BenNox_D, cela permet d'ajouter la fermeture automatique pour tous les firmwares ou encore de nouvelles options permettant de charger etaHEN ou Kstuff à partir de plusieurs chemins. \n \nUmtx1 a gagné en stabilité, bien qu'il se lance un peu plus lentement cela permet d'accroitre son taux de réussite, et Websrv a été mis à jour, il est possible de trouver tout cela dans le changelog ci-dessous. \n \n \n\n \n \n \nChangelog v1.16 : \n \n \n- Ajout du chargeur BDJ Hen Loader mis à jour par BenNox_ D\n \nVoici les nouvelles fonctionnalités de ceci :\n \n- Ajout de la fermeture automatique pour tous les firmwares, après avoir exécuté un pipeline contenant etahen, il se fermera automatiquement au lieu de devoir le fermer manuellement - par BenNox_ D\n \n- Ajout de l'option permettant de charger etaHEN et/ou Kstuff à partir de plusieurs chemins par BenNox_ D\n \n- Umtx1 est devenu un peu plus lent, mais il est désormais plus stable.\n \n- Corrections de bugs/stabilité\n \n- Websrv mis à jour vers la version 0.23.1 - par John Tornblom\n \nComme tout cela est assez expérimental, veuillez comprendre que des kernel panics peuvent survenir.\n \n \nTéléchargement :  PS5 BDJB Modified ISOs v1.16\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206768/in-ps5-ps5-bdjb-modified-isos-v116-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[PS4/PS5] Kstuff Toggle 0.2 Beta et Homebrew Dump Runner v0.01 d'EchoStretch",
        "content": "Il y a quelques heures, le développeur EchoStretch a mis en ligne Homebrew Dump Runner mais également une nouvelle mouture de la Kstuff Toggle. \n \nHomebrew Dump Runner \n \nSous ce nom se cache un nouvel utilitaire permettant \" d'exécuter des jeux et des homebrews sur votre PS5 à l'aide des payloads Kstuff, Websrv et Homebrew Launcher \" .\n \n \n \nInstallation et lancement\n \nCopiez votre dossier homebrew dans :\n/data/homebrew/\n/mnt/usb#/homebrew/ (remplacez #par votre numéro USB, par exemple, usb0, usb1, etc.)\n \nDans le dossier homebrew , ajoutez :\n \ndump_runner.elf\nhomebrew.js\n \nInstallez le Homebrew Launcher et envoyez le payload Websrv à votre console :\nWebsrv v0.23.1\n \nOuvrez le loader Homebrew.\n \nUne fois la clé USB branchée, votre jeu homebrew devrait apparaître.\nSélectionnez un jeu homebrew et lancez-le.\n \n \n\nTéléchargement : Homebrew Dump Runner 0.01\n \n \n \n\n\n \n \nKstuff Toggle \n \nLa seconde information est qu'EchoStretch dévoile la version 0.2 de Kstuff Toggle, toujours proposé en Bêta. \n \nChangelog v0.2 : \n \n\nOption 1: Juste sysentvec\nOption 2: Juste sysentvec_ps4\nOption 3: Les 2\n\n \nTéléchargement :  kstfuff toggle v0.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206756/in-ps4ps5-kstuff-toggle-02-beta-et-homebrew-dump-runner-v001-dechostretch-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] mais aussi SaltyNX, FPSLocker, et SwitchLayoutEditor",
        "content": " \nSecond tour des nouveautés qui concernent la Switch, nous le devons aux développeurs masagrator et FuryBaguette qui propose respectivement les mises à jour de FPSLocker, SaltyNX et SwitchLayoutEditor, l'idée est là aussi d'apporter avant tout le support de la branche firmware 20.0.0, cela intègre bien entendu le tout dernier firmware 20.0.1. \n \nFPSLocker / SaltyNX\n \nLe développeur masagrator a mis à jour FPSLocker et SaltyNX, ils partagent d'ailleurs le même changelog.\n \n \n\n \nChangelog : \n \n- Réduction de la taille de Core32 de 15 % et de Core de 35 %, ce qui nous permet de faire en sorte que sysmodule prenne 64 Ko de RAM en moins\n- Autorisation de la modification de la quantité de tampons dans les jeux Vulkan (nécessite FPSLocker 1.2.2+)\n- Correction d'un problème avec certains jeux surdéclarant des images (120 au lieu de 60), comme Hades\n- Correction d'un problème où très peu d'unités Erista présentaient des saccades d'image constantes et les temps de chargement augmentaient depuis la version 1.2.0\n \nTéléchargement : FPSLocker / SaltyNX\n \n \n \nSwitchLayoutEditor\n \nL'éditeur SwitchLayoutEditor qui pour rappel a pour but de simplifier et de rendre plus accessible la création de thèmes (et de layouts) pour la Nintendo Switch a aussi été upgradé. \n \n \n\n \n \nCette nouvelle version implémente les modifications nécessaires à la prise en charge des différences de disposition pour le firmware 20.0. Si vous avez utilisé l'une des versions précédentes pour créer des dispositions 20.0, il est possible qu'elles ne fonctionnent pas correctement. \n \nTéléchargement : SwitchLayoutEditor v16\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206743/in-switch-mais-aussi-saltynx-fpslocker-et-switchlayouteditor-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1206743/in-switch-mais-aussi-saltynx-fpslocker-et-switchlayouteditor-1.png"
        }
    },
    "news_15": {
        "title": "[Switch] NXMP, SwitchThemeInjector, NXThemesInstaller, SysDVR à jour",
        "content": " \nPremier tour des nouveautés des homebrews et logiciels mis à disposition pour la Nintendo Switch, les développeurs ont travaillé leur solution pour y apporter des mises à jours. \n \nSysDVR 6.2.1 \n \nLe développeur exelix11 offre la v6.2.1 de SysDVR, cette version prend en charge l'arrêt et le démarrage dynamiques du module système SysDVR sans redémarrage de la console. Cette fonctionnalité devrait permettre de réduire l'impact des nouvelles limites de mémoire ajoutées au firmware 20.0.\n \nCette fonctionnalité est disponible à la fois dans les paramètres homebrew et pour une utilisation par les gestionnaires de modules système tiers via le fichier toolbox.json .\n \nTéléchargement : SysDVR 6.2.1\n \n \n \n\n \n \n \nSwitchThemeInjector et NXThemesInstaller \n \nIl a également mis à jour SwitchThemeInjector et NXThemesInstaller, là aussi l'ambition étant d'apporter avant tout le support du firmware 20.0.0. Cette version des outils de thème apporte la prise en charge du nouveau firmware 20.0 ainsi que la prise en charge du remplacement des icônes de toutes les nouvelles icônes d'applet.\n \nÉtant donné que le nouveau firmware modifie certains aspects de la disposition du menu d'accueil, le programme d'installation tentera de corriger automatiquement les anciens thèmes. Grâce aux retours de quelques personnes ayant testé les versions bêta et à les tests des dispositions les plus populaires sur Themezer, le développeur affirme que la plupart des thèmes devraient fonctionner correctement, avec seulement quelques différences mineures au niveau de l'interface utilisateur.\n \nTéléchargement : SwitchThemeInjector 4.8 et NXThemesInstaller 2.8\n \n \nNxmp\n \nEnfin, sachez que le développeur Proconsule a lui de son côté mis à jour Nxmp, le lecteur vidéo pour Nintendo Switch basé sur MPV https://mpv.io/ et sur la solution open source de Cpasjuste pplay. \n \n \n\n \n \nChangelog 0.9.2 \n \nAjout :\n- Prise en charge des fichiers PDF\n \nCorrections :\n- correction sur la recherche de fichier d'archive (utile pour la lecture d'un fichier vidéo dans une archive)\n- correction sur la lecture d'archives depuis USB\n- liste de lecture à partir de la carte SD locale et des clés USB\n- paramètres sélection/enregistrement de la langue\n \n \nTéléchargement : Nxmp 0.9.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206742/in-switch-nxmp-switchthemeinjector-nxthemesinstaller-sysdvr-a-jour-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206742/in-switch-nxmp-switchthemeinjector-nxthemesinstaller-sysdvr-a-jour-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS4] PS4 Syscon Tools v2.2.0 disponible",
        "content": "Le développeur AbkarinoMHM que l'on ne présente plus dévoile une nouvelle version de son outil PS4 Syscon Tools qui est maintenant proposé en version 2.2.0. La versin précédente avait été livrée il y a presque un an, les nouveautés sont donc importantes. \n \nLa puissance de ce petit outil n'est déjà plus à démontrer, créé avec EgyCnq et permet de manipuler, dumper, flasher la puce Syscon de la PS4 (Renesas RL78/G13). \n \n \nPour s'en servir au mieux, il vous faudra la partie logicielle représentée par cet outil PS4 Syscon Tools mais aussi la partie hardware avec de quoi flasher le Syscon, un Teensy++ 2.0 ou Teensy 4.0.\n \n\n \nChangelog 2.2.0 :\n \n- Mise à jour du cadre .net de .net framework 8.0 à .net framework 9.0.\n- Déplacement de la fonction Write Full Syscon Flash du mode d'utilisation normal au mode avancé.\n- Déplacement de la fonction Write Syscon NVS/SNVS Only du mode avancé au mode normal.\n- Mise à jour et amélioration de la détection du matériel PS4 Syscon Flasher.\n- Correction de certains problèmes en détectant et en ouvrant PS4 Syscon Flasher pour chaque fonction au lieu de le détecter et de l'ouvrir une seule fois au démarrage de l'application.\n- Ajout de vérifications minimales du firmware du PS4 Syscon Flasher, de sorte que si votre flasher a un firmware ancien/non supporté, il vous demandera de le mettre à jour en premier.\n- Nettoyage du code.\n- Ajout d'un programme d'installation pour qu'il installe PS4 Syscon Tools ainsi que les bibliothèques .NET framework 9.0 nécessaires à son fonctionnement.\n- Mise à jour de la version 2.1.0 beta à 2.2.0.\n \n \nTéléchargement : PS4 Syscon Tools v2.2.0\n \n \n \n \n",
        "images": {}
    },
    "news_17": {
        "title": "[Switch] LibHac privé de liberté sous DMCA de Nintendo",
        "content": "Libhac est une bibliothèque utilisée pour le déchiffrement du contenu de la Nintendo Switch. Cette bibliothèque seule est inutile sans les clés, qui, à juste titre, n'ont pas été intégrées. \n \nMalgré cela, Nintendo a envoyé une notification DMCA à GitHub demandant la suppression de toutes les instances de Libhac.\n \n \n\n \n \nPour rappel, LibHac est une bibliothèque .NET qui réimplémente certaines parties du système d'exploitation Nintendo Switch, également connu sous le nom d'Horizon OS.\n \nL’une des autres fonctions principales de la bibliothèque est l’ouverture, le décryptage et l’extraction des formats de fichiers de contenu courants utilisés par Horizon.\n \nLa plupart des contenus sont importés et exportés via une IStorageinterface standard. Cela signifie que la lecture de types de fichiers imbriqués et de chiffrements peut être facilement effectuée en reliant différents lecteurs de fichiers.\n \n \n \nLa notification DMCA est disponible à l' adresse suivante : Retrait pour DMCA de LibHac\n \nC'est un vrai coup dur de Nintendo encore une fois qui agit toujours pour limiter l'utilisation hors charte, tous les forks, et ils sont nombreux, subissent le même sort. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206714/in-switch-libhac-prive-de-liberte-sous-dmca-de-nintendo-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] MissionControl 0.13.1 disponible",
        "content": "La 27ème version officielle de MissionControl vient d'être mise en ligne par son développeur ndeadly, une petite semaine après la version précédente, cette version vient corriger des bugs, car certaines régressions ont été détectées. \n \nAinsi suite au changement du type de manette signalé en Manette Pro sous licence, le logiciel ne prenait pas en charge les vibrations ni le niveau de batterie. Les correctifs HID ont été mis à jour pour ajouter les indicateurs manquants et restaurer la fonctionnalité pour les manettes émulées via Mission Control. \n \n \n\n \n \nLa définition de nouveaux indicateurs pour le type de contrôleur Pro sous licence peut également activer des fonctionnalités manquantes sur les contrôleurs Pro tiers sous licence (par exemple, l'affichage du niveau de batterie) si le contrôleur les implémente. Ne vous attendez pas à des miracles (le vibreur ne fonctionnera pas sur un contrôleur sans moteurs).\n \n \nChangelog 0.13.1 : \n \n- Ajout d'indicateurs de fonctionnalités aux types de contrôleurs Pro sous licence pour activer les rapports de batterie et la prise en charge des vibrations\n- Correction de certains offsets incorrects dans les correctifs exefs Bluetooth 20.0.X affectant l'implémentation IPC personnalisée\n \n \nTéléchargement : MissionControl 0.13.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206671/in-switch-missioncontrol-0131-disponible-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS4-PS5] Saturn 2 PS4/PS5 V 1.3",
        "content": "Voici une nouvelle version de mon outil Saturn 2 PS4/PS5 qui passe en version 1.3 qui va vous permettre de convertir vos jeux Saturn pour PS4 et PS5.\n \n\n \nVous trouverez dans cette version 1.3 quelques petites nouveautés,  le code a été totalement réécrit en python avec l ajout d'une interface graphique, j' ai également ajouté un switch entre la version PS4 et PS5 (icon PS4 et icon PS5), de plus une option pour créer un son sur le menu et un lecteur AT9 (Merci Darkprogrammer pour le lecteur AT9) ont été ajoutés.\n \nCet outil a été testé et fonctionne sur tous les firmwares jailbreakés PS5 et à partir du 5.05 sur PS4...\nVous aurez le choix entre 3 émulateurs Saturn, à vous de tester et trouver le meilleur pour votre jeu Saturn.\n \nMerci aux testeurs:\n \n\n- Arksama  firmware 2.50 et 4.03\n- New rival firmware 2.50\n- Oswald phantom firmware 3.00\n- Ribery95 firmware 4.03\n- Hyndrid firmware 4.03\n- Markus95 firmware 4.03 et 6.50\n- Mega gonzales firmware 4.50\n- Scott Darby firmware 4.51\n- Ahmad firmware 5.10\n- PS56.02 firmware 6.02\n- Eye Full Blood firmware 7.20\n- Jonas Bartholdi firmware 7.61\n- Link firmware 7.61\n \n\n \nPour le fonctionnement et l installation je vous laisse regarder ma vidéo tuto, j' y explique le fonctionnement, ainsi que la mise en place des dépendances OBLIGATOIRES à son bon fonctionnement.\n \n\n \nTélécharger SATURN_2_PS4/PS5_v1.3\n \nPour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:\nhttps://www.paypal.com/paypalme/markus00095\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206655/in-ps4-ps5-saturn-2-ps4ps5-v-13-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] Le A53MM/A53IO (MP4) peut désormais être dumpé",
        "content": "Contrairement à d'habitude, nous ne parlerons pas ici de hack ou d'exploit, mais simplement de dump, cela fait écho à ce que Zecoxao disait il y a quelques jours sur les possibilités d'accès à la puce A53MM/A53IO (MP4) qui a pour ambition de gérer séparément les packages PS5 (PKG) sur PS5, et qui limite donc les possibilités de lancement. \n \nIl est donc désormais possible de dumper le firmware MP4, cette faculté a été opérée sur un firmware 4.50, mais cela est accessible sur les firmwares 1.00 à 7.61 qui disposent un userland et un exploit kernel. \n \n \n\n \n \nLe développeur Zecoxao propose d'ailleurs le dump MP4 ici.\n \n \n \n\n \n \n \nBien entendu, en l'état le dump de cette puce n'est pas très utile, il faudra creuser pour voir s'il existe une possibilité de modifier son code, ou bien cela pourrait faciliter son contournement, là encore le temps nous le dira. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206619/in-ps5-le-a53mma53io-mp4-peut-desormais-etre-dumpee-du-firmware-100-au-761-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206619/in-ps5-le-a53mma53io-mp4-peut-desormais-etre-dumpee-du-firmware-100-au-761-2.png"
        }
    }
}