{
    "news_1": {
        "title": "[Multi] Dolphin dévoile un énorme rapport et une nouvelle version",
        "content": "Les petits gars de Dolphin ont mis un gros coup de collier, ils proposent une nouvelle version et un énorme rapport de progression. La version 2409 et son rapport d'avancement sont en ligne ! \n \nL'équipe parle de polygones explosifs, Cached Interpreter 2.0, des capteurs externes sur Android, la nouvelle version de Dolphin va sauvegarder vos pixels et bien plus encore !\n \n \n\n \n \nBeaucoup de choses ont changé. Dolphin a finalement laissé derrière lui l'ère 5.0 et est entré dans l' ère des versions. Non seulement il s'agit de la première version en huit ans, mais à l'avenir elles seront nombreuses. \n \nDolphin prend désormais en charge RetroAchievements, au cours des deux derniers mois, l'équipe Dolphin a résolu un problème majeur ainsi que de nombreux problèmes plus petits avec RetroAchievements. La première itération de RetroAchievements dans une version de sortie est stable, mais pas si flashy. Les bases sont là pour de futures améliorations, mais de nombreuses fonctionnalités et options restent encore à terminer. De plus, le support Android est toujours bloqué par quelques problèmes.\n \n \nLe rapport est disponible ici : dolphin-progress-report-release-2407-2409\n \nTéléchargement : Dolphin 2409\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195101/in-multi-dolphin-devoile-un-enorme-rapport-et-une-nouvelle-version-1.png"
        }
    },
    "news_2": {
        "title": "[3DS] Mandarine v1.1 disponible",
        "content": "Le développeur PabloMK7 est de retour avec une nouvelle version de Mandarine, cette nouvelle version 1.1 apporte de nombreux changements par rapport à la v1.0 libérée il y a un mois. \n \nLe fork de Citra, Mandarine, est une version retravaillée qui offre en théorie des performances supérieures, des mises à jour récentes, et des optimisations supplémentaires par rapport à Citra Enhanced. L'interface utilisateur a été revue, de nouvelles options audio ont été introduites, et ainsi que le contrôle sur Android. \n \nLa nouvelle version 1.1 corrige beaucoup de bugs, apporte de nombreuses améliorations, des correctifs, par exemple une meilleur gestion de la pause de l'émulateur sur PC. \n \n \n \n \n\n \n \n \nChangelog : \n \n- PC : Modification de la façon dont la mise en pause de l'émulateur est gérée pour permettre le frame (@OpenSauce04)\n- Android : Implémentation d'une interface graphique de personnalisation de la mise en page (@DavidRGriswold)\n- Code/CI : Mise à jour vers Clang 18\n- PC : Corrections de la création de raccourcis Flatpak (@OpenSauce04, ceci pour une future implémentation de Flatpak)\n- externals : mise à jour des sous-modules\n- shader_jit_a64 : Optimisation des tests conditionnels (@Wunkolo)\n- Android : Quelques changements d'interface\n- Android : Correction du padding si l'interface des paramètres est trop petite\n- PC : Nombreuses corrections pour les raccourcis clavier (@OpenSauce04)\n- qt : Correction de la langue par défaut qui n'est pas définie sur la langue principale utilisée par le système (@kleidis)\n- Android : Ajout d'une option de thème statique (@kleidis)\n- GSP_GPU : Ne pas toujours déboguer GXCommandProcessed sur TriggerCmdReqQueue\n- gradle : mise à jour de certaines dépendances\n- PC : Renommer Report Compatibility en Report Issues\n- Android : implémenter le support pour l'échelle de résolution automatique\n- Android & PC : Rebrand Custom CPU Ticks names (Une réinitialisation de la configuration est suggérée ici)\n- Android & PC : Ajout d'un paramètre système pour les pas par heure (@szdarkhack)\n- vk_stream_buffer : Refonte de la sélection du type de mémoire tampon Vulkan (@i0x404)\n- act : Ajout de noms de commandes et implémentation de GetErrorCode (@DaniElectra)\n- core : Suppression de certaines utilisations de l'instance globale du système par le portage PLGLDR (@raphaelthegreat)\n- Android & PC : Ajout du mode 3D Sterioscopic Side by Side inversé (@OpenSauce04)\n- Android : Correction du bouton pause de l'émulateur qui fait planter l'émulateur\n- shader_jit_a64 : Compact host executable memory (@Wunkolo)\n- Code : Application d'autres mises à jour et améliorations minimales\n \n \nTéléchargement : Mandarine 1.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195100/in-3ds-mandarine-v11-disponible-1.png"
        }
    },
    "news_3": {
        "title": "[PS4/PS5] Vers une solution semi permanente (CFW) sur PS4 et PS5",
        "content": "Le développeur Zecoxao, très proche de certains autres développeurs, annonce qu'une solution semi permanente serait possible sur PS4 et PS5. Attention, il parle bien avec le conditionnel et rien n'est certain, mais il parle bien d'une solution semi permanente sur PS4 et PS5. \n \nQuand nous parlons de solution semi permanente, nous parlons de ce qu'il est possible de faire avec un custom firmware, entendu qu'il s'agit d'une modification firmware, permettant de revenir en arrière ou de rester sur le firmware officiel. \n \nLes solutions actuelles ne sont pas codées dans le dur du firmware, et n'existe plus si vous mettez à jour votre cache, ou que vous le videz, cette solution serait donc plus évoluée.\n \n \n\n \n \nLe développeur Zecoxao précise que cela devrait fonctionner sur PS5 sous les firmwares 3.xx et 4.xx, et il ne sait pas si cela est envisageable sur plus récent, comme sur le firmware 8.20. \n \nNiveau PS4, il confirme que sur le firmware 5.05 ce serait possible, mais comme pour les autres firmwares sensibles. Cela semble laisser dire qu'il faudrait disposer d'un firmware sensible aujourd'hui à du hack pour installer ce CFW. \n \nBref, si cela s'avère vrai ce sera une bonne nouvelle pour les PS4 et PS5, même si cela ne change pas les firmwares sensibles. Dernier détail, le développeur annonce qu'on en saura plus très prochainement \"soon\", il n'y a plus qu'à patienter. Y aurait-il un lien avec la récente faille remontée par TheFlow, probablement pas non plus. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195033/in-ps4ps5-vers-une-solution-semi-permanente-cfw-sur-ps4-et-ps5-1.png"
        }
    },
    "news_4": {
        "title": "[PS4] D'énormes progrès aussi du côté de RPCSX (PS4)",
        "content": " \nIl n'y a pas que ShadPS4, c'est ce que souhaite montrer le développeur DH avec le second émulateur PS4 qui progresse lui aussi !\n \nDepuis quelques semaines, et c'est encore plus significatif ces derniers jours, l'émulateur ShadPS4 impressionne, il faut dire que les vidéos de démonstration sont nombreuses, la dernière en date fait tourner Bloodborne avec des patchs Ultrawide en 60 FPS, avec les DLC et les cheats d'actifs, rien que ça ! \n \n \n\n \n \n \nAu delà de ça, de nombreux jeux commerciaux se lancent, ou commencent même à être jouable même si les problèmes graphiques sont encore nombreux. \n \nLe développeur DH, lui qui s'occupe de la version PS4 de RPCS, qui se nomme RPCSX, a codé énormément ces deux derniers jours, cela faisait depuis le début que l'année que cela n'avait pas été le cas, mais alors là il ne fait pas les choses à moitié. \n \n \n\n \n \nLes premiers jeux commerciaux tournent, rien que ça, Sonic Mania arrive à démarrer, et le multithreading est aussi supporté. Zecoaxao nous informe qu'il faut quelques commits supplémentaires pour que rpcsx-gpu implémente les instructions manquantes et nous devrions le voir dessiner bientôt des éléments sur d'autres jeux, il prend pour exemple Gravity Rush. \n \n \nTout est là : RPCSX\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195011/in-ps4-denormes-progres-aussi-du-cote-de-rpcsx-ps4-1.jpg"
        }
    },
    "news_5": {
        "title": "[Switch] Sys-con et Nx Dump Client se mettent à jour",
        "content": " \nDeux programmes importants de la scène Nintendo Switch ont été mis à jour, Sys-con et NX Dump Client. \n \nSys-con \n \nLe développeur français o0Zz a pris la suite de Cathery avec Sys-con, et il le fait plutôt bien puisque les versions s'enchainent et ajoutent de nombreuses fonctionnalités. Inspiré du projet sys-con de Cathery, ce nouveau fork a été réalisé pour ajouter le support de toutes les manettes compatibles PC (avec un profil HID). \n \nAvec cette version, le développeur a voulu apporter de nombreuses nouveautés, la possiblité de mapper les commandes \"Slider\" et \"Dial\", ce qui peut être utile pour certains contrôleurs. Le mappage analogique a été revu, il est désormais possible de mapper n'importe quel contrôleur. Il en profité pour améliorer l'interprétation des données HID lors de rapports contenant des valeurs négatives. \n \n \n\n \n \n \nChangelog 1.4.0 : \n \n- Ajout d'un moyen d'associer les contrôles « Slider » et « Dial » (utile pour certains contrôleurs qui ont besoin d'un slider sur le stick droit).\n- Correction de l'interprétation incorrecte des données HID lorsque le descripteur de rapport HID contient des valeurs négatives.\n- Modification de la cartographie analogique pour pouvoir mapper tout sur n'importe quoi\n- Correction : le mapping Switch Controller Pro via USB ne fonctionne pas toujours (corrigé en version 1.3.0).\n- Ajout du mapping pour T.Flight Hotas X - PS3 Mode pour ACE Combat 7 Deluxe. Merci à @kfkboys.\n \n \nTéléchargement : Sys-con 1.4.0 \n \n \nNx Dump Client \n \nLe développeur v1993 propose une mise à jour de son programme NX Dump Client, son application client Linux utilisant Vala et GTK pour le dumping via USB en s'appuyant sur l'outil NXDumpTool. \n \nSa simplicité de lancement et d'utilisation font de cette application un indispensable de la console, même si cette version est une mouture de maintenance, elle annonce aussi la prochaine puisque le développeur dit \" version de maintenance avant la 1.2.0\". \n \n \nTéléchargement : Nx Dump Client 1.1.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195009/in-switch-sys-con-et-nx-dump-client-se-mettent-a-jour-1.png"
        }
    },
    "news_6": {
        "title": "[PS3] L'émulateur RPCS3 révise sa configuration matérielle minimale",
        "content": " \nL'équipe en charge du développement de l'émulateur PS3 RPCS3 vient de faire une annonce et une évolution importantes, elle vient en effet de relever la configuration minimale de l'émulateur, ce qui n'avait pas été le cas depuis plus de 4 ans. \n \nConcrètement qu'est ce que cela signifie, cela veut dire que les nouvelles versions de l'émulateur ne tourneront plus sur certaines configurations anciennes, et il faudra donc que votre configuration PC soit plus récente, cela va exclure de fait des ordinateurs anciens, c'est dommage mais cela va permettre de mieux exploiter les ressources récentes. \n \n \n\n \n \n \nL'équipe n'a pas fait dans la dentelle, voici les anciennes configurations minimales et les nouvelles exigences. \n \n \nVoici les changements apportés :\n \n> Processeur recommandé\nIntel : Skylake (6ème) -> Comet Lake (10ème)\nAMD : Zen 2 (3000) -> Zen 3 (5000)\n \n> RAM recommandée\n8 GO -> 16 GO\n \n> RAM minimale\n4 GB -> 8 GB\n \nCela signifie donc que toute configuration avec moins de 8 Go de RAM ne sont pas recommandés, mais assez paradoxalement l'équipe n'a pas accompagné cette annonce d'une mise à jour de l'émulateur qui le rendrait plus exigeant. Elle dit procéder à un petit ajustement de nos exigences matérielles, afin qu'elles garantissent une expérience plus solide avec les jeux jouables.\n \n \n\n \n \n \nEn pratique, ce changement d'exigences signifie que les nouveaux rapports de jeux jouables peuvent désormais cibler la nouvelle ligne de base recommandée, au lieu de s'appuyer sur Skylake ou Zen 2, qui date de bientôt 9 générations, avec ses problèmes de latence inter-CCX plus importants.\n \n \nDernière build ici :  rpcs3.net\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194968/in-ps3-lemulateur-rpcs3-revise-sa-configuration-materielle-minimale-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1194968/in-ps3-lemulateur-rpcs3-revise-sa-configuration-materielle-minimale-2.png"
        }
    },
    "news_7": {
        "title": "[Switch] NXBoot profite d'une mise à jour importante",
        "content": " \nPas moins de 3 années après la version précédente, voilà que NXBoot fait son grand retour pour la Nintendo Switch. NXBoot vous permet d'envoyer des payloads Fusée-Gelée vers un Switch depuis un appareil iOS ou un Mac.\n \nEn somme, derrière ce nom se cache une application avec laquelle vous allez pouvoir injecter des payloads et pouvoir lancer Linux depuis votre téléphone ou tablette sous IOS jailbreaké.\n \n \nPrérequis :\n \n- Un iphone ou ipad sous ios 9.x minimum et jailbreaké\n- Un cable OTG d'un coté et lightning de l'autre .\n \nBeaucoup de changements ont été apportés à cett nouvelle version, elle prend en charge les nouveaux jailbreaks « sans racine » ainsi que le TrollStore . De plus, NXBoot fonctionne désormais également sur l'ancien iOS 9 et ceux qui utilisent iOS 12+ peuvent s'attendre à un mode sombre . L'importation via le menu de partage a également été rendue plus intuitive et Coreboot/CBFS a été supprimé car hekate est \"maintenant\" établi.\n \n \n\n \n \nChangelog : \n \n \n- Ajouter la prise en charge du jailbreak sans racine\n- Ajouter le support de TrollStore\n- Ajoutez la prise en charge d'iOS 9, prend désormais en charge iOS 9 à 17\n- Interface utilisateur retravaillée avec un nouvel éditeur de charge utile\n- Mode sombre sur iOS 12+\n- L'importation via la feuille de partage est désormais beaucoup plus intuitive\n- Supprimez le support coreboot/CBFS, la communauté a opté pour Hekate 6 à la place\n- La version 0.3.0 était une version bêta privée et la version 0.3.1 contient uniquement des corrections de bugs.\n \n \nTéléchargement : NXBoot\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194962/in-switch-nxboot-profite-dune-mise-a-jour-importante-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] TinWoo est de retour et s'améliore",
        "content": " \nLe développeur Mrdude2478 propose une nouvelle version de TinWoo pour la Nintendo Switch, il faut dire que le programme avait disparu des écrans radars depuis un bon moment. \n \nRappelons que TinWoo est un installateur qui fonctionne un peu comme Tinfoil Installer ou Awoo Installer et comme ses ainés, le programme prend en charge l'installation de fichiers NSP, NSZ, XCI et XCZ en les divisant sur la carte SD, et il prend également en charge les DLC qu'ils proviennent d'un URL depuis un Google Drive ou via des outils tels que ns-usbloader. \n \nCe logiciel intègre aussi la possibilité de mettre à jour automatiquement les sigpatches, ainsi que le support de thèmes via la personnalisation des skins, et l'ajout de sons customisés, à condition de choisir les mêmes formats audio que ceux déjà présents. \n \n\n \n \nCaractéristiques : \n \n- Supporte l'installation de fichiers NSP/NSZ/XCI/XCZ et sépare les fichiers NSP/XCI de votre carte SD\n- Supporte l'installation de fichiers NSP/NSZ/XCI/XCZ sur un réseau local ou USB à partir d'outils tels que NS-USBloader\n- Supporte l'installation de fichiers NSP/NSZ/XCI/XCZ sur l'internet par URL ou Google Drive\n- Supporte l'installation de NSP/NSZ/XCI/XCZ à partir d'un disque dur (NTFS/Fat32/ExFat/EXT3/EXT4)\n- Vérifie les NCA par la signature de l'en-tête avant qu'elles ne soient installées\n- Installe et gère rapidement et facilement les derniers patchs de signature\n- Fonctionne sur SX OS et Atmosphere\n- Possibilité de créer un thème, de changer les sons d'installation\n \n \nSur les versions précédentes de TinWoo, il y avait un problème concernant la liste ou le chargement d'un dossier avec plusieurs fichiers à installer, le code a été réanalysé et a été modifié pour apporter quelques modifications pour corriger le problème, vous pouvez désormais installer par lots plusieurs fichiers en même temps sans faire planter l'application.\n \n \nTéléchargement : TinWoo 1.0.26\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194951/in-switch-tinwoo-est-de-retour-et-sameliore-1.jpg"
        }
    },
    "news_9": {
        "title": "[XBX/S] La mise à jour d'Août fait le plein de fonctionnalités",
        "content": " \nMicrosoft vient d'annoncer la disponibilité immédiate de la mise à jour système Xbox d'août, elle se destine principalement au Cloud Gaming, aux Xbox Series S et X, mais aussi au PC.\n \nEn se basant sur les retours utilisateurs, Microsoft a voulu apporte de nouvelles fonctionnalités pour le Cloud Gaming, mais aussi apporter des améliorations sur les manettes sans fil.\n \n \n\n \n \nL’application Xbox sur Fire TV est désormais disponible sur le Fire TV Stick (1ère génération) et le Fire TV Cube (2ème génération), il vous sera plus facile aussi de trouver vos amis et les canaux Discord directement depuis votre Xbox, mais aussi d'en regarder les streams.\n \n \nVous avez maintenant la possibilité de choisir ce que vous souhaitez installer pour vos jeux Xbox ou PC. Il vous sera possible d'économiser du temps ou de l'espace disque, plus de liberté.\n \n \n\n \n \nEt enfin la possibilité de personnaliser encore plus vos manettes Xbox, deux nouvelles options de personnalisation arrivent pour les manettes Xbox : la fonction « toggle hold » et un raccourci pour éteindre vos appareils.\n \n« Toggle hold » (disponible sur la Manette sans fil Xbox Elite Series 2 et la Xbox Adaptive Controller) permet de maintenir un bouton enfoncé en appuyant une seule fois, ce qui est idéal pour les joueuses et les joueurs nécessitant une meilleure accessibilité. \n \n \n\n \nBien entendu, il est trop tôt pour dire si indirectement cette mise à jour vient corriger des failles, probablement pas, les nouveautés étant déjà assez nombreuses pour en plus venir combler des manques de sécurité. \n \nTout est là : news.xbox.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194909/in-xbxs-la-mise-a-jour-daout-fait-le-plein-de-fonctionnalites-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1194909/in-xbxs-la-mise-a-jour-daout-fait-le-plein-de-fonctionnalites-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1194909/in-xbxs-la-mise-a-jour-daout-fait-le-plein-de-fonctionnalites-3.png"
        }
    },
    "news_10": {
        "title": "[PS4] ShadPS4 montre une nouvelle fois ses progrès",
        "content": "Il n'est pas nécessaire de faire un long discours pour découvrir les progrès réalisés par les développeurs de ce qui est actuellement l'émulateur PS4 qui progresse le plus. \n \nLes vidéos de fonctionnement de ShadPS4 se multiplient. \n \n \n\n \nNeoGeo Metal Slug 3\n \n \n\n \nNamco Museum Archives Vol 1 \n \n \n\n \nThe Binding of Isaac: Rebirth\n \n \n\n \nDeltarune\n \n \nEt la vidéo qui peut nous impressionner le plus est probablement celle de Resident Evil 4, même si tout n'est pas parfait, on voit clairement les progrès de jour en jour de l'émulateur PS4.\n \n \n\n \n \n \n \n",
        "images": {}
    },
    "news_11": {
        "title": "[PS4/PS5] Theflow une nouvelle fois récompensé",
        "content": " \nNotre ami Linkynimes nous informe que TheFlow vient d'être une nouvelle fois récompensé par le bounty program présent sur HackerOne dans la branche PlayStation Hacktivity.\n \nIl y a 2 heures, sur HackerOne, nous venons d'apprendre qu'il a reporté un bug dans la branche PlayStation, ce qui lui a conféré une récompense de 10 000 $. \n \n \n\n \n \n \nLe bug n'est pas dévoilé, il le sera probablement dans 4 à 6 mois comme c'est la coutume avec TheFlow, nous ne savons pas si son bug concerne la PS4, la PS5 ou les deux consoles. \n \nDu reste, cela prouve encore une fois que TheFlow est un chercheur en sécurité dont la réputation n'est plus à prouver, c'est la personne la plus récompensé de tous les programmes. \n \nTout est là : hackerone.com\n \nMerci Linkynimes\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194846/in-ps4ps5-theflow-une-nouvelle-fois-recompense-1.jpg"
        }
    },
    "news_12": {
        "title": "[WiiU] Cemu 2.1 stable disponible",
        "content": "Et ben dis donc, il aura fallu attendre pas moins de deux ans avant de voir débarquer une version stable de Cemu. L'équipe en charge du développement a enfin abandonné les versions expérimentales pour proposer enfin des versions stables comme cela était le cas auparavant. \n \nIl n'y aura qu'un seul canal de publication et vous pourrez décider de mettre à jour immédiatement ou avec un léger retard. \n \nCemu est sorti en open source il y a deux ans, mais aussi pour l'arriver de la version Linux, forcément le changelog est énorme. Pas moins de 93 modifications apportées depuis la 2.0, mais de trop nombreuses depuis la 1.x. \n \n \n\n \n \n \nExplications du changement : https://github.com/cemu-project/Cemu/pull/1306\n \nChangelog : https://github.com/cemu-project/Cemu/releases/tag/v2.1\n \n \nTéléchargement : Cemu 2.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194816/in-wiiu-cemu-21-stable-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[PS4] Un nouveau payload pour dumper la NOR (Sflash0) sur une clé USB",
        "content": " \nLe développeur Andryshik345 propose un nouveau payload pour les PlayStation 4 et PlayStation 4 Pro disposant d'un firmware sensible. Ce payload permet de dumper le firmware NOR, aussi appelé Sflash0 d'une PS4 ou PS4 Pro sur une clé USB. Cela évite d'utiliser le FTP pour réaliser l'opération.\n \n \n\n \n \nComposant indispensable de la composition de la console, le firmware NOR est spécifique à chaque console, il contient toutes les données du système, de démarrage et les paramètres systèmes.\n \nComme toujours, vous touchez là aux données sensibles de la console, donc il faut agir avec prudence, mais cela pourrait vous aidez en cas de restauration.\n \n \nTéléchargement : ps4-sflash0-dumper v1.0.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194793/in-ps4-un-nouveau-payload-pour-dumper-la-nor-sflash0-sur-une-cle-usb-1.jpg"
        }
    },
    "news_14": {
        "title": "[3DS] nds-bootstrap 1.6.2 disponible",
        "content": " \nLe développeur RocketRobz vient de mettre en ligne une nouvelle version de nds-bootstrap qui est désormais proposé en 1.6.0.\n \nAvec cette version, la stabilité de la connexion sans fil a été grandement améliorée, de sorte que Mario Kart DS peut désormais être joué sans fil avec une seule cartouche, sans aucune déconnexion pour le multiplayer. De plus, un abandon de données lors de la connexion à Pokémon Battle Revolution dans Pokémon Diamant, Perle et Platine a été corrigé.\n \nCependant, cette version comporte également de nouveaux bugs connus. Des ralentissements peuvent survenir dans certains jeux comme Pokémon Noir/Blanc 2 et si la connexion persiste, l'option « Card read DMA » doit être désactivée pour le jeu concerné.\n \n \n\n \n \n \nChangelog :\n \nCorrection de bugs :\n- Amélioration de la stabilité des communications sans fil en déplaçant les opérations SD R/W des IRQ vBlank & IPC Sync (de l'arm7) vers la boucle principale (de l'arm7) (une fois de plus, en accrochant les appels SWI Halt) !\n- Cela signifie qu'il n'y a pas ou peu d'interruptions de connexion aléatoires (cela peut varier en fonction du jeu).\n- Mario Kart DS hébergera désormais correctement une partie multijoueur à carte unique.\n- Plus de ralentissements lors de la lecture de ROM à partir de la carte SD avec des communications sans fil !\n- Par rapport aux versions précédentes qui implémentaient l'accrochage SWI Halt, certaines optimisations ont été faites pour réduire les ralentissements dus à cet accrochage. Aucun ralentissement n'a été constaté dans les jeux connus qui en avaient auparavant, comme CTGP Nitro (v1.0).\n- Correction d'un bug négligé (survenu depuis la v1.1.0) qui provoquait une interruption des données lors d'une tentative de connexion à PBR via Pokemon Diamant, Perle ou Platine.\n- Le même bug de déconnexion persistera probablement.\n- Cut the Rope n'affiche plus d'écran noir pour les utilisateurs de Memory Pit !\n \nBugs connus :\n- En raison du déplacement des opérations SD R/W vers la boucle principale, les problèmes suivants se produiront.\n- Par rapport aux versions précédentes, il peut y avoir un ralentissement mineur dans certains jeux (comme Pokemon B/W 2, pendant l'écran titre).\n- Sur les consoles DSi, Nervous Brickdown et Big Bang Mini se planteront sur des écrans noirs après les logos des entreprises. Ces deux jeux fonctionneront toujours sur les consoles 3DS, car ils sont préchargés dans la mémoire vive.\n- Si vous rencontrez toujours des interruptions de connexion aléatoires, essayez de désactiver le paramètre DMA de lecture de carte dans le menu TWLMenu++ ou dans les menus de paramètres par jeu du transitaire.\n \nedit 27.08.24\n \nTéléchargement : nds-bootstrap 1.6.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194765/in-3ds-nds-bootstrap-160-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[Switch] CTCaer améliore son correctif de charge pour la Switch Lite",
        "content": " \nLe développeur CTCaer a dévoilé une nouvelle version de son correctif pour les problèmes de tension de charge de la Switch Lite, c'est suite à un rappel d'un utilisateur qu'il a proposé ce fix, il l'avait développé depuis longtemps et il n'avait pas été mis à jour depuis novembre 2023. \n \n \n\n \n \nCe bug se produit lors d'un effacement manuel et incorrect du système, ce qui peut effacer un étalonnage important dans les données enregistrées.\n \nSa solution se nomme Battery Desync Fixer NX et est proposée en v1.5.0 sous format NRO.\n \n \nChangelog : \n \nAjout d'un moyen de corriger la fiabilité des cycles de charge de la batterie pour la Nintendo Switch LiteS'applique aux appareils qui ont été mal nettoyés auparavant et qui ont perdu toutes les données d'étalonnage.Sur ces appareils, l'application demandera les cycles de charge corrects. \n \n \nTéléchargement : Battery Desync Fixer NX  (1.5)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194756/in-switch-ctcaer-ameliore-son-correctif-de-charge-pour-la-switch-lite-1.png"
        }
    },
    "news_16": {
        "title": "[3DS] 3DS FBI Link v1.1 disponible",
        "content": "Voilà plus de 7 années et demi sortait 3DS FBI Link dans sa première version, voilà désormais que son développeur smartperson nous propose sa première mise à jour. L'outil spécialisé pour macOS « 3DS FBI Link » permet d'envoyer des CIA vers une ou plusieurs 3DS via le réseau.\n \nL'application a été écrite à l'aide de la version 5 du langage de programmation Swift et prend désormais également en charge nativement les Mac dotés d'une puce Apple. De plus, certains ajustements ont été apportés aux versions modernes de macOS et la version minimale requise de macOS a été augmentée à 10.13 (High Sierra).\n \n \n\n \n \n \nChangelog : \n \n- Création d'une version Swift 5 et prise en charge d'Apple Silicon par @TomJinW \n- Quelques modifications supplémentaires en plus de celles de @TomJinW pour prendre en charge des versions macOS plus modernes par @smartperson \n- La version minimale de macOS est 10.13.\n \nExigences :\n \n- Nintendo 3DS avec FBI\n- MacOS X 10.10 ou supérieur\n \nInstallation :\n \n- Copiez l'application 3DS FBI Link dans votre dossier Applications\n \nUsage :\n \n- Ouvrez FBI sur 3DS. Choisissez « Recevoir les URL sur le réseau ».\n- Ouvrez l'application sur votre Mac.\n- Si votre 3DS n'est pas déjà répertoriée, cliquez sur « + » et entrez ses informations, telles qu'indiquées sur l'écran du FBI.\n- Ajoutez les fichiers ou les URL de votre choix. Les fichiers peuvent également être glissés et déposés ou ouverts\n \n \nTéléchargement : 3DS FBI Link v1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194715/in-3ds-3ds-fbi-link-v11-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[PS4] PS4HEN VTX mis à jour en version 2.15",
        "content": " \nLe développeur Echo Stretch vient de procéder à la mise à jour de PS4-HEN-VTX, il s'agit là d'un de ses plus célèbres payloads à destination de la PlayStation 4 et PlayStation 4 Pro. \n \n \n\n \n \nAinsi il affirme avoir mis à jou PS4HEN pour prendre en charge davantage de payloads à l'aide de l'invité de payloads. Actuellement, il travaille avec Bestpig sur WebRTE, ce qui implique de nombreux décalages d'offsets. Il a du corriger certains patchs de Mira, il a rectifié les supports des firmwares 8.52 et 9.00, ainsi que modifier certains fichiers et répertoires d'installation et de sous-modules.\n \n \n\n \n \nIl a mis à jour aussi la plupart des payloads, il a rajouté que ces payloads devraient fonctionner jusqu'au firmware 11.50, si un jour un exploit est découvert pour ce firmware. Dans les faits, les modifications de cette version concerne les firmwares 7.00 à 11.00. \n \n \n\n \n \nA noter que PPPwnUI a également mis à jour en version 3.30b par Aldostools.\n \n \n \n\n \n \n \nTéléchargement : PPPwn-1.0331\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194679/in-ps4-ps4hen-vtx-mis-a-jour-en-version-215-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1194679/in-ps4-ps4hen-vtx-mis-a-jour-en-version-215-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1194679/in-ps4-ps4hen-vtx-mis-a-jour-en-version-215-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1194679/in-ps4-ps4hen-vtx-mis-a-jour-en-version-215-3.png"
        }
    },
    "news_18": {
        "title": "[XBX] Microsoft annonce la date et le prix de la Xbox Series X digitale",
        "content": " \nMicrosoft vient d'annoncer la date de sortie ainsi que le prix de la Xbox Series X digitale (sans lecteur optique), mais pas que cela. \n \nLe géant de Redmond est en pleine restructuration, même si cela n'est avoué qu'à demi-mot, les jeux commencent à sortir ou à être annoncé sur PS5, et cela ne va pas réellement s'arranger dans le sens où le refresh hardware est timide. \n \n \n\n \n \n \nLà où Sony a laissé le choix en permettant de souscrire ou pas à l'option du lecteur, Microsoft a fait le choix encore étrange de proposer 3 modèles, un modèle Xbox Series X digitale disposant de 1 TB de SSD, un modèle là aussi digital mais de Xbox Series S, et enfin la Xbox Series X de 2 TB de SSD. \n \nTout ce petit monde sera lancé le 15 Octobre 2024, voir 15 jours plus tard dans certains pays, pour la France ce sera bien le 15 octobre 2024.\n \n \n\n \n \n \nVous pouvez précommander dès aujourd'hui ces consoles \"Robot White\" ou \"Galaxy Black\". \n \nLa Xbox Series X étant actuellement à 549 euros, la versions digitale (sans lecteur) sera proposée à 499 euros, tandis que la version 2 To Galaxy Black sera commercialisée à 649 euros, rien que ça ! A noter que l'offre est limitée à une console par client. \n \nEn face, il se murmure que Sony va proposer la PS5 Pro, nous verrons bien, quoiqu'il en soit ces versions digitales semblent une nouvelle fois implanter encore plus le gamepass, le monde digital, où le hack est moins présent. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194664/in-xbx-microsoft-annonce-la-date-et-le-prix-de-la-xbox-series-x-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1194664/in-xbx-microsoft-annonce-la-date-et-le-prix-de-la-xbox-series-x-2.png"
        }
    },
    "news_19": {
        "title": "[PS4/PS5] PS Classics fPKG Builder v1 disponible",
        "content": " \nLe développeur SvenGDK vient de dévoiler un nouvel outil pour les PS4 et PS5 disposant d'un firmware sensible. Pour le moment, le développeur a décidé de mettre le développement de PS Multi Tools entre parenthèse, c'est pourquoi il dévoile PS Classics fPKG Builder dans une première v1.\n \n \n \n\n \n \nIl s'agit là d'un nouvel outil pour générer facilement des fPKG de jeux PS1, PS2 et PSP, cet outil fonctionnant sous PC Windows et MacOS. \n \nIl prend en charge les fichiers .Bin pour les jeux PS1, et les .Iso pour les jeux PS2 et PSP, en plus de cela l'outil applique automatiquement les patchs PS1 nécessaires, et applique les paramètres sur la table des matières en lien avec la musique CDDA. \n \n \nTéléchargement : PS Classics fPKG Builder v1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194598/in-ps4ps5-ps-classics-fpkg-builder-v1-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[Switch] La team UnlockSwitch montre les plans de son Xtractor",
        "content": " \nLa Team UnlockSwitch vient de montrer des images concept du PCB de son Xtractor. L'équipe informe  que tout comme le linker UnlockSwitch PBS, le Xtractor peut être mis à niveau au fil du temps en utilisant le même programmateur. \n \nLa principale caractéristique du Xtractor est sa capacité à sauvegarder vos jeux Switch originaux sur votre PC ou Mac (la prise en charge Mac est actuellement en cours de développement).\n \nNous avons également inclus un port microSD directement sur l'Xtractor pour faciliter le transfert de vos jeux originaux.\n \n \n\n \n\n \n \nEn résumé:\n \n- L'Xtractor est programmable et donc évolutif.\n \n- Vous pouvez sauvegarder vos jeux sur votre ordinateur ou directement sur la carte microSD intégrée avec un simple copier-coller\n \n- La version PC sera disponible au lancement (mais pas la version Mac actuellement)\n \n- La production en série des UnlockSwitch PBS et Xtractor débutera début septembre.\n \n \n \n\n \n \n \nA noter que la team a ouvert un github.\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194597/in-switch-la-team-unlockswitch-montre-les-plans-de-son-xtractor-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1194597/in-switch-la-team-unlockswitch-montre-les-plans-de-son-xtractor-2.jpg"
        }
    }
}