{
    "news_1": {
        "title": "[Switch] AtmoPackUpdater passe en version 1.8.0",
        "content": "Bonjour à tous, aujourd'hui j'ai mis à jour mon homebrew AtmoPackUpdater en 1.8.0 afin de rajouter quelques nouveautés intéressantes. Les deux principales nouveautés ont été proposé par des personnes de la communauté donc merci à vous! Si vous avez d'autres idées pour l'homebrew faites les moi parvenir, j'essayerai de rajouter ces nouvelles fonctionnalités.\n \nChangelog 1.6.0 :\n- Ajout d'un fix pour le téléchargement du fiwmare quand vous en avez déjà un dans sdmc:/firmware/\n \nChangelog 1.7.0 :\n- Ajout d'une option pour redémarrer sur hekate dans l'onglet paramètres\n \n- Correction d'une coquille (#9 merci Gum)\n \nChangelog 1.8.0 :\n- Ajout d'un onglet pour mettre à jour les homebrews du pack si le pack lui n'a pas encore été mis à jour avec les dernières versions des homebrews (Merci Zoria pour l'idée)\n \n- Ajout d'une détection des sysmodules lors de la mise à jour du firmware afin de pouvoir les supprimer pour éviter tous les problèmes de compatibilité (Merci Jones pour l'idée)\n- Ajout d'un fix pour toujours avoir un \"v\" devant la version du dernier pack disponible\n \n \nMerci à tous pour votre soutiens et vos remerciements c'est grâce à ça que je trouve la motivation pour continuer ce projet.\nTéléchargement : AtmoPackUpdater 1.8.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172737/in-switch-atmopackupdater-passe-en-version-180-1.png"
        }
    },
    "news_2": {
        "title": "[Switch] Saturn2Nsp V1.2",
        "content": "Après la 1ére version de Saturn2PKG pour PS4, voici une petite mise à jour du même script mais cette fois ci pour Switch qui passe donc en version 1.2.\n \n\n \nEn effet, grâce à ce script il vous sera possible de profiter des vos jeux Sega Saturn sur votre Switch. Vous pourrez ainsi jouez à un grand nombre de titre Saturn en plein écran si vous le désirez, garder à l esprit par contre que certains titres ne seront pas compatibles et que d'autres fonctionneront plus ou moins bien...\n \nJ'ai mis en place ce petit homebrew pour faciliter la création des nsp, son utilisation est très simple, vous avez juste à suivre les instructions et rien d' autre. Il vous faudra cependant posséder le nsp de base COTTOn Boomerang - Saturn tribute et votre fichier prod.keys, sans cela le script ne fonctionnera pas et vous demandera d' ajouter ces 2 fichiers...\n \n\n \nCette version 1.2 vient corriger un bug (reporté par DED FR) avec le menu in-game qui était complètement buggé, elle ajoute également un nouveau boot-logo grandement inspiré de la version PS4 expliquant la configuration des touches, mais aussi les crédits disponible dans le menu in-game.\n \nAttention !!! Il se peut que votre jeu ne fonctionne pas alors qu' il est compatible, il vous faudra alors tester une autre version du même jeu, par exemple il m a fallu tester 4 versions différentes de Dragon Ball Z la légende avant d' en trouver une fonctionnelle...\n \n\n \nTélécharger Saturn2Nsp v1.2\n \n \nUn petit don pour me soutenir est toujours le bienvenue ^^:https://www.paypal.com/paypalme/markus00095\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172726/in-switch-saturn2nsp-v12-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1172726/in-switch-saturn2nsp-v12-2.png"
        }
    },
    "news_3": {
        "title": "[Vita] RetroFlow-Launcher en version 6.0.0",
        "content": "Le développeur jimbob4000 vient de publier RetroFlow-Launcher dans sa version 6.0.0. Pour rappel, RetroFlow-Launcher est une jolie petite interface graphique permettant de parcourir et delancer vos jeux Retro sur la PS Vita, et est à l'origine un fork de HexFlow-Launcher par VitaHEX.\n \nIl s'agit d'une version modifiée de HexFlow Launcher, un coverflow 3D comme un lanceur pour PS Vita. Cette version comprend des catégories de jeux rétro qui peuvent être lancées sans bulles pour RetroArch, DaedalusX64 et Flycast. Les jeux Playstation et PSP peuvent également être lancés sans avoir à créer de bulles pour chaque jeu.\n \n \n\n \n \nLe lancement d'un jeu ou d'une application à partir de  RetroFlow Launcher fermera automatiquement le lanceur sans demander, et il créera également des catégories pour les favoris et les jeux récemment joués.\n \nDans cette nouvelle version 6.0.0, il vous sera possible d'ajouter vos propres catégories personnalisées (Collections). Cette version propose de nouveaux systèmes, fonctionnalités et améliorations.\n \n \n\n \n \n \nNouveautés :\n \n- Catégories personnalisées (Collections) : Ajout de la prise en charge des catégories personnalisées. Créez une collection en appuyant sur le bouton triangulaire d'un jeu, puis appuyez à nouveau sur le bouton triangulaire pour afficher le mini-menu. Les collections peuvent être renommées/supprimées en allant dans le menu des paramètres principaux \"Autres paramètres > Modifier les collections\".\n \n- Nouveaux systèmes : ScummVM, PICO-8 et PlayStation Mobile ajoutés.\n \n- Nouvelles langues : Portugais (brésilien) et hongrois.\n \n- Défilement fluide : Les transitions entre les couvertures de jeux sont plus fluides lorsque l'on parcourt les jeux. Peut être désactivé en allant dans les paramètres du thème.\n \n- Adrénaline : Option permettant d'inclure les jeux de toutes les partitions disponibles. (C'est maintenant le réglage par défaut).\n \n- D-Pad Up : Sauter à la catégorie des jeux récemment joués / favoris, ou filtrer les catégories pour n'afficher que les collections.\n \n- Cacher les couvertures manquantes : Paramètre permettant de masquer les jeux dont la couverture est manquante. Allez dans le menu des paramètres principaux \"Autres paramètres > Afficher les couvertures manquantes\". La première fois que vous faites cela, il se peut que le scan soit refait.\n \n- N64 et SNES : Support ajouté pour les boîtes japonaises de N64 et SNES (supprimez vos anciennes pochettes de N64 et SNES et téléchargez à nouveau).\n \n- Vita : Option pour extraire les images d'arrière-plan. Réalisé en intégrant une version modifiée de copyicons par cy33hc. Les fonctions normales de copyicons sont également exécutées.\n \n- PICO-8 : Option pour extraire les images d'arrière-plan de PICO-8 (utilise l'image au centre du chariot de jeu).\n \nAméliorations :\n \n- Meilleure méthode de lancement : Suppression de la dépendance à l'égard du plugin repatch et des fichiers bin de lancement.\n \n- Taille des images de la boîte : Nouvelle approche, la taille de l'image est vérifiée et la taille de la boîte la plus proche est attribuée (l'ajout de vos propres couvertures devrait donner de meilleurs résultats).\n \n- Boîtes de cassettes : Les boîtes apparaissent maintenant plus grandes dans leurs propres catégories (C64, MSX, MSX2, Spectrum).\n \n- Reflets de la boîte : Amélioration des reflets du jeu, suppression d'un petit écart.\n \n- PSTV : L'icône de la batterie et le pourcentage ont été supprimés.\n \n- PSP : L'extraction d'images ne récupère plus que les images manquantes, ce qui accélère le processus. Les images ne sont plus affichées pendant l'extraction afin d'éviter d'épuiser les ressources.\n \n- Amélioration des traductions : Polonais et français.\n \n- Langues : Classées par ordre alphabétique.\n \nCorrections de bugs :\n \n- Erreur de paramétrage des fichiers : Correction de l'erreur de sauvegarde lors de l'appui répété et très rapide sur les boutons.\n \n- PSP et PS1 : Correction d'une erreur avec les mauvais titres de jeux qui contenaient des guillemets doubles. (Correction de PES C19).\n \n- PSP : Extraction de l'arrière-plan de la PSP, correction de C2-12828-1, les images ne sont plus affichées lors de l'extraction.\n \n- Jeux cachés : Les jeux cachés apparaissaient lors du rescanning, l'approche globale a été revue.\n \n- Beaucoup de corrections mineures qui ne valent pas la peine d'être mentionnées, voir la nightly build pour plus d'informations.\n \nTéléchargement : RetroFlow-Launcher 6.0.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172703/in-vita-retroflow-launcher-en-version-600-1.png"
        }
    },
    "news_4": {
        "title": "[XB] L'émulateur Dolphin en UWP v1.1.5.1 disponible",
        "content": "Après l'émualtion Xbox 360, voilà que c'est désormais l'émulation de la GameCube et de la Wii qui sont au programme de SirMangler.\n \nDéjà à l'origine du portage UWP de Xenia, voilà qu'il propose désormais une nouvelle version de Dolphin, qui passe en version 1.1.5.1.\n \nComme vous le savez, le portage UWP va fonctionner sur Xbox One et Xbox Series X ou Series S.\n \nLa mise à jour ajoute un véritable menu à partir duquel il est possible de sélectionner les profils de manette et deux nouveaux profils par défaut pour la lecture Wii, \"Classic\" et \"Sideways Wiimote\".\n \n \n\n \n\n \n\n \n \nChangelog :\n \n- Menu de sélection du profil de la manette !\n- Profils par défaut de la manette classique et de la Wiimote latérale !\n- Options de mappage de pad pour Netplay !\n- Netplay peut maintenant rejoindre les lobbies hébergés sur PC (doit être Dolphin version 5.0-19260)\n- Améliorations générales incluant une alerte lorsque les utilisateurs sélectionnent des dossiers avec des permissions incorrectes\n- Corrections générales incluant un correctif pour 'Compiler les Shaders' avant le lancement du frontend et des problèmes liés à 'Wingman'.\n- Mise à jour vers la version 5.0-19260\n- Mise à jour mineure\n- Correction de ELF/DOL ne fonctionnant pas dans Netplay\n- Merci à TRW et GoldenSky pour leur temps de test !\n \nTéléchargement : Dolphin 1.1.5.1 (en UWP)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172700/in-xb-lemulateur-dolphin-en-uwp-v1151-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1172700/in-xb-lemulateur-dolphin-en-uwp-v1151-disponible-1.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1172700/in-xb-lemulateur-dolphin-en-uwp-v1151-disponible-2.jpg"
        }
    },
    "news_5": {
        "title": "[PS4] Saturn2Ps4 v1.0 pour 5.05, 6.72 et 9.00",
        "content": "Depuis un petit moment déjà l' émulation Saturn sur PS4 est disponible mais seulement pour les consoles en 9.00. Depuis peu le grand Cybik qu' on ne présente plus à (enfin) réussit à backporter cet émulateur Saturn en 5.05 ce qui permet donc au consoles 5.05 et 6.72 d'en profiter également.\n \nJ' ai donc décidé d' adapter mon batch Switch permettant de créer nos propres jeux Saturn pour PS4.\n \n\n \nEn effet, grâce à ce nouveau script il vous sera possible de profiter des vos jeux Sega Saturn sur votre PS4 5.05, 6.72 et 9.00. Vous pourrez ainsi jouez à un grand nombre de titre Saturn en plein écran si vous le désirez, garder à l esprit par contre que certains titres ne seront pas compatibles et que d'autres fonctionneront plus ou moins bien...\nA savoir également qu'il vous faudra le goldhen 2.3 minimum pour faire fonctionner cet émulateur Saturn, et que vos jeux devront être au format .bin/cue, le script prenant en compte aussi les jeux possédant plusieurs .bin...\n \n\n \nDe plus j' ai ajouté quelques petites options qui vous permettront par exemple de customiser le boot-logo, d'injecter un fichier .ini custom, mais aussi de lancer les jeux nécessitant 4MB de mémoire...\nVous pourrez également convertir vos .iso en .bin mais cette option a ses limites, les jeux contenant des fichiers .wav ou mp3 ne pourront être convertis en .bin, il vous faudra donc trouver ce même jeu en version .bin complète...\n \nAttention !!! Il se peut que votre jeu ne fonctionne pas, vous aurez alors soit une erreur, soit un black screen à l’exécution de votre jeu, cela signifiera donc que vos iso n' est pas compatible avec l'émulateur.\n \nTélécharger Saturn2Ps4 v1.0\n \nUn petit don pour me soutenir est toujours le bienvenue ^^:https://www.paypal.com/paypalme/markus00095\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172671/in-ps4-saturn2ps4-v10-pour-505-672-et-900-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1172671/in-ps4-saturn2ps4-v10-pour-505-672-et-900-1.jpg"
        }
    },
    "news_6": {
        "title": "[Switch] switch_AIO_LS_pack 4.10.0",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 4.10.0.\n\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\n\nLe firmware inclus est le firmware 16.0.2.\nAjout du payload Picofly-toolbox.\nMise à jour d'Atmosphere, de Hekate, de Haku33, de DBI, de Status-Monitor-Overlay, de AtmoXL-Titel-Installer et de Goldleaf vers la dernière version de ceux-ci.\nMise à jour de EdiZon-Overlay, de FastCFWSwitch, de OvlSysmodules et de TeslaMenu pour intégrer les dernières modifications de la Libtesla.\nPetite correction dans le fichier de config d'Atmosphere pour la redirrection des touches, sans importance car non utilisé car toutes les configs sont commentées.\nMise à jour de AIO_LS_pack_Updater qui est compilé avec la dernière version de la Libnx et qui a suivi les évolutions des homebrews Goldleaf et AtmoXL-Titel-Installer.\n\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\n\nN'hésitez pas à faire vos retours, ils seront les bienvenues. Par contre ne demandez pas une interface graphique pour AIO_LS_pack_Updater, je n'en ferai probablement jamais une.\n\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-4.jpg"
        }
    },
    "news_7": {
        "title": "[switch] switch_AIO_LS_pack 4.10.0",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 4.10.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles. Le homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\nLe firmware inclus est le firmware 16.0.2.\nAjout du payload Picofly-toolbox.\nMise à jour d'Atmosphere, de Hekate, de Haku33, de DBI, de Status-Monitor-Overlay, de AtmoXL-Titel-Installer et de Goldleaf vers la dernière version de ceux-ci.\nMise à jour de EdiZon-Overlay, de FastCFWSwitch, de OvlSysmodules et de TeslaMenu pour intégrer les dernières modifications de la Libtesla.\nPetite correction dans le fichier de config d'Atmosphere pour la redirrection des touches, sans importance car non utilisé car toutes les configs sont commentées.\nMise à jour de AIO_LS_pack_Updater qui est compilé avec la dernière version de la Libnx et qui a suivi les évolutions des homebrews Goldleaf et AtmoXL-Titel-Installer.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\nN'hésitez pas à faire vos retours, ils seront les bienvenues. Par contre ne demandez pas une interface graphique pour AIO_LS_pack_Updater, je n'en ferai probablement jamais une.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-4.jpg"
        }
    },
    "news_8": {
        "title": "[PS4] Dead Island 2 backporté sur 5.05 / 6.72 / 7.02 / 7.55 / 9.00",
        "content": "Le développeur CyB1K continue de montrer au monde du hack ses talents avec notamment la mise à disposition de la mise à jour backportée de Dead Island 2 avec le backport compatible sur 5.05 / 6.72 / 7.02 / 7.55 / 9.00. \n \nDead Island 2 est un jeu vidéo d'action-aventure de type survival horror, développé par Dambuster Studios et édité par Deep Silver. Il s'inscrit dans le même univers que Dead Island donc il en est la suite, donc âme sensible s'abstenir, le jeu est PEGI 18.\n \n \n\n \n \n \nInitialement prévu pour 2015, il a été reporté à de nombreuses reprises à cause de son développement chaotique, il aura fallu 9 ans pour parvenir à voir le bout du tunnel depuis son annonce de développement. Le jeu est finalement sorti hier le 21 avril 2023 sur Xbox Series, Xbox One, PlayStation 4, PlayStation 5 et Microsoft Windows, et donc a déjà été backporté pour PS4 par CyB1K.\n \nComme vous le save CyB1K n'agit pas réellement seul car il s'appuie sur son ami Arczi et jocover, et pour cette release il tient à remercier plus particulièrement xmrallx qui a probablement acheté le jeu.\n \nIl vous faudra un peu plus de 17 Go pour le jeu principal et moins de 250 Mo pour la mise à jour et les DLC.\n \n \n\n \nOn comprend pourquoi le jeu est PEGI 18\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172628/in-ps4-dead-island-2-backporte-sur-505-672-702-755-900-1.png"
        }
    },
    "news_9": {
        "title": "[Vita/PSP] ARK-4 version 4.20 disponible avec des nouveautés",
        "content": "Jose Aaron Lopez Garcia vient de mettre à jour sa solution Ark-4 en version 4.20, comme vous le savez la principale différence entre ARK et Adrenaline sur les consoles PlayStation Vita et PlayStation TV est qu'il ne nécessite pas l'exécution de l'exploit HENkaku. ARK est un portage du PRO CFW, il s'agit plutôt d'un eCFW (Custom Firmware de la PSP sur Playstation Vita), tout comme TN-C il peut démarrer les homebrews et les jeux de la première PSP et PSX, mais il ne peut faire tourner d'homebrews sur Vita, il faudra obligatoirement passer pour cela par HENkaku.\n \nCette nouvelle version est très intéressante, elle apporte pas mal de nouveautés comme le portage de Time Machine et Despertar del Cementerio vers ARK ou encore une surcouche Pentazemin qui permet à ARK de s'exécuter à l'intérieur Adrenaline. Il a aussi pas mal réécrit les correctifs pour limiter les problèmes sur les testkits et devkits.\n \n \n \n \n\n \n \n \nChangelog Version 20 :\n \n- Portage de Time Machine et Despertar del Cementerio vers ARK, permettant de unbrick les PSP et d'installer et d'exécuter le firmware 6.61 (plus ARK) sur une clé USB.\n- Création de la compatibilité avec la couche Pentazemin qui permet à ARK de s'exécuter à l'intérieur Adrenaline, en créant un  Hybrid Custom Firmware qui combine les fonctionnalités des deux Custom Firmwares. Remarque : fonctionnalité extrêmement expérimentale qui est encore en développement et qui contient des bugs connus.\n- Créé un nouveau  VSH Menu qui combine à la fois le  Simple VSH Menu et le  Advanced VSH Menu, n'ayant plus à l'installer à partir d'un fichier séparé pour accéder à ses fonctionnalités.\n- Réécriture de tous les correctifs statiques de la couche de compatibilité PSP en correctifs dynamiques, corrigeant tous les problèmes avec les testkits et les devkits.\n \nTéléchargement : ARK-4 version 4.20\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172627/in-vitapsp-ark-4-version-420-disponible-avec-des-nouveautes-1.png"
        }
    },
    "news_10": {
        "title": "[Switch] RyujinxEmu dévoile son rapport de Mars 2023",
        "content": "Une bonne nouvelle, voilà que l'équipe RyujinxEmu en charge du développement de l'émulateur Ryujinx vient de dévoiler sur son blog un nouveau rapport complet du mois de Mars 2023.\n \nL'article prend un axe intéressant, nous nous dirigeons sur le deuxième trimestre de 2023, et on sent bien que la Team attend le nouveau Zelda. \"Nous sommes tous incroyablement excités de voir ce que Nintendo nous réserve pour cette aventure étrangement familière, et bien sûr, de voir quels défis cela apportera à Ryujinx. Nous espérons que vous avez tous passé un bon mois, et que vous appréciez ce rapport d'avancement un peu plus court que d'habitude !\"\n \nLa solution Ryujinx améliore sa section GPU avec notamment le \"bug spécifique au fournisseur de GPU du mois\" et bien ce mois-ci c'est nVidia avec les RTX 3000 et 4000.\n \nLa Team explique comment elle lutte contre les scintillements et comment elle a mis l'accent sur l'isolement des cas où OpenGL surpassait encore largement Vulkan. Cela indique généralement les chemins de code que le pilote OpenGL de votre GPU optimise automatiquement, alors que dans Vulkan, nous aurions besoin de les faire manuellement dans Ryujinx lui-même. \n \n \n\n \n \n \nLes allocations de mémoire de programme ont été réduites . Il en résulte une réduction de 44 % des événements d'allocation, une réduction de 25 % du temps de récupération de place et une réduction de 32 % des pauses du programme en raison de l'allocation de mémoire. Des gains de performance très mineurs pourraient être observés dans les scénarios d'allocation intensive.\n \nLes fonctionnalités de callsystèmes ont été mises à jour pour inclure ceux ajoutés dans la version 15.0.0 du firmware.\n \nLibHac (bibliothèque utilisée pour les services du système de fichiers) a été mise à jour vers 0.18.0 .\n \nLa team fait aussi référence à l'ajout de la prise en charge des tiltlekey de ticket personnalisées en fonction du dump de clé.\n \nUn blocage lors de la fermeture de l'application , provoquant le maintien d'un processus fantôme Ryujinx, a été résolu sous Linux.\n \nLe gestionnaire de contenu téléchargeable de l'interface graphique WIP Avalonia a reçu une refonte pour l'aligner plus étroitement sur les principes de conception \"Fluent\" et avec un bouton \"Activer tout\" très demandé, pour ceux qui ont été arnaqués en achetant tous les costumes Smash Bros DLC +.\n \n \nTout est là : blog.ryujinx.org\n \nLa dernière version : ryujinx\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172626/in-switch-ryujinxemu-devoile-son-rapport-de-mars-2023-1.png"
        }
    },
    "news_11": {
        "title": "[2DS/3DS/DS] TWiLight Menu++ v25.9.4 et nds-bootstrap v0.71.1",
        "content": "Le développeur RocketRobz propose à la scène 3DS de découvrir une nouvelle version de TWiLight Menu++ et de nds-bootstrap qui passent respectivement en v25.9.4 et 0.71.1. TWiLightMenu++ pour rappel est un menu alternatif, open source et personnalisable pour lancer des homebrews DS, jeux et roms DS, GBA, BD via la DS, 3DS ou 2DS.\n \nLes versions se sont enchainées, et apportent pas mal de corrections de bugs. \n\n \nChangelog TWiLight Menu++ v25.9.4\n \nCorrection de bugs :\n- S'applique désormais également au menu classique de la DS : Correction d'un bogue négligé qui empêchait les jeux de démarrer.\n- Pour les jeux DS(i), nds-bootstrap affichait le code d'erreur -2 ou des écrans blancs après le lancement d'un jeu.\n- Correction d'un bogue négligé qui empêchait les jeux de démarrer.\n- Pour les jeux DS(i), nds-bootstrap affichait le code d'erreur -2 ou des écrans blancs après le lancement d'un jeu.\n- Correction de l'écran blanc apparaissant sur l'écran supérieur si la musique est désactivée.\n- Correction du scintillement du texte dans les paramètres du menu TWLM++ lorsque le module d'extension de mémoire est inséré.\n- Remplacement de Use nds-bootstrap par Game Loader dans le menu des paramètres par jeu pour refléter le changement dans TWLMenu++ Settings.\n \n \nChangelog ds-bootstrap v0.71.1  :\n \n- Correction des jeux ne démarrant pas si la taille du cache du cluster FAT est supérieure à 0x598 octets.\n- Pour faire de la place pour le grand cache, le tas du jeu est réduit. Si Memory - Expansion Pak est inséré, ou si la taille du cache est inférieure ou égale à 0x598 octets, le tas n'est pas modifié.\n- Pour savoir s'il est plus grand que 0x598 octets, activez la journalisation, lancez le jeu problématique et ouvrez root:/NDSBTSRP.LOG.\n- Si vous avez utilisé nds-bootstrap sur une carte flash connue pour être suffisamment stable, et qu'un jeu ne démarrait pas, vous avez peut-être rencontré cette situation.\n- C'est un correctif utile sur DSi/3DS si vous utilisez votre flashcard en mode DS, car il n'y a pas de Slot-2 disponible.\n \n \nTéléchargement : TWiLight Menu++ v25.9.4 / nds-bootstrap 0.71.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172609/in-2ds3dsds-twilight-menu-v2594-et-nds-bootstrap-v0711-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] sys-clk v1.0.3 disponible",
        "content": "L'équipe de développement Retronx vient de dévoiler une nouvelle version de son sysmodule sys-CLK, le développeur p-sam avec la contribution du développeur alula vient en effet de mettre en ligne la v1.0.3, la version précédente datant de plus d'une année puisqu'elle avait été publiée en Mars 2022. sys-clk est un module système qui vous permet de configurer l’horloge CPU / GPU et Mémoire en fonction de l’application en cours d’exécution et de l’état docké ou pas, d’accélérer les temps de chargement si votre console regorge de jeux, et donc de profiter des possibilités offertes par l'overclock.\n \n \n\n \n \nCette mise à jour vient corriger des crashs, des bugs, optimiser le programme par rapport aux firmwares supérieurs au 16.0.0. En effet cette mise à jour mineure corrige le problème de superposition qui ne fonctionne pas sur HOS >= 16.0.0 en mettant à jour libtesla et libnx vers la dernière version.\n \n \nTéléchargement : sys-clk v1.0.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172607/in-switch-sys-clk-v103-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[XboxOne] RetroPass v1.7.1 disponible",
        "content": "RetroPass est une interface RetroArch et RetriX Gold développée par Retropassdev exclusivement pour la Xbox One. \n \nAttention s'agissant d'un homebrew un peu particulier, le programme nécessite un accès au mode développeur, donc il se destine à un public averti. Retro Pass est une interface frontale pour RetroArch, RetriX Gold, Dolphin, XBSX2 et Xenia Canary fonctionnant sur Xbox.\n \nCette interface est spécialement conçue pour la console Xbox et devrait être familière aux utilisateurs de la Xbox.\n \n \n\n \n \nCes derniers jours les versions se sont un peu succédées, puisque le logiciel est passé de v1.6.0, à 1.6.1, puis 1.7.0, et 1.7.1.\n \n \nChangelog : \n \n- Correction du numéro de version dans les paramètres et le manifeste\n- Lors de l'utilisation de LaunchBox, les jeux dans les plateformes peuvent être réordonnés en utilisant le paramètre \"Sort Title\".\n- Correction : Les listes de lecture générées automatiquement par LaunchBox Arcade ne se chargeaient pas correctement et empêchaient les autres plateformes et listes de lecture de se charger.\n- Ajout du support pour les sources de données multiples et les stockages externes multiples.\n- Le numéro de version de RetroPass est visible sur la page Paramètres.\n \nA noter que RetroPass devient également compatible avec l'émulateur Xenia pour UWP.\n \n \nTéléchargement : RetroPass v1.7.1\n \n",
        "images": {}
    },
    "news_14": {
        "title": "[Switch] MissionControl v0.9.1 disponible",
        "content": "Le développeur ndeadly vient de mettre en ligne une nouvelle version de MissionControl, il s'agit de la version 0.9.1 qui apporte pas mal de nouveautés. \n \nAvant d'aborder les nouveautés de cette dix-huitième version officielle, rappelons que MissionControl pour ceux qui le connaitrait pas est un module système personnalisé qui permet de profiter de contrôleurs Bluetooth tiers qui peuvent être utilisés de manière native sur la Switch, et tout cela sans dongle ni autre matériel externe.\n \n \n\n \n \nLe support de la Dualshock 3 : \n \nCette nouvelle version apporte le support des manettes Dualshock 3 ! L'appairage des manettes Dualshock 3 fonctionne un peu différemment des manettes Bluetooth ordinaires, car il nécessite l'utilisation d'un câble USB.\nPour appairer la manette, vous devez être sur l'écran Change Grip/Order comme d'habitude.\nConnectez la manette à la console via un câble USB (vous aurez besoin d'un adaptateur USB-C OTG si vous êtes en mode portable).\nUne fois que les LED rouges du joueur commencent à clignoter, retirez le câble USB et appuyez sur le bouton PS. Attendez quelques secondes et vous devriez voir apparaître la notification habituelle Paired indiquant que la manette est désormais appariée à la console.\nVous pouvez désormais vous reconnecter à la console en appuyant simplement sur le bouton PS.\nCette version apporte également quelques modifications aux paramètres du fichier de configuration missioncontrol.ini. \n \nQuelques changements structurels :\n \n- Ajout du paramètre dualshock3_led_mode pour choisir entre les modèles de LED des joueurs de style Switch et PS3.\n- Ajout dualshock4_polling_rate pour modifier le taux d'interrogation utilisé par les contrôleurs Dualshock 4.\n- enable_dualshock4_lightbar -> dualshock4_lightbar_brightness\n- enable_dualsense_lightbar -> dualsense_lightbar_brightness\n- Ces deux paramètres ont été modifiés, passant d'un booléen permettant d'activer/désactiver la barre lumineuse à LED à une valeur entière contrôlant la luminosité.\n- Renommé enable_dualsense_player_leds -> dualsense_enable_player_leds pour être cohérent avec les autres noms de paramètres.\n \nChangelog :\n \n- Ajout de la prise en charge de la manette Sony Dualshock 3.\n- Ajout du support pour la manette Mocute 053.\n- Ajout d'une option de configuration .ini pour sélectionner le modèle préféré de LED du lecteur Dualshock 3.\n- Ajout d'une option de configuration .ini pour contrôler le taux d'interrogation utilisé par les contrôleurs Dualshock 4.\n- Remplacement de l'option de configuration .ini pour activer/désactiver la barre lumineuse LED sur les contrôleurs Sony par un paramètre de contrôle de la luminosité.\n- Renommé quelques autres options de configuration .ini.\n- Le dpad de la Wiimote est maintenant mappé sur le stick analogique gauche en orientation horizontale pour améliorer la compatibilité avec les jeux qui n'autorisent pas les entrées dpad pour les mouvements.\n \nTéléchargement : MissionControl v0.9.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172536/in-switch-missioncontrol-v091-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS5] Le firmware PS5 07.20.00 disponible",
        "content": "Sony vient de mettre en ligne un nouveau firmware à destination de la PlayStation 5, il s'agit de la mise à jour officielle 07.20.00 qui porte la référence 23.01-07.20.00.05-00.00.00.0.0.\n \nUn peu moins d'un mois après la sortie du firmware 7.01.01 pour la PS5 , la première mise à jour après les débuts de Discord sur la console de salon Sony et l'introduction du support VRR 1440p. Cette mise à jour 23.01-07.20.00 pour PlayStation 5 semble inclure une série d'améliorations purement liées à la stabilité du système d'exploitation et à certaines de ses fonctionnalités.\n \n \n\n \n \nVoici le changelog officiel de ce firmware 7.20 provenant de la page officielle de Sony :\n \nChangelog version 23.01-07.20.00\n \n- Dernière mise à jour du logiciel système pour les consoles PS5\n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et la convivialité de certains écrans.\n- Nous avons mis à jour le logiciel du contrôleur sans fil DualSense Edge pour en améliorer la stabilité.\n \nLe bot est PS5Bot\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172535/in-ps5-le-firmware-ps5-072000-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[PS4] L'émulation Saturn en natif sur PS4",
        "content": "Le développeur CyB1k que l'on ne présente plus vient d'informer la scène PlayStation 4 qu'il a réussi à backporter l'émulation Saturn sur la PS4 et PS4 Pro.\n \nLe développeur nous informe en effet qu'il a réussi à backporter pas moins de 3 émulateurs, bien qu'il ne sache pas réellement s'il y a de réelles différences entre les 3.\n \n \n\n \n\n \n \nA noter que vous devez utiliser GoldHen 2.3 pour les jeux Saturn sur le firmware 5.05 !\n \n \n\n \n Crédit image : Markus95\n \nNe vous inquiétez pas, vous le savez on peut déjà compter sur notre ami Markus95 qui nous l'espérons va proposer un script aux petits oignons ! \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172486/in-ps4-lemulation-saturn-en-natif-sur-ps4-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1172486/in-ps4-lemulation-saturn-en-natif-sur-ps4-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1172486/in-ps4-lemulation-saturn-en-natif-sur-ps4-3.jpg"
        }
    },
    "news_17": {
        "title": "[Multi] Gary Bowser va être libéré de prison",
        "content": "Nous venons d'apprendre que Gary Bowser, le célèbre membre de l'équipe Team Xecuter (Gateway 3DS, le Stargate, le Trueblue Mini, le Classic2Magic, le SX OS, le SX OS Pro, SX Lite et SX Core), va être libéré dans les jours qui viennent.\n \nIl avait été condamné à 40 mois de prison, mais il avait demandé une libération pour le mois de Mars 2023 invoquant des problèmes de santé, et bien entendu une \"bonne conduite\". \n \nBien entendu tout n'est pas tout rose pour Gary Bowser comme en atteste son interview avec Nick Moses de Février dernier. \n \nIl doit toujours payer les 10 millions de $ de dommages et intérêts à Nintendo, et pour cela Nintendo a été autorisé à saisir 25 à 30 % des revenus de Bowser. \n \nIl va sortir dans les prochains jours, il va être ramené au Canada avec un nouveau passeport comme il l'explique dans une nouvelle interview avec Nick Moses. \n \n \n \n\n \n \n \nIl a commencé le processus de remboursement alors qu'il était encore en prison; comme de nombreux détenus américains, Bowser a pu travailler derrière les barreaux, et au cours de son séjour au centre de détention fédéral SeaTac à Washington, il a pu rembourser 175 $.\n \nIl a en fait avoué être le « vendeur » de l'entreprise et aurait gagné 320 000 $ en sept ans de travail, le plus riche étant le français Max Louarn.\n \nTout est là : kotaku.com\n \n",
        "images": {}
    },
    "news_18": {
        "title": "[Switch] Atmosphere 1.5.2 disponible",
        "content": "SciresM vient déjà de réagir et propose la version 1.5.2 d'Atmosphere. \n \nPour notre plus grand plaisir il dévoile en effet une nouvelle version de sa solution Atmosphere qui est donc depuis 2 heures proposées en version 1.5.2, qui est la  soixante et onzième version officielle d'Atmosphère.\n\n \nAssurez-vous de mettre à jour fusee lors de la mise à jour vers la version 1.5.2. Grâce au travail de l'équipe de Switchbrew, Atmosphère 1.5.2 est fourni avec hbl 2.4.3, et hbmenu 3.5.1.\n \n \n\n \n \nChangelog 1.5.2 : \n \n- Une application homebrew (haze) a été ajoutée pour effectuer des transferts de fichiers USB (SciresM tient à remercier liamwhite pour la conception et l'implémentation).\n- haze est inclus avec Atmosphère, et permet d'accéder à la carte SD via le protocole PTP/MTP.\n- A noter que haze apparaîtra dans le menu homebrew sous le nom de \"USB File Transfer\".\n- Atmosphère ne peut pas être mis à jour en cours d'exécution, et tenter d'installer une mise à jour d'Atmosphère via haze échouera comme d'habitude.\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n\n \n \nTéléchargement : Atmosphere 1.5.2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1299795438.png"
        }
    },
    "news_19": {
        "title": "[Switch] Le firmware officiel 16.0.2 disponible",
        "content": "Nintendo vient de mettre en ligne un tout nouveau firmware, il s'agit du firmware 16.0.2 qui vient d'être publié. Cette mise à jour concerne toutes les zones, comme l'Europe, les USA, le japon mais également la Chine. \n \nCette mise à jour vise à corriger une faille de sécurité, et également propose des \"Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur\" . \n \n \n\n \n \n \nLe wiki a déjà été mis à jour : https://switchbrew.org/wiki/16.0.2#ssl\n \nLa liste des gros mots et le module SSL (qui permet d'établir des connexions sécurisées avec les serveurs) ont été mis à jour.\n \nLe mot \"adhd\" a été ajouté à la liste des gros mots en japonais. Aucune autre langue n'a été affectée.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172446/in-switch-le-firmware-officiel-1602-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[Retro] Un dock rétro lite CM4 AIO pour la CM4",
        "content": "Le développeur StonedEdge avance sur sa Retro Lite CM4 AIO Docking Station, un dock destiné à sa console CM4, même si actuellement, le code affiche l'écran d'accueil et passe à l'affichage des statistiques Pi sur la détection d'un port COM. Il y a encore beaucoup de bogues, et le développeur ne recommanderait pas de l'utiliser pour l'instant.\n \nSi un jeu est lancé par l'utilisateur, Pi stats se fermera et affichera une image binaire combinée du jeu en cours. Il s'agit donc d'une station d'accueil basique conçue pour être utilisée avec la console de jeu Retro Lite CM4. \n \n \n\n \n \nLa Retro Lite CM4 est un projet commun entre Dmcke5 et StonedEdge. La console est alimentée par une batterie Li-Po de 4000mAh et est conçue pour fonctionner avec différentes images logicielles, y compris mais non limité à RetroPie, Lakka ou Batocera, directement à partir d'une carte SD ou via un stockage eMMC. Le boîtier du projet a été inspiré par une Nintendo Switch Lite, mais ne correspond pas à 100% à l'original. Le CM4 ne peut actuellement pas émuler la plupart des consoles 32/64 bits sorties après la PSP ou la Dreamcast. Cela signifie que la GameCube, la Wii et la 3DS sont actuellement injouables jusqu'à ce que la fondation sorte une nouvelle version.\n \n \n \n\n \n \n \nLes principales caractéristiques de ce projet dock sont les suivantes\n \n- Un écran couleur 16 bits de 1,5\" 128x128 piloté par SPI et entièrement intégré.\n- Écran d'accueil configurable par l'utilisateur au démarrage de la machine\n- 3 ports USB 2.0 externes à utiliser pour le clavier, la souris et d'autres périphériques en mode bureau.\n- Chargement USB-C\n- Sortie vidéo HDMI\n- Bouton poussoir multifonction\n \nLes modes actuellement prévus sont :\n \n- Écran d'affichage jusqu'à ce que le port COM soit détecté\n- Pi Stats - Affiche les statistiques matérielles de base du système\n- Métadonnées du jeu au démarrage (visuels)\n- Métadonnées du jeu au démarrage (texte)\n- Statistiques du jeu (temps de jeu)\n \nCode disponible ici : Retro-Lite-CM4-Dock\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172443/in-retro-un-dock-retro-lite-cm4-aio-pour-la-cm4-1.jpg"
        }
    }
}