{
    "news_1": {
        "title": "[PS3] Un mod Pico avec BadHTAB d'esc0rtd3w disponible",
        "content": "Le développeur esc0rtd3w a décidé d'optimiser l'exploit BadHTAB comme vous le savez se destine à la PlayStation 3 et qui fait suite à la découverte de XORLOSER. \n \nL'exploit utilise une technique hardware et software pour modifier le signal de la RAM vers la terre, alors qu'un payload lui se charge afin d'aller pointer les données HTAB tout en forçant leur entrée via un glitch. \n \nUn exploit très technique, mais qui fonctionne, malgré son taux de réussite assez faible de l'ordre de 30 %. L'idée d'esc0rtd3w a été de modifier le code original afin d'apporter des modifications au code Pico pour faciliter les tests, pour l'heure aucune modification n'a été apporté pour la partie PS3. \n \n \n\n \n \n\n \n \nLes modifications incluent :\n \n- Redémarrage automatique si un problème fait planter la PS3\n- UART0 activé pour pico\n- UART1 activé pour l'entrée sb_uart de la PS3\n- Surveillance du mode veille du bloc d'alimentation\n- Connecteur d'alimentation de surveillance\n- Surveillance d'état sur 4 LED\n \nJusqu'à présent en cas de bug de lancement, il fallait souvent débrancher la prise, ou faire un hard reset, avec cette version vous n'aurez plus à  débrancher le cordon d'alimentation ni à actionner l'interrupteur de la multiprise. Le redémarrage automatique est pris en charge lorsqu'une erreur est détectée. Cela nécessite sb_tx de la PS3 et la soudure du bloc d'alimentation 5 V « always on » au Vsys du Pico. Ainsi, le Pico reste allumé lorsque la PS3 s'éteint. Le sb_uart de la PS3 surveille les messages permettant de contrôler le comportement du Pico.\n \n \n\n \n \n\n \n \nIl reste quelques bugs à corriger, notamment des plantages de la PS3 empêchant le Pico de se rétablir automatiquement, nécessitant un redémarrage manuel. Les fils devront être soudés aux emplacements appropriés sur la PS3 et le Pico.\n \nIl a proposé plusieurs versions qu'il fait rapidement évoluer, les dernières modifications ont été réalisées pour : \n \n- Ajout d' une variable pour suivre les tentatives de mise sous tension\n- Réinitialiser les séquences si le nombre maximal de boucles est de 12 et que l'alimentation est allumée \n- Réinitialiser en mode veille pour vérifier si les tentatives de mise sous tension sont de 6 ou plus\n- Augmentater du temps de glitch de la LED en cas de problème réussi\n \nTout est là : Psx-place.com\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206325/in-ps3-un-mod-pico-avec-badhtab-desc0rtd3w-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1206325/in-ps3-un-mod-pico-avec-badhtab-desc0rtd3w-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1206325/in-ps3-un-mod-pico-avec-badhtab-desc0rtd3w-disponible-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1206325/in-ps3-un-mod-pico-avec-badhtab-desc0rtd3w-disponible-4.jpg"
        }
    },
    "news_2": {
        "title": "[PS5] Mise à jour kstuff pour le VR2 et la désactivation ASLR",
        "content": "Le développeur Echo Strech a dévoilé une nouvelle version du payload kstuff qui intègre quelques évolutions intéressantes, cela passe par la désactivation de l'ASLR, mais aussi des progrès sont réalisés pour le support du PlayStation VR2.\n \nAu sujet de la désactivation de l'ASLR, ASLR est la randomisation de la disposition de l'espace d'adressage (ASLR), il s'agit d'une technique utilisée pour augmenter la difficulté de réaliser une attaque par débordement de mémoire tampon qui nécessite que l'attaquant connaisse l'emplacement d'un exécutable dans la mémoire. Il s'agit donc dans kstuff de proposer son contournement, en désactivant cette protection, les adresses deviennent prévisibles. Ainsi cela permet de charger des payloads de manière plus stable, cela ouvrirait la possibilité à d'autres exploits de bas niveau. Il restera à voir si cela sera utile. \n \n \n\n \n \n \nLe support du PlayStation VR2 a été également intégré par Al-Azif, il s'agit encore d'une version expérimentale, en version bêta, cela montre la volonté d'améliorer les fonctionnalités du payload, et ainsi de proposer l'arrivée du VR2 au travers du payload. Lancé en 2023 à 599 euros, il a largement baissé, proposé parfois autour des 370 euros, il n'a pas réellement connu le succès escompté par Sony, mais il reste un accessoire permettant une expérience intéressante.\n \nEt Al-Azif a également apporté le support du firmware 3.10 en apportant les offsets nécessaires, et un nettoyage du code a été opéré afin de supprimer des opérations inutiles et accroitre la stabilité de l'exécution. \n \n \nTéléchargement : kstuff v1.5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206313/in-ps5-mise-a-jour-kstuff-pour-le-vr2-et-la-desactivation-aslr-1.png"
        }
    },
    "news_3": {
        "title": "[Switch] Une première version d'Hekate pour le firmware 20.0.0 est là",
        "content": "Le développeur CTCaer vient de proposer, sur son Github, une première version d'Hekate pour le firmware 20.0.0.\n \nRappelons que le firmware 20.0.0 contient un bug qui pourrait être gênant et qu'il est probablement préférable d'attendre pour savoir si cette version est compatible avec le firmware 20.0.1.\n \n \n\n \n \n \nHekate, un custom bootloader largement utilisé pour la Nintendo Switch, vient d'être mis à jour par CTCaer. Hekate sert de point d'entrée pour de nombreux utilisateurs souhaitant explorer les capacités personnalisées de leur console Nintendo Switch. Depuis sa création, il a été utilisé pour lancer des homebrews, des backups de jeux, et d'autres logiciels personnalisés, offrant ainsi aux joueurs une expérience différente de celle prévue par Nintendo.\n \nCette version préliminaire, qui n'est pas accompagné de la mise à jour de Nyx, est compatible avec le firmware 20.0.0 mais également avec Atmosphère 1.9.0, il s'agit d'une version de test qui n'est pas à considérer comme une version stable et finale, pour l'utilisateur lambda il est préférable d'attendre la version officielle. \n \n \nTéléchargement : Hekate compatible firmware 20.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206292/in-switch-une-premiere-version-dhekate-pour-le-firmware-2000-est-la-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] PS5 BDJB Modified ISO v1.12 plus besoin de connexion internet",
        "content": " \nPlus besoin d'avoir une connexion internet, avec PS5 BDJB Modified ISO il est désormais possible de jailbreaker une PS5 sans avoir besoin d'une connexion internet ! Cette version modifiée proposée par Viktorious-x, basée sur le travail original de driverick, a été optimisée pour fonctionner en mode complètement hors ligne sur les firmwares  4.xx jusqu'à 7.xx. \n \nLe développeur utilise la version 7.61 du firmware, pour lui cette solution est une alternative à celles et ceux qui souhaitent débloquer leur console sans avoir besoin de la connecter à internet. \n \n \n\n \n \nProcédure gravure : \n \n- Téléchargez la dernière version ISO à partir du lien GitHub\n- Ouvrez  ImgBurn  (ou un autre logiciel)\n- Sélectionnez « Écrire le fichier image sur le disque »\n- Charger le fichier ISO modifié\n- Insérez le BD-R vierge et démarrez la gravure\n \nFonctionnement sur PS5 :\n- Insérez le disque gravé dans la PS5\n- Démarrer le lecteur Blu-ray\n- Sélectionnez un pipeline  (1er recommandé)\n- Veuillez patienter jusqu'à ce que le processus soit terminé\n- Lorsque vous y êtes invité,  fermez le lecteur de disque.\n- etaHEN se chargera automatiquement sur la page d'accueil (Si etaHEN n'apparaît pas , réinjectez-le via ItemzFlow)\n \n \n \n\n \n \n \nCette version modifiée de l' ISO PS5 BD-JB représente une avancée pour le jailbreaking hors ligne. Avec la prise en charge de plusieurs firmwares (du 4.xx au 7.xx et sa facilité d'utilisation, il permet d'accéder aux UMTX, loader ELF, serveur Web et autre etaHEN (avec kstuff) très facilement, la dernière version v1.11 apportant la prise en charge des fichiers .jar  dans le loader USB bin/elf.\n \n \nTéléchargement : PS5 BDJB Modified ISO v1.11\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206204/in-ps5-ps5-bdjb-modified-iso-v111-plus-besoin-de-connexion-internet-1.png"
        }
    },
    "news_5": {
        "title": "[XB/XB360] XCAT v1.06 disponible",
        "content": "Les passionnés de préservation pour la Xbox et la Xbox 360 ont consacré d’importants efforts au développement de XCAT, un outil gratuit et automatisé permettant aux possesseurs de Xbox d’explorer leur console à la recherche de contenus disparus (DLC, mises à jour de jeux, applications homebrew, skins, etc.) et de les téléverser dans le cadre d’un projet collaboratif d’archivage. Grâce à XCAT, la communauté peut mutualiser ses ressources pour sauvegarder des fichiers rares encore présents sur certaines consoles, assurant ainsi leur conservation pour les générations futures.\n \nCompatible avec les Xbox modifiées (softmod ou hardmod), ce logiciel extrêmement léger (moins de 4 Mo) tient facilement sur une carte mémoire, et l'outil vient d'être mis à jour en v1.06. \n \nLe fonctionnement est simple : XCAT génère une empreinte unique (checksum) pour chaque fichier détecté. Ces identifiants sont ensuite comparés avec ceux des serveurs XCAT. Si un fichier est inédit, il est ajouté à une liste de téléchargement et récupéré directement depuis la console du contributeur. En revanche, si le fichier est déjà archivé, il n’est pas dupliqué. Ce système évite aussi les doublons causés par des différences de nom ou dénomination, puisque chaque fichier est identifié par son hash.\n \nLa préservation ne s’arrête pas à la récupération : une fois collectés, les contenus pertinents sont partagés avec la communauté. Par exemple, les éléments utiles pour jouer en ligne via Insignia (le successeur moderne du Xbox Live) sont transmis à son équipe et intégrés aux mises à jour des jeux concernés. Les autres fichiers (homebrew, skins, etc.) sont diffusés via les canaux dédiés.\n \n \nAvec cette version 1.06, l'équipe a mis l'accent sur la réinitialisation réseau en cas de perte de connexion.\n \n \n\n \n \nChangelog v1.06\n \nAjout : Réinitialisation automatique des paramètres réseau en cas d'échec de connexion. Les configurations existantes du dashboard ne seront ni perdues ni écrasées !\n \n \nTéléchargement : XCAT v1.06\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206200/in-xbxb360-xcat-v106-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[PS5] Kstuff Toggle v0.1 Beta de Echo Stretch disponible",
        "content": "Le développeur Echo Stretch, avec la contribution de John Tornblom dont il tient à remercier, vient de mettre en ligne une première version d'un nouvel payload qu'il propose, il s'agit de Kstuff Toggle 0.1 Beta qu'il vient proposer au téléchargement. \n \n \n\n \n \n \nCet outil sous la forme d'un payload prend la forme d'un fichier ELF : \n \n- Ajout de homebrew.js – Grâce à cette nouveauté, le payload peut désormais être lancée via websrv.\n- Quelques améliorations cosmétiques \n– Des ajustements visuels ont été apportés pour une meilleure expérience utilisateur.\n \n \nTéléchargement : Kstuff Toggle v0.1 Beta\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206182/in-ps5-kstuff-toggle-v01-beta-de-echo-stretch-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[Switch] Un bug dans le firmware 20.0.0 !",
        "content": "Cela peut paraitre inconcevable, surtout quand on connait les process de validation des firmwares et leur importance, mais il semblerait qu'un bug est présent dans le firmware 20.0.0 publié il y a 2 jours, imposant Nintendo à sortir en catastrophe le nouveau firmware 20.0.1. \n \nUn bug s'est glissé dans la mise à jour firmware 20.0.0 de mercredi, certains utilisateurs se retrouvent face à un code erreur 2206-1015 lors du redémarrage de leur console.\n \nLe firmware 20.0.1 qui est déployé dès maintenant vient corriger ce bug ! Bref, ne mettez pas à jour en firmware 20.0.0 ou bien passez au 20.0.1 si vous l'avez déjà fait ! \n \nToute personne recevant le code d'erreur doit mettre à jour le Switch via le mode maintenance . Pour ce faire, allumez la Switch et maintenez les deux boutons de volume enfoncés jusqu'à ce que le mode maintenance s'affiche.\n \n \n\n \nLe rapport Yellow's8 est disponible ici. \n \nPour le hack, il ne doit pas y avoir de changements au niveau de la sécurité du firmware, nous verrons bien comment vont réagir les acteurs, notamment SciresM . \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206150/in-switch-un-bug-dans-le-firmware-2000-1.png"
        }
    },
    "news_8": {
        "title": "[PS3] PS3 4K Pro Lite 5.6.2 mis à jour par LuanTeles",
        "content": "Le développeur Luan Teles a mis à jour il y a 4 heures sa solution toute en un PS3 4K Pro Lite en version 5.6.2, comme vous le savez il s'agit là d'une interface utilisateur permettant d'amener de nouvelles fonctionnalités à la PS3, en plus de toutes celles déjà présentes dans un CFW par exemple.\n \n \n\n \n \nDe nouveaux sons, de nouvelles animations, de nouvelles options, une navigation plus intuitive font de PS3 4K Pro une solution fluide et qui permet de transformer radicalement votre UI.\n \n \n\n \n \n \n \n[2025-05-01]\n \n- Overclocking automatique à 650/750 Mhz (CFW uniquement)\n- Contrôle des performances (OC et Underclock)\n- Contrôle du ventilateur dans ps2net_emu\n- Prise en charge de plus de stores non officiels\n- Corrigé : Activer les syscalls sur 4.92 (HEN)\n \n \n \nTéléchargement : PS3 4K Pro Lite 5.6.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206146/in-ps3-ps3-4k-pro-lite-562-mis-a-jour-par-luanteles-1.png"
        }
    },
    "news_9": {
        "title": "[XB/Series] Une nouvelle version de XBS2 a été proposée",
        "content": "Le développeur SternXD a repris le travail de SirMangler car il a publié il y a quelques jours une nouvelle version de l'émulateur XBSX2, l'émulateur de PlayStation 2 (le portage de PCSX2) pour les consoles Xbox One et Xbox Series X/S.\n \nIl s'agit là d'une mise à jour maj, il faut avouer que les mises à jour ne se font que tous les 4 à 5 mois, en conséquence, les nouveautés sont nombreuses. \n \nPour rappel, l'émulateur XBSX2 vous permet non seulement de jouer à des titres PS2 avec toute la puissance native de l' émulateur PCSX2 , mais vous permet également de profiter des résolutions échelonnées (+4K) jamais vues sur une console Xbox.\n \n \n \n\n \n \n \n \nPossibilités de XBS2 : \n \n- Support complet de D3D12\n- Standalone de PCSX2 pour Xbox !\n- RetroAchievements\n- Système de triche et de correctifs entièrement fonctionnel\n- Préconfiguré pour le jeu en ligne\n- Basé sur la dernière révision de PCSX2 à ce jour.\n \n \nAttention, l’installation de cette mise à jour rendra vos sauvegardes incompatibles. Assurez-vous d’avoir sauvegardé vos parties sur une carte mémoire avant d’installer cette mise à jour, sinon vous perdrez votre progression. \n \nXBS2 a désormais le support officiel de l'équipe RetroAchievement pour la version 2.0.8.3 et les versions plus récentes, conformément à leur récent article de blog\nhttps://retroachievements.org/viewtopic.php?t=29231 , il ne dira plus lorsque vous ouvrez un jeu \n \n \nChangelog de la version 2.0.8.3 :\n \n- Synchronisé avec les dernières optimisations en amont au 07/03/2024 .\n- Grâce aux nouvelles corrections de l'équipe PCSX2, nous avons maintenant des thèmes !\n- Mise à jour vers SDL3 3.3.0 (Merci à@3URpour avoir travaillé rapidement sur ce sujet pour moi).\n- L'Enable CDVD Precachingoption a été supprimée des paramètres en raison de problèmes excessifs avec la limite de RAM.\n- Ressources mises à jour pour supprimer le .0de XBSX2.\n- Mise à jour de l'agent utilisateur pour inclure le modèle de console de l'utilisateur.\n- N'oubliez pas que les packs de textures fonctionnent, mais ils doivent être au format .dds. .png ne fonctionne plus.\n \n \nTéléchargement : XBS2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206133/in-xbseries-une-nouvelle-version-de-xbs2-a-ete-proposee-1.jpg"
        }
    },
    "news_10": {
        "title": "[Switch] Sys-tune v3.0.0 disponible",
        "content": "Le développeur TheReconJacob, qui dispose d'une formation de développeur professionnel, propose une nouvelle version de Sys-tune, à l'origine créé par HookedBehemoth. Cet outil vous permet sur la Nintendo Switch de lire les fichiers audio directement en arrière plan, tout en les gérant via le menu Tesla. \n \nCette nouvelle version 3.0.0 apporte toutes les fonctions des versions précédentes, mais elle intègre aussi des optimisations importantes comme les listes de lecture qui sont automatiquement enregistrées au redémarrage de la console. Une autre option dans le menu permet de démarrer la lecture de piste dès que la Switch est allumée. \n \nD'autres options ont été intégrées, comme la liste blanche qui a été ajoutée, une option qui n'existait pas jusqu'à là, une chanson ne peut être jouée que lorsqu'un certain ID de titre est actif.\n \n \n\n \n\n \n\n \n \n \nAjoute les fonctionnalités suivantes :\n \n- Les listes de lecture sont désormais enregistrées lors du redémarrage de la Switch\n- Une nouvelle option apparaît dans le menu, permettant à votre playlist de démarrer automatiquement lorsque vous allumez votre Switch\n- Ajoute un mode liste blanche, qui fait l'inverse de la liste noire, où une chanson est jouée UNIQUEMENT lorsqu'elle a un identifiant de titre spécifique\n \nInstallation :\n \n- Téléchargez Sys-tune\n- Extrayez le zip à la racine de votre carte SD.\n- Mettez des fichiers mp3, flac, wav ou wave sur votre carte SD.\n- Vous pouvez gérer la lecture via la superposition Tesla dans la version.\n \n \nTéléchargement : sys-tune 3.0.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206128/in-switch-sys-tune-v300-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206128/in-switch-sys-tune-v300-disponible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1206128/in-switch-sys-tune-v300-disponible-3.png"
        }
    },
    "news_11": {
        "title": "[XBO] Une version de Far Cry découverte sur un kit de développement XBO",
        "content": "Une découverte intéressante a été faite pour l'histoire du jeu vidéo, une version expérimentale de Far Cry a été découverte sur un kit de développement \n \nUn membre de Reddit, connu sous le nom de « New_Strategy5261 », a découvert une version préliminaire du premier opus de Far Cry sur un kit de développement Xbox Original. \n \nAprès avoir acheté ce kit de développement à un allemand, il a appris que ce kit appartenait au développeur allemand \"Crytek\", qui a notamment proposé Far Cry et Crysis. \n \n \n\n \n \nEn cherchant un peu il a trouvé une version expérimentale de Far Cry, il s'agit d'une version datée du 27 octobre 2005, soit un mois seulement après la sortie de « Far Cry Instincts », ce qui en constitue un portage du premier Far Cry sur la Xbox Originale, mais il avait été abandonné à la dernière minute pour se concentrer sur la version Xbox 360. \n \n \n \n",
        "images": {}
    },
    "news_12": {
        "title": "[PS4] Apollo Save Tool PS4 v2.2.0 disponible",
        "content": " \nLe développeur Damian Parrino, alias Bucanero, vient de mettre en ligne une nouvelle version d'Apollo Save Tool pour la PS4 et PS4 Pro qui est maintenant proposé en v2.2.0.\n \nComme vous le savez Apollo Save Tool est un superbe gestionnaire de sauvegardes qui devrait être livré par défaut avec toutes les consoles Sony tellement il est efficace et simple d'utilisation. Ce serait vraiment dommage de se priver de son utilisation si vous disposez d'une console récente Sony. \n \nChangelog PS4 release - Apollo Save Tool v2.2.0 :\n- Si vous disposez d'un serveur FTP (NAS, PC, VPS, Android, etc.), vous pouvez créer un compte et gérer la sauvegarde/restauration des sauvegardes dans le cloud avec votre compte FTP. (Sauvegardes PS4/PS2/PS1 supportées).\n \n \n\n \nChangelog 2.2.0 :\n \nAjout :\n- Prise en charge du serveur FTP (sauvegarde des sauvegardes dans le cloud)\n- Zipper, télécharger et sauvegarder des sauvegardes sur un serveur FTP défini par l'utilisateur\n- Lister, télécharger et restaurer des sauvegardes à partir d'un serveur FTP défini par l'utilisateur\n- Sauvegarder des sauvegardes PS1, PS2 et PS4\n- Prise en charge de la gestion en masse des sauvegardes cryptées (USB)\n- Option améliorée de copie des sauvegardes sur le disque dur\n \nMenu Paramètres :\n- Ajout de l'option URL du serveur FTP\n- Ajout d'une option de sélection (FTP/BD en ligne) pour les téléchargements de sauvegardes\n- Amélioration de la génération de noms de fichiers .zip pour l'exportation de sauvegardes\n \nNouveaux codes de triche :\n- Lunar 1 Remastered\n- Lunar 2 Remastered\n- Metaphor : ReFantazio\n- Resident Evil 7 : Biohazard\n \nPrise en charge de la somme de contrôle personnalisée :\n- Lunar 1 Remastered\n- Lunar 2 Remastered\n- Resident Evil 7 : Biohazard\n \nCorrections :\n- Correction du processus de reconstruction de l'app.db sur 11.00+ FW\n \nMisc : \n- Mise à jour de la bibliothèque SSL vers mbedTLS v2.16.12\n- Mise à jour d'Apollo Patch Engine vers v1.3.0\n- Ajout de la fonction de hachage djb2\n- Ajout de la prise en charge des balises pour les options sélectionnées par l'utilisateur sur les fichiers .savepatch\n- E.g., {ZZ}val=nom;03E7=999 or ;...;270F=9999 or{/ZZ}\n- Prise en charge des codes SaveWizard et BSD avec plusieurs options\n- Mise à jour du processus de montage des données de sauvegarde\n \nTéléchargement : Apollo Save Tool PS4 v2.2.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206103/in-ps4-apollo-save-tool-ps4-v220-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[PS5] Mise à jour de PSX2PS5 support 5.xx 6.xx et 7.xx",
        "content": "Depuis peu le hack PS5 s 'est étendu aux firmwares 5.xx, 6.xx et 7.xx, voici donc une mise à jour de PSX 2 PS5 apportant le support de ces nouveaux firmwares.   En effet, la première version ne fonctionnait qu' avec les firmwares 2.xx à 4.xx et donnait une erreur lors de l installation sur 5.xx ou plus.Avec cette version 1.1 vous aurez maintenant la posibilité de choisir quel émulateur utiliser en conséquence de votre firmware. Vous aurez le choix entre 2 émulateurs: - 2.xx-3.xx-4.xx.pkg pour les firmwares 2.xx à 4.xx- 5.xx-6.xx-7.xx.pkg pour les firmwares 5.xx à 7.xx  Mais ce n 'est pas tout, j' ai aussi ajouté le multi-disque, ce qui vous permettra de convertir vos jeux contenu sur plusieurs CD, mais attention seul les jeux demandant de sauvegarder a la fin d' un CD seront compatibles (comme final fantasy 7 par exemple)... Il comprend toujours les liens vers mon tweeter (icon Kaneda), mon Paypal (icon paramètre), ma vidéo tuto (logo youtube) et pour finir le plus important, les codes LibCrypt (La loupe). Ce dernier lien (la loupe) pointe donc vers les codes LibCrypt qui vont vous permettre de débloquer certains jeux comme Dino Crisis ou Resident Evil 3 Nemesis (explications dans ma vidéo tuto ci dessous).  Vous trouverez également dans le .rar de cette new. Un petit batch qui vous servira à fusionner vos .bins en un seul .bin afin d'utiliser ensuite PSX 2 PS5 v1.1  mais également de créer le .toc. Ce dernier fichier (.toc)  est important pour certains jeux comme Tekken, sans ce fichier votre jeu fonctionnera mais sans musique, d' où son utilité. J'ai également rajouté un dossier \"dependance\" comprenant Python v3 et install_pillow.bat qui sont obligatoires pour lancer mon outil, il vous faudra donc bien installer les 2 avant de lancer l' outil la 1ère fois. Mais aussi et très important bien COcHER LA CASE PATH dans python avant l' installation de ce dernier, sans ça vous aurez des erreurs lors de la compilation de vos FPKG.  Télécharger PS2PS5_v1.1 ",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206029/in-ps5-mise-a-jour-de-psx2ps5-support-5xx-6xx-et-7xx-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206029/in-ps5-mise-a-jour-de-psx2ps5-support-5xx-6xx-et-7xx-2.png"
        }
    },
    "news_14": {
        "title": "[Wii/WiiU] Nintendont se met à jour",
        "content": "Bonne nouvelle Nintendont vient d'être mis à jour en version v6.503, Nintendont comme vous le savez c'est le projet Homebrew qui permet de jouer à des jeux GameCube sur Wii et sur Wii U via vWii.\n \nOfficiellement la dernière fois que Nintendont avait été mis à jour c'était en Juillet 2024. \n \n \n\n \n \nChangelog v6.503 :\n \n- Correction d'un écran noir lors du lancement de Super Smash Bros. Melee avec Slippi\n- Toutes les régions de « Homeland » et de la « Nintendo Puzzle Collection » seront corrigées, ce qui est nécessaire pour les futures traductions des fans\n- Prise en charge de l'adaptateur de contrôleur GameCube tiers avec l'ID 0079:1846\n- Amélioration de la prise en charge du DualSense Edge et du Qanba Drone Arcade Stick\n- Prise en charge de l'adaptateur haut débit\n- Les ISO surdimensionnés sont désormais affichés en jaune foncé et peuvent être démarrés\n \nTéléchargement : Nintendont v6.503\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206005/in-wiiwiiu-nintendont-se-met-a-jour-1.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] Mise à jour Switch en 20.0.0, SciresM nous prévient",
        "content": "Nintendo vient de mettre en ligne cette nuit la nouvelle version du firmware pour la Nintendo Switch, il s'agit de la v20.0.0 qui vient d'être déployée sur les serveurs de big N, et le développeur SciresM nous prévient, \" il s'agit d'une version majeure, donc Atmosphere est cassé et doit être mis à jour \". \n \nComme à chaque nouvelle branche de numérotation, Nintendo change pas mal de paramètres, et surtout des clés qui empêche le fonctionnement d'Atmosphere, mais qui ne va pas réellement le bloquer, d'ailleurs SciresM rajoute qu'il faut être juste patient. \n \n \n \n\n \n \n \nLe rapport Yellow's 8 se trouve ici\n \n \n \nLe changelog est présent : \n \nLes icônes suivantes pour les nouvelles fonctionnalités ont été ajoutées au menu HOME :\n \nCarte de jeu virtuelle.\n \nLes logiciels numériques Nintendo Switch achetés, les DLC et certains logiciels gratuits sont désormais des cartes de jeu virtuelles et affichés dans une liste dans ce menu.\nVous pouvez charger et éjecter virtuellement des cartes de jeu virtuelles entre deux consoles Nintendo Switch maximum.\nLes cartes de jeu virtuelles peuvent être prêtées à d'autres personnes du même groupe familial de compte Nintendo. Pour plus d'informations, consultez le guide des cartes de jeu virtuelles. Les logiciels compatibles\n \n \nGameShare\n \npeuvent être partagés d'une console Nintendo Switch 2 vers d'autres consoles à proximité pour jouer ensemble.\n \nVous ne pouvez jouer ensemble que via une connexion sans fil locale, et la console Nintendo Switch 2 doit lancer GameShare.\nCette fonctionnalité ne peut pas être utilisée entre deux consoles Nintendo Switch, Nintendo Switch - Modèle OLED et/ou Nintendo Switch Lite.\n \n \nDes paramètres de vérification de l'utilisateur ont été ajoutés sous Utilisateur > Paramètres utilisateur.\n \nVous pouvez restreindre l'accès au menu Carte de jeu virtuelle en exigeant la saisie d'un code PIN ou en vous connectant à votre compte Nintendo.\n \n \nDes paramètres de licence en ligne ont été ajoutés.\n \nLorsque la console est activée, vous pouvez jouer aux logiciels téléchargés ou aux DLC que vous avez achetés lorsque la console est connectée à Internet, même si la carte de jeu virtuelle n'est pas chargée.\nPour plus d'informations, veuillez consulter les détails de cette option dans les Paramètres de la console.\n \n \nLes couleurs des icônes du Nintendo eShop et des Actualités Nintendo Switch dans le menu HOME ont été modifiées.\nVous pouvez sélectionner et transférer simultanément plusieurs données de sauvegarde dans le menu « Transférer vos données de sauvegarde ».\nLe transfert de la console vers la Nintendo Switch 2 a été ajouté dans Paramètres de la console > Console.\n \nVous pouvez effectuer un transfert de la console de votre Nintendo Switch vers la Nintendo Switch 2 via la communication locale.\n \nPour les utilisateurs qui perdront l'accès à leur Nintendo Switch avant de recevoir leur Nintendo Switch 2, il existe une option pour télécharger les données de transfert du système sur un serveur dédié qui peuvent ensuite être récupérées sur leur Nintendo Switch 2. Après avoir téléchargé vos données de transfert du système sur le serveur dédié, la console Nintendo Switch sera initialisée aux paramètres d'usine, donc n'effectuez ce transfert que si vous pouvez terminer le transfert sur Nintendo Switch 2.\nSi vous souhaitez continuer à utiliser votre Nintendo Switch jusqu'à ce que vous ayez une Nintendo Switch 2, nous vous recommandons d'effectuer le transfert du système en utilisant la communication locale après avoir acquis une console Nintendo Switch 2.\n \n \nUne connexion Internet et un compte Nintendo sont nécessaires pour effectuer le service de transfert de système local et basé sur le serveur.\nPour plus d'informations, consultez la section « Transfert de console de Nintendo Switch vers Nintendo Switch 2 ».\n \n \nL'apparence de certaines icônes utilisateur a été mise à jour.\n \nPour plus d'informations sur la Nintendo Switch 2, consultez le site web de Nintendo.\nNotez que l'utilisation de « Console principale » a été abandonnée avec le passage aux cartes de jeu virtuelles, et que « Console compatible avec le Pass » sera désormais utilisée. Sur une console configurée comme « Console compatible avec le Pass » pour un utilisateur, tous les utilisateurs de la console peuvent accéder à certains abonnements ou passes pour certains logiciels. Pour plus d'informations, consultez la section « Comment configurer ou modifier la console compatible avec le Pass pour un compte Nintendo ».\n \n \n \nVous l'aurez compris, il convient d'attendre si vous le pouvez avant de mettre à jour ou d'utiliser des versions alternatives d'Atmosphere. \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206004/in-switch-mise-a-jour-switch-en-2000-sciresm-nous-previent-1.png"
        }
    },
    "news_16": {
        "title": "[Multi] RetroArch v1.21.0 disponible",
        "content": " \nL'équipe LibRetro vient de mettre en ligne une nouvelle version de leur émulateur multi-plateforme RetroArch qui est désormais proposé en version 1.21.0 depuis quelques heures directement sur leur serveur. Le site internet officiel n'est pas encore à jour, mais il est possible de télécharger cette nouvelle version stable directement sur leur site ici pour chacune des plates-formes concernées. La toute dernière version qui avait été livrée était la 1.20.0 le 03 janvier 2025.\n \n \n\n \n \nAvec cette nouvelle version, de nombreuses corrections ont été apportées, sur la 3DS, TLS (HTTPS) a été activé et un blocage de l'interface utilisateur a été corrigé lorsque le rendu threadé est actif. Les plantages lors du chargement du contenu appartiennent également au passé. Sur Lakka, MacOS, Windows, ou encore la Wii et Wii U là aussi de nombreuses corrections ont été apportées. \n \n \n\n \n \nChangelog 1.21.0 :\n \n- 3DS: Fix unique IDs for newer cores\n- 3DS: Enable TLS (SSL)\n- 3DS: Fix UI freeze when threaded rendering is enabled\n- 3DS: Fix crash on load content\n- 3DS: Other minor fixes\n- APPLE: Enable Vulkan emulated mailbox\n- APPLE: Include b2 core in App Store builds\n- APPLE: CoreMIDI driver for IOS/MacOS\n- APPLE: CoreLocation driver for IOS/MacOS\n- AUTOCONF: Enable alternative display name in autoconfig files\n- AUTOCONF: Make autoconfig failure messages optional\n- AUDIO: Option to mute on rewind\n- AUDIO/PIPEWIRE: Fix app launch when pipewire service is stopped\n- AUDIO/PIPEWIRE: Fix speedup with threaded video mode\n- AUDIO/PIPEWIRE: Fix latency setting and microphone handling\n- AUDIO/PIPEWIRE: Pass the new rate to the audio driver\n- CAMERA: Add PipeWire camera driver\n- CAMERA: Add ffmpeg camera driver\n- CHEAT: Rewrite part of cheat_manager_load_cb_second_pass()\n- CHEEVOS: Include achievement state in netplay states\n- CHEEVOS: Fix crash when entering achievements in quick menu while client is not present\n- CHEEVOS: Restore cheevos_badges_enable for HAVE_GFX_WIDGETS builds\n- CLI: Allow --entryslot to fall back to normal states\n- CLOUDSYNC: Fix Windows path issues\n- CLOUDSYNC: Workaround for duplicated requests bug\n- CLOUDSYNC: Workaround for 301 redirects\n- CLOUDSYNC: Handle ignored directories properly\n- EMSCRIPTEN: Added new AudioWorklet driver, a fast callback-based audio driver\n- EMSCRIPTEN: Scale window to correct size\n- EMSCRIPTEN: Additional platform functions\n- EMSCRIPTEN: Add new default video context driver: emscriptenwebgl_ctx\n- EMSCRIPTEN: Add new audio driver: AudioWorklet\n- EMSCRIPTEN: Add new modernized web player which will eventually replace the existing one\n- EMSCRIPTEN/RWEBINPUT: Add touch input support\n- GAMECUBE: Fixes\n- GENERAL: Fix save state auto increment\n- GENERAL: Fix softpatching with periods/dots in the file name\n- GENERAL: Fix compilation with --enable-videocore\n- GENERAL: Allow asset directory redefinition and other directory overrides via environment variables\n- GENERAL: Allow override of player 1/2 input with machine learning models (needs recompilation and external library)\n- GENERAL: Fix performance counter option not remembered between sessions\n- GENERAL: Create security statement\n- GENERAL: Fix crash when core is not selected\n- GENERAL: Use core fps instead of screen refresh for calculating dropped frames\n- INPUT: Fix a crash when initializing illuminance sensor on Linux\n- INPUT: Analog-to-digital refactor, fixing behavior when analogs are assigned to keys\n- INPUT: Turbo fire overhaul. See #17633\n- INPUT/ANDROID: Fix game focus and pause handling\n- INPUT/COCOA: Include gravity in acceleration sensor values\n- INPUT/COCOA: Fix relative mouse input\n- INPUT/COCOA: Allow mouse input while mouse overlay is active\n- INPUT/WINRAW: Invert mouse index order\n- IOS: Ensure webserver notice can be dismissed\n- IOS: Fix rescanning manual playlists after app update\n- IOS: Fix clean playlist function\n- IOS: Fix crash when scanning\n- IOS: Fix jump back to selected item when closing content\n- IOS: Fix shared GL context setup\n- IOS: Update Launch Screen\n- IOS: Screen orientation lock through display server\n- IOS: Fix rescanning manual playlists after app update\n- LAKKA: Remove bluetooth device after disconnection\n- LINUX/X11: Extend X11 input driver with XInput2 extensions for multi-mouse\n- MACOS: Fix some sandbox handling in App Store builds\n- MACOS: Reset keyboard state when focus is lost\n- MENU: Add SSL support to the information list\n- MENU: Add warning to BFI and related menu items\n- MENU: Fix latency statistics when using runahead\n- MENU: Fix opening file inside archive with core selection\n- MENU: Main menu unified between different menu drivers\n- MENU: Visibility toggle for playlist tabs\n- MENU: Color the notification icon by message category\n- MENU: Gray Dark+Light theme adjustments\n- MENU/GLUI: Menu back button switches tabs like in other menu drivers\n- MENU/GLUI: Tab selection option is honored\n- MENU/GLUI: Fix CD icon appearing when no icon is specified\n- MENU/GLUI: Allow fullscreen thumbnail browsing\n- MENU/GLUI: Save state thumbnails\n- MENU/PLAYLISTS: Random selection/shuffle function\n- MENU/QT: Fix desktop menu crash with Cheevos disabled\n- MENU/RGUI: Cleanups of certain menu items\n- MENU/RGUI: Thumbnail fixes\n- MENU/OZONE: Fix messagebox background\n- MENU/XMB: Fix Light theme, font shadow\n- MENU/XMB: Appearance menu cleanup\n- MENU/XMB: Icon thumbnail can be any of the existing types\n- MISC: Guard nanosleep prototype behind _POSIX_TIMERS\n- MISC: Use fabsf and intended threshold for refresh rate check\n- MISC: Use platform-specific checks for invalid descriptors\n- MIDI: Add dropdown items for midi device selection\n- NETWORK: Refactor of net_http, improvements for task blocking and performance\n- NETWORK: Follow http redirects in net_http\n- NETWORK: Expire failed DNS lookups much faster\n- NETWORK: Fix netplay when using netpacket interface with recent cheevos\n- NETWORK/HTTP: Fix crash in net_http_resolve() in single-thread mode\n- OVERLAY: Fix overlay lightgun, mouse & pointer\n- OVERLAY: Preferred overlay loading is now default only on mobile platforms\n- OVERLAY: Improve analog recentering when touching the area just outside the recentering zone\n- QT: Enable non-png thumbnails also for Qt interface\n- REPLAY: Fix issue when replaying old format input recordings in newer RetroArch\n- TTS: Fix initial text-to-speech on Windows\n- TVOS: Fix 720p display\n- TVOS: Fix refresh rate fetching on tvOS 13/14\n- TVOS: Update Top Shelf art\n- SAVESTATES: Reset state index when loading new content\n- UWP: Fix slang shader compilation\n- VIDEO: Enable BFI setting for mobile platforms (mind the warnings)\n- VIDEO/OpenGLES: Fix FP/sRGB FBO support\n- VIDEO/SHADERS: Allow exact refresh rate sync with shader subframes\n- VIDEO/SHADERS: FIX shader wildcards\n- VIDEO/VULKAN: Enable adaptive vsync\n- VIDEO/V4L2: Added resolution picker/forcing.\n- VIDEO/V4L2: Rewrote logic for finding ALSA audio devices in enumerate_audio_devices function\n- VIDEO/V4L2: Added a skip for some of the interface queries that fail and aren't required for magewell usb.\n- VITA: Fixes\n- WINDOWS: Win32 socket improvements\n- WII: Fixes\n- WIIU: Fixes\n- WEBPLAYER: Update core list for 1.20.0\n \n\n \n\n \nTéléchargement : RetroArch v1.21.0 (changelog) et les liens de téléchargement ici\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205972/in-multi-retroarch-v1210-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[Multi] Apollo CLI Tools v1.3.0 disponible",
        "content": "Le développeur Bucanero propose une nouvelle version de son outil appelé Apollo CLI Tools, comme vous le savez Bucanero est à l'origine d'Apollo Save Tool sur PS3, PS4 et Vita, mais là c'est un peu particulier puisque CLI Tools est multiplateforme. \n \nApollo CLI Tools permet d'appliquer l'assistant de sauvegarde et les codes de patch BSD à un fichier de données. La bibliothèque et les outils de ligne de commande implémentent un moteur de sauvegarde de données qui prend en charge les codes Save Wizard/Game Genie et les scripts Bruteforce Save Data.\n \nL'arrivée de nouveautés est très rare pour Apollo CLI Tools, l'objectif est de corriger des bugs et d'ajouter un nouveau support de paramètres. Cette version 1.3.0 n'échappe pas à cette règle, elle a pour ambition de rajouter le support des hash djb2, d'améliorer le support de sélection des fichiers .savepatch, et d'ajouter le support de SaveWizard et d'options multiples sur les codes BSD. \n \n \n\n \n \n \nChangelog 1.3.0 : \n \n- Ajout d'une fonction de hash djb2\n- Ajout la prise en charge des balises pour les options sélectionnées par l'utilisateur sur .savepatchles fichiers\nPar exemple,{ZZ}val=name;03E7=999 gold;...;270F=9999 gold{/ZZ}\n- Prise en charge de SaveWizard et des codes BSD avec plusieurs options\n \n \nTéléchargement : Apollo CLI tools v1.3.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205969/in-multi-apollo-cli-tools-v130-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] Itemzflow (PS5) a été mis à jour en v1.10",
        "content": "Le développeur LightningMods a également mis à jour son manager Itemzflow qui est maintenant proposé en v1.10. Là aussi il a mis à jour le plugins afin d'ajouter le support pour les firmwares 7.xx. \n \nIl a aussi intégré les dernières optimisations afin de charger kstuff en moins de 10 secondes là où auparavant il fallait parfois jusqu'à 2 minutes. \n \n \n\n \n \nChangelog : \n \n- ajout de plugins mis à jour pour 7.xx \n- amélioration de la vitesse d'injection de la toolbox avec kstuff de 2 minutes à 10 secondes.\n- Si vous ne pouvez pas ouvrir cette version, assurez-vous de supprimer l'ancien PKG, puis d'installer cette version, ne pas l'écraser.\n \nTéléchargement : Itemzflow (PS5) 1.10\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205965/in-ps5-itemzflow-ps5-a-ete-mis-a-jour-en-v110-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS5] etaHEN 2.1 disponible",
        "content": "Le développeur LightningMods dévoile avec le plus grand plaisir sa nouvelle version officielle et finale d'etaHEN qui est désormais proposée en v2.1. La grosse nouveauté de cette version est le support de kstuff et d'etaHEN pour les firmwares 7.xx. \n \nMais les nouveautés sont très nombreuses, au delà de ce \"simple\" support. \n \n \n\n \n \n\n \n \nChangelog 2.1 : \n \n- Ajout de la possibilité de mettre en pause/reprendre kstuff dans la toolbox (section Utilitaires)\n- Mise à jour de kstuff et etaHEN pour la prise en charge des firmwares 7.xx\n- Stabilité améliorée lors du chargement automatique de la boîte à outils (nouvelle méthode de chargement, devrait être 20 fois plus stable) nécessite kstuff, l'ancienne méthode sera utilisée comme solution de secours lorsque kstuff ou byepervisor n'est pas disponible\n- Ajout d'erreurs plus approfondies à DPIv2 par @cragson\n- Correction de kstuff modifiant inutilement les identifiants cibles *kit (obligeant les devkits à passer par défaut en mode de publication)\n- Ajout de l'adresse IP DBG0 au panneau du menu d'accueil pour les devkits\n- Correction du démarrage automatique de klog même lorsqu'il est désactivé via la boîte à outils/config\n- Correction de /data dans les sandbox pour les pare-feu qui avaient des problèmes avec cette option\nsuppression de la création de fichiers inutiles lors du démarrage d'etaHEN (devrait légèrement accélérer les temps de démarrage)\n- Ajout d'une option pour recharger le cache des codes de triche et ajouter automatiquement de nouveaux codes de triche aux fichiers de cache\n- Mise à jour de PS5Debug par GHEN et réactivation de PS5Debug pour 5.xx\n- Ajout d'une vérification pour voir si une opération telle que le téléchargement du Store/Cheats ou le rechargement du cache des cheats est déjà en cours avant de démarrer une nouvelle opération\n- Ajout d'une option pour charger etaHEN sans kstuff (UTILISATEURS AVANCÉS UNIQUEMENT) c'est-à-dire des cheats ou des plugins (un fichier nommé \"no_kstuff\" sur la racine USB ou /data/etaHEN/ désactivera le chargement de kstuff)\n- Ajout des patchs du programme PKG Installer pour 2.xx et 3.xx-4.xx\n \n \nTéléchargement : etaHEN 2.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205964/in-ps5-etahen-21-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205964/in-ps5-etahen-21-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[Switch] Sphaira 0.8.2 disponible",
        "content": "Assez actif en ce moment, ITotalJustice vient de mettre en ligne la version 0.8.0 de Sphaira, sa solution de remplacement du hbmenu intégrant des fonctionnalités inédites dont nous vous avons déjà parlé. \n \nMalgré que cette nouvelle version arrive une petite dizaine de jours après la version 0.7.0, elle n'est pas avare en nouveautés avec des évolutions très intéressantes. \n \n \n\n \n\n \n \nChangelog 0.8.0 : \n \n- Ajout de la prise en charge des installations de flux.\n- Ajout du menu d'installation ftp.\n- Ajout du menu d'installation de GameCard.\n- Correction de l'autorisation de capture d'écran qui n'est pas définie en mode applet (vous pouvez désormais prendre des captures d'écran en mode applet).\n- Ajout de la vitesse de transfert et le temps restant à la barre de progression.\n- Ajout du support de transfert pour Mame et Neogeo.\n \nEdit 30.04.25\n \nTéléchargement : Sphaira 0.8.1\n \nEdit 02.05.25\n \n\nTéléchargement : Sphaira 0.8.2\n \n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205939/in-switch-sphaira-080-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205939/in-switch-sphaira-080-disponible-2.jpg"
        }
    }
}