{
    "news_1": {
        "title": "[PS5] La conférence de Specter nommée Byepervisor se tiendra demain",
        "content": "Le planning d'intervention de la convention Hardwear.io a été dévoilé, après 3 jours de trainings qui viennent de s'écouler, voilà désormais les deux journées de conférence qui auront lieu demain et vendredi. \n \n \n \n\n \n \n \n \nEt bien vu que nous avons le planning, nous pouvons voir que la conférence Byepervisor se tiendra demain, présenté par le célèbre développeur Specter, son intervention est prévue entre 15h30 et 16h10, soit une présentation assez rapide sur \"Comment nous avons cassé l'hyperviseur de la PS5\". \n \n \n \n\n \n \n \n \nTout est là : hardwear.io\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197680/in-ps5-la-conference-de-specter-nomme-byepervisor-se-tiendra-demain-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197680/in-ps5-la-conference-de-specter-nomme-byepervisor-se-tiendra-demain-1.png"
        }
    },
    "news_2": {
        "title": "[PS5] Sony dévoile le firmware officiel 10.20 pour la PS5",
        "content": " \nSony vient de dévoiler un nouveau firmware pour la PS5, la firme japonaise a en effet mis en ligne la version 10.20 de la mise à jour système de la dernière console de salon.\n \nCette mise à jour s'intéresse autant à la PS5 FAT que la Slim ou la toute proche PS5 Pro.\n \nLes changements opérés par Sony portent sur la gestion des activités, désormais affichées comme \"En cours\", \"Non démarrées\" ou \"Terminées\" selon l'avancement. \n \nLes spoilers potentiels continueront d'être cachées, et la convivialité de certains écrans ont été améliorés. Accessoirement Sony parle d'une amélioration de performances et de stabilité, mais nous savons bien ce que cela signifie, la correction éventuelle de failles reportées ou découvertes récemment. \n \n \n\n \n \n \nVersion : 24.07-10.20.00 :\n \n- Les activités portent désormais la mention En cours, Non commencée ou Terminée, selon que vous avez lancé ou terminé l'activité.\n- Les éventuels spoilers resteront cachés.\n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et l'ergonomie de certains écrans.\n \n \nTout est là : playstation.com\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197678/in-ps5-sony-devoile-le-firmware-officiel-1020-pour-la-ps5-1.jpg"
        }
    },
    "news_3": {
        "title": "[3DS] Dead Simple EULA Set v1.2 disponible",
        "content": "Si vous disposez d'une 3DS, et que celle-ci soit hors ligne pour des raisons qui vous sont propres, comme ne pas vouloir installer notamment le dernier firmware afin de disposer d'un firmware facilement hackable, il ne vous est pas possible de vous connecter en ligne en raison de la non acceptation du CLUF (le contrat de licence utilisateur final). \n \nCertains outils sont cependant conçu pour fonctionner avec le cluf accepté, c'est le cas pour jouer en ligne ou pour Streetpass par exemple, et c'est là que Dead Simple Eula Set entre en jeu puisque cet outil permet de contourner la procédure manuelle d'acceptation du cluf en rendant le processus rapide et sans complexité. \n \nLors de la lecture de jeux 3DS en dehors de la région d'origine, la console nécessite l'acceptation du Cluf spécifique qui permet d'accéder aux services en ligne. Dead Simple EULA Set va donc se charger de gérer les Clufs, en acceptant ou rejetant le Cluf. \n \n \n \n\n \n \n \nChangelog v1.2 :\n \n- Correction d'un bug où la fonction CFG_UpdateConfigSavegame n'était pas appelée, ce qui provoquait l'expiration d'un CLUF défini à moins qu'il ne soit maintenu (par exemple en changeant la luminosité de l'écran). \n- Le code est à nouveau compilable avec la dernière version de libctru (2.4.0).\n \n \nTéléchargement : Dead Simple EULA Set v1.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197661/in-3ds-dead-simple-eula-set-v12-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] PS5-Jar-Loader v4.0.0 de Master-s disponible",
        "content": "Le développeur Master-s vient tout juste, il y a quelques minutes, de dévoiler la version 4.0.0 de sa version fork de PS5-jar-loader qui comme vous le savez il personnalise avec quelques ajouts spécifiques. \n \nAinsi il a rajouté quelques fichiers bin et quelques fichiers elf permettant d'augmenter encore les possibilités offertes par le logiciel sur PS5. \n \n \n\n \n \nps5-jar-loader v4.0.0 : \n \n- Ajout du fichier test de chargement .jat et .bin \n- Ajout des Payload PS5 5.xx : ftpsrv.elf.bin, hello_world.elf et elfldr.elf\n \n \nTéléchargement : ps5-jar-loader v4.0.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197622/in-ps5-ps5-jar-loader-v400-de-master-s-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] Les Pokemon leakés sont désormais crackés sur PC",
        "content": "Récemment, Game Freak, le studio derrière la franchise Pokémon, a été victime d’une cyberattaque massive. Cette attaque a entraîné la fuite de nombreuses informations sensibles, y compris des données sur des jeux passés, présents et futurs, notamment les codes de certains jeux Pokemon, comme Pokemon Legends : Arceus, Pokemon Brilliant Diamond, et Pokemon Shining Pearl. \n \nCes 3 jeux ont été crackés et sont désormais jouables sur PC sans qu'aucun émulateur ne soit nécessaire, ce leak nommé \"Teraleak\" est probablement l'un des plus importants de l'histoire des jeux vidéo, dévoilant également des données personnelles de nombreux employés de Game Freak. \n \n \n\n \n \nIl semblerait que des problèmes de compatibilité avec les cartes nVidia limitent l'expérience utilisateur, des pilotes graphiques spécifiques devant être déployés.\n \nLes versions de Pokémon BD et SP semblent être proches des versions de débogage finales, et Pokémon Legends Arceus est un prototype très précoce. Ces éditions sont loin d'être les versions finales des jeux, probablement des test builds ou des versions alpha, mais tout ceci n'a de cesse d'exaspérer Game Freak et Nintendo. \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197621/in-switch-les-pokemon-leakes-sont-desormais-crackes-sur-pc-1.jpg"
        }
    },
    "news_6": {
        "title": "[PS5] PS Multi Tools v14.5.4 disponible",
        "content": "Le développeur SvenGDK propose également une nouvelle version de son outil PS Multi Tools qu'il propose en version 14.5.4. \n \nComme vous le savez probablement cet utilitaire s'adresse à tout ceux qui dispose d'une console Sony, de la PSP à la PS5 en passant par toutes les générations. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n\n \n \n \nCette nouvelle version n'a pas été compilée, il vous faudra le faire, elle apporte quelques corrections mineures, et la mise à jour du lecteur des PKG PS5. \n \nChangelog :\n \n- Mise à jour du lecteur des PKG PS5 et autres changements mineurs\n \nParcourir les fichiers :\n \n- Sauvegarde de la configuration du package XML\n- Exportation du param.json\n- Sauvegarde de l'icône icon0 et de l'arrière-plan pic0\n- Correction d'un crash possible lors de l'ouverture du 'PS5 Game Patches Downloader'.\n \n \nTéléchargement : PS Multi Tools v14.5.4\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197612/in-ps5-ps-multi-tools-v1454-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[Switch] NeXT 3.30 pré-version disponible",
        "content": "Le développeur Vampitech propose une nouvelle version de son all-in-one NeXT, comme vous le savez le code a été retiré de Github, mais le développeur continue de proposer son travail sur Codeberg.\n \n \n\n \n\n \n\n \n \nChangelog : \n \nMise à jour de :\n- Atmosphere > 1.8.0 Pre-Release\n- Hekate > 6.2.2\n- NeXT Updater > 2.0.1\n- Sigmapatches > 19.0.0\n- MissionControl > 0.12.0\n \nAjout :\n- Tinfoil AutoInstaller pour 19.0.0 (Bravo à Kronos2308)\n \nEn raison de certaines modifications apportées au Keyset 19.0.0, certaines redirections ne fonctionneront pas. Il est prévu que cela soit corrigé dans la version finale d'Atmosphere 1.8.0\n \nTéléchargement : NeXT 3.30\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197607/in-switch-next-330-pre-version-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197607/in-switch-next-330-pre-version-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1197607/in-switch-next-330-pre-version-disponible-3.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] NX-Activity-Log et EdiZon Overlay à jour",
        "content": "Les programmes NX-Activity-Log et EdiZon ont été mis à jour, le programme EdiZon Overlay propose à l'origine par WerWolv a été repris par proferabg, il tient à remercier ppkantorski pour cette mise à jour. \n \nEdiZon est une application dédiée à la gestion des sauvegardes d'état sur Switch et qui intègre également un éditeur très utile, cette nouvelle version de nombreuses optimisations. \n \n \n\n \n \nChangelog : \n \n- Mise à jour de libnx.\n- Utilise maintenant libtesla (Ultrahand) et libultra.\n- Prise en charge des fonds d'écran / thèmes personnalisés.\n- Les utilisateurs peuvent remplacer le fond d'écran / thème du système avec  sdmc:/config/edizon/wallpaper.rgba et sdmc:/config/edizon/theme.ini.\n- Ouverture plus rapide / détection des jeux.\n- Correction des appels IP locaux.\n- Les relevés de température sont maintenant effectués par i2c.\n \nTéléchargement : EdiZon-Overlay\n \n \n \nLe programme NX-Activity-Log quand à lui proposé à l'origine par tallbl0nde, a été repris par zdm65477730, Damien Zhao. Il a rajouté le support du firmware 19.0.0.\n \n \n\n \n \nTéléchargement : NX-Activity-Log\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197602/in-switch-nx-activity-log-et-edizon-overlay-a-jour-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197602/in-switch-nx-activity-log-et-edizon-overlay-a-jour-2.jpg"
        }
    },
    "news_9": {
        "title": "[PS5] PS5 PKG Passcode Finder v1 disponible",
        "content": "Le développeur SvenGDK propose un outil nommé PKG Passcode Finder qui est un logiciel de force brute qui permet de retrouver ou recouvrer un mot de passe perdu sur des PKG PS5. \n \nL'outil fourni de façon indépendante va probablement être intégré dans sa suite de solution  PS Multi Tools, mais en attendant il est possible de le télécharger seul. \n \n \n \n\n \n \n \nTutoriel : \n \n- Entrée PS5 PKG\n- Sélectionner un chemin de sortie temporaire\n- Attendre qu'un code d'accès soit trouvé\n \n \nTéléchargement : PKG Passcode Finder v1\n \n \n \n",
        "images": {}
    },
    "news_10": {
        "title": "[PS5] PS5 Jar Loader v2.1.0 disponible",
        "content": "Le développeur Hammer-83 propose la mise à jour de son outil PS5 Jar Loader, il s'agit de la version 2.1.0 qui apporte pas mal de nouveautés, notamment une tentative d'amélioration de la synchronisation lorsque plusieurs threads tentent d'afficher des messages de débogage à l'écran et dans le journal distant.\n \nA noter que cette version est rétrocompatible avec la v2.0.0. Les JARs construits pour la v2.1.0 devraient être compatibles avec la v2.0.0.\n \n \n \n\n \n \nLes étapes à suivre :\n \n- Compilez le projet et gravez le contenu de assembly/target/assembly-2.1.0 sur un disque BD-RE. L'ISO précompilé est également fourni. Compilez éventuellement avec -Dloader.logger.host=[IP du serveur d'enregistrement] pour envoyer la sortie à l'écran à un hôte distant.\n- Insérez le disque dans PS5 et exécutez le chargeur JAR.\n- Envoyez un payload : java -jar <payload.jar> <PS5 IP>\n \nTéléchargement : ps5-jar-loader 2.1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197598/in-ps5-ps5-jar-loader-v210-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] John Tornblom propose websrv en version 0.13",
        "content": "Le développeur John Tornblom propose une nouvelle version de son payload websrv pour la PS5, qui y sont sensibles bien entendu. Comme vous le savez, ce payload lorsqu'il est injecté permet d'éxecuter un simple serveur web, cependant il permet beaucoup de choses, puisqu'il permet de lancer des homebrews via le webkit ou bien à distance via un PC, smartphone ou des appareils compatibles.\n \nDans cette nouvelle version 0.13, le développeur a fait évoluer quelques scripts pour améliorer certains aspects de sa proposition. \n \n \n\n \n \n \nChangelog : \n \nhomebrew : remplacer les fichiers bin par des scripts de construction\nci : construire homebrew en utilisant des scripts de construction\nscummvm : commit initial\nfbneo : impression du chemin de configuration sur stdout\nelfldr : rendu cosmétique sur stdout\n \n \nTéléchargement : webserv 0.13\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197547/in-ps5-john-tornblom-propose-websrv-en-version-013-1.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] Sys-con v1.4.3 disponible",
        "content": "Le développeur français o0Zz a pris la suite de Cathery avec Sys-con, et il le fait plutôt bien puisque les versions s'enchainent et ajoutent de nombreuses fonctionnalités. Inspiré du projet sys-con de Cathery, ce nouveau fork a été réalisé pour ajouter le support de toutes les manettes compatibles PC (avec un profil HID). \n \nAvec Sys-Con vous profiter de ses fonctionnalités, telles que le support des joysticks et gamepads avec profil HID, la configuration des touches en fonction du VID/PID de la manette, la gestion de la deadzone et la personnalisation de la couleur des manettes. Le module Sys-Con permet d’utiliser des contrôleurs tiers sur votre console Nintendo Switch en connectant simplement vos manettes via les ports USB du dock ou via le port USB-C avec un adaptateur OTG.\n \n \n\n \n \nCette nouvelle version 1.4.3 ajoute quelques correctifs :\n \n- Correction du bouton de guide XBOXOne qui ne fonctionne pas (régression par rapport à la version 1.4.0)\n- Ajout de la prise en charge de 8BitDo Ultimate 2C (manette XBOXOne)\n- Problème résolu avec les contrôleurs HID qui n'ont pas de profil Joystick/manette de jeu en première position.\n \n \nTéléchargement : Sys-con v1.4.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197545/in-switch-sys-con-v143-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[Wii] cdbackup v1.4.0 disponible",
        "content": "Une nouvelle version de cdbackup a été publiée par Naim2000, il s'agit de la version 1.4.0 qui apporte son lot de nouveautés et de corrections. Pour rappel, cette application homebrew apporte des modifications permanentes à la mémoire NAND du système de la Nintendo Wii. Par conséquent, cette application doit être utilisée avec prudence. \n \n \n\n \n \nElle permet notamment de :\n \n- Sauvegarder/restaurer/exporter les données du tableau de messages Wii.\n- Sauvegardez/restaurez les données du tableau de messages Wii sur cdbackup.vff sur votre carte SD ou clé USB, exportez tous les messages au format texte ou supprimez-les entièrement de la Wii.\n \nEt cette nouvelle version 1.4.0 apporte ces nouveautés : \n \n- Les messages exportés sont désormais convertis en UTF-8 afin qu'ils ne s'affichent pas comme ceci\n \n\n \n- Ajout d'une option d'extraction brute pour cdbackup.vff\n- Correction du bug qui négligeait le périphérique de stockage de masse USB si aucune carte SD n'était insérée\n \n \nTéléchargement : cdbackup v1.4.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197542/in-wii-cdbackup-v140-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1197542/in-wii-cdbackup-v140-disponible-2.png"
        }
    },
    "news_14": {
        "title": "[Switch] Switch Firmware Dumper v1.0 disponible",
        "content": "La version Switch Firmware Dumper v1.0 a été publiée le 19 octobre 2024. Cet outil permet aux utilisateurs de sauvegarder le firmware actuel de leur Nintendo Switch. La dernière mise à jour inclut des ajustements pour la version actuelle de libnx et corrige un problème où la suppression du dossier contenant le firmware sauvegardé échouait.\n \nSwitch Firmware Dumper est un dumpeur de firmware modifié qui est capable d'obtenir un dump de firmware à partir de votre NAND, le dump sera compatible avec Daybreak ou ChoiDujourNX.\n \n \n \n\n \n \nLe code d'origine provient de https://github.com/JDK/biggestDump , le code a été moddé par mrdude. \n \nIl s'agit de la dernière version de code avec la dernière LibNX pour prendre en charge le firmware 19+ avec le fix qui corrige une erreur sur le dossier de suppression des fichiers dumpés. \n \n \nTéléchargement : Switch Firmware Dumper v1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197540/in-switch-switch-firmware-dumper-v10-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] MissionControl supporte le dernier firmware 19.0.0",
        "content": "MissionControl est un module sysmodule pour la Nintendo Switch qui permet de connecter des contrôleurs Bluetooth d’autres consoles sans avoir besoin de dongles ou de matériel externe, pour en profiter il faut bien entendu que votre Switch soit hackée.\n \nVoici ses principales fonctionnalités, notamment les contrôleurs supportés : \n \n- Nintendo : Wii Remote + extensions, WiiU Pro Controller\n- Sony : DualShock 3, DualShock 4, DualSense (PS5)\n- Microsoft : Xbox One S/X Controller\n- Autres : NVidia Shield Controller, 8BitDo SN30 Pro, GameSir G3s, et bien d’autres\n \n \n\n \n \nChangelog : \n \n- Support pour le firmware 19.0.0 : Cette version est compatible avec la dernière mise à jour du firmware de la Nintendo Switch.\n- Amélioration de la précision du HD Rumble : La décodification des vibrations a été réécrite pour fonctionner sans erreurs.\n- Correction des problèmes de vibration : Les contrôleurs ne vibreront plus de manière erratique dans certains jeux.\n- Correction des erreurs liées aux amiibo : Certains jeux ne se bloqueront plus lors de la lecture des données amiibo avec des contrôleurs non officiels.\n- Cette mise à jour nécessite Atmosphère v1.8.0 ou une version ultérieure\n \n \nTéléchargement : MissionControl v0.12.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197415/in-switch-missioncontrol-supporte-le-dernier-firmware-1900-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS5] PS5 PKG Tool v1.0.5 disponible",
        "content": "Le développeur Master-s a mis en ligne il y a quelques heures une nouvelle version de PS5 PKG Tool, le fork de l'outil de DNNDHH, qui permet de construire des PKG pour la PS5. \n \n \n\n \n \n\n \n \n \nIl améliore son outil en y apportant des options de configurations supplémentaires, ainsi il a dévoilé une vidéo dans laquelle il modifie le fonds d'écran selon l'icone utilisée au sein même de l'app. \n \n \n \n\n \n \n \nIl ne nous donne pas de réel changelog de cette version, tout comme pour la version 1.04, ce qui est dommage, mais comme vous le savez sous PS5 PKG Tool se cache un outil qui va vous permettre de créer et gérer des fichiers de package (PKG) pour la PlayStation 5. Il comprend des fonctionnalités pour construire, modifier et installer des fichiers PKG, qui sont essentiels pour le développement de jeux et le modding.\n \n \nTéléchargement : PS5 PKG Tool v1.0.5\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197405/in-ps5-ps5-pkg-tool-v105-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1197405/in-ps5-ps5-pkg-tool-v105-disponible-2.png"
        }
    },
    "news_17": {
        "title": "[PS3] webMAN MOD v1.47.47e disponible",
        "content": "Le développeur Aldo Vargas, connu aussi sous le pseudonyme d'Aldostools, propose une nouvelle version de son plugin webMAN MOD, il s'agit de la version v1.47.47e qui comme vous le savez se destine à la PlayStation 3.\n \n \n\n \n \nAu programme, de nouvelles options et de nouvelles commandes : \n \n- Nouvelle option dans /setup.ps3 pour afficher l'URL actuelle sous forme de code QR\n- Nouvelle commande Web /qr.ps3<texte>\n- Mise à jour cumulative (inclut plus de 54 modifications apportées à la suite d'outils après la publication initiale de la version 1.47.46).\n- La combinaison R2+O annule désormais le processus de balayage du contenu en cours \n- Scan pour les couvertures de ROMS dans covers_retro de multiMAN\n- Amélioration de l'algorithme de balayage du contenu (les groupes ROMS et jeux permettent maintenant de trouver plus de jeux) \n- Ajout de nouvelles étiquettes de nom de fichier $RND$, $000$, $NEW$\n- Correction des entrées CUE/BIN dupliquées dans le dossier ROMS\n- Correction d'une erreur de segmentation lors de l'analyse d'un grand nombre de ROMS\n \n \nTéléchargement : webMAN MOD v1.47.47e\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197404/in-ps3-webman-mod-v14747e-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[XBX] Les nouveaux modèles Xbox Series X ont une puce 6 nm",
        "content": " \nComme vous le savez certainement les consoles Xbox et PlayStation partagent leur APU (processeur central) sur les chaînes de production de TSMC, sans pour partager le même processus de production, ils profitent de la même finesse de gravure. \n \n \n\n \n \nAinsi les nouveaux modèles Xbox Series X, sans disque et de 2 To, dispose d'une puce plus petite que celle des versions précédentes, un peu comme les nouvelles puces présentes dans la PS5 Pro, nous comprenons que Microsoft a fait l'impasse sur un nouveau modèle là où Sony a engagé la course à la puissance. \n \n \n\n \n \nUne fois cela confirmé, il faut noter que cette puce de 6 nm consomme moins d'énergie puisqu'elle permet d'économiser 10 watts lorsqu'elle tourne au ralenti, et jusqu'à 16 watts pendant une session de jeu. La console originale de la Xbox Series X fonctionne à environ 61 watts au repos sur le dashboard Xbox, mais sur le nouveau modèle en édition spéciale de 2 To, ce chiffre tombe à environ 51 watts au repos et à seulement 38 watts sur la Xbox Series X numérique. Pendant le jeu, la Xbox Series X originale fonctionne à 167 watts, le modèle sans disque à 156 watts et le modèle 2 To à 151 watts.\n \n \n\n \n\n \n \nCette nouvelle puce permet également à Microsoft de changer le système de refroidissement, et également de revoir techniquement la carte mère qui a été totalement repensée. \n \n \nTout est là : Theverge.com\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197403/in-xbx-les-nouveaux-modeles-xbox-series-x-ont-une-puce-6-nm-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197403/in-xbx-les-nouveaux-modeles-xbox-series-x-ont-une-puce-6-nm-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1197403/in-xbx-les-nouveaux-modeles-xbox-series-x-ont-une-puce-6-nm-3.jpg"
        }
    },
    "news_19": {
        "title": "[Switch] Atmosphere 1.8.0 officiellement disponible (prerelease)",
        "content": " \nSciresM est de retour et propose officiellement la version 1.8.0 d'Atmosphere sur son github, il s'agit de la version c6014b5 qui est la prerelease, ainsi même s'il s'agit de la quatre-vingtième version officielle d'Atmosphère, pour le moment il s'agit d'une préversion, et des problèmes peuvent être trouvés qui doivent être corrigés avant la sortie de la version complète.\n\n \nSi des bugs sont signalés pendant la préversion d'Atmosphère, ils seront corrigés et la version sera mise à jour. Merci à switchbrew, Atmosphère 1.8.0 est fourni avec hbl 2.4.4, et hbmenu 3.6.0.\n\n \n \n\n \n \n\nChangelog : \n \n- Le support de base a été ajouté pour le firmware 19.0.0.\n- La console devrait démarrer et l'atmosphère devrait être pleinement fonctionnelle. - Cependant, tous les modules n'ont pas été entièrement mis à jour pour intégrer les derniers changements.\n- Il ne devrait rien en résulter de visible pour l'utilisateur, mais ce problème sera traité dans une prochaine mise à jour d'atmosphère. Il reste également un point d'action de la version 18.0.0 à traiter.\n- Exosphère a été mis à jour pour intégrer les dernières évolutions du moniteur sécurisé.\n- Mesosphère a été mis à jour pour disposer des derniers changements du kernel.\n- Le loader a été mis à jour pour disposer des dernières évolutions.\n- pm a été mis à jour pour disposer des dernières évolutions.\n- ro a été mis à jour pour disposer des dernières évolutions.\n- Les modèles d'accès aux fichiers de creport ont été optimisés, ce qui améliore grandement les performances lors de la génération d'un rapport de crash.\n- Atmosphère utilise maintenant les relocalisations relr lorsque c'est possible.\nCela réduit la taille des fichiers d'un certain nombre de modules d'atmosphère.\n- Un certain nombre de problèmes mineurs ont été corrigés et des améliorations ont été apportées :\n- Le support a été corrigé pour faire fonctionner Atmosphère sur des unités plus récentes avec des puces DRAM Hynix/Micron spécifiques.\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \n\n \nTéléchargement : Atmosphere 1.8.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2146576139.png"
        }
    },
    "news_20": {
        "title": "[Switch] sys-clk, SaltyNX, sigpatch-updater et sys-botbase disponibles",
        "content": "Cela bouge sur le firmware 19.0.0 de la Switch, après la sortie de la mise à jour des Sys-patch, une version moddée des Sys-patch modifiant le patch ES FW18 + 19, et ajoutant le patch FS taillé pour le firmware 19.0.0. Les autres patchs restent les mêmes.\n \nA noter que si vous avez installé IPS/Patches.ini et que vous l'utilisez en même temps - sur FW19 - nocntchk_FW19_1 dira qu'il n'est pas corrigé, même s'il l'est. \n \n \n\n \n \nSys-clk et sys-botbase ont également été mis à jour apportant le support du firmware 19.0.0 et aussi d'Atmosphere 18.x. Pour rappel, sys-botbase est un module qui permet de prendre le contrôle à distance de votre Switch via une connexion WiFi, afin de lire ou d'écrire par exemple dans la mémoire du jeu. \n \n \n \nTéléchargement : Sys-patch (de Miniminx) / switch/off_switch.nro / sys-botbase / sys-clk / sigpatch-updater\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-601525428.jpg"
        }
    }
}