{
    "news_1": {
        "title": "[PS5] Direct Package Installer support la PS5",
        "content": "Nouveauté importante dans Direct Package Installer, son auteur marcussacana vient en effet de rajouter le support initial de la PS5. \n \nComme vous le savez l'outil Direct Package Installer vous permet de prévisualiser et d'envoyer des PKG sur votre PS4 via Remote Package Installer à partir de liens directs.\n \nS'appuyant sur le serveur de GoldHEN ou de Remote Package Installer, Direct Package Installer est compatible avec des services d'hébergement comme Alldebrid, Realdebrid, Google Drive, Mediafire, PixelDrain ou encore beaucoup d'autres. \n \nLe support initial de la PS5 semble marquer la volonté de basculer les possibilités offertes de Direct Package Installer sur PS5. \n \n \n\n \n \n \nChangelog 8.3.0 : \n \n- Prise en charge initiale de la PS5 \n- Ajout de la prise en charge d'etaHEN DPIv2\n- Ajout de la prise en charge de la détection automatique de l'IP PS5\n \n \nTéléchargement : Direct Package Installer avec support la PS5 (v8.3.0)\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206603/in-ps5-direct-package-installer-support-la-ps5-1.png"
        }
    },
    "news_2": {
        "title": "[PS4] Le portage 8.00 à 9.60 de PSFree est réalisé à 99 %",
        "content": "Selon le développeur Al Azif, le portage de l'exploit PSFree sur les firmwares compris entre le 8.00 et 9.60 sur PS4 est réalisé à 99 %. Selon lui il ne manque désormais que les chaînes JOP, il nous informe qu'il les a un peu mélangé en uilisant plusieurs parefeu simultanément. \n \nDeux solutions, soit il repart de zéro, soit il utilise d'autres implémentations, mais l'objectif est désormais en ligne de mire, ce n'est qu'une question de jours.\n \nIl dit qu'il ne pourra pas tout terminer avant le week-end prochain, car il a du travail cette semaine, tout est configué pour les consoles, et les firmwares, il ne restera qu'à ajouter un loader de payloads. \n \nIl tient déjà à remercier abc pour la publication des implémentations et toutes les personnes impliquées. Les crédits, la licence et le lien de don sont conservés tels que publiés par abc, et il rajoute calmboy2019 au crédit pour avoir testé toutes les modifications.\n \n \n \n\n \n \n \nEnfin il confirme que le DNS bénéficiera d'une mise à jour importante prochainement, avec quelques nouveautés, il pense avoir trouvé un moye de le rouvrir, une solution client sans utilité générale, mais il pense que ça fonctionnera.\n \nLes pare-feu affectés par les exploits utilisés sont répertoriés dans le fichier Lisez-moi sous forme de tableaux faciles à lire. Lapse fonctionnera, mais PSFree ne fonctionnera pas comme point d'entrée.\n \nLa Todo List se trouve dans le lien ci-dessous . \n \n- Intégrer le chargeur de charge utile (Test sur 8.00-8.03)\n- Réécrire les chaînes JOP dans rop/ps4/850.mjs, rop/ps4/900.mjs, etrop/ps4/950.mjs\n- J'ai mis au rebut ceux que j'avais...\n- lapse.mjs: Définissez simplement les bits pour les privilèges JIT\n- view.mjs:Suppose la PS4, prend également en charge la PS5\n- Ajouter la prise en charge de la PS5\n \n \n \nTéléchargement : PSFree 1.5.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206602/in-ps4-le-portage-800-a-960-de-psfree-est-realise-a-99-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS5] Flat_z envisage un Hen v2",
        "content": "Sur le discord de regroupement de l'ensemble des utilisateurs expérimentés de hack PlayStation, le développeur Flat_z a émis l'idée de proposer une nouvelle version du Hen pour la PlayStation 4 mais aussi pour la PlayStation 5.\n \nDans un message évocateur, le développeur informe avoir trouvé un autre moyen, plus facile, que les possibilités actuelles, il dit que sa solution permettrait d'apporter les fpkgs sur PS5, et que les jeux PS4 fonctionneront plus rapidement.\n \n \n\n \n \nDu calme, pour le moment il ne s'agit qu'une théorie, rien de concret n'est réellement sorti, pas de Poc ou de piste certaine, mais il annonce avoir fait du rétro-engineering sur une partie du code. Il a rajouté qu'il doit maintenant prendre le temps de voir si cela fonctionne sur chaque firmware. \n \n \n\n \n \nBien entendu, ce n'est que les prémices de ce qui pourrait au moins être une évolution des solutions actuelles, wait and see. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206572/in-ps5-flat-z-envisage-un-hen-v2-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206572/in-ps5-flat-z-envisage-un-hen-v2-1.jpg"
        }
    },
    "news_4": {
        "title": "[Switch] Goldleaf et uLaunch ont été mis à jour par XorTroll",
        "content": " \nLe développeur XorTroll propose les mises à jour de uLaunch et de Goldleaf, l'idée est d'apporter des améliorations et de nouvelles fonctionnalités, mais pas que ça. \n \nLa nouvelle version 1.2.0 de uLaunch apporte à cette version la correction de la prise en charge d'Atmosphère 1.9.0 et des firmwares 20.0.0/20.0.1. uLaunch est une alternative personnalisée à l’interface originale de la Nintendo Switch, qlaunch.\n \nDéveloppée par XorTroll, elle propose un menu paramétrable mêlant jeux et homebrews, ce qui tranche avec l’austérité de l’interface proposée par Nintendo, bien trop épurée.\n \nLe changelog de la v1.2.0 est énorme.\n \n \nChangelog for v1.2.0 :\n \n \nGénéralités\nAvant toute chose, comme toujours : de nouveaux textes de langue ont été ajoutés pour refléter les changements ci-dessous, et d'autres corrections internes mineures ont été effectuées (qui ont probablement très peu d'impact sur l'expérience de l'utilisateur).\n \nCompilé avec les derniers changements de libnx et Atmosphère 1.9.0, supportant jusqu'au firmware 20.0.1\n \nCorrection de problèmes où certains fichiers de thème n'étaient pas correctement mis en cache et ne se chargeaient donc pas.\n \nDésormais, les processus d'applets de uLaunch (uMenu, alias le menu HOME visible, et uLoader, alias tout homebrew lancé sous forme d'applets depuis uMenu) sont chargés par défaut au-dessus de l'applet album.\n \nAuparavant, uMenu s'exécutait par défaut sur eShop et uLoader sur le contrôle parental... ce qui était un choix plutôt arbitraire fait il y a des années.\n \nLe code de uSystem a été adapté pour que uLoader, uMenu et les autres applets utilisées s'exécutent sur le même type d'applet (maintenant uMenu, uLoader et l'album normal s'exécutent tous sur le processus de l'applet album) car cela aurait causé des problèmes dans les versions précédentes.\n \nIl s'agit peut-être d'une spéculation, mais faire tourner notre matériel sur album serait probablement plus sûr que d'utiliser quelque chose comme eShop.\n \nLa chaîne par défaut (si tous les fichiers de langue n'ont pas été chargés) est maintenant <inconnu> au lieu d'une chaîne vide.\n \nLes applications invalides, précédemment sélectionnées comme homebrew takeover sont réinitialisées (si vous avez sélectionné une application comme homebrew takeover et que vous avez ensuite supprimé l'application, uLaunch se plantait auparavant en essayant de lancer homebrew par dessus, mais maintenant un tel paramètre invalide est automatiquement nettoyé).\n \nLa configuration est maintenant unique par emuMMC ou sysMMC ! Cela signifie que emu/sysmmC auront des configurations indépendantes (oui, cela signifie des thèmes différents !)\n \nuLaunch convertira automatiquement les paramètres globaux en paramètres sys/emu : ils seront les mêmes, copiés depuis les paramètres globaux, mais à partir de maintenant, tout changement ne sera effectué que sur la MMC courante (sys/emu) !\n \nUn bug mineur de cache d'entrée de homebrew a été corrigé, maintenant si un homebrew est mis à jour pendant que uLaunch est actif (homebrew qui se met à jour automatiquement, envoyé via le NetLoader de hbmenu) il sera mis en cache en conséquence (avant cela, le chargement du cache échouait et l'entrée s'affichait comme \" ???\" invalide).\n \n \nuMenu\nLorsque l'on appuie sur B dans un dialogue, le bouton d'annulation est brièvement mis en évidence avant de disparaître, afin de montrer plus clairement que le dialogue a été annulé.\n \nLe problème qui faisait que les applets d'ouverture de uMenu (le clavier, la page utilisateur, etc.) affichaient les graphiques de l'applet précédente en arrière-plan est enfin corrigé !\n \nAjout de la prise en charge de la réaffectation des boutons et de la mise à jour des contrôleurs ! Il s'agit désormais d'options supplémentaires dans le menu spécial \"Contrôleurs\".\n \nLa suspension des applets a maintenant un effet de fondu similaire à celui de la suspension des applications, ce qui est très joli IMO \n \nDes corrections similaires ont été effectuées lors du lancement d'applets via uMenu (clavier, contrôleur) où auparavant un fond sombre était affiché, maintenant (comme avec le menu HOME normal) l'écran uMenu est affiché de manière floue en arrière-plan (des petits détails qui rendent tout plus joli !).\n \nLors du lancement des applets, un effet de fondu est effectué avec la couleur du thème sous-jacent (clair ou foncé) pour faire une transition plus agréable entre les thèmes colorés et le style minimaliste clair/foncé que les applets utilisent de toute façon \n \nAjout d'une journalisation supplémentaire pour le dépannage futur des temps de chargement.\n \nCorrection mineure lors de l'affichage du clavier : maintenant le curseur est correctement initialisé à la fin (s'il y avait du texte initial, comme lors du changement de pseudo de la console)\n \n \n \nMenu principal\nLes menus sont désormais chargés paresseusement (ils ne sont chargés que lorsque vous y accédez), ce qui pourrait améliorer les performances (marginalement ?).\n \nLe démarrage de uLaunch n'affiche pas le lockscreen (si activé), il va directement au menu de démarrage comme d'habitude\n \nCertains textes de l'interface utilisateur (titre et auteur/version dans le menu principal) ne dépassent plus leurs limites s'ils sont trop longs (un nouveau système d'animation simple est utilisé pour les afficher)\n \nLe plantage du module audio lors de la suspension de certains jeux est enfin corrigé ! Pour les détails techniques, consultez le README du repo concernant la construction.\n \nL'heure et la date ne sont re-rendues que lorsque les valeurs changent réellement (encore une fois, amélioration marginale des performances ?)\n \nLes jeux qui ont besoin d'une mise à jour sont maintenant traités correctement (parfois ils peuvent être lancés et parfois non, les deux cas sont distingués maintenant).\n \nUne animation simple mais habituelle est présente dans le texte de l'heure, où les points \" :\" entre les minutes et les secondes clignotent occasionnellement (également dans le menu de l'écran de verrouillage).\n \nLes entrées homebrew spéciales (hbmenu et uManager à partir de maintenant) ne peuvent pas être ajoutées à nouveau, puisqu'elles sont faites pour être toujours présentes dans le menu (c'est pour cela qu'elles sont spéciales)\n \nUn message d'erreur dédié est affiché lorsqu'un thème ne se charge pas (et que le thème par défaut a été chargé à cause de cela), ou lorsqu'un thème est obsolète (mais qu'il a quand même été chargé)\n \nCorrection du SFX joué en permanence lorsque l'on spamme L/R pour déplacer des pages dans le menu (maintenant le SFX n'est joué que lorsqu'il est déplacé)\n \nCorrection d'un comportement graphique gênant lorsque l'on spamme +/- pour redimensionner le menu\n \nSi l'on sélectionne un jeu qui est le homebrew takeover, l'option pour définir comme homebrew takeover n'est plus affichée (parce que c'était inutile)\n \nMaintenant, appuyer sur le bouton HOME à l'intérieur d'un dossier le ramène d'abord au début, puis une seconde pression le ramène à la racine du menu HOME (auparavant, il retournait directement au menu racine).\n \nLa disposition des menus est maintenant unique par utilisateur et par sys/emuMMC ! uLaunch copiera automatiquement le menu actuel (global) pour tous les utilisateurs, et à partir de là, toute modification du menu sera unique pour l'utilisateur \n \nCorrection d'un bug où renommer un dossier ne mettait pas à jour le texte du nom du dossier sur l'icône du dossier.\n \nLes icônes de jeu ne sont plus mises en cache par uLaunch lui-même : la console a déjà son propre système de cache, et le simple fait de s'appuyer dessus (comme le fait le menu HOME normal) a toujours été plus rapide que de charger nos icônes mises en cache depuis la carte SD (c'est juste qu'il m'a fallu quelques années pour le remarquer) ; une autre conséquence est que, lorsque l'on change de langue dans la console, les icônes reflètent correctement la langue correspondante (ce qui ne fonctionnait pas toujours comme prévu auparavant)\n \nLes icônes des comptes/utilisateurs ne sont plus mises en cache (pour plus ou moins la même raison que pour les jeux) ; ainsi, lors de la création d'un nouvel utilisateur / de la modification de l'icône d'un utilisateur, le changement est correctement reflété dans le menu \n \n \nMenu des paramètres\nLe paramètre qui vérifie les mises à jour du système ne se bloque plus lorsqu'il attend une connexion (un délai d'attente l'empêche maintenant).\n \nLes mouvements entre les menus de réglages ont été réécrits, ils sont maintenant beaucoup plus fluides (vous pouvez aussi vous déplacer avec ZL/ZR et le D-pad gauche/droit)\n \nDe nouveaux paramètres uLaunch ont été ajoutés :\n \nVersion de uLaunch\n \nService audio utilisé par uLaunch\n \nRéinitialisation de l'application utilisée pour la prise de contrôle du homebrew (il n'y avait aucun moyen de le faire auparavant)\n \nLancer homebrew comme application par défaut (désactivé par défaut, ne prend effet que si une application de reprise est sélectionnée)\n \nDeux nouveaux sous-menus sont introduits... pour la prise en charge des périphériques audio Bluetooth ! Un sous-menu pour (dé)connecter/désapparier les appareils déjà appariés, et un autre pour rechercher de nouveaux appareils.\n \n \nThèmes\nNouveau numéro de version du thème : 3\n \nuLaunch est conçu pour essayer de rendre les thèmes aussi rétrocompatibles que possible, donc les thèmes précédents devraient fonctionner sans problème\nL'extension pour les thèmes est maintenant .ultheme au lieu d'un simple .zip (c'est toujours un fichier ZIP dans le contenu, cependant)\n \nuLaunch lui-même renommera automatiquement les thèmes .zip valides dans le répertoire themes \n \nuDesigner supportera le chargement des thèmes .zip et .ultheme, mais les sauvegardera sous .ultheme à partir de maintenant\n \nLes EntryIcons et OverIcons doivent être fournies en tenant compte du fait que les icônes de menu ont une taille de 384x384 dans le pire des cas (il était auparavant recommandé d'envisager une taille de 256x256).\n \nLes entrées de texte peuvent être configurées pour avoir une largeur maximale et animer leur affichage dans le cas contraire (voir la correction du texte de l'interface utilisateur ci-dessus) :\n \nUtilisation des options clamp_width, clamp_speed et clamp_delay\nUn nouveau SFX pour le menu des réglages a été ajouté : SettingMenuMove.wav\n \nDe nouveaux SFX pour le menu principal ont été ajoutés : MenuIncrement.wav et MenuDecrement.wav\n \nMaintenant, une version du thème par défaut avec DSi/Wii/3DS BGM/SFX sera incluse dans la version ! Vous pouvez maintenant la télécharger et expérimenter le thème par défaut d'une manière plus immersive \n \nThème par défaut\nLa partie supérieure du menu principal a été réorganisée pour afficher les titres des jeux de manière plus pratique.\n \nLes icônes ont été déplacées vers la partie droite\n \nLes couleurs d'arrière-plan (uniques pour l'application, le dossier, le homebrew, etc) ont été changées pour des couleurs plus attrayantes visuellement.\n \nMise à jour des EntryIcons, OverIcons et QuickIcons pour refléter la taille maximale de 384x384 des icônes. Pour certaines d'entre elles, le design / les couleurs de l'icône de base ont été changés pour des couleurs plus appropriées \n \nuSystem\nCode amélioré pour la détection du contenu ajouté ou supprimé\n \n \n \nTéléchargement : uLaunch 1.2.0\n \n \n \n \n\n \n \nEt en plus de cette nouvelle version de uLaunch, il a mis à jour Goldleaf en version 1.1.0 : \n \n \n \n \nChangelog v1.1.0\n \nGénéral\nMise à jour pour la dernière version de Plutonium (bibliothèque d'interface utilisateur) :\n \nLors de l'annulation d'un dialogue, l'option \"annuler\" est focalisée avant la fermeture (pour indiquer visuellement qu'il a été annulé).\n \nLa résolution par défaut est toujours de 1080p en interne (voir les conséquences ci-dessous)\n \nGoldleaf\nCorrection d'un problème où les couleurs d'arrière-plan personnalisées n'étaient pas correctement analysées par Goldleaf.\n \nGoldleaf est maintenant en 1080p ! Diverses modifications pertinentes de l'interface utilisateur ont été apportées dans cette version :\n \nLa palette de couleurs n'est plus générée aléatoirement au démarrage : il y a maintenant une palette de couleurs bleu clair/foncé par défaut (bien que vous puissiez toujours la personnaliser vous-même) ainsi que la couleur or du projet.\n \nDe nouvelles icônes sont utilisées partout (car j'ai dû en trouver de nouvelles qui avaient de bonnes résolutions)\n \nLes paramètres de Goldleaf ont (légèrement) changé : les noms des paramètres sont (légèrement) différents maintenant, et la personnalisation des couleurs est faite d'une manière plus organisée (consultez le README pour tous les détails)\n \nLe menu mémoire/espace a été réorganisé et occupe l'espace d'une manière plus attrayante sur le plan visuel.\n \nLes textes trop longs sont désormais bridés, afin qu'ils ne dépassent pas les limites prévues.\n \nLa taille des répertoires n'est désormais calculée que si un paramètre (désactivé par défaut) est activé, car cela entraînait des ralentissements lors de la sélection de grands répertoires à d'autres fins.\n \nLors de l'exportation/déversement du contenu, les noms contenant des caractères FS invalides (« : », « / » ou « ») sont désormais remplacés pour éviter les problèmes lors de la création du PSN exporté.\n \nSuppression de l'ancien système de gestion des crashs, qui ne fonctionnait que la moitié du temps et rendait les choses ennuyeuses : les crashs sont gérés comme un homebrew normal (avec l'écran de crash habituel du système), et des informations détaillées sur ce qui a causé le crash sont enregistrées dans le fichier journal de Goldleaf.\n \nLes icônes sont désormais des ressources partagées en interne (auparavant, pour chaque élément de menu/endroit où il était utilisé, une nouvelle copie de l'icône était chargée en mémoire), ce qui devrait réduire l'empreinte mémoire et améliorer quelque peu les performances.\n \nAjout de dialogues de confirmation au dialogue de mise hors tension/redémarrage, pour éviter que des pressions ZL/ZR non désirées ne provoquent des arrêts/redémarrages non désirés.\n \nL'utilisation du navigateur web n'est plus autorisée si Goldleaf n'est pas lancé en tant qu'application (sinon, cela ne fonctionnera pas et provoquera un plantage).\n \nLes dossiers ont désormais deux icônes différentes, ce qui permet de distinguer visuellement les répertoires vides des répertoires non vides.\n \nCorrection d'un bug où le message après l'exportation d'un ticket/certificat n'était pas affiché du tout (une longue boîte vide était seulement affichée)\n \nL'icône du menu « image » s'affiche désormais également pour les images PNG/WEBP (même si elles ne peuvent pas être définies comme icônes utilisateur).\n \nMise à jour de la reconnaissance de la génération de clés jusqu'aux derniers firmwares 20.0.0/20.0.1\n \nPour les tickets utilisés, le titre du jeu est affiché à la place de l'ID de l'application dans les éléments du menu des tickets (l'ID peut toujours être visualisé en sélectionnant un ticket donné).\n \nAjout d'un traitement spécial lors de la suppression d'un compte qui est également lié (la suppression nécessite qu'il soit d'abord dissocié, ce qui est maintenant fait automatiquement).\n \nAjout de messages spéciaux de description des résultats pour les codes de résultats dédiés (ceux qui n'ont pas de description précédente ou ceux pour lesquels la description de base n'était pas vraiment informative pour les utilisateurs).\n \nCorrection du calcul de l'ETA lors de la copie de répertoires (qui affichait des valeurs absurdes lors de la copie de plusieurs petits fichiers) de manière à ce qu'il affiche des valeurs quelque peu cohérentes.\n \nL'icône de l'utilisateur est à nouveau exportée après avoir été modifiée.\n \nCorrection d'un bogue qui empêchait la journalisation de se dérouler correctement dans certains menus.\n \nLes systèmes de fichiers montés sont désormais correctement éliminés lorsque l'on quitte Goldleaf.\n \nPresser Y lorsqu'un fichier est focalisé dans le navigateur de fichiers affichera également ses options (comme presser A, donc Y a le même comportement pour les fichiers et les répertoires)\n \nL'ancien système de contenu a été complètement remplacé par un tout nouveau menu de liste de jeux :\n \nIl ne prend plus en compte/liste le contenu du système NAND, car c'était une fonctionnalité inutile (et lente).\n \nLa lenteur du chargement des contenus a été réduite grâce à l'utilisation d'un code threadé à chargement paresseux et à la mise en cache de nombreux éléments.\n \nLes jeux et leur contenu sont désormais directement consultables, au lieu de devoir choisir des espaces de stockage.\n \nDes informations utiles pour le débogage et le développement sont également affichées (dernier événement enregistré et drapeaux d'affichage).\n \nLe calcul de la taille est désormais plus simple et direct.\n \nLe montage des données de sauvegarde a été corrigé pour les jeux qui utilisent les données de sauvegarde de l'appareil au lieu des données de sauvegarde par utilisateur (comme Animal Crossing : New Horizons).\n \nSi aucun utilisateur n'a encore été sélectionné, la tentative de montage des données de sauvegarde demandera directement de sélectionner un utilisateur, et le montera en cas de succès.\n \nLe menu des tickets a été déplacé dans le menu principal\n \nLe menu de mise à jour a été fusionné avec le menu « about » : vous pouvez maintenant vérifier les mises à jour en appuyant sur A sur la page « about ».\n \nCorrection d'un bug de dump replace-all où les chaînes anglaises disaient \"g_Clipboard\" au lieu de \"clipboard\".\n \nLes informations sur les tickets affichent désormais également la gamme de versions de génération de clés (pas seulement sur les informations d'installation de NSP).\n \nLes fichiers *.bin vides ne peuvent plus être lancés (ou plutôt, Goldleaf ne peut plus essayer de les lancer)\n \nLes transitions et les mouvements dans les menus ont été rendus légèrement plus rapides (pour plus de commodité) et avec plus d'icônes/messages dédiés pour chaque menu.\n \nLa visionneuse de texte a été légèrement améliorée, permettant de se déplacer horizontalement pour lire de longues lignes, et ne rendant que la partie visible de chaque ligne.\n \n \n \nTéléchargement : Goldleaf 1.1.0\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206571/in-switch-goldleaf-et-ulaunch-ont-ete-mis-a-jour-par-xortroll-1.png"
        }
    },
    "news_5": {
        "title": "[PS4/PS5] PSFree v1.5.0rc1 la fin de la clé USB sur firmware 9.00",
        "content": "Avec l'arrivée de PSFree sur PS4 du firmware 6.xx au 9.60, et sur PS5 du firmware 1.xx au 5.xx, il va être désormais possible de se passer de clé USB sur les firmwares 9.xx sur PS4.\n \n \n\n \n \nDu firmware 8.xx au 9.60 nous avons un webkit exploit, donc le portage va être rapide, du firmware 10.00 au 12.02 il n'y a pas d'exploit webkit, il faudra passer par l'exploit lua, et à compter du 12.50 il n'y a aucun jailbreak, ni kernel exploit, juste l'exploit lua. \n \n \n\n \n \nAinsi PSFree est accessible sur 8.00, 8.01, 8.03, 8.50, 8.52, 9.00, 9.03, 9.04, 9.50, 9.51, 9.60, et ne l'est pas sur 10.00, 10.01, 10.50, 10.70, 10.71, 11.00, 11.02, 11.50, 11.52, 12.00, 12.02 fu fait qu'il n'y a pas d'exploit webkit. \n \n \n\n \n \nLe lancement sur le firmware 8.00 est ultra rapide, moins de 3 secondes, avec un taux de réussite de l'ordre de 60 %, cela doit encore être amélioré. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206567/in-ps4ps5-psfree-v150rc1-la-fin-de-la-cle-usb-sur-firmware-900-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1206567/in-ps4ps5-psfree-v150rc1-la-fin-de-la-cle-usb-sur-firmware-900-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1206567/in-ps4ps5-psfree-v150rc1-la-fin-de-la-cle-usb-sur-firmware-900-3.jpg"
        }
    },
    "news_6": {
        "title": "[PS3] BadWDSD, le qCFW pour les SuperSlim en Nor",
        "content": "Cela semble se concrétiser, avec avoir dévoilé et publié l'exploit BadHTAB, qui nécessite un appui software mais aussi hardware, la scène PS3 avance et les évolutions sont réelles. \n \nAprès l'exécution de Linux, c'est l'overclocking qui a été amené sur les PS3 ne disposant pas obligatoirement de CFW, mais c'est surtout le développeur esc0rtd3w, qui travaille sur PS3HEN, qui a dévoilé qu'il était possible de downgrade les SuperSlim disposant d'une mémoire NOR. \n \nAinsi BadHTAB a évolué vers BadWDSD, et il semble qu'un qCFW soit en développement. Cela semble aller vers ça, un CFW pas réellement complet, mais qui intègrerait une forme de PS3HEN. \n \nqCFW signifie \"Quasi-CFW\", l'objectif d'aomsin2526 (Kafuu) serait de déployer avec ce qCFW un loader Cobra depuis un coldboot, malheureusement, appldr doit être patché pour exécuter le custom niveau 2, cela signifie que cette fonctionnalité ne fonctionnera jamais sur BadHTAB, car si vous modifiez le code niveau 2, même d'un seul octet, le démarrage sera impossible. \n \n \n\n \n \nIl part sur l'idée de modifier le level 2 d'Evilnat, il était capable de gérer toutes les fonctionnalités sauf le dump de l'eid_root_key. La méthode d'installation est différente : vous ne pouvez pas installer de programme personnalisé de manière normale (et c'est une bonne chose, car l'installation d'un CFW existant risque de bricker).\n \nDe plus, il faut passer par une modification matérielle obligatoirement, même si ce n'est qu'une fois, il faut rendre ce qCFW permanent, les loaders seront toujours sécurisés et activés.  Sous CoreOS, les level lv0 (pour bootldr) et lv1.self (pour lv1ldr pour initialiser ATA) doivent rester intacts. Ensuite, y serons simplement ajouter des fichiers .diff pour appliquer les correctifs en mémoire après le chargement au démarrage (le fichier entier peut également ne pas être diff, mais il est trop volumineux). Le résultat final est donc identique à celui de CFW.\n \nLa puce est également compatible avec le firmware OFW. Dans ce cas, vous n'obtiendrez qu'un downgrade + un aperçu/une recherche de level 1 via hvcall 114. Le démarrage est également plus lent (30 secondes). Cependant, c'est plus sûr, car vous ne touchez pas à CoreOS. Vous pouvez donc toujours récupérer en cas d'erreur, d'échec ou de défaillance.\n \n \n \n\n \n \n\n \n \n \n \nTout est là : BadWDSD (le github de Kafuu) / psx-place.com (le thread officiel du projet)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206536/in-ps3-badwdsd-le-qcfw-pour-les-superslim-en-nor-1.png"
        }
    },
    "news_7": {
        "title": "[Vita] Apollo Save Tool v2.0.0 disponible",
        "content": "Le développeur Bucanero vient de mettre en ligne la version 2.0.0 d'Apollo Save Tool pour la PlayStation Vita. Les nouveautés sont nombreuses, et cette version 2.0.0 n'échappe pas à la règle, elle est riche en options et optimisations. Avec cette v2.0.0, vous pouvez désormais sauvegarder et restaurer vos sauvegardes Vita/PSP/PS1 sur le cloud en utilisant votre propre serveur FTP, mais le changelog est beaucoup plus détaillé. \n \n \n\n \n \nAjout :\n- Prise en charge du serveur FTP (enregistrement de la sauvegarde dans le cloud)\n- Compressez, téléchargez et sauvegardez les enregistrements sur un serveur FTP défini par l'utilisateur\n- Répertorier, télécharger et restaurer les sauvegardes à partir d'un serveur FTP défini par l'utilisateur\n- Sauvegarde des sauvegardes PS1, PSP et Vita\n- Ajoutez la prise en charge d'emplacements de stockage supplémentaires ( imc0, xmc0)\n \nMenu Paramètres :\n- FTP Server URLOption ajoutée\n- Ajout de l'option de sélection ( FTP/Online DB) pour les téléchargements de sauvegardes\n- Debug logOption persistante\n \nCorrections : \n- Correction .PSVde l'en-tête lors de l'exportation des sauvegardes PS1\n- Correction du processus de copie de sauvegarde sur le stockage utilisateur ( ux0:user/)\n \nDivers :\n- Mise à jour du moteur de correctifs Apollo vers la version 1.3.0\n- Correction du bug de recherche de code SW\n- Ajout de la fonction de hash djb2 \n- Ajout de la prise en charge des balises pour les options sélectionnées par l'utilisateur sur .savepatchles fichiers , par exemple,{ZZ}val=name;03E7=999 gold;...;270F=9999 gold{/ZZ}\n- Prise en charge de SaveWizard et des codes BSD avec plusieurs options\n- Bibliothèque cURL mise à jour vers la version 8.9.1\n \n \nTéléchargement : Apollo Save Tool v2.0.0\n \n  \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206533/in-vita-apollo-save-tool-v200-disponible-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] MissionControl supporte désormais les firmwares 20.0.x",
        "content": "Le développeur ndeadly vient de mettre à jour sa proposition MissionControl afin qu'elle puisse supporte les firmwares 20.0.0 et 20.0.1, une implémentation que de nombreux logiciels et homebrews Switch vont devoir adopter. \n \nIl s'agit de la vingt-sixième version officielle de Mission Control, cette version apporte donc un support complet pour les firmwares 20.0.0 et 20.0.1, une implémentation d'un nouveau format de mouvement basé sur les quaternions trouvé dans les firmwares des contrôleurs récemment par Banz99 ainsi que diverses autres corrections de bugs et améliorations. \n \n \n\n \n \nChangelog : \n \n- Ajout de la prise en charge complète des firmwares 20.0.X\n- Ajout de l'implémentation d'un nouveau format de données de mouvement basé sur les quaternions.\n- Ajout de correctifs exefs pour HID afin de modifier les indicateurs de fonctionnalités prises en charge pour les manettes Pro sous licence tierces. Le remappage des boutons, le stick analogique et l'étalonnage des mouvements sont désormais activés.\n- Le type de manette émulée a été remplacé par une manette Pro sous licence. Cela empêche la console de lire les données NFC des manettes émulées, ce qui provoquait des blocages et des grincements dans certains jeux.\n- Sysmodule n'initialise plus les services btm/btm:sys au démarrage afin de laisser les sessions disponibles pour d'autres applications homebrew.\n- Ajout d'un mécanisme via les correctifs exefs Bluetooth pour implémenter des commandes personnalisées appelées via la fonction IPC WriteHidData2. Cela permet d'exposer les fonctions internes de la pile Bluetooth.\n- Ajout de commandes IPC au service mc pour exposer les appels d'envoi de commandes HCI arbitraires et l'appel de la fonction interne BSA_DmSetConfig.\n- Ajout d'un mécanisme permettant aux logiciels externes d'utiliser la redirection d'événements de rapport caché pour consommer les événements redirigés ou les renvoyer au système.\n \nTéléchargement : MissionControl 0.13.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206493/in-switch-missioncontrol-supporte-desormais-les-firmwares-200x-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS3] Le downgrade de la PS3 Superslim grâce à BadWDSD",
        "content": " \nLe développeur esc0rtd3w que l'on ne présente plus a réussi à downgrade avec l'exploit BadWDSD. Conçu surtout pour permettre l'overclock cet exploit va donc être la solution pour la Superslim.\n \nL'utilisateur NGX a confirmé d'abord être la troisième personne à réussir à overclocker une PS3 Superslim grâce à cet exploit, les résultats concernant les valeurs maximales d'overclocking sont surprenantes, des possibilités énormes grâce à BadWDSD. \n \n \n\n \n\n \n \n \nMais la grande information vient donc de esc0rtd3w qui a réussi à downgrade, il informe sur psx-place.com que cela est plus facile que d'habitude avec une puce Pico installée. Il a downgrade une NOR superslim du firmware 4.91 au 4.40, et il affirme qu'un autre utilisateur a réussi à downgrade du 4.92 au 4.82. \n \n \n \n\n \n \nD'après ses informations, cela ne fonctionne que sur les NOR pas sur les eMMC, il tient à remercier Kafuu pour son excellent travail. \n \nLe développeur Kafuu a défini la version 4.00 lors de la récupération avec les correctifs de sa PS3, ce qui pourrait sembler être le firmware min accessible, mais il faudra un peu de temps pour le confirmer. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206492/in-ps3-le-downgrade-de-la-ps3-superslim-grace-a-badwdsd-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1206492/in-ps3-le-downgrade-de-la-ps3-superslim-grace-a-badwdsd-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1206492/in-ps3-le-downgrade-de-la-ps3-superslim-grace-a-badwdsd-3.jpg"
        }
    },
    "news_10": {
        "title": "[Switch] hekate v6.3.0 &#38; Nyx v1.7.0 disponibles",
        "content": " \nLe développeur CTCaer propose les mises à jour d'Hekate et de Nyx suite à la sortie du nouvel Atmosphère. hekate v6.3.0 & Nyx v1.7.0 viennent d'être mis en ligne pour apporter le support de la toute nouvelle version de chacun d'entre eux. Ces nouvelles versions amènent énormément de nouveautés, la principale étant le support du firmware 20.0.0 et 20.0.1. \n \n \n\n \n \n \nModifications de hekate v6.3.0\n- Prise en charge de HOS 20.0.0\n- Configuration : pkg3La prise en charge des clés ajoutées, qui remplacent fss0exactement la fonctionnalité,\nfss0continuera de fonctionner pour des raisons de compatibilité, mais elle est désormais obsolète . Elle deviendra obsolète\nà terme . fss0Assurez-vous donc de mettre à jour vos configurations pour l'utiliser pkg3.\n- Les modèles ont été mis à jour pour utiliser cette fonctionnalité.\n- Configuration : Ajout pkg3kip1skipde la prise en charge des clés. Utilisateurs avancés uniquement. Consultez le fichier README.\n- Configuration : atmospherela clé est désormais renommée en kernelprocidpour correspondre à ce qu'elle fait.\n- Seuls les utilisateurs avancés qui n'utilisent pas fss0/pkg3 sont concernés par cela.\n- Configuration : fss0experimentalla clé a été renommée enpkg3ex\n- Correction de l'analyse de system_settings.inil'activation USB3. Merci.@new-waifupour le rappeler.\n- Correction d'un problème qui pouvait provoquer un écran noir au démarrage du stock dans certains cas rares (lié à kerneldr)\n- L4T : Mise à jour du micrologiciel SC7exit vers la dernière version\n- L4T : Ajout d' sld_typeune clé qui vous permet de désactiver l'affichage transparent ou d'utiliser la méthode coreboot obsolète\n \nModifications emuMMC :\n- Prise en charge de HOS 20.0.0\n- Comme toujours basé sur https://github.com/m4xw/emuMMC\n \nModifications de Nyx v1.7.0 :\n- Prise en charge de HOS 20.0.0\n- Le benchmark SD/eMMC affiche désormais les IOPS standard du 95e et du 5e percentile. Il utilise également les tailles de test A2 conformes aux spécifications.\n- De plus, la fenêtre a été rendue plus compacte afin que les informations situées en dessous restent visibles pour le partage de captures d'écran.\n- En raison des modifications, il est préférable de comparer les cartes SD sur le même benchmark mis à jour.\n- Les 95 % des meilleurs accès correspondent généralement aux performances attendues.\n- Les 5 % des pires accès indiquent des parties NAND dégradées ou des copies de NAND SLC/MLC vers TLC/QLC, des vidages de cache importants, une mauvaise gestion du contrôleur, des bugs de microprogramme, etc.\n- SD Info vérifie désormais si la prise en charge A2 de la carte est correcte. Vert : prise en charge complète, Jaune : améliorations nécessaires, Rouge : cassé.\n- Les informations SD afficheront désormais immédiatement les erreurs SDMMC avant de calculer l'espace libre dans la partition FAT\n- Correction d'un problème où emuMMC pouvait ne pas être trouvé pour la sauvegarde ou la restauration\n- Correction d'un problème où la sauvegarde d'emuMMC pouvait échouer\n- La détection de la capacité réelle de la RAM est désormais plus robuste\n- J'ai rendu Nyx un peu plus rapide.\n- Correction d'un problème où la taille de la partition Android réservée pouvait être mal calculée sur le curseur HOS restant\n- Correction d'un problème où une fenêtre ne pouvait pas être fermée avec le bouton B du Joy-Con\n- Le rechargement de Nyx vérifiera désormais si nyx.bin existe toujours et ne se rechargera pas, afin que l'utilisateur puisse à nouveau résoudre ce problème avec UMS\n- Divers correctifs et améliorations\n \nModifications du BDK :\n- DIRLIST : il utilise désormais l'ordre alphabétique au lieu de l'ordre ASCII\n- SDMMC : Ne pas autoriser les accès hors limites, car ils nécessitent un cycle d'alimentation pour effacer l'erreur\n- SDMMC : ajout de la prise en charge de l'analyse des registres d'extension de performances\n- UITLS : fonctions de comparaison qsort ajoutées pour int, char et char insensibles à la casse.\n- SE : Prise en charge du hachage SHA256 de taille 0\n- Les pilotes SE et DISPLAY n'utilisent plus le tas\n- Divers correctifs et améliorations\n \n \nTéléchargement : hekate v6.3.0 & Nyx v1.7.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206477/in-switch-hekate-v630-nyx-v170-disponibles-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] Atmosphère 1.9.0 (pre-release) disponible",
        "content": "Le développeur SciresM vient de mettre en ligne Atmosphère 1.9.0, il s'agit de la version Pre-release, qui n'est plus ni moins la 89ème version officielle d'Atmosphère. Atmosphère 1.9.0 est actuellement en pré-version et des problèmes peuvent survenir et doivent être corrigés avant la sortie complète.\n \nAtmosphère 1.9.0 est fourni avec hbl 2.4.4 et hbmenu 3.6.0.\n \n \n\n \n \nLes éléments suivants ont été modifiés depuis la dernière version :\n \n- Un support de base a été ajouté pour la version firmware 20.0.0.\n- La console devrait démarrer et Atmosphère devrait être pleinement fonctionnelle. Cependant, tous les modules n'ont pas été entièrement mis à jour pour refléter les dernières modifications.\n- Il ne devrait rien y avoir de visible pour l'utilisateur en résultant, mais cela sera résolu dans une future mise à jour d'Atmosphère.\n- La même action que celle de la version 18.0.0 est toujours en cours, et je suis convaincu qu'elle sera finalement résolue. Quelqu'un m'a dit y travailler.\n- Il n'y a plus (à ma connaissance) d'éléments 19.0.0 en suspens.\n- Remarque : en raison des modifications apportées aux logiciels Nintendo dans la version 20.0.0, il y a environ 10 Mo de mémoire en moins disponible pour les modules système personnalisés.\n- Nous ne pouvons voler qu'un maximum de 14 Mo du pool d'applets, contre 40 Mo auparavant.\n- Pour compenser cela, ams.mitml'utilisation du tas de a été réduite de 20 Mo.\n- Pour faciliter cela, un nouveau module d'aide ( memlet) a été ajouté, afin que la mémoire puisse être temporairement volée pendant le processus de construction du romfs.\n- Espérons que cela entraînera relativement peu de casse, mais il est possible que les mods utilisateur qui remplacent un nombre extrêmement important de fichiers dans The Legend of Zelda: Tears of the Kingdom ne fonctionnent plus.\n- Si vous êtes concerné par ce problème, vous verrez « Data abort (0x101) » lorsque vous tenterez de lancer le jeu avec des mods.\n- Si cela se produit, veuillez nous contacter sciresmsur Discord pour partager votre rapport d'erreur binaire. Cependant, certains problèmes peuvent être impossibles à résoudre.\n- Je m’excuse sincèrement si le problème est impossible à résoudre, mais j’ai été inévitablement contraint de faire des compromis ici, et je pense que c’est le meilleur équilibre à trouver.\n- exosphère a été mis à jour pour refléter le dernier comportement officiel du moniteur sécurisé.\n- mesosphère a été mis à jour pour refléter le dernier comportement officiel du noyau.\n- loader a été mis à jour pour refléter le dernier comportement officiel.\n- pm a été mis à jour pour refléter le dernier comportement officiel.\n- ncm a été partiellement mis à jour pour refléter le dernier comportement officiel.\n- erpt a été mis à jour pour refléter le dernier comportement officiel.\n- Atmosphère a été mis à jour pour utiliser GCC 15/newlib (dernières versions de devkitA64/devkitARM).\n- Un certain nombre d'améliorations ont été apportées au moteur de triche dmnt.\n- De nouvelles instructions ont été ajoutées et des instructions ont été mises à jour pour des fonctionnalités améliorées/nouvelles.\n- Veuillez consulter les documents pour plus de détails - merci@tomvita!\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \n \nTéléchargement : Atmosphere 1.9.0 (Pre-release)\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206476/in-switch-atmosphere-190-pre-release-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[Divers] Nintendo a largement modifié son contrat d'utilisation du compte Nintendo",
        "content": "Est-ce que Nintendo ne serait pas en train de préparer l'arrivée judiciaire de la Switch 2, du moins, de finaliser les prémices judiciaires en mettant à jour ses services en ligne et l'utilisation des comptes qui sont liés à ses matériels. En effet, Nintendo a mis à jour son Contrat de Licence Utilisateur Final (CLUF) en y ajoutant des informations pour le moins contestables.\n \nNintendo vient de modifier 10 des 21 sections du contrat, et les modifications apportées spécifiquement aux sections 2 (Licence) et 16 (Règlement des litiges, Arbitrage exécutoire, Renonciation aux recours collectifs) ont suscité des interrogations, voir de l'indignation. \n \nLa première des modifications contestables est que le recours collectif devient impossible, en effet, si un client devient utilisateur de compte Nintendo, il doit désormais renoncer à son droit de poursuivre Nintendo par le biais d'un recours collectif. Exit également les procès devant jury, ni d'y participer vua un recours collectif impliquant Nintendo, tout devra se faire de manière individuelle, c'est à dire que cela devient impossible, surtout aux USA. \n \nLes recours collectifs pour les Joy-cons n'ont finalement rien donné car Nintendo disposait déjà de ce type de clauses dans le CLUF, mais désormais cela est étendu. \n \n \n\n \n \nLa seconde partie qui est choquante, il semblerait que Nintendo se réserve le droit de bricker la console ou le matériel qui tente de décrypter, de downgrade, de modifier ou de copier tout ou partie du code, ou de non-respect des modifications non autorisées spécifiées des services de compte Nintendo, ce n'est plus un blocage temporaire du compte, mais carrément du matériel.\n \n \n2. License\n \n\" Sans limitation, vous acceptez de ne pas (a) publier, copier, modifier, procéder à une Rétro-ingénierie, louer, décompiler, désassembler, distribuer, proposer à la vente ou créer des oeuvres dérivées de toute partie des Services de compte Nintendo ; ( contourner, modifier, décrypter, neutraliser, altérer ou contourner de toute autre manière les fonctions ou protections des Services de compte Nintendo, y compris par l'utilisation de tout matériel ou logiciel qui entraînerait un fonctionnement des Services de compte Nintendo non conforme à leur documentation et à leur utilisation prévue ; © obtenir, installer ou utiliser des copies non autorisées des Services de compte Nintendo ; ou (d) exploiter les Services de compte Nintendo autrement que conformément à la documentation applicable et à l'utilisation prévue, dans chaque cas, sans le consentement écrit ou l'autorisation expresse de Nintendo, ou sauf autorisation expresse contraire de la loi applicable. Vous reconnaissez qu'en cas de non-respect des restrictions susmentionnées, Nintendo peut rendre les Services de compte Nintendo et/ou l'appareil Nintendo concerné définitivement inutilisables, en tout ou en partie. \"\n \n \nNintendo devra préciser ce dernier point, il est bien trop important, que le ban concerne le compte Nintendo ou son utilisation cela peut s'entendre, par contre que cela touche directement le hardware, c'est une autre histoire ! Il faudra aussi s'assurer qu'à la disponibilité de la Switch 2, nous ne devions pas utiliser un compte Nintendo imposant un DRM en ligne pour pouvoir l'utiliser, des craintes qui vont devoir être levées. \n \n \nTout est là : accounts.nintendo.com / nintendo.com/us/eula-update/\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206465/in-divers-nintendo-a-largement-modifie-son-contrat-dutilisation-du-compte-nintendo-1.png"
        }
    },
    "news_13": {
        "title": "[PS5] AirPSX 0.14 disponible",
        "content": "AirPSX, le payload PS5 qui permet la gestion à distance d'une PlayStation 5 jailbreakée via un environnement de bureau Web similaire à AirDroid, passe en version 0.14.\n \nDans cette nouvelle version le développeur a voulu rajouter de nouvelles fonctions audio, en apportant notamment le support de format bien connus. \n \nPour rappel, AirPSX est une projet similaire à AirDroid, mais adapté pour la PS5 via une interface web, offrant des fonctionnalités comme la gestion des fichiers, l’exécution de scripts, et bien plus encore.\n \n \n\n \n \n \nLe développeur précise qu’il n’est pas responsable des dommages causés à la console ou de l’utilisation abusive de l’outil. AirPSX est construit avec le framework web hxwell, le code source est écrit en Haxe, qui est transpilé en C++ et compilé à l’aide du PS5 Payload SDK.\n \nAvec cette version 0.14, la prise en charge des formats tels que png, mp3, mp4, flac,... a été ajoutée au gestionnaire de fichiers et vous pouvez désormais afficher ces formats directement depuis le gestionnaire de fichiers.\n \nTéléchargement : AirPSX 0.14\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206464/in-ps5-airpsx-014-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] NeXT 3.34 Edition Prisas avec support partiel du firmware 20.0.1",
        "content": "Le développeur Vampitech vient de mettre en ligne la pré-version 3.34 de sa solution tout en un NeXT, pour rappel NeXT est un pack qui supporte les CFW que ce soit Atmosphere ou SX OS, de plus sa gestion des applications est largement simplifiée par une interface utilisateur très fonctionnelle. \n \nAvec la 3.34, qu'il nomme Prisas Edition, le développeur a souhaité apporté le support partiel du firmware 20.0.1 afin de pouvoir le tester uniquement. Vous l'aurez compris cette version est expérimentale et n'est pas destinée à un usage intensif et quotidien, elle se destine surtout aux testeurs, d'ailleurs \"Prisas\" signifie \"Pressés\". \n \n \n\n \n \nChangelog : \n \n- Support partiel du firmware 20.0.1\n- Atmosphere 1.9.0 QA_TEST\n- Hekate 6.2.3 BETA\n- MissionControl 0.13.0 DEVELOP\n- À des fins de test ! Non destiné à un usage quotidien, ceci n'est pas une version finale\n \nPour information, tous les correctifs, modules homebrew et modules système les plus importants ont été testés avant leur sortie publique afin de vérifier la compatibilité et le bon fonctionnement de cet AIO avec le dernier firmware système disponible. Cependant, les modules homebrew et modules système ne sont pas toujours mis à jour par leurs développeurs à chaque sortie de NeXT. Par conséquent, gardez à l'esprit que l'utilisation de modules homebrew et modules système non mis à jour peut provoquer des blocages ou des plantages du système. \n \n \nTéléchargement : NeXT 3.34 PRISAS EDITION\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206455/in-switch-next-334-edition-prisas-avec-support-partiel-du-firmware-2001-1.png"
        }
    },
    "news_15": {
        "title": "[PS4 PRO linux] Registres AMDGPU gladius + bzImages",
        "content": " \n \nJe fourni les registres de la carte graphique des PS4 PRO + des bzImages ayant ces options, sur ps4 pro belize et baikal\nLes ps4 fat/slim aeolia, belize et baikal peuvent les utiliser, mais ils ne pointent pas ces registres + fix gflops ( AMD Liverpool = PS4 fat/slim     AMD Gladius = PS4 pro )\n Cependant ces derniers bzImages ont aussi la possibilité de filmer un autre périphérique hdmi avec une ps4 fat/slim/pro aeolia/belize/baikal , et j'inclue des patchs gamer.\nJ'ai d'ailleurs filmé la video de la release , sur une ps4 pro belize linux + bzImages de la news + carte d'acquisition usb/hdmi branchée sur une deuxieme ps4 pro linux\n(la partie baikal a été testé par Lestat)\nDepuis la release en octobre 2022 des payloads linux ps4 pro (travail de rancido/mircoho + ma ps4 pro)https://www.youtube.com/watch?v=U_bMh4wf7sw\n\nun dump de la carte graphique a été effectué sur la ps4 pro de mircoho\n rancido (team psxita) a ajouté une fonction au chargeur Linux qui permet de vider la mémoire du GPU juste avant de redémarrer la PS4 et de lancer Linux.\nMircoho l'a ensuite utilisé sur sa Ps4 Pro et a généré un fichier cik, puis des tests ont été effectués.    Je n'ai récupéré que les valeurs que j'inclue dans cette release.\nCes bzImages ont les memes options kernel que mes releases de février 2024https://www.logic-sunrise.com/news-1187117-ps4-bzimages-aeoliabelize-51515-compiles-en-fulllto-et-thinlto.html\n( patchs gamer + options du kernel ps4 linux)https://ps4linux.com/ps4-aeolia-belize-full-thin-lto-kernel-saya/\n Passons maintenant à la release de mai 2025 :\n \nRegistres AMDGPU GLADIUS PS4PRO  http://e.pc.cd/MVey6alK5.15.15.src-codedwrench-KHEOPS-FullLTO-v2_aeolia-belize  http://e.pc.cd/37ey6alK5.15.25-rc1.src-codedwrench-KHEOPS-FullLTO-v2_belize  http://e.pc.cd/NXey6alK5.4.213.src.whitehax0r.KHEOPS_baikal  http://e.pc.cd/J7ey6alKEt un petit bonus, en béta :6.8.12.src-crashniels-saya_v0_aeolia-belize  http://e.pc.cd/WVey6alK6.8.12.src-crashniels-saya-FullLTO_v0_aeolia-belize  http://e.pc.cd/QyUotalK\n Pour le bzImage 5.4.213 baikal et les bzImages  6.8.12-aeolia-belize, je n'ai pas rajouté de fix blackscreen\nvous pouvez rajouter ce bootargs.txt (rajouté à coté du bzImage) pour fixer l'écran noir  http://e.pc.cd/NVey6alK\n Je tiens à remercier rancido (team psxita) , mircoho, codedwrench whitehax0r et crashniels pour leur source kernel de base, lestat triki1 VvSx87 Qba pasmatic LUFFY_YTB95 Arksama001 pour les differents tests, LoupBlanc pour le test de la capture video sous Obs-studio avec sa ps4 slim baikal\n  Team KHEOPS\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206440/in-ps4-pro-linux-registres-amdgpu-gladius-1.jpg"
        }
    },
    "news_16": {
        "title": "[Switch2] La carte mère et le die nvidia T239 analysés",
        "content": "De manière exceptionnelle Geekerwan a obtenu une carte mère Switch 2 et a fait une analyse complète des die shots du T239 avec l'aide de Kurnal. Ils ont obtenu la carte mère sur l'équivalent chinois d'eBay (Xianyu) pour environ 150 $.\n \nNous avons enfin la confirmation de certains éléments, le processus de gravure utilisé est le Samsung 8N, le die dispose de 8 coeurs A78C, partage 4 Mo L2, la partie GPU s'appuie sur 1536 Cuda cores et 6TPC au travers de l'architecture Ampère.\n \n \n\n \n \nLe die a été fabriqué à Taiwain par Samsung la semaine 21 de 2024, soit il y a un an, et on peut donc voir que ce T239 est très proche d'un die d'une carte graphique de la génération RTX série 3050, mais aussi avec certaines optimisations de la RTX 2050.\n \n \n\n \n\n \n \n\n \n \nLa vidéo de Geekerwan est tout simplement remplie de détails techniques, il analyse comment Nvidia a adapté le T239 entre les différentes architecture, décryptant la partie GPU, CPU et des Cuda Cores qui sont présents. \n \n \n \n\n \n \n\n \n \n \n \nQuelques détails techniques : \n \n- 207 mm² (Switch 2) contre 118 mm² (Switch)\n- Il est également plus grand que le GPU RTX 3050 Ti (mobile), le M2 d'Apple, le Ryzen 7840H (Z1 extreme) et le X elite de Qualcomm.\n- L'année de sortie du SoC est 2021, comme indiqué sur la matrice.\n- Ils ont également examiné la matrice du GPU RTX 3050, dont l'année de sortie était 2020.\n \nLe T239 en résumé :\n-  8 coeurs A78C, avec 4 Mo de cache L3 et 256 Ko de cache L2 sur chaque puce.\n- La surface de la puce A78C est la même que celle de la puce T234 de 8 nm, ce qui indique qu'il s'agit du même nœud de traitement.\n- Le suffixe C et AE n'a pas beaucoup de signification sur la conception du cœur lui-même, mais plutôt sur la classification ARM indiquant Compute et Automotive et comment les cœurs fonctionnent.\n- 6 TPC, 2SM/TPC, 1536 coeurs CUDA\n- La conception de l'Ampère, bien que sa disposition semble étrange car les TPC sont séparés.\n- La conception du GPU semble plus proche de celle d'Ada Lovelace.\n- En termes de surface du TPC, le T239 est 22% plus petit que le T234 d'orin.\n-  Il y a quelques différences dans la conception de la puce elle-même, elle n'est pas exactement 8nm et certains aspects sont plus proches de la fabrication du nœud de processus 10nm de Samsung.\n-  Ils soulignent les vitesses d'horloge précédemment « fuitées » et, comme DF, mentionnent que son équivalent le plus proche est la RTX 2050, bien qu'elle soit fortement downclockée.\n-  Comme DF, ils effectuent également une simulation des performances de la Switch 2 avec la RTX 2050 downclockée comme proxy.\n- Les performances de la Switch 2 sont alignées sur celles de la GTX 1050 Ti en mode docked et de la GTX 750 Ti en mode handheld dans les tests synthétiques de Steel Nomad Light.\n- Il est loin de la Xbox Series S et l'équivalent mobile le plus proche est l'A18 Pro d'Apple, M1 en mode docké, et la Steam Deck est un peu meilleure en mode portable.\n- Ils ont testé Cyberpunk 2077, Black Myth Wukong, Monster hunter Wild, KCD2...\n- Ils ont également pris une carte T234 (Orin) et ont testé les performances du CPU à travers des synthèses (geekbench 6)\n- En le downclockant à 1,1 GHz et 1 GHz, ses performances à cœur unique sont deux fois supérieures à celles de la PS4 et trois fois supérieures à celles de la Switch, l'équivalent portable le plus proche étant le i7-4700HQ.\n- L'équivalent mobile le plus proche en termes de performances multithread est l'A12 de l'iPhone, dont les performances single thread sont plus de deux fois supérieures à celles de la « Switch 2 »\n- Ils ont également utilisé un i7-10700KF downclocké pour approcher les performances du CPU de la Switch 2.\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206419/in-switch2-la-carte-mere-et-le-die-t239-analyse-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206419/in-switch2-la-carte-mere-et-le-die-t239-analyse-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1206419/in-switch2-la-carte-mere-et-le-die-t239-analyse-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1206419/in-switch2-la-carte-mere-et-le-die-t239-analyse-4.png"
        }
    },
    "news_17": {
        "title": "[XBO] Les projets Skeleton Key et Skeleton Key Mu sortent des cartons",
        "content": "Les payloads Skeleton Key et Skeleton Key Mu sortent des cartons, il s'agit de projets qui se destinent à la Xbox originale, il s'agit d'une collaboration communautaire de grande envergure. Ces payloads devraient faciliter l'accès aux améliorations Xbox et constituer une précieuse boîte à outils pour les fans expérimentés de la Xbox originale.\n \nDeux projets, Skeleton Key pour les clés USB, et Skeleton Key Mu pour les consoles modifiées, Skeleton Key fonctionnera sur de nombreuses clés USB. Vous pouvez également acheter une clé USB préchargée et un adaptateur USB auprès de nombreux revendeurs. Consultez plusieurs vitrines pour trouver un prix raisonnable. Les payloads seront toujours gratuits. Veuillez ne pas payer pour un logiciel gratuit !\n \n \n\n \n\n \n \n \nCe loader est basé sur les outils PrometheOS et peut lancer les applications suivantes :\n \n- Xbox Content Archive Tool (XCAT) Loader\n- Insignia Setup Assistant\n- Gamepad Tester\n- MemCheck\n- Rocky5's Softmod v1.2.2\n- Xbox Disk Over Network\n \nPour utiliser le payload Xbox Skeleton Key :\n \n1) Écrivez le contenu du dossier Skeleton Key sur une clé USB compatible. Ou copiez le contenu de Skeleton Key MU sur une carte mémoire Xbox avec une Xbox modifiée.\n2) Connectez la clé USB ou la carte mémoire à votre Xbox.\n3) Dans le tableau de bord Xbox; Accédez à l'option Mémoire, sélectionnez la Skeleton Key ou la Skeleton Key MU et appuyez sur A.\n \nUne image disque complète de cette boîte à outils est incluse dans la version. Elle peut être utilisée avec HDD Raw Copy ou d'autres outils pour écrire l'image sur votre clé USB compatible sans FatXplorer.\n \nLe lancement de Rocky5's Softmod v1.2.2 définira votre DNS sur automatique. Si votre console est configurée pour utiliser Insignia, vous devrez le remettre en manuel.\n \nTéléchargement : Projets Skeleton Key et Skeleton Key Mu\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206415/in-xbo-les-projets-skeleton-key-et-skeleton-key-mu-sortent-des-cartons-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206415/in-xbo-les-projets-skeleton-key-et-skeleton-key-mu-sortent-des-cartons-2.png"
        }
    },
    "news_18": {
        "title": "[PS4/PS5] Lapse Exploit d'abc disponible, nouvel exploit kernel sur PS4 et PS5",
        "content": "Le développeur abc est fier de nous présenter Lapse Exploit, un exploit kernel pour les firmwares 5.00 à avant le 12.50 pour la PS4 et du 1.00 avant le 10.20 pour la PS5, il faudra des correctifs pour la lecture / écriture sur le kernel PS4 8.0x. \n \n \n\n \n\n \n \n \nVous l'aurez compris il s'agit ni plus ni moins d'une bombe qui vient d'être lâchée par abc, un kernel exploit qui va rester dans l'histoire vu les firmwares qui sont supportés.\n \n \n \n\n \n \nCet exploit est corrigé sur le firmware 12.50 sur PS4 et sur 10.20 sur PS5, mais cela signifie qu'il est possible d'en profiter juste avant ces firmwares. \n \n \nTéléchargement : psfree-1.5rc1.7\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206406/in-ps4ps5-lapse-exploit-dabc-disponible-nouvel-exploit-kernel-sur-ps4-et-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206406/in-ps4ps5-lapse-exploit-dabc-disponible-nouvel-exploit-kernel-sur-ps4-et-ps5-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1206406/in-ps4ps5-lapse-exploit-dabc-disponible-nouvel-exploit-kernel-sur-ps4-et-ps5-3.png"
        }
    },
    "news_19": {
        "title": "[PS5] L'hyperviseur bientôt accessible sur les firmwares 3.xx et 4.xx",
        "content": "Petite bombe lâchée par Zecoxao il y a quelques heures, il vient de mettre un Tweet sur X informant que l'hyperviseur sera probablement bientôt une réalité sur les firmwares 3.xx et 4.xx de la PS5, de là à ce que les firmwares 4.xx deviennent des GoldHEN Firmware il n'y a qu'un pas. \n \nEn Septembre 2024, le développeur Flat_z nous confirmait que la structure sécuritaire des firmwares 3.21 avait bien trop évoluée pour permettre l'accès à l'hyperviseur au dessus de ce firmware, mais il semble que la donne à changer. \n \n \n\n \n \nReste à voir si la problématique du processeur principal a53io qui gère séparément les packages PS5 (PKG) sur PS5 sera toujours présente, et il faut là aussi casser ses protections ou trouver un moyen de le contourner pour lancer les fPKG.\n \n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206367/in-ps5-lhyperviseur-bientot-accessible-sur-les-firmwares-3xx-et-4xx-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1206367/in-ps5-lhyperviseur-bientot-accessible-sur-les-firmwares-3xx-et-4xx-2.jpg"
        }
    },
    "news_20": {
        "title": "[PS5/PS4] FPKGi pour PS4/PS5 v1.00.0 disponible",
        "content": "Le développeur ItsJokerZz vient de dévoiler la version 1.00.0 de FPKGi pour PS4 et PS5. FPKGi, une alternative à PKGi, projet open-source permet de télécharger et d'installer des fichiers .pkg modifiés, notamment pour les jeux backportés sur des firmwares compatibles. FPKGi est conçu pour être utilisé avec des serveurs personnalisés, permettant aux utilisateurs de peupler l'application avec leur propre contenu via des fichiers .json locaux ou en ligne. \n \n \n\n \n \n \nLes grandes nouveautés de cette version 1.00.0 : \n \n- Supprimer après l'installation \n- Le téléchargement ZIP PS5 Prise en charge + Ordre d'installation\n- Extraction du dump PS5\n- Compatibilité jailbreak améliorée\n- Fermer avec double pression sur le bouton cercle\n- Augmentation des éléments par page\n- Correctifs PS5\n \n \nChangelog 1.00.0 : \n \nAjouts : \n- « Supprimer après l'installation » pour PS5 : activation de la fonctionnalité « Supprimer après l'installation » pour les téléchargements PS5.\n- Prise en charge du téléchargement ZIP : ajout de la prise en charge du téléchargement, de l'extraction et de l'installation de fichiers ZIP.\n- Extraction de vidage PS5 : extraction de vidage PS5 introduite pour l'intégration d'itemzflow.\n- Ordre d'installation ZIP : les packages ZIP s'installent désormais par ordre alphabétique, en donnant la priorité aux numéros et aux symboles.\n- Compatibilité Jailbreak : Compatibilité améliorée en utilisant un jailbreak sur liste blanche sur PS5.\n- Double pression circulaire : Fermeture par deux pressions sur le bouton circulaire.\n \nAméliorations et optimisations : \n- Augmentation du nombre d'éléments par page : le nombre d'éléments par page est désormais passé de 25 à 30, avec une mise à jour de l'interface utilisateur et un nouveau logo.\n- Télécharger les informations Précision : Basculé vers ulongpour des données de téléchargement plus précises.\n- Restriction de contenu PS5 : le contenu PS5 ne peut plus être visualisé sur PS4.\n \nCorrections, résolutions et plus :\n- Correction des plantages de téléchargement direct sur PS5 : plantages résolus lors des téléchargements directs sur PS5.\n- Correction de langue : problèmes d’affichage résolus pour différentes langues.\n- Correction de l'installation de titres non UTF8 : correction de l'impossibilité d'installer des fichiers de titres de caractères non UTF8 (non anglais).\n- Prise en charge linguistique ajoutée : prend désormais en charge les langues asiatiques et l'arabe pour les titres de contenu, conformément à la vidéo YouTube de Miichael Crump\n \n \n\n \n \n \nTéléchargement : FPKGi v1.00.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206365/in-ps5ps4-fpkgi-pour-ps4ps5-v1000-disponible-1.png"
        }
    }
}