{
    "news_1": {
        "title": "[Switch] Sphaira, une alternative au hbmenu sur Switch",
        "content": "Le développeur TotalJustice, bien connu sur la scène Nintendo et qui a récemment publié un client ftp ultra léger, a annoncé une nouvelle surprise pour la Nintendo Switch : Sphaira, une alternative au hbmenu proposant des fonctionnalités exclusives. \n \n\n \nSphaira propose actuellement les mêmes fonctionnalités que hbmenu (lancer des homebrews et utiliser nxlink) tout en ajoutant de nombreuses nouvelles fonctionnalités : \n \nL’onglet principal du menu affiche tous les fichiers .nro trouvés dans le dossier /switch/. Depuis cet onglet, vous pouvez lancer des homebrews, les trier, les supprimer, créer des raccourcis (forwarders), etc. Vous pouvez naviguer vers les autres onglets à l'aide des boutons L et R. \nL'explorateur de fichiers est accessible en appuyant sur L depuis le menu principal. Vous pouvez couper, copier, supprimer, renommer des fichiers, etc. Il est possible de sélectionner plusieurs fichiers/dossiers en utilisant le bouton ZR, puis d'appliquer ces actions sur le groupe sélectionné.\n\nSphaira inclut une boutique d'applications utilisant l'API du hbappstore. Vous pouvez y accéder en appuyant sur R depuis le menu principal : Cette boutique offre les mêmes fonctionnalités que l'application hb-appstore (installation, mise à jour, lecture des manifests).\n\n\nSphaira est livré avec trois thèmes : abyss (par défaut), noir, et blanc (inspirés des \"thèmes\" de la Switch). Vous pouvez ajouter des thèmes personnalisés dans le dossier /config/sphaira/themes/. Les musiques de fond sont aussi supportées si elles sont encodées au format bfstm. \n\n\nLes thèmes au format nxthemepeuvent être parcourus et téléchargés via le menu Options -> Divers -> Themezer. Ils seront enregistrés dans /themes/sphaira/Nom du thème - Par Auteur/. Pour les installer, il faudra tout de même passer par NXThemes Installer.\n\nLa création de forwarders (raccourics depuis le menu Switch) pour vos homebrews et roms (voir plus bas) est possible depuis le menu : Sphaira peut créer et installer des raccourcis pour n'importe quel fichier .nro. Il utilise l'icône du .nro ainsi que son nom et son auteur.\n\nDes raccourcis peuvent également être créés pour des fichiers ayant une association de fichiers. Par exemple, si mgba est installé et qu'un jeu est situé dans /roms/gba/game.gba, l’option \"Installer un raccourci\" apparaîtra. Sphaira essaiera de récupérer l'icône du jeu ; sinon, il utilisera celle du .nro. Le nom sera une combinaison du nom du .nro et de celui du jeu.\n\n\nLes associations de fichiers permettent de lier des extensions (.gba, .nro, etc.) à une application homebrew. Par exemple, en cliquant sur un fichier rom.gbc ayant une association, une liste des applications pouvant l’ouvrir s’affichera.\nCela peut être utilisé pour des émulateurs, lecteurs multimédias, éditeurs de texte, etc.\nLes associations personnalisées doivent être placées dans /config/sphaira/assoc/. Les ROMs doivent être placées dans /roms/nom_du_système/, où nom_du_système correspond à cette table. Ce format est similaire à celui utilisé par Emulation Station, afin d'éviter les conflits entre ROMs de différents systèmes partageant les mêmes extensions (par exemple, .bin ou .cue). Les sous-dossiers sont autorisés, par exemple : /roms/psx/scooby-doo/scooby-doo.bin. \n\n\nD'autres fonctionnalités sont intégrées : un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit, un raccourci vers le navigateur intégré, nxlink (activé par défaut) et la lecteur des audios de GmaeBoy au format gbs. \n\n\n \n\n \n\n \n\n \nSi vous souhaitez que Sphaira remplace hbmenu, activez l'option dans Options -> Remplacer hbmenu à la sortie. Une sauvegarde de hbmenu sera créée dans /switch/hbmenu.nro au cas où vous voudriez y revenir.\n \nSphaira est disponible en version beta sur le topic officiel du homebrew juste ici. \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201726/in-switch-sphaira-une-alternative-au-hbmenu-sur-switch-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1201726/in-switch-sphaira-une-alternative-au-hbmenu-sur-switch-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1201726/in-switch-sphaira-une-alternative-au-hbmenu-sur-switch-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1201726/in-switch-sphaira-une-alternative-au-hbmenu-sur-switch-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1201726/in-switch-sphaira-une-alternative-au-hbmenu-sur-switch-5.jpg"
        }
    },
    "news_2": {
        "title": "[PS3] CFW Evilnat 4.91.2 Bêta 16 disponible",
        "content": "Le développeur Nathan Martin, plus connu de la scène PlayStation sous le pseudonyme Evilnat, vient de mettre en ligne la version Bêta 16 de son CFW Evilnat 4.91.2. \n \n \n\n \n \nIl propose les version D-PEX et PEX, rappelons que la version PEX -> Console Retail, kernel CEX + DEX et la version D-PEX -> Console de débogage/convertie, kernel DEX + CEX.\n \n \nChangelog Bêta 16 :\n \n+ Variantes PEX et D-PEX uniquement disponibles pour le moment (par manque de temps pour tester toutes les variantes)\n+ Options [Convertir en CEX/DEX] améliorées avec plus de sécurité pour éviter les problèmes\n+ Options [Activer/Désactiver le support pour DEX OFW] améliorées avec plus de sécurité pour éviter les problèmes\n+ Ajout d'informations sur le mode Cobra externe actuel dans [Informations Cobra].\n \n \nTéléchargement : CFW Evilnat 4.91.2 Bêta 16\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201698/in-ps3-cfw-evilnat-4912-beta-16-disponible-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS5] John Tornblom dévoile une version de RetroArch !",
        "content": "Le développeur John Tornblom vient de dévoiler une version de RetroArch, il s'agit d'une version estampillée \"Beta 1\" et il semblerait qu'elle fonctionne correctement pour lancer la plupart des cores. \n \n \n\n \n \n \nLa démonstration vidéo présente le core Snes qui fait tourner une rom de Mario Bros 3, mais il a bel et bien rendu disponible cette version spécialement taillé pour la PS5. \n \n \n \n\n \n \n \nPour le moment peu de détails sur l'installation, ou plutôt la manière ou une procédure de lancement, probablement le tout doit se passer sur un bluray à graver. \n \n \nTéléchargement : RetroArch Test (Beta 1) de 16.37 Mb\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201697/in-ps5-john-tornblom-devoile-une-version-de-retroarch-1.png"
        }
    },
    "news_4": {
        "title": "[PS4/PS5] Remote Lua Loader permet de lancer le FTP sur PS5 et PS5 Pro",
        "content": "Comme vous le savez Remote Lua Loader est un script python déployé pour la PS4 et PS5 (et leur versions pro), permettant de charger des fichiers via l'utilisation de Lua dans les jeux construits autour du moteur Artemis. \n \nLe point d'entrée étant un jeu, ce loader ne dépend pas de la version du firmware installée, et fonctionne donc sur tous les firmwares, il a ainsi été testé avec succès sur le dernier firmware de la PS5 et de la PS5 Pro.\n \nLa nouvelle version du loader prend en charge plusieurs loaders, notamment les scripts pour générer des notifications, des outils pour rectifier certains crashs, mais surtout le nouveau serveur FTP qui permet de parcourir le système de fichiers de la console.\n \n \n \n\n \n \n \nPour l'heure, bien entendu il n'est actuellement pas possible de télécharger des fichiers, ni même d'en charger via le FTP, car toutes les protections de la PS5 ne le permettent pas. \n \n \n \n",
        "images": {}
    },
    "news_5": {
        "title": "[WiiU] Wii VC Launch 1.3 disponible",
        "content": "Le développeur Lynx64, Andrew Hawes, a mis à jour Wii VC Launch en version 1.3, il s'agit là d'un loader permet la forme d'un fichier wps qui permet le lancement de la Wii VC, c'est un plugin qui permet de lancer des titres Wii VC et du mode Wii sur Nintendo Wii U.\n \nDes options intéressantes sont proposées, comme la possibilité de lancer les titres WiiVC avec tous les contrôleurs, d'ignorer tous les dialogues, et de définir des résolutions spécifiques de l'écran (480p, 720p, 480i ou 576i, avec certaines variantes comme le 4:3). \n \n \n\n \n \n \nInstallation : \n \n- Téléchargez la dernière version à partir du site en cliquant sur WiiVCLaunch.wps\n- Copiez le fichier WiiVCLaunch.wps dans wiiu/environments/[ENVIRONMENT]/plugins\noù [ENVIRONNEMENT] est le nom de l'environnement (probablement 'aroma').\n \nChangelog 13 :\n \n- Corrections de bugs :\n-- Correction du correctif SYSCONF Preserver ne fonctionnant pas sur certaines configurations.\n-- Les boîtes de dialogue personnalisées n'apparaissaient pas/le lancement automatique ne se configurait pas correctement après :\n--- Ouverture de certaines applets du menu.\n--- Lancement d'un titre non-Wii qui a ensuite été annulé après un certain point.\n \n \nTéléchargement : Wii VC Launch 1.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201661/in-wiiu-wii-vc-launch-13-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[PS5] Le PS5 Payload SDK proposé en v0.22 par John Tornblom",
        "content": " \nLe développeur John Tornblom propose une nouvelle révision de son outil PS5 Payload SDK qui est maintenant téléchargeable avec l'estampille 0.22.\n \nComme vous le savez PS5 Payload SDK est une boite à outils qui permet de créer des payloads ELF pour les PlayStation 5, il comprend notamment plusieurs codes comme celui du PS5SDK permettant aux développeurs de tester leur projet avant leur diffusion. \n \nComme vous le savez, ce SDK a pour ambition de faciliter le portage et le développement de payloads qui pourront s'exécuter sur les consoles bénéficiant du loader ISO BD-JB ELF, mais aussi sur celles utilisant l'exploit \"ipv6 uaf\" basé sur le webkit.\n \n \n\n \n \nLe SDK offre ainsi un environnement de développement idéal pour des applications tiers ou des homebrews sous forme de payloads ELF. Avec cette mise à jour 0.22, le développeur a ajouté la prise en charge des payloads liés aux objets partagés .so, permettant ainsi le chargement via dlopen. Des exemples de code ont été introduit avec des paramètres pour Visual Studio Code dans Cmake, en plus de la prise en charge des hôtes LLVM 19.\n \nL'utilisation de Fedora, d'autres modifications du module intègrent la suppression libm, et la recommandation d'Openlibm, mais les nouveautés passent aussi par la mise à jour de nombreux fichiers .sprx au lieu de .so.\n \nLa bibliothèque libc a été améliorée, avec notamment l'ajout de fonctions telles que qsort_r, dirfd, strsignal et reallocarray. Mais il y a aussi d'autres évolutions comme l'activation de la prise en charges des threads dans libcxxabi, ce qui en théorie devrait améliorer l'environnement multithread. \n \n\n \nChangelog : \n \n- rtld: support payloads that are linked with .so shared objects, and loading them via dlopen\n- examples: add vscode settings to cmake example\n- add support for hosts using llvm-19\n- readme: add instructions for fedora\n- prospero-nid: link dynamically, some OSes don't have static libc installed by default\n- sce_stubs: remove libm as it lacks support complex numbers (users can install - openlibm instead)\n- sce_stubs: set soname to *.sprx instead of *.so\n- libc: decouple from crt\n- libc: add qsort_r, dirfd, strsignal and reallocarray\n- libc: add a couple of stubs for functions that currently does not work on ps5\n- libcxxabi: enable threads\n \n \n\n \n\n \nTout est là : PS5 Payloads SDK 0.22\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201659/in-ps5-le-ps5-payload-sdk-propose-en-v022-par-john-tornblom-1.png"
        }
    },
    "news_7": {
        "title": "[PS5] La mise à jour 4.0.1 du PlayStation Portal disponible",
        "content": "Sony continue d'améliorer l'expérience utilisateur sur sa console PlayStation Portal, avec la mise à jour firmware 4.0.1 la marque a décidé d'améliorer la stabilité, les fonctionnalités Cloud Gaming et Remote Play, tout un programme !\n \nLa sortie du firmware 4.0.1 ne passera pas inaperçue, en effet le géant japonais a décidé d'apporter des correctifs assez importants notamment afin d'augmenter la stabilité et les performances de l'appareil.\n \nLa fonction Cloud a été améliorée, que ce soit en terme de stabilité que de fluidité, ainsi certains titres exigeants comme Watch Dogs Legion ou Final Fantasy 7 Remake sont désormais plus fluide. \n \nUne autre nouveauté est la possibilité d'utiliser le bouton Playstation pour ouvrir le menu pendant l'utilisation et la diffusion de jeux, et le bouton d'accueil pour revenir à l'écran d'accueil, cela permet d'amener de l'ergonomie lors des sessions.\n \n \n \n\n \n \n \nVersion 4.0.1 :\n \n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et la convivialité sur certains écrans.\n \nBien entendu nous ne savons pas si cette mise à jour vient apporter des corrections sécuritaires, probablement, mais le temps nous le dira. \n \nTout est là : playstation.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201657/in-ps5-la-mise-a-jour-401-du-playstation-portal-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[PS5] John Tornblom propose PS5 link device pour jouer sans PSN en local",
        "content": "Le développeur John Tornblom propose un nouvel homebrew pour les PS5 jailbreakées mais qui n'ont pas accès au PSN. Il propose en effet PS5 link device, un homebrew qui permet de jouer à distance en local sur des PS5 jailbreakées sans PSN. Il utilise la même approche que ps5-remoteplay-get-pin, mais avec une interface utilisateur graphique et ne repose pas sur le syscall ptrace.\n \n \n\n \n \nPrérequis :\n \n- Une PS5 jailbreakée qui exécute ps5-payload-websrv et a été redémarrée après avoir activé le compte utilisateur connecté à l'aide de OffAcct .\n \nDémarrage rapide :\n \n- Téléchargez LinkDev , décompressez le fichier zip et transférez son contenu sur votre PS5 à l'adresse /data/homebrew/LinkDev\n- Lancez-le selon les instructions de ps5-payload-websrv et associez votre appareil à l'aide des paramètres affichés à l'écran.\n \n \nTéléchargement : PS5 link device v0.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201611/in-ps5-john-tornblom-propose-ps5-link-device-pour-jouer-sans-psn-en-local-1.png"
        }
    },
    "news_9": {
        "title": "[Switch] Un nouveau boitier sans vis pour le Mig Flash",
        "content": "Cela faisait deux mois que nous n'avions plus de nouvelles de la team Mig Flash (anciennement Mig Switch), et bien il suffit de regarder sur le site officiel pour s'apercevoir qu'elle vient de communiquer sur leur produit. \n \nLa team explique qu'elle essaye toujours d'améliorer leur logiciel et leur matériel, restant à l'écoute de tous les utilisateurs finaux afin d'améliorer l'expérience produit. \n \n \n\n \n \nAujourd'hui, elle informe qu'elle apporte une mise à jour matérielle à la carte Mig Flash, pour laquelle les demandes ont été régulières. \n \nL'étui en plastique du Mig Flash V2 est actuellement le set par défaut envoyé pour toutes les nouvelles commandes. Il s'agit d'un étui à clipser avec un bouton permettant de changer de jeu, sans avoir besoin d'éjecter le linker. \n \nN'oubliez pas que la team recommande de toujours fermer le chariot de jeu lors de son utilisation. La team reconnait que le boitier équipé de la vis est plus robuste, il restera toujours disponible pour les distributeurs, afin qu'ils puissent laisser la possibilité à l'acheteur de choisir le boitier que vous préférez. \n \n \n \n\n \n \n \nLa team présente le boitier en plastique en question dans une vidéo, et anticipe un peu les fêtes, en vous souhaitant d'excellentes fêtes de fin d'année. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201605/in-switch-un-nouveau-boitier-sans-vis-pour-le-mig-flash-1.png"
        }
    },
    "news_10": {
        "title": "[Switch] Moonlight Switch v1.2.3 disponible",
        "content": "Moonlight Switch, le fork de Moonlight-NX, vient de recevoir une mise à jour, le développeur Xitrix vient en effet de mettre à jour pour corriger des bugs et améliorer la localisation de certaines langues. \n \nRappelons que Moonlight Switch permet de streamer, il s'agit d'une implémentation open-source du protocole GameStream de nVidia, ce qui implique l'utilisation d'une carte graphique nVidia compatible PC vers la Switch. \n \nSi vous avec un PC avec une carte graphique NVIDIA, il vous suffit de downloader nVidia Expérience et d'activer le partage d'application SHIELD dans les options.\n \nEnsuite sur votre SWITCH ou même sur un smartphone Android vous pouvez installer Moonlight pour vous connecter sur votre PC et jouer aux jeux partagés.\n \nLes jeux partageables doivent être compatibles nVidia Experience, attention tous ne le sont pas mais il existe une astuce c'est de partager un exécutable Windows (par exemple mstsc.exe) et vous aurez accès à tout votre PC Windows depuis la Switch et ensuite pourrez lancer n'importe quel jeux.\n \n \n\n \n \nChangelog :\n \nCorrection d'un bug : L'appairage manuel ne fonctionnait pas si un port était spécifié\n \nAméliorations :\n \n- Localisation en coréen\n- Localisation en chinois\n- Options FPS mieux organisées\n \nL'option 45 FPS est rabaissé à 40 FPS. \n \n \nTéléchargement : Moonlight-Switch v1.2.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201602/in-switch-moonlight-switch-v123-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[3DS] L'émulateur Azahar ne chargera pas les .3DS mais les .CCI",
        "content": "Cela peut paraitre surprenant, mais le développeur PabloMK7, à l'origine du développement de l'émulateur Azahar, vient une nouvelle fois de partager quelques informations importantes. \n \nL'une d'entre elles a retenu notre attention, il s'agit que l'émulateur s'aligne sur la réglementation en vigueur, mettant l'accent sur l'interopérabilité, et la préservation des jeux vidéo. Cependant la décision importante concerne la suppression du support des jeux cryptés. \n \nAinsi le développeur a expliqué que Azahar ne prendra pas en charge le lancement et/ou l'installation de jeux cryptés n'ayant pas été légalement acquis, telles que les applications officielles acquises via l'eShop. \n \n \n\n \n \n \nAzahar sera donc un émulateur de tout ce qu'il y a de plus légal dans le sens où il ne fera pas tourner de jeux avec l'extension .3DS l'émulateur supportera en lieu et place le .cci , le nom officiel des fichiers image des cartouches de jeu. \n \nAucune instructions permettant de dumper, ou de créer ses propres copies privées ne sera intégré à la solution. L'émulateur se contentera de donner des guides pour configurer le firmware, accéder à l'eShop, ou encore retélécharger des jeux déjà achetés. \n \n \n\n \n \nIl semblerait que les récentes déconvenues avec Citra, Ryujinx, ou encore Yuzu a refroidi certains développeurs, ou du moins ils sont plus prudents. \n \nTout est là : azaharemu\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201591/in-3ds-lemulateur-azahar-ne-chargera-pas-les-3ds-mais-les-cci-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201591/in-3ds-lemulateur-azahar-ne-chargera-pas-les-3ds-mais-les-cci-2.png"
        }
    },
    "news_12": {
        "title": "[PS5] PSFree amélioré dans PS5-UMTX-Jailbreak",
        "content": "Le développeur idlesauce propose depuis quelques heures une mise à jour de PS5-UMTX-Jailbreak, il s'agit là de mettre à jour l'exploit webkit PSFree.\n \nAinsi dans cette version, qui se destine à la PS5, il a amélioré PSFree afin que l'exploit soit plus rapide et plus stable, le développeur idlesauce annonce qu'il y a moins de crashs avec cette version. \n \n \nTout est là : \n \nhttps://github.com/idlesauce/PS5-UMTX-Jailbreak/tree/psfree-150b\n \n \n \n\n \n \nAu chapitre des bonnes nouvelles, nous venons d'apprendre que l'actualisation d'etaHEN 1.9B sera disponible avant la fin de l'année, c'est LightningMods qui s'est engagé sur ce délai. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201578/in-ps5-psfree-ameliore-dans-ps5-umtx-jailbreak-1.png"
        }
    },
    "news_13": {
        "title": "[PS4] PS4 Fake PKG Tools 3.87 v7 mis à jour par CyB1K",
        "content": "Le développeur CyB1K a décidé de mettre à jour PS4 Fake PKG Tools 3.87 en v7, comme vous le savez il avait déjà fait l'effort il y a tout juste un an de proposé la v6.0.0, et bien voilà la v7.0.0.\n \nComme vous le savez cet outil permet de compiler des fake PKG qui pourront tourner sur votre PS4. Cette nouvelle version V7 proposée par CyB1K a corrigé un bug d'affichage.\n \n \n\n \n \nChangelog : \n \n- Correction de la vérification du firmware minimum afin que les packages ne s'affichent plus comme nécessitant la version 7.50. Il devrait s'afficher comme 5.05 !\n \n \nTéléchargement : PS4 Fake PKG Tools v3.87 v7.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201576/in-ps4-ps4-fake-pkg-tools-387-v7-mis-a-jour-par-cyb1k-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] PS5 Remoteplay-Get-Pin v0.1 disponible",
        "content": " \nLe développeur slowsauce vient de publier une toute première version de PS5 Remoteplay-get-pin, il s'agit là d'un outil qui permet d'obtenir le code PIN du remote play sur les consoles PS5 pour les comptes activés hors ligne.\n \nSans avoir besoin d'aucun patch, la fonction sceRemoteplayGeneratePinCode permet de générer le code PIN, et ceci même sur les consoles non jailbreakées. \n \n \n \n\n \n \n \nQuelques étapes sont nécessaires pour y parvenir : \n \n1.Activez votre compte hors ligne en utilisant offact .\n- Téléchargement : https://github.com/ps5-payload-dev/websrv/releases/\n- Vous pouvez suivre ce tutoriel de Modded Warfare pour savoir comment configurer cela : https://youtu.be/CFTIWX0JJRI?t=202\n- La description de la vidéo contient un lien vers le référentiel offact, mais vous devez télécharger offact à partir de la page des versions websrv car ce sont des versions plus récentes.\n- L'identifiant généré automatiquement peut être utilisé, vous n'avez pas besoin d'un véritable identifiant PSN.\n- Sur les firmwares très bas de gamme, l'interface websrv peut être cassée dans le navigateur de la ps5, pour le moment vous pouvez ouvrir offact en allant http://<yourps5ip>:8080/sur votre pc.\n2.Redémarrez la console si vous ne l’avez pas fait depuis que vous avez activé votre compte hors ligne.\n3.Injectez ce payload en utilisant le chargeur elf de john-tornblom sur le port 9021.\n- La broche d'appairage et l'ID codé en base64 seront affichés dans une notification et imprimés sur stdout.\n- Pour voir stdout, vous pouvez injecter comme ceci : socat -t 99999999 - TCP:<yourps5ip>:9021 < rp-get-pin.elf\n- Seul l'identifiant de compte affiché sera accepté lors de l'appairage, c'est-à-dire l'utilisateur actuellement connecté.\n- Si vous souhaitez annuler le couplage, vous pouvez renvoyer la charge utile.\n4.Connectez-vous avec chiaki ou chiaki-ng\n- L'application officielle Remote Play peut également fonctionner. Pour cela, vous devrez définir votre identifiant de compte approprié associé à votre compte PSN dans Offfact.\n \n \nTéléchargement : PS5 Remoteplay-Get-Pin v0.1\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201572/in-ps5-ps5-remoteplay-get-pin-v01-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[PS4] HB2 v1.04 disponible avec les 6 chapitres !",
        "content": " \n \nEt voilà que le développeur Lapy propose la version 1.03 de son adaptation de Hellblade II sur PS4. \n \n \n\n \n \n \nComme vous le savez désormais, il s'agit davantage d'un film interactif plutôt que le jeu original, un film découpé en plusieurs parties proposant quelques scènes en QTE pour amener une interactivité avec le \"joueur\". \n \nLa version 1.03 ajoute le chapitre 5, il faut disposer du dossier HB2 disponible ici : \n \net du PKG : pkg-zone.com/details/LAPY10025\n \nil reste possible d'attendre la version PKG complète proposée par dravszoo1. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201558/in-ps4-hb2-v103-disponible-avec-le-cinquieme-chapitre-1.png"
        }
    },
    "news_16": {
        "title": "[PS4] L'alternative à Gamebato est là",
        "content": "Gamebato, un store permettant de télécharger des jeux, vient de voir débarquer de la concurrence, une alternative à ce store vient de naitre sous le nom de Game-Changing PS4 Fake PKG Store de Super PSX.\n \n \n\n \n \n \nTout comme Gamebato, il s'agit d'un store alternatif permettant de télécharger des jeux directement sur votre PS4. \n \n \n \n\n \n \n \nCe système innovant vous permet de télécharger et d'installer des jeux, des mises à jour et des DLC directement via le navigateur de votre PS4. Pas besoin d'étapes manuelles fastidieuses ni d'outils tiers (à l'exception de l'indispensable RPI). Le processus est conçu pour maximiser la commodité et minimiser les tracas, tout en utilisant pleinement la vitesse maximale de votre connexion, c'est du moins ce qu'annonce Super PSX.\n \n \n \n\n \n \n \n \nQuelques caractéristiques : \n \nInstallation directe par navigateur :\n- Ouvrez simplement votre navigateur PS4, sélectionnez le jeu, la mise à jour ou le DLC que vous souhaitez et installez-le directement. Aucune étape ou dispositif supplémentaire n'est nécessaire.\nLarge compatibilité avec les firmwares :\n- Que votre PS4 utilise le firmware 5.05 ou 11.00, ce système prend en charge toutes les versions. Vous n'avez pas à vous soucier des problèmes de compatibilité.\nTéléchargements rapides comme l'éclair :\n- Contrairement aux méthodes traditionnelles, ce système vous garantit la meilleure vitesse possible de votre connexion Internet, ce qui réduit considérablement les temps d'attente.\nFini les problèmes de matériel :\n- Dites adieu à la configuration de routeurs haut de gamme, aux câbles et aux périphériques de stockage externes. Cette approche rationalisée élimine les complications inutiles.\n \nGamebato a rapidement évolué vers un modèle payant pour pouvoir offrir à ses membres une capacité de téléchargement optimale. Reste à voir ce que va réellement proposé ce Game-Changing PS4 Fake PKG Store. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201523/in-ps4-lalternative-a-gamebato-est-la-1.png"
        }
    },
    "news_17": {
        "title": "[Switch] ftpsrv v1.0.0 disponible",
        "content": " \nLe développeur TotalJustice propose la version 1.0.0 de ftpsrv, comme vous le savez il s'agit d'un nouveau serveur FTP ultra léger, simple et rapide, écrit en langage C pour certaines consoles Nintendo comme la Wii, 3DS, DS ou encore la Switch. \n \nDéveloppé pour apprendre le protocole FTP, et afin de proposer un serveur avec une faible utilisation de la mémoire, ftpsrv ne s'appuie sur aucune allocation dynamique, tout en gardant une grande capacité de configuration avec le fichier config.ini modifiable. Pour information, ftpsrv utilise 592 ko de mémoire.\n \nIl existe quelques protections, comme sur la Nintendo Switch où il est obligatoire de définir un nom d'utilisateur et un mot de passe sauf si l'option anonyme est activée. \n \n \n\n \n \nChangelog : \n \n- ajout de la commande OPTS, permet aux clients de prendre en charge UTF8.\n- remplacement de sscanf par snprintf / strtoull.\n- ajout du délai d'expiration de session, peut être défini dans config.ini.\n- rendre tous les sockets non bloquants. auparavant, accept et connect pouvaient bloquer.\n- suppression du code de décimale virtuelle du serveur ftp, à la place, laissez le backend vfs gérer tous les périphériques virtuels.\n- correction de l'interrogation PORT.\n- [Unistd] correction de la fermeture du socket, voir commit pour plus de détails.\n- [Nx] sysmod est 3 fois plus rapide (10 Mio en lecture, 6 Mio en écriture).\n- [Nx] option pour définir un port différent pour app/sysmod dans config.ini.\n- [Nx] ajout de la liste de sauvegarde / montage.\n- [Nx] correction des sockets sysmod à court de mémoire, provoquant un blocage.\n- [Nx] la LED clignote maintenant pendant le transfert de données.\n- [Nx] ferme le fichier journal à la sortie dans la version de l'application.\n- [Nx] ajout du montage du stockage de contenu.\n- [Nx] ajout du montage de la carte de jeu, vous permet de vider le certificat, le ticket et le ncas.\n- [Nx] ajout de la prise en charge du fichier de stockage bis.\n- [Nx] ajout du montage du disque dur, disponible uniquement dans la version de l'application.\n- [Nx] montage du romfs de l'application, s'il est lancé via le remplacement du titre (en maintenant R), vous pouvez monter le romfs du titre actuel, disponible uniquement dans la version de l'application.\n- [Nx] montage du romfs qlaunch (menu d'accueil), disponible uniquement dans la version de l'application.\n- [Nx] offre des sauvegardes sous forme de fichiers zip.\n \n \n \nTéléchargement : ftpsrv v1.0.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201517/in-switch-ftpsrv-v100-disponible-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS4/PS5] La prochaine version d'etaHEN se dévoile",
        "content": " \nLe développeur LightningMods nous amène quelques informations sur la prochaine version d'etaHEN, le payload qui permet de profiter de fonctions avancées comme celle de Game Dumper ou encore les Debug Settings dans Itemzflow. \n \nLe développeur nous montre le nouveau logo et la nouvelle icône d'etaHEN, et la mise à jour pourrait introduire de nouvelles fonctionnalités comme par exemple des plugins à lancement automatique, ou encore une interface de bureau inspirée de mmOS. \n \n \n \n\n \n \nBien entendu l'une des plus grandes innovations sera le support du SDK de John Tornblom afin de compiler un payload, avec une telle évolution cela permettra d'améliorer la stabilité.\n \netaHen verra aussi arriver la suppression du patch Syscore, ce qui aura pour effet d'augmenter légèrement le temps de chargement, mais là aussi au profit d'une stabilité accrue. \n\n \nLe support des firmwares 5.xx sera aussi de la partie, avec notamment le loader ELF du SDK, et là aussi le payload sera corrigé afin d'apporter un peu plus de flexibilité. Bien entendu, il faudra revoir certains plugins en relation avec le SDK, tout cela semble très prometteur. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201513/in-ps4ps5-la-prochaine-version-detahen-se-devoile-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201513/in-ps4ps5-la-prochaine-version-detahen-se-devoile-2.png"
        }
    },
    "news_19": {
        "title": "[PS3] RPCS3 désormais comptatible avec ARM64",
        "content": "L'équipe en charge du développement de l'émulateur RPCS3, le meilleur émulateur de PS3, vient de faire une grande annonce. La team vient en effet de teaser depuis plusieurs jours une annonce qui vient d'être dévoilée, il s'agit du support de l'architecture ARM64. \n \nCe support est très important pour RPCS3 puisqu'il permet désormais de lancer l'émulateur sur des possibilités beaucoup plus modernes, des appareils dotés de puces Mac (Apple Silicon) ou encore les appareils Android avec puce ARM. \n \n \n\n \n \n \nAinsi l'émulateur ne se contente plus d'être accessible uniquement sur les architectures x86-64, les appareils ARM sont donc désormais supportés et les performances sont là. \n \nAinsi les Apple M1, M2 et versions ultérieures sont accessibles auparavant seul les appareils équipés du Rosetta 2 l'étaient.\n \n \n \n\n \n \n \nLes smartphones ou tablettes équipés de puces haut de gamme comme le Snapdragon 8 Gen 2 ou Exynos 2400 sont aussi de la partie.\n \nCette fonctionnalité majeure a fait l’objet d’un travail intensif au cours des derniers mois et permet à RPCS3 de fonctionner nativement sur les appareils Linux, macOS et Windows arm64 !\n \n \nL'équipe dévoile un énorme article de lancement : rpcs3.net\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201479/in-ps3-rpcs3-desormais-comptatible-avec-arm64-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] switch_AIO_LS_pack 5.16.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.16.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format).\nLe mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.16.0:\nPassage aux outils basés sur Libultrahand pour lancer les overlays au lieu de Libtesla qui n'est plus mis à jour depuis un moment. De fait les raccourcis pour lancer le menu des overlays devient \"ZL+ZR+croix directionnelle vers le bas\".\nSuppression des fichiers de configuration liés au menu des overlays basé sur Tesla.\nMise à jour de Sys-patch, de JKSV, de Status-monitor-overlay et de de EdiZon-Overlay vers la dernière version de ceux-ci.\nMise à jour des crédits.\nMise à jour du homebrew AIO_LS_pack_Updater en version 7.00.00 contenant les évolutions suivantes:\nNouvelle fonction permettant d'afficher le dernier changelog du pack via le homebrew en appuyant sur \"LS\" sur le menu principal ou sur \"X\" lorsque cela est proposé durant la mise à jour du pack (lancement du homebrew hors mode applet et connexion à internet requis).\nAjout d'une option dans le menu pour synchroniser l'heure de la console.\nSynchronisation de l'heure de la console avec des serveurs distants avant l'affichage du changelog.\nLa connexion à internet est vérifiée avant de lancer les fonctions la nécessitant.\n\nNote: Pour traiter les problèmes particuliers de lancement de la sysnand en firmwares 17.0.0 et supérieurs c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets. Pour cela nous avons mis en place un questionnaire de satisfaction, en plus de pouvoir reporter les problèmes sur Github ou sur le forum vous pouvez utiliser ce questionnaire pour nous donner vos opinions de façon anonyme (pour des problèmes spécifiques il vaut mieux reporter sur Github ou ouvrir un sujet sur le forum, il y aura une réponse bien plus rapide et cela permet de demander plus de détails pour identifier et peut-être résoudre le possible problème.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe et vous avez aussi un tutoriel plus détaillé sur cette page, d'ailleurs ce dernier site contient aussi pas mal de tutoriels notamment sur la Switch.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    }
}