{
    "news_1": {
        "title": "[XB] Microsoft limite l'utilisation de contrôleur tiers",
        "content": "Depuis quelques semaines, Microsoft a averti, la firme de Redmond ne souhaite plus que les détenteurs de consoles Xbox utilisent des manettes tierces, aussi appelées des contrôleurs tiers. Comme le rapporte Wololo.net, la firme va imposer un nouveau firmware qui va bloquer toutes les manettes de marque autre que Microsoft. \n \nC'est en Octobre dernier qu'à commencer ce nouvel épisode de la saga Microsoft, certains utilisateurs ont vu apparaitre une erreur lors du branchement de leur manette.\n \nUne fois ce message d'erreur affiché, Microsoft laisse 2 semaines d'utilisation. \n \n \n\n \n \nSi le code d'erreur suivant apparaît lorsque vous tentez de connecter un accessoire non autorisé à votre console Xbox :\n \n0x82d60002\nCela signifie que l'un des accessoires que vous essayez de connecter n'a pas été fabriqué par Microsoft ou par un autre partenaire matériel Xbox sous licence. Si vous ne recevez pas de code erreur, votre accessoire ne sera pas impacté.\n \nLes accessoires Microsoft et d'autres partenaires matériels Xbox sous licence sont conçus et fabriqués selon des normes de qualité en matière de performances, de sécurité et de sûreté. Les accessoires non autorisés peuvent compromettre l'expérience de jeu sur les consoles Xbox (Xbox One, Xbox Series X|S).\n \n \n \nBref, c'est sans équivoque, Microsoft tout comme Sony souhaite rentrer toujours plus d'argent, et donc fait tout pour empêcher les utilisateurs d'acheter leur seconde manette en dehors de l'écosystème Microsoft. \n \nBien entendu Microsoft avance le fait que certains contrôleurs permettent de tricher, ou ne répondent pas aux exigences matérielles de finition, de qualité ou de compatibilité avec ses consoles. \n \nCe genre de mesures incitent les utilisateurs à trouver des solutions alternatives et c'est le cas de  Robert Dale Smith qui montre sur Twitter comment il utilise un contrôleur officiel comme adaptateur de manette tierce. \n \n \n \n\n\n \n \n\n\n \n \n \nPour le moment c'est qu'un début, mais cela permettra à coup sur de proposer rapidement des solutions de types dongles, ce n'est qu'un peu de temps gagné par Microsoft. \n \n \n\n \n\n \n\n \n \nTout est là : RobertDaleSmith\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182993/in-xb-microsoft-limite-lutilisation-de-controleur-tiers-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182993/in-xb-microsoft-limite-lutilisation-de-controleur-tiers-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1182993/in-xb-microsoft-limite-lutilisation-de-controleur-tiers-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1182993/in-xb-microsoft-limite-lutilisation-de-controleur-tiers-4.jpg"
        }
    },
    "news_2": {
        "title": "[Multi] Dolphin fait son rapport 4 mois après l'échec Steam",
        "content": "L'équipe en charge du développement de l'émulateur Dolphin tourne doucement la page de l'échec de la version Steam de l'émulateur GameCube. Dolphin existe depuis plus de 20 ans, ce n'est tout de même pas rien en terme de support et de suivi de développement. \n \n \n\n \n \n \nDans le rapport et la nouvelle version proposée, la Team revient surtout sur l'arrivée du dark mode (mode sombre personnalisé) à destination de Windows, ajouté avec la v5.0-19886, jusqu'alors ce mode n'était accessible qu'aux utilisateurs macOS, Android et Linux. \n \n \n \n\n \n\n \n \n \nLe rapport d'avancement d'août, septembre et octobre 2023 confirme aussi un chargement plus rapide de l'état de sauvegarde, une meilleure mise en cache, de l'amélioration des boutons de verrouillage, un rééchantillonnage de sortie resampling, qui permet d'améliorer l'apparence visuelle de Dolphin.\n \n \n \n\n \n \n \nBeaucoup d'autres améliorations son reprises en détails dans le rapport qui se trouve ici : fr.dolphin-emu.org\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182946/in-multi-dolphin-fait-son-rapport-4-mois-apres-lechec-steam-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182946/in-multi-dolphin-fait-son-rapport-4-mois-apres-lechec-steam-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1182946/in-multi-dolphin-fait-son-rapport-4-mois-apres-lechec-steam-2.png"
        }
    },
    "news_3": {
        "title": "[PS5] BwE PS5 Code Reader v1.0.6 disponible",
        "content": "Le développeur BwE vient de mettre en ligne une nouvelle version de BwE PS5 Code Reader qui est maintenant proposé en version v1.0.6. \n \n \n\n \n \nCe logiciel est conçu pour diagnostiquer les problèmes matériels, tandis que PS5 NOR Tool permet de diagnostiquer et de réparer les problèmes logiciels. Ces deux outils constituent la solution ultime pour la réparation de la PS5.\n \n \n\n \n \nMatériel requis :\n- USB TTL (ou tout autre périphérique UART)\n- Console PS5\n \nDiagnostiquer les éléments suivants  :\n- SSD\n- TPM\n- RAM\n- Contrôleur SSD\n- Puissance\n- VRM APU\n- HDMI\n- WiFi/BT\n- USB\n- Température\n- Secure Loader (SAM_IPL)\n \nTéléchargement : BwE PS5 Code Reader v1.0.6 / betterwayelectronics.com\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182937/in-ps5-bwe-ps5-code-reader-v106-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[PS3] Apollo Save Tool v1.8.6 disponible",
        "content": "Le développeur Bucanero vient de mettre en ligne une nouvelle version d'Apollo Save Tool pour la PlayStation 3. Cela faisait un bon moment que cela n'avait plus était le cas, la version précédente était daté d'Avril 2023.\n \nEn conséquence les changements sont nombreux, maintenant vous pouvez décrypter et éditer les sauvegardes TPP de Metal Gear Solid 5 TPP, et il annonce déjà vouloir mettre à jour les éditions PS2 et PS4 de l'outil. \n \n \n\n \n \nAjouts :\n- Détection automatique des paramètres du bouton X/O\n- La fonction \"Copier l'enregistrement sur le disque dur\" prend en charge l'écrasement.\n- Autoriser la réactivation d'un faux compte\n- Nouveaux codes de triche\n- Assassin's Creed II\n- Grand Theft Auto V\n- Metal Gear Solid 5 : The Phantom Pain\n- Prise en charge du décryptage personnalisé\n- Metal Gear Solid 5 : The Phantom Pain\n- Prise en charge de la somme de contrôle personnalisée\n- Assassin's Creed\n- Assassin's Creed II\n- Assassin's Creed III\n- Assassin's Creed IV : Black Flag\n- Assassin's Creed : Brotherhood\n- Assassin's Creed : Révélations\n- Assassin's Creed Rogue\n- Castlevania : Les Seigneurs de l'Ombre\n- Castlevania : Les Seigneurs de l'Ombre 2\n- Grand Theft Auto V\n- Metal Gear Solid 5 : The Phantom Pain\n \nCorrections :\n- Correction des attributs de fichiers exportés sur les disques FAT32\n- Correction de la clé BCAS20224 secure file-id\n \nDivers :\n- Prise en charge des paramètres de proxy HTTP réseau\n- Mise à jour du moteur de patch apollo-lib vers la version 0.6.0\n- Ajout de rappels d'hôtes (nom d'utilisateur, nom du système, mac wlan, psid, identifiant de compte)\n- Ajout des fonctions de hachage murmu3_32 et jhash\n- Ajout du décryptage de Patapon 3 PSP\n- Ajout du décryptage de MGS5 (PS3/PS4)\n- Ajout du décryptage de Monster Hunter 2G/3rd PSP\n- Ajout de la somme de contrôle Castlevania:LoS\n- Ajout de la somme de contrôle de Rockstar\n- Correction de SaveWizard Code Type C\n- Correction de right() sur les plateformes little-endian\n \n \n \nTéléchargement : Apollo Save Tool v1.8.6\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182936/in-ps3-apollo-save-tool-v186-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS4/PS5/Switch] DS4Windows 3.2.20 disponible",
        "content": "Le développeur Travis Nickles, connu aussi sous le pseudo Ryochan, nous propose de découvrir une nouvelle version de DS4Windows. Comme vous le savez probablement DS4Windows est une interface efficace pour paramétrer une manette sur PC, il est basé sur un fork de Jays2Kings. Pour en profiter cela passe par un câble micro-USB, mais il est aussi possible de s'en servir sans fils avec quelques adaptateurs Bluetooth 2.1 (ou supérieur). \n \nIl va s'agir de l'une des dernières versions de DS4Windows, le développeur a décidé d'arrêter le support le 31.12.2023, cela a été confirmé sur Github, il avait déjà annoncé cela l'année dernière, mais là cela semble être certain. \n \n \n\n \n \n \nCorrections :\n \n.NET Runtime x64\nhttps://dotnet.microsoft.com/en-us/download/dotnet/thank-you/runtime-desktop-6.0.16-windows-x64-installer\n.NET Runtime x86\nhttps://dotnet.microsoft.com/en-us/download/dotnet/thank-you/runtime-desktop-6.0.16-windows-x86-installer\n \n- Passage de DotNetProjects.Extended.Wpf.Toolkit de 5.0.103 à 5.0.106\n- Correction de certains index de déclencheurs Gyro. S'assurer que les déclencheurs liés au Touchpad fonctionnent à nouveau\n- Ajout de boutons DSE à utiliser comme déclencheur de changement de vitesse. Permettre aux boutons latéraux du - JoyCon de fonctionner en tant que déclencheurs de changement.\n- Plus d'abstraction dans les chemins de ressources. Permet de renommer plus facilement les assemblages. - Conséquences mineures dans l'éditeur VS XAML.\n- Consolidation des listes du menu contextuel du déclencheur gyroscopique dans l'éditeur de profil.\n- Ajout d'une traduction en malais. Contribution de shoen1x\n- Utiliser la propriété FileVersion pour récupérer la version de l'assembly à la place. Plus utile pour l'utilisation de .NET 8 que pour l'instant.\n- Mise à jour des fichiers FakerInputDLL\n- Cacher certains messages ViGEmBus dans l'éditeur de profil concernant le passthru lors de l'utilisation de versions supportées. Petite modification\n- Utiliser la vérification de la version de ViGEmBus pour le message de passthru de la barre lumineuse également\n- Ajout de Resources.zh-hans.resx pour la traduction simplifiée en chinois. Contribution de CrazyHPi\n- Mise à jour de Strings.zh-Hans.resx pour la traduction simplifiée en chinois. Contribution de CrazyHPi\n- Marque plus de chaînes dans l'interface graphique pour la traduction. Cela n'affectera évidemment pas cette version\n- Suppression de l'utilisation de l'extension LocText, obsolète. Elle est remplacée par l'extension BLoc. Elle n'était utilisée que pour rendre une seule chaîne dans l'éditeur de profil auparavant.\n- Sauter la tentative de réinitialisation de la connexion au serveur UDP si l'on demande au serveur de s'arrêter.\n- Correction de l'en-tête de la liste des déclencheurs de l'action spéciale \"Charger un profil\" dans le thème \"Dark\".\n- Modification du texte d'affichage des boutons \"Side L\" et \"Side R\" dans la liste des déclencheurs de déchargement.\n \nTéléchargement : DS4Windows 3.2.20\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182919/in-ps4ps5switch-ds4windows-3220-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[Switch] DBI 640 disponible",
        "content": "Le développeur rashevskyv propose une nouvelle version de DBI, DBI pour DB Installer est un gestionnaire et installateur de fichiers NSP/NSZ/XCI et XCZ via SD, USB. Il fonctionne tout aussi bien en standalone ou bien en créant son propre serveur http local. Il permet aussi de gérer et supprimer les fichiers orphelins les tickets (mise à jours par exemple).\n \nHormis une tendance très minimaliste exacerbée, DBI est apprécié pour ses fonctionnalités et une partie backend de Windows qui permet de faciliter les transferts.\n \n \n\n \nCorrection de DBI 640 : \n- Journal d'activité : Amélioration de la fonctionnalité et de la stabilité.\n- Problèmes liés à l'installation à partir d'une clé USB : Correction de certains problèmes liés à l'installation à partir de lecteurs externes, notamment en ce qui concerne Windows et l'attribut \"lecture seule\".\n \nAjout de DBI 633 :\n- Transfert de captures d'écran via HTTP : Les utilisateurs peuvent désormais transférer des captures d'écran de leur appareil vers un PC en utilisant HTTP. Cette fonctionnalité est disponible sous l'option de menu Outils > Parcourir l'album via HTTP.\n- Options de configuration :\n- EnableNSZ=true : Permet l'installation de NSZ/XCZ en mode applet. Cette option désactive l'installation des fichiers NSZ/XCZ lorsque DBI fonctionne en mode applet. Elle garantit que les installations ne peuvent être effectuées qu'en mode titre, soit par l'intermédiaire d'un transitaire, soit par l'intermédiaire d'un jeu. Ce mode se caractérise par un fond noir dans l'application, ce qui élimine l'erreur due à l'insuffisance de mémoire lors du décompactage.\n- CreateLFS=true : Crée un dossier LFS (Large File Storage) dans /atmosphere/contents après l'installation du jeu.\n- Traduction en chinois traditionnel : Une nouvelle version de l'application, DBI_znch.nro, a été ajoutée pour prendre en charge le chinois traditionnel.\n \n \n \nTéléchargement : DBI 640\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182913/in-switch-dbi-640-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[Vita] Hollow Knight Vita passe en v0.75",
        "content": "Le développeur PatnosDD vient de mettre en ligne une nouvelle version de son jeu Hollow Knight destiné à la PlayStation Vita. \n \nComme vous le savez ce n'est pas le jeu qui est directement proposé, mais un script qui permet de porter le jeu indie sur PlayStation Vita et PlayStation TV. \n \nHollow Knight était un jeu vidéo indépendant très apprécié développé par Team Cherry, Hollow Knight est un jeu vidéo indépendant de type metroidvania développé et édité par Team Cherry, un petit studio australien dont il est la première réalisation commerciale. Il sort en 2017 sur PC (Windows, Mac et Linux), puis en 2018 sur les consoles Nintendo Switch, PlayStation 4 et Xbox One. Son développement sur le long terme a en grande partie été rendu possible par un important financement participatif sur la plate-forme Kickstarter.\n \n \n\n \n \nL'intrigue du jeu suit la quête d'un chevalier insectoïde devant pénétrer les tréfonds du royaume d'Hallownest et y éradiquer l'entité maléfique qui y a été emprisonnée en des temps immémoriaux au sein du Hollow Knight éponyme (« chevalier creux » ou « chevalier vide »). L'influence maligne de l'antagoniste se ressent à nouveau dans une infection qui ronge le royaume et contamine peu à peu la plupart des insectes autochtones. Au terme de son voyage, le chevalier comprend qu'il n'est qu'un rouage du mécanisme retenant le fléau prisonnier, et qu'un sacrifice lui sera peut-être nécessaire pour mettre fin à l'infection.\n \n \n\n \n\n \n \nChangelog Hollow Knight v0.75 : \n \n- Remplacement de l'icône par celle utilisée dans la version PC du jeu.\n- Augmentation de la résolution des textures dans certaines scènes.\n- Correction des cutscenes cassées dans la partie \"Dream\" du jeu.\n- Suppression de certains pics de lag dans le jeu.\n- Prise en charge des trophées ! (Bien que partiellement. Vous devez installer NoTrpDrm)\n- Ajout de la prise en charge de la version GOG.\n- Correction du bug où seule la saisie tactile fonctionnait dans la sélection initiale de la langue.\n- Correction de l'intro du pré-menu.\n \n \n \n\n \n \n \n \nInstructions : \n \nTout d'abord, vous pouvez installer le .VPK à l'aide de VitaShell. N'essayez pas de lancer le jeu, car il plantera sans les fichiers nécessaires.\n \nVersion Steam : \n- Téléchargez le vpk de Hollow Knight depuis vitadb et installez-le.\n- Allez sur la page Release et téléchargez HollowKnightVitaSTEAM.zip.\n- Extrayez-le.\n- Placez le dossier du jeu (../steamapps/common/Hollow Knight) à l'intérieur du dossier extrait (il doit s'agir de la version Steam, assurez-vous qu'il n'y a pas de fichier Config.ini dans les fichiers. s'il y en a un, supprimez-le).\n- Lancez ApplyPatch.bat et attendez (entre 15 et 25 minutes selon le système).\n- Laissez-le se terminer et vous devriez obtenir un fichier .ZIP nommé HollowKnightDATA.zip.\n- Allumez VitaShell, connectez votre PS Vita à votre PC et copiez le contenu du fichier .ZIP (le fichier Zip devrait faire environ 300-400MB avant d'être décompressé) dans ``ux0:app/HKVT12222/`.\n- Cliquez sur \"Replace the files in destination\" lorsqu'il vous le demande.\n- Lancez le jeu et amusez-vous !\n \nVersion GOG : \n- Téléchargez Hollow Knight vpk depuis vitadb et installez-le.\n- Allez sur la page Release et téléchargez HollowKnightVitaGOG.zip.\n- Extrayez-le.\n- Placez le dossier du jeu(../GOG/Hollow Knight/Hollow Knight_Data) à l'intérieur du dossier extrait (Il doit s'agir de la version - Steam, assurez-vous qu'il n'y a pas de fichier Config.ini dans les fichiers. s'il y en a un, supprimez-le).\n- Lancez ApplyPatch.bat et attendez (entre 15 et 25 minutes selon le système).\n- Laissez-le se terminer et vous devriez obtenir un fichier .ZIP nommé HollowKnightDATA.zip.\n- Allumez VitaShell, connectez votre PS Vita à votre PC et copiez le contenu du fichier .ZIP (le fichier Zip devrait faire environ 300-400MB avant d'être décompressé) dans ``ux0:app/HKVT12222/`.\n- Cliquez sur \"Replace the files in destination\" lorsqu'il vous le demande.\n- Lancez le jeu et amusez-vous !\n \n \nTéléchargement : Hollow Knight Vita v0.75\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182875/in-vita-hollow-knight-vita-passe-en-v075-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182875/in-vita-hollow-knight-vita-passe-en-v075-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1182875/in-vita-hollow-knight-vita-passe-en-v075-3.jpg"
        }
    },
    "news_8": {
        "title": "[XB] Le futur du recovery de la Xbox est là",
        "content": "Le développeur dtomcat propose sa solution de sauvegarde de data pour la Xbox, il pourrait s'agir là de l'avenir de la récupération facile de données sur Xbox. La sauvegarde et/ou l'écriture de votre eeprom Xbox prend désormais moins de 5 secondes. \n \nUn fonctionnement on ne peut plus simple, il suffit de placer la solution PicoPromSD de dtomcat sur la carte PCB de la Xbox en fonctionnent pour flasher ou dumper l'eeprom. \n \nLa partie software de la solution est là : picoPromSD de dtomcat\n \n \n\n \n \nLa solution que l'on voit dans cette vidéo est faite sur une console Xbox Originale 1.4 non modifiée. Ouvrez simplement votre Xbox, connectez votre PicoPromSD, allumez la console et vous obtenez un dump EEPROM et un fichier texte avec toutes vos données. Il peut également écrire des données sur l'EEPROM. \n \nAvant d'arriver à cette solution, de nombreux prototypes ont été produits. \n \n \n\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182828/in-xb-le-futur-du-recovery-de-la-xbox-est-la-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS5] PS Multi Tools v13.2 disponible taillé pour la PS5",
        "content": "Le développeur SvenGDK propose depuis quelques heures une nouvelle version de PS Multi Tools qui est désormais livré en v13.2. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \nChangelog PS Multi Tools :\n \n- Les dossiers de sauvegarde locaux des jeux et applications de la PS5 sont désormais pris en charge.\n- La bibliothèque de jeux de la PS5 a été entièrement repensée et affiche désormais plus d'informations\n- Nouvelle conception du ListView\n- Affiche plus d'informations\n- Le titre du jeu ou de l'application peut être affiché dans différentes langues au survol du titre (si présent dans param.json)\n \n \n\n \n \nTéléchargement : PS Multi Tools v13.2\n \n \n",
        "images": {}
    },
    "news_10": {
        "title": "[PS5] PS5 DB Rebuilder pour app.db et appinfo.db",
        "content": "Le développeur Nomadic dévoile PS5 DB Rebuilder, un outil pour sauvegarder et réparer vos fichiers app.db et appinfo.db sur une PS5 hackée, cela peut s'avérer utile en cas de fichiers corrompus, après par exemple un kernel panic. \n \nBien qu'il soit toujours en développement, ce script PC permet de se connecter à votre PS5 en exécutant un serveur FTP, de récupérer les fichiers app.db et appinfo.db, ou encore de récupérer le conceptID. Cette valeur est requise pour créer des entrées valides dans la base de données lors d'une tentative de réparation.\n \nDe manière générale, si vous piratez votre PS5, il est recommandé d'obtenir une copie de sauvegarde de ces deux fichiers, vous courez le risque de perdre les jeux précédemment installés (et ceux-ci pourraient être difficiles à obtenir). de retour puisqu'une PS5 piratée n'a pas d'accès PSN). Bien sûr, il reste possible de copier ces fichiers directement depuis votre PS5 compatible FTP devrait en général suffire. PS5 DB Rebuilder aide dans les cas où ces fichiers sont corrompus.\n \n \n\n \n \nCe script se connecte via FTP et les récupère app.db et appinfo.db de la PS5 et les copie dans un répertoire local appelé  tmp que le script crée. Il vérifie via FTP s'il y a des jeux dans /user/app, ou dans d'autres emplacements qui vous manquent probablement après une reconstruction de la base de données. Après avoir récupéré une liste de jeux du système de fichiers, il comparera cette liste aux valeurs de la ou des bases de données PS5. S'il en manque, cela remplira le(s) tableau(s)\n \nTélécharger : PS5 DB Rebuilder pour app.db et appinfo.db\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182825/in-ps5-ps5-db-rebuilder-pour-appdb-et-appinfodb-1.jpg"
        }
    },
    "news_11": {
        "title": "[PSP] L'unbrick d'une PSP-1000 avec un RP2040",
        "content": "Le développeur Yoti, bien connu pour la méthode Baryon Sweeper, vient de mettre en ligne une vidéo précédent la possibilité de réaliser un unbrick d'une PSP-1000 avec un RP2040. \n \nDepuis bien longtemps il est possible de unbrick la PSP avec la batterie Pandora, mais ça sur des modèles anciens, les modèles PSP-2000 et PSP-3000 il fallait passer par Baryon Sweeper. \n \n \n\n \n \nC'est une excellente évolution que la PSP puisse être unbrick avec un RP2040 car cela amène une ouverture à la simplification du processus. \n \n",
        "images": {}
    },
    "news_12": {
        "title": "[PS4] Call of Duty Modern Warfare III backporté 5.05/6.72/7.02/7.55/9.00",
        "content": "Certains le qualifient de titre exceptionnel, d'autres de simple DLC de Modern Warfare II, rien de mieux que de tester ou de se faire une idée par soi-même.\n \n\"Call of Duty\" est une franchise de jeux vidéo de tir à la première personne (FPS) créée par Infinity Ward et publiée pour la première fois par Activision en 2003. \n \nCertains des volets les plus populaires de la série incluent \"Call of Duty 4: Modern Warfare\", \"Call of Duty: Black Ops\", \"Call of Duty: Modern Warfare 2\", et \"Call of Duty: Warzone\" (un mode de jeu gratuit basé sur la franchise), mais chaque année, un nouveau titre Call of Duty est généralement publié, avec différents développeurs travaillant en rotation sur les projets. Modern Warfare est l'une des meilleures déclinaisons de la franchise.\n \n \n\n \n \n \nCall of Duty : Modern Warfare III est un jeu FPS développé par Sledgehammer Games et publié par Activision. Il s'agit de la suite de Modern Warfare II (2022), du troisième opus de la série Modern Warfare et du vingtième opus de la série Call of Duty.\n \n \n\n \n\n \n \nLe développeur Cyb1K a réussi à backporté le titre sur PlayStation 4 au travers de la mise à jour 1.33, et ils n'arrivent pas seuls puisque Cyb1K a réussi également à rajouter de nombreux packs Campagne et Multi. Par contre attention il faudra un peu d'espace sur le disque dur. \n \n \n\n \n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182781/in-ps4-call-of-duty-modern-warfare-iii-backporte-505672702755900-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182781/in-ps4-call-of-duty-modern-warfare-iii-backporte-505672702755900-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1182781/in-ps4-call-of-duty-modern-warfare-iii-backporte-505672702755900-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1182781/in-ps4-call-of-duty-modern-warfare-iii-backporte-505672702755900-4.jpg"
        }
    },
    "news_13": {
        "title": "[XB] Xemu mis à jour en version 0.7.117",
        "content": "L'équipe en charge du développement de Xemu, l'émulateur de la console Xbox originale pour PC Windows, MacOS et Linux. Pour se souvenir Xemu est avant tout un fork de XQEMU, le projet d'émulation système complet QEMU, toujours axé sur les fonctionnalités, les performances, et la stabilité et surtout l'expérience utilisateur.\n \nAinsi comme nous pouvons le voir dans le changelog ce sont de nombreux correctifs qui ont été déployés, comme par exemple la simplification de l'interface utilisateur ou la suppression d'éléments non utilisés. \n \nLe code a été retravaillé, une restauration de l'affichage du système au premier démarrage est aussi de la partie , ainsi de nombreuses évolution du menu contextuel. \n \n \n\n \n \nChangelog v0.7.117 :\n \n- Utiliser une seule option pour la fenêtre de paramétrage (#1122)\n \n- rebase code\n \n- suppression des éléments inutilisés\n \n- restaurer l'affichage du \"système\" au premier démarrage\n \n- restaurer les fonctions du menu popup (commit séparé)\n \n- restaurer la fonction snapshot dans le menu popup\n \n- récupérer la valeur de l'index actuel dans le fichier de configuration\n \n \nTéléchargement : Xemu v0.7.117\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182742/in-xb-xemu-mis-a-jour-en-version-07117-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] Sony dévoile le code source de la PlayStation Portal",
        "content": "Cela ne vous aura pas échappé mais la PlayStation Portal est un véritable succès, du moins, elle est déjà en rupture 5 jours après sa sortie, de deux choses l'une, soit Sony n'en a pas produit et fourni assez pour honorer un lancement digne de ce nom, soit c'est un véritable succès au delà des attentes, en tout cas les scalpers se font déjà plaisir. \n \nBref, au delà de cela, Sony vient de publier le code source de la PlayStation Portal comme la firme avait pu le faire avec la PS4 et la PS5, et ceci en raison que s'appuyant sur un licence open-source, la divulgation du code source du système d'exploitation est indispensable et indiscutable. \n \nPesant 600 Mo, ce sont 5 dossiers différents : External, kernel_platform, prebuilts, system et vendors.\n \n \n \n\n \n \n \nLe développeur emuonpsp a découvert que la PlayStation Portal utilise un SoC Snapdragon SM6225, soit un SnapDragon 680.\n \n \n\n \n \nTout est là : Source Code PlayStation Portal Remote Player\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182729/in-ps5-sony-devoile-le-code-source-de-la-playstation-portal-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1182729/in-ps5-sony-devoile-le-code-source-de-la-playstation-portal-2.png"
        }
    },
    "news_15": {
        "title": "[Switch] RyuJinx au rapport d'Octobre !",
        "content": "C'est désormais au tour de la Team RyuJinx de dévoiler son rapport du mois d'Octobre quelques heures après celui de la Team Yuzu. \n \nLà aussi de nombreuses évolutions, notamment dans certains jeux comme Luigi's Mansion 3. Des problèmes de GPU AMD ont été corrigés via à certains correctifs, afin de corriger des problèmes d'objets et d'ombres. \n \n \n\n \n\n \n \nLa Team nous explique qu'elle a été confronté à la nécessité de gérer la suppression de données de mémoire GPU (VRAM) après la fin d'utilisation de certains jeux. \n \n \n\n \n \nA noter que certains jeux, bénéficiant d'un nouveau service IFileSystem.GetFileSystemAttribute introduit à partir du firmware 16.0.0 ne fonctionnaient plus, c'est désormais corrigé. \n \n \n\n \n \nComme nous le voyons, RyuJinx évolue comme Yuzu dans le bon sens.\n \n \nTout est là : ryujinx.org\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182676/in-ps3-ryujinx-au-rapport-doctobre-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1182676/in-ps3-ryujinx-au-rapport-doctobre-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1182676/in-ps3-ryujinx-au-rapport-doctobre-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1182676/in-ps3-ryujinx-au-rapport-doctobre-4.png"
        }
    },
    "news_16": {
        "title": "[PS3] Le xai-plugin voit arriver les options de la Rebug Toolbox",
        "content": "Le développeur Nathan Martin vient d'annoncer sur son profil Twitter qu'à la suite de la demande d'un utilisateur, RoboKingsComos, qu'il vient de rajouter de nouvelles options dans le xai-plugin. \n \nCe ne sont pas n'importe lesquelles des options qui ont été rajoutées, ce sont les options de la Rebug Toolbox. \n \nL'option \"Basculer l'espace disque dur\" a été corrigée et fonctionne désormais sur HEN. Le code d'erreur 0x800299D2 lors de la lecture d'un film DVD/BD semble avoir été contourné lors de tests récents. \n \nCorrection d'un problème dans xai_plugin lors de la création de fichiers act.dat/RIFs lorsque l'ID utilisateur actuel comporte plus de deux chiffres.\n \n \n\n \n\n \n \nCes derniers jours, il a porté ses efforts sur la gestion des régions des films DVD/BD à partir du XMB, et aussi pour le format de diffusion PAL/NTSC, preuve qu'il est toujours possible de trouver des évolutions sur PS3. \n \nPour rappel, xai_plugin fait partie du CFW 4.90 Evilnat. Le plugin est utilisé conjointement avec le menu Custom Firmware Tools (XML), certaines options nécessitent des fonctionnalités ajoutées à Cobra 8.4.\n \nDonc, si vous souhaitez utiliser xai_plugin, il vous suffit d'installer CFW 4.90 Evilnat et tout est prêt. \n \nTout est là : https://twitter.com/xXEvilnatXx\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182643/in-ps3-le-xai-plugin-voit-arriver-les-options-de-la-rebug-toolbox-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182643/in-ps3-le-xai-plugin-voit-arriver-les-options-de-la-rebug-toolbox-2.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] Abkarino dévoile une méthode de partage de compte",
        "content": "Le développeur Abkarino a publié sur son profil Twitter (X) une technique de partage de compte pour la PlayStation 4. \n \nCette technique a déjà été approuvée sur PSP, PS3 et Vita, mais Sony a changé pas mal de choses sur la PlayStation 4, il a fallu adapter la méthode. Comme vous le savez cette technique n'est pas nouvelle, elle s'appuie sur le fait que Sony tolère un compte ami sur une nouvelle console en faisant oublier la première console. \n \nComme cette méthode s'appuie sur des dumps, des flashs SPI et Syscon, elle ni gratuite, ni simple à mettre en oeuvre.\n \n \n \n\n \n \n \nCette méthode de partage / activation de compte PSN : \n \n1 - Ajoutez des comptes PSN avec des jeux à votre console et activez-la en tant que console principale et téléchargez tous les jeux que vous souhaitez à partir de ces comptes .\n \n2 - Éteignez votre console et dumpez votre flash SPI et Syscon 2 ou 3 fois pour être sûr que vous avez un dump correct. \n \n3 - Retirez le disque dur actuel, installez-en un nouveau et réinstallez le même firmware que vous aviez à nouveau.\n \n4 - Ajoutez les mêmes comptes PSN que vous avez ajoutés lors de la première étape et désactivez maintenant cette console de tous les comptes. \n \n5 - Éteignez à nouveau votre console et restaurez vos dumps SPI Flash et Syscon que vous aviez effectués à l'étape 2. \n \n6 - Remplacez le nouveau disque dur par votre original (très important).\n \n7 - Rallumez la console et tadaaaaaa vous avez activé les jeux PSN sans compter votre console parmi les comptes PSN utilisés.\n \n \nLa méthode se trouve ici : AbkarinoMHM\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182629/in-ps4-abkarino-devoile-une-methode-de-partage-de-compte-1.png"
        }
    },
    "news_18": {
        "title": "[2DS/3DS/DS] TWiLight Menu++ v26.3.0 et nds-bootstrap v1.0.3 disponibles",
        "content": "Le développeur RocketRobz est de retour avec de nouvelles versions de TWiLight Menu++ et de nds-bootstrap, ainsi le thème DSi Classic a été ajusté pour se comporter davantage comme l'original. Plusieurs traductions ont été mises à jour et un patch anti-piratage a été ajouté pour le hack ROM \"Pokémon : Refined Gold Overhaul\".\n \nAu délà de cela certains bugs ont été corrigés dans Bootstrap NDS. Le jeu « Tootuf : Mission Nadia » est désormais sauvegardé et « Style Lab : Jewelry Design » démarre en mode DSi. \n \n \n\n \n \nSur la 3DS , les astuces dans DSiWare fonctionnent désormais également et l'ouverture du menu \"Enregistrements\" dans Tetris DS ne provoque plus de crash si le menu Nintendo WFC était précédemment ouvert.\n \n \n \nTéléchargement : TWiLight Menu++ v26.3.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182622/in-2ds3dsds-twilight-menu-v2630-et-nds-bootstrap-v103-disponibles-1.jpg"
        }
    },
    "news_19": {
        "title": "[Switch] Yuzu fait son introspection du mois d'Octobre 2023",
        "content": "Comme tous les mois, la Team Yuzu fait le récapitulatif des évolutions de son émulateur Switch nommé tout simplement Yuzu, et elles ont encore une fois étaient nombreuses sur le mois dernier. \n \nLe rapport qu'elle dévoile souvent en milieu de mois permet de connaitre les améliorations, les nouveautés et vers où va les ressources de l'équipe, un bon moyen d'informer mais aussi de rassurer les utilisateurs et ceux qui continuent de soutenir le projet. \n \nAinsi la team annonce avoir amené une pléthore de correctifs GPU, la prise en charge de nouvelles applets, beaucoup de travail consacré aux versions Android, et des nouvelles intéressantes sur l'avenir.\n \nGPU ?\n \nDes optimisations par certains endroits pour Super Mario Bros Wonder, notamment sur des bascules internes entre VSync à double et triple tampon. De nombreux changements sur la gestion des GPU ont été effectués le mois dernier. Lorsqu'un jeu utilise un tampon de profondeur, il s'inspire généralement d'une scène 3D chargée tout en profitant d'un processus accéléré par le matériel appelé test de profondeur.\n \nLors des tests de profondeur, le matériel GPU détermine si un pixel est visible ou masqué (occlus) par un autre pixel. Ceci est décidé par leurs valeurs de profondeur. Le tampon de profondeur suit la distance entre chaque pixel stocké et la caméra. Si un pixel rendu est plus éloigné que ce qui a déjà été dessiné sur la scène, alors le pixel est ignoré ; s'il est plus proche, alors il est conservé et les tampons de couleurs sont mis à jour. Généralement, le tampon de profondeur est également mis à jour et écrit, dans ce cas, pour stocker la profondeur du nouvel objet plus proche.\n \n \n\n \n \n \nIl est possible pour un jeu d'utiliser uniquement les tests de profondeur et de désactiver les écritures réelles dans le tampon de profondeur pour des éléments spécifiques, et de nombreux jeux le font lors du rendu d'objets partiellement transparents. Cependant, l'inverse n'est pas permis par les API graphiques comme Vulkan : les conceptions matérielles nécessitent que les tests de profondeur soient activés afin de mettre à jour le tampon de profondeur. Le chemin clair masqué de yuzu pour les tampons de profondeur/pochoir a un shader qui met à jour le tampon de profondeur, et permet ainsi les écritures en profondeur, mais a oublié d'activer également les tests de profondeur. La plupart du temps, cela fonctionnait par coïncidence, car le jeu permettait des tests approfondis et Yuzu ne sortait pas de cet état. Cependant, tous les jeux ne les permettent pas, et sans tests de profondeur, des jeux comme Super Mario 64, ou Super Mario 3D All-Stars, ne peuvent pas restituer correctement le visage de Mario.\n \n \n\n \n \nCela passe par un travail effectué par le développeur Maide, qui lui aussi est à l'origine de l'optimisation de Vulkan Memory Allocator standard (VMA en abrégé) qui est la façon dont il peut aider à nettoyer le code, mais il a aussi résolu des problèmes de cache, de scale de résolution, de redimensionnement d'images, et il a même découvert un problème avec les calculs des shaders lorsqu'ils déclenchaient des invalidations dans le cache de tampon. Bref il a fait un énorme boulot. \n \n \nAndroid ? \n \nLa version Android a largement était améliorée, il faut dire qu'elle a vu arriver de nombreuses modifications, notamment pour améliorer l'expérience utilisateur et la compatibilité avec les appareils. Ainsi un nouveau gestionnaire de pilotes GPU a été développé. \n \nDes crashs ont été résolus, ceux qui se produisaient uniquement en faisant une simple rotation de l'appareil, et des problèmes liés à Vulkan 1.1, surtout présent sur Adreno 600 et 700 ont là ausi été rectifiés. \n \nUne grille d'accueil a été implémentée, et certains threads de mémoire ont été séparé afin de limiter les freezes.\n \n \n\n \n \nEnfin un menu applets nommé \"Cabinet\" est désormais intégré permettant par exemple d'accéder à l'éditeur Album et Mii, ou à un app permettant de gérer les données Amiibo. \n \n \nL'interface utilisateur ? \n \nUn support spécifique pour Windows a été apporté, après un début difficile certaines fonctionnalités ont été intégrées, comme des raccourcis permettant de mettre votre jeux directement sur le bureau ou dans le menu démarrer. Il a fallu également créé un format d'icônes, ainsi que sur la gestion de la souris. Des spécifiques comme pour les captures d'écran, mais ils ne peuvent pas tout voir, les développeurs passent beaucoup de temps à ouvrir et fermer yuzu alors que byte[] peut mesurer avec précision que 10 % des crashs d'arrêt qui sont causés par les jeux. \n \n \n\n \n\n \n \n \nQuelques modifications à venir ? \n \nOui notamment du côté AMD, Polaris et Vega, d'ancienne génération vont sortir du support AMD, les pilotes sont désormais scindés en deux, les 2 derniers vestiges de l'architecture GCN sont sur le point d'être abandonnés. Ces produits exécutent des branches de pilotes Vulkan obsolètes par rapport à RDNA et au matériel plus récent. La nouvelle d'AMDVLK, le pilote Linux AMD officiel, supprimant la prise en charge de ces produits signifie qu'aucun nouveau pilote Vulkan ne sera disponible. Il faut se préparer à la sortie du support de ces générations.\n \nLe Project Nice pour les appareils Android, NCE (Native Code Execution) progresse très bien, mais il reste encore quelques bugs à corriger. Les jeux deviennent non seulement jouables, mais aussi plus rapides sur les appareils soumis à des restrictions thermiques. De plus, le temps passé à charger et fermer les jeux a désormais été considérablement réduit ! NCE a également aidé à comprendre les problèmes liés à l'émulation de processeur dans x86_64, alors attendez-vous à des gains sur les deux fronts.\n \n \n\n \n \nBref, on le voit le travail effectué par la Team Yuzu restent impressionnant, tenant à s'excuser car les devoirs universitaires et les examens retardent un peu la publication des rapports mensuels. \n \n \nLe rapport intégral se trouve ici : \n \nhttps://yuzu-emu.org/entry/yuzu-progress-report-oct-2023/\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182590/in-switch-yuzu-fait-son-introspection-du-mois-doctobre-2023-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1182590/in-switch-yuzu-fait-son-introspection-du-mois-doctobre-2023-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1182590/in-switch-yuzu-fait-son-introspection-du-mois-doctobre-2023-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1182590/in-switch-yuzu-fait-son-introspection-du-mois-doctobre-2023-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1182590/in-switch-yuzu-fait-son-introspection-du-mois-doctobre-2023-5.png",
            "image_6": "https://www.logic-sunrise.com/images/news/1182590/in-switch-yuzu-fait-son-introspection-du-mois-doctobre-2023-6.png"
        }
    },
    "news_20": {
        "title": "[Switch] AIO Switch Updater v2.23.2 disponible",
        "content": "Le développeur HamletDuFromage a mis en ligne hier une nouvelle version de son AIO Switch Updater, comme vous le savez cet outil permet de profiter d'options très utiles comme mettre des DNS Lan Play, de mettre à jour Atmosphere ou les sigpatches, ou encore de gérer des cheats codes via CheatSlips.com.\n \n \n\n \n \n \nChangelog 2.23.2 : \n \n- Correction du payload rcm pour les unités picofly \n- Correction du payload ne fonctionnant pas sur certaines unités picofly\n- Mise à jour de la traduction en anglais\n- Mise à jour du fichier menus.json coréen\n- Correction de certaines formulations dans la traduction en roumain\n \n \nTéléchargement : aio-switch-updater\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182581/in-switch-aio-switch-updater-v2232-disponible-1.jpg"
        }
    }
}