{
    "news_1": {
        "title": "[PS4] PS4 Cheats Manager 1.2.0 disponible",
        "content": "Le développeur Bucanero démarre bien l'année 2024 en faisant le choix de proposer une nouvelle version de PS4 Cheats Manager qui passe en version v1.2.0.\n \nLa première des évolutions est le changement de nom puisqu'il s'agissait jusqu'à présent de GoldHEN Cheats Manager et qu'il s'appelle désormais PS4 Cheats Manager.\n \nCette version intègre le décryptage, l'analyse et l'exportation des fichiers MC4 au format XML, avec cela de nouveaux actifs d'interface utilisateur ont été ajoutés, tout comme d'autres améliorations. \n \n \n\n \n \nAjouté :\n- Décryptage du format MC4\n- Analyse et affichage des codes des fichiers MC4\n- Exportation des fichiers MC4 décryptés au format xml\n- Liste des fichiers MC4 invalides\n- Taguer les fichiers de cheat par format (JSON, SHN, MC4)\n- Ajout d'une option pour supprimer tous les cheats, patches et plugins locaux\n- Prise en charge du proxy réseau (basé sur les paramètres du système)\n \nModification :\n- Mise à jour des éléments de l'interface utilisateur\n \nCorrection :\n- Filtrage des jeux par Title ID\n \nDivers :\n- Inclut le dernier pack cheat+patch (2023-12-30)\n \n \nTéléchargement : PS4 Cheats Manager 1.2.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184497/in-ps4-ps4-cheats-manager-120-disponible-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS5] Sleirsgoevy dévoile un script pour porter ps5-kstuff sur d'autres firmwares",
        "content": "Le développeur Sleirsgoevy vient de mettre en ligne un script python qui va permettre de porter facilement ps5-kstuff sur les firmwares compris entre le 3.00 et 4.51.\n \nAlors que nous attendons dans les heures ou jours qui viennent l'arrivée du portage de l'exploit sur le firmware 3.00, le développeur permet donc de faciliter les portages. \n \nAvant de vous lancer, il faut que vous vérifiez si le firmware n'est pas déjà supporté. \n \n \n\n \n \nAttention avant toute chose, ce n'est pas un outil complet, ceci ne contient pas toutes les données nécessaires pour porter \"ps5-kstuff\" sur d'autres firmwares. Il s'agit davante d'un work-in-progress, à noter la contribution de NotSoTypicalGamer et EchoStretch. \n \n\n \nInstructions for ps5-kstuff porting_tool (original by NotSoTypicalGamer and EchoStretch)\n \n0.Make sure PS5 is jailbroken and running your exploit of choice with the ELF loader active\n1.Use Linux, this README is focused on Ubuntu specifically (WSL2 doesnt appear to work)\n2.Clone this repository locally:\n> git clone https://github.com/sleirsgoevy/ps4jb-payloads.git --recursive --recurse-submodules -b bd-jb \n> move into the right folder cd ps4jb-payloads/ps5-kstuff/porting_tool\n3.Create symbols.json in the same folder and the contents should be: {\"allproc\": <ALLPROC_OFFSET>}\n> to find the ALLPROC_OFFSET for your firmware, search on Specter's GitHub\n> the offsets are located here document/en/ps5/offsets, find the right .js file for your firmware and search for OFFSET_KERNEL_DATA_BASE_ALLPROC. The HEX value you will find needs to be converted to DEC (just use a website online)\n> you can finally substitute <ALLPROC_OFFSET> with the DEC value you got and save the file\n4.Make sure python3 is installed\n5.Install gbd-tools either with pip install gdb-tools or sudo apt-get install gdb if the other command doesn't work.\n6.Install yasm with sudo apt install yasm\n7.Try and run the script with python3 main.py symbols.json <your.ps5.ip.address> <elf.loader.port> kernel-data.bin\n8.Once complete you should have kernel-data.bin dumped into porting_tool folder.\n9.symbols.json will have also been updated to include needed information.\n \n\n \n\n \n \nTout est là : ps5-kstuff porting_tool \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184496/in-ps5-sleirsgoevy-devoile-un-script-pour-porter-ps5-kstuff-sur-dautres-firmwares-1.png"
        }
    },
    "news_3": {
        "title": "[Switch] Le linker Mig Switch serait vendu le prix d'un jeu",
        "content": "En ce début 2024, un nouveau linker serait lancé d'ici la fin du mois à destination de la Nintendo Switch d'abord en petit volume, puis le volume de production augmentera à compter de Mars 2024. Dans un premier temps, seuls les revendeurs auront accès au premier stock, la Team ne vendant pas au détail, certainement un moyen de se protéger de Nintendo en plus du pays d'origine. \n \n \n\n \n \nSelon plusieurs sources, le linker Mig Switch serait vendu le prix d'un jeu, un revendeur a déjà listé ce linker sur son shop, et des utilisateurs ont demandé sur le site officiel a combien il serait vendu. Les deux parlent d'un prix de 65 $, ce qui fera de ce linker une offre assez chère finalement, celui très proche d'un certain Gateway 3DS.\n \n \n\n \n \nBien entendu, chaque revendeur proposera le prix qu'il souhaitera, selon les quantités, mais cela donne une idée du prix auquel ce linker pourrait être proposé.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184404/in-switch-le-linker-mig-switch-serait-vendu-le-prix-dun-jeu-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184404/in-switch-le-linker-mig-switch-serait-vendu-le-prix-dun-jeu-2.png"
        }
    },
    "news_4": {
        "title": "[PS4/PS5] PS Multi Tools v13.5 disponible",
        "content": "Première version de 2024, SvenGDK vient de mettre à jour PS Multi Tools en version 13.5.\n \nAprès la version Mac, après une première version apportant le support de la PS5, voilà qu'il améliore encore une fois sa proposition en axant désormais beaucoup des optimisations pour la PS5. \n \nComme vous le savez  PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n\n \n \n \nCette nouvelle version 13.5 apporte de nouvelles librairies PS5, des outils PS5, et des corrections pour les patchs de jeux PS5, quand on vous dit qu'il s'agit d'une version taillée pour la PS5 le changelog le confirme ! \n \nChangelog 13.5 : \n \nGénéral :\n> Mise à jour de certains paquets NuGet\n- FluentFTP\n- WinSCP\n- Microsoft.Web.WebView2\n \nBibliothèque PS5 : \n> Légère augmentation des performances de la bibliothèque de jeux\n> Nouvelle action du menu contextuel pour les jeux : \"Parcourir les actifs\"\n> Navigateur d'actifs de jeux\n- Parcourt rapidement les fichiers d'actifs du jeu sélectionné\n- Charge les fichiers .mp4, .webm, .png, .jpg, .ogg & .ttf\n- Lit ou affiche (actuellement) les fichiers .mp4, .png, .jpg et .ttf\n> Plus d'informations sur les infobulles\n- Vérifie maintenant si l'eboot du jeu est signé\n- Indique si le firmware requis pour le jeu n'est pas trop élevé pour être (actuellement) jouable\n- Affiche maintenant tous les identifiants de contenu d'un jeu à partir de contentids.json\n> Sauvegarde et recharge automatiquement l'IP et le port de votre PS5 lorsque vous les définissez dans \"Settings\".\n> Correction : Ne pas vérifier l'absence de l'icône (icon0.png) sur les prosperopatches pour les applications NPXS\n \nOutils PS5 :\n> Nouvel outil Make fSELF pour signer les fichiers SELF des dumps créés\n- Basé sur Make_FSELF_PY3.bat d'EchoStretch et sur la mise à jour de make_fself de LightningMods par Flatz.\n- Fake signs va désormais signer les fichiers SELF dumpés et créer une sauvegarde (.esbak) du fichier original\n> Correction de FTP Grabber : Retour du curseur de la souris une fois le dump des fichiers SELF terminé\n \nPS5 Game Patches :\n> Correction : Le paquet SC n'est pas téléchargeable à cause d'une erreur de certificat.\n> Correction : Si la taille d'un pkg ne pouvait pas être déterminée, la fenêtre plantait ou n'ajoutait pas le .pkg à la file d'attente.\n> Correction du téléchargement lent\n- L'opération de téléchargement par défaut de CoreWebView2 ne s'annulait pas lorsque l'on supprimait le dialogue de téléchargement par défaut.\n> Charge maintenant les patchs déjà téléchargés (doivent se trouver dans le dossier Downloads de PS Multi Tools).\n> Fusionner les patchs après le téléchargement en cliquant avec le bouton droit de la souris sur \"_sc.pkg\"\n- Ceci peut être fait après que tous les paquets aient été téléchargés.\n- Cela crée un nouveau dossier avec le nom de base du patch (dans le dossier Downloads), place tous les paquets de ce patch dans ce dossier et les fusionne ensuite.\n> Les champs \"Download State\" et \"Merge State\" ont été ajoutés pour indiquer la progression.\n- Indique si le téléchargement [Non démarré / Démarré / Téléchargé (pas pour reprendre !)].\n- Indique si les paquets d'un correctif de jeu ont été fusionnés ou si une fusion est encore nécessaire\n> Supporte maintenant le tri des éléments en cliquant sur l'en-tête de la colonne\n \n \nTéléchargement : PS Multi Tools v13.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184403/in-ps4ps5-ps-multi-tools-v135-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[Multi] ScummVM v2.8.0 disponible",
        "content": " \nUne nouvelle version de ScummVM vient d'être publiée, il s'agit d'une version majeure qui a pour ambition d'apporter de nombreuses nouveautés que ce soit sur Nintendo Switch, PS Vita, PS3, PSP, Windows, et bien plus encore, notamment au travers de la compatibilité de pas moins de 50 jeux supplémentaires et qui ramène le support de la Nintendo Wii ou encore de la PS3 !\n \nLe portage RetroArch a été correctement réécrit, et il fait maintenant partie du code source. Le portage Atari a également été refait à partir de zéro et la couche software passe désormais nativement au matériel, sans passer par SDL en tant que couche intermédiaire. Cela permet d'élargir la gamme de jeux compatibles.\n \n \n\n \n \nContrairement aux versions précédentes, il s'agit d'une version majeure avec le retour de toutes les plates-formes (Windows, Debian, Ubuntu, Vita, Android, Dreamcast, Switch, Wii, PS3...).\n \n \nUn petit changelog est lié à cette version : \n \n\n \n2.8.0 \"Mysteries, Mammoths, and Muppets\" (2023-12-30)\nNew games:\n \nAdded support for macOS versions of Syberia and Syberia II.\nAdded support for The Vampire Diaries, Nancy Drew: Secrets Can Kill, Nancy Drew: Stay Tuned for Danger, Nancy Drew: Message in a Haunted Mansion, Nancy Drew: Treasure in the Royal Tower and Nancy Drew: The Final Scene.\nAdded support for Reah: Face the Unknown and Schizm: Mysterious Journey.\nAdded support for Might and Magic Book One.\nAdded support for Muppet Treasure Island.\nAdded support for Primordia, Shardlight and Technobabylon.\nAdded support for The Excavation of Hob's Barrow, Strangeland and Whispers of a Machine.\nAdded support for Stranga and Cloak and Dagger's AGS games.\nAdded support for Adibou 1.\nAdded support for Dark Side.\nAdded support for Kingdom: The Far Reaches.\nAdded support for Escape From Hell.\nAdded support for Wrath of the Gods, Gadget: Invention, Travel and Adventure, The Dark Eye, and 4 other Director titles.\nNew platforms:\n \nAdded libretro new shiny port.\nAdded Atari port.\nGeneral:\n \nAdded optional dependency for libvpx.\nAdded optional dependency for libmikmod.\nAdded support for PC98 font ROM.\nAdded optional dependency for libsonivox, implementing EAS (Embedded Audio Synthesis) sound driver.\nAdded YUV422 and YUV444 support to Theora decoder.\nImplemented specialized CPU routines for graphics blitting for ManagedSurface.\nChanged default GM device to \"auto\" for better compatibility.\nAGS:\n \nSynced with upstream AGS 3.6.0.53.\nSped up graphics manipulation on modern hardware with CPU-specific code.\nAdded support for early font rendering, to match the original interpreter.\nAdded support for playback of transcoded videos in place of unsupported codecs.\nCompleted implementation of MOD audio playback.\nFixed background music not looping in some games.\nFixed game-breaking bugs in various games (e.g. Strangeland, Chronicle of Innsmouth)\nMultiple updates to the game detection tables.\nAsylum:\n \nAdded support for Chinese Sanitarium.\nDragons:\n \nImplemented localizations for the copyright screen and main menu.\nFreescape:\n \nImproved collision and projectile detection using sweepAABB\nGrimE:\n \nAdded support for Chinese Grim Fandango.\nAdded support for Russian Grim Fandango translations from Fargus, ENPY and 7Wolf.\nKyra:\n \nAdded support for Kyra1 Amiga French release and DOS Czech fan translation.\nImproved game controls menu accuracy for all platforms.\nAdded support for Chinese EOB2.\nAdded support for the PC-98 version of EOB2.\nMohawk:\n \nGreatly improved the accurary of the code generation for the Domes in Riven: The Sequel to Myst to match the original game.\nPrivate:\n \nAdded support for the Japanese Windows release.\nSCUMM:\n \nAdded support for unpacked RuSCUMM patches for Russian localizations.\nAllow usage of the official Monkey Island 1 Roland MT-32 patch with any EGA version, not just the English release.\nCompletely rewritten sound code for all Humongous Entertainment games.\nFaithfully implemented Mac GUI for Indiana Jones and the Last Crusade, and Loom.\nImplemented turning around animation when changing direction for Full Throttle, The Dig and The Curse of Monkey Island.\nAdded enhancement to Loom: Ctrl+D shows up list of drafts that has been discovered.\nFixed kanji characters rendering issue in Japanese SegaCD version of Monkey Island 1. Text rendering for this game is now pixel perfect.\nImplemented complete support for the Macintosh and DOS/V Japanese versions of Indiana Jones and the Fate of Atlantis distributed by MicroMouse.\nImplemented network multiplayer support for Backyard Football, Backyard Baseball 2001, and Backyard Football 2002.\nSherlock:\n \nAdded support for Chinese Serrated Scalpel.\nAdded data to savegames whose lack could make savegames unwinnable.\nSword1:\n \nRewrote the palette fading system and the game timers to match the original DOS version.\nRewrote all the menu code to make it match the original. This includes the restoration of the Speed setting.\nRestored the correct fonts and menu texts for all Russian versions of the game.\nRewrote the audio engine to match the original. Compressed files are still supported.\nTweaked the subtitles routine for the PSX version to match the original.\nRestored George's idle animation.\nRestored pause functionality: press \"P\"!\nRestored debug commands: CTRL-G for toggling on-screen walkable grids, CTRL-T for displaying debug information, SHIFT-M for displaying crosshairs for the mouse cursor and George's position, and keys 1 and 4 to toggle respectively slow and fast frame pacing mode.\nRestored the correct font for the game over screen.\nFixed other various small inaccuracies.\nOverall the PC version of the game on ScummVM shouldn't differ from the original executable anymore.\nImplemented credits for the PSX version.\nSword2:\n \nAdded support for Chinese translation.\nTinsel:\n \nFix running out of soundreels error.\nTwinE:\n \nAdded support for Japanese translation.\nUltima:\n \nImprove Ultima VI responsiveness.\nFix crash loading Ultima VI savegames when dialogs are open.\nFix ordering of generated items in Ultima VI.\nFix auto-readying throwing weapons in Ultima VI.\nFix Ultima VI crash opening new-style spellbook gump.\nFix Ultima VI actor doll and gump colors.\nFix Ultima VI crash using look action on walls.\nFix several other miscellaneous crashes.\nFix spawners and projectiles to more closely match the original.\nImproved Ultima VI AdLib support and added Roland MT-32 support.\nFix multiple Ultima VIII render order issues.\nAdd support for Ultima VIII Spanish fan translation.\nSupport Pentagram save game files.\nAdded configurable double-click time for Ultima VIII.\nVoyeur:\n \nAdded support for German fan translation.\nXeen:\n \nRenamed 'xeen' engine to 'mm' for Might & Magic.\nAdded custom engine option to replace the health gems with HP/SP bars.\nRISC OS port:\n \nDouble buffering is now used in full screen mode when V-sync is enabled.\nAdded support for hardware palettes.\n \n\n \n\n \nTéléchargement : ScummVM v2.8.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184400/in-multi-scummvm-v280-disponible-1.jpg"
        }
    },
    "news_6": {
        "title": "[PS5] Le portage de l'exploit sur le firmware 3.xx est en cours",
        "content": "Selon le développeur Echo Strech il ne manquerait que seulement 8 offsets pour terminer le portage de l'exploit de la PS5 vers le firmware 3.xx. \n \nPour parler simplement, les utilisateurs qui n'ont pas mis à jour leur console PS5 et qui sont donc restés sur un firmware compris entre le 3.00 et le 3.21 pourront prochainement lancer l'exploit et faire tout ce qu'il est possible de faire entre le firmware 4.03 et 4.51.\n \n \n\n \n \n\n \n \nAinsi il sera donc bientôt possible de lancer des sauvegardes sur ces firmwares, l'intérêt de rester sur un firmware inférieur est de pouvoir profiter de failles différentes, de sécurité moins avancées, ou permettre d'exécuter certains privilèges. \n \n \nTout est là : twitter.com/StretchEcho/\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184377/in-ps5-le-portage-de-lexploit-sur-le-firmware-3xx-est-en-cours-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184377/in-ps5-le-portage-de-lexploit-sur-le-firmware-3xx-est-en-cours-2.png"
        }
    },
    "news_7": {
        "title": "[Vita] SKGleba rend public son projet Bert",
        "content": "Le développeur SKGleba (Sebastian Kubala) qui s'est longtemps spécialisé sur la PlayStation Vita, dévoile un projet sur lequel il travaille depuis des mois. Il s'est appuyé sur d'autres développeurs comme ProximaV ou encore Mathieu HERVAIS (Mathieulh).\n \nLe projet \"bert\" est maintenant public, il s'agit d'un client pour l'interface UART RPC du contrôleur système de Playstation Vita qui expose environ 100 commandes allant de la simple vérification de l'état des périphériques à des commandes plus complexes comme la programmation flash ou des bootmodes alternatifs du SoC.\n \n \n\n \n \n\"Bert\" est un surnom donné à un client de l'interface UART RPC du contrôleur système de la PSP2.\n \nLe contrôleur système de la PlayStation Vita/TV - nom de code \"Ernie\" - est un MCU basse consommation qui gère les périphériques tels que le PMIC, le contrôleur USB, les boutons physiques, les panneaux tactiles, etc. Il héberge un serveur RPC accessible à partir de plusieurs interfaces, chacune ayant son propre ensemble de commandes disponibles.\n \nL'une des interfaces est UART, activée par un circuit spécial \"jig\" qui définit des niveaux de tension spécifiques sur les broches/sondes de détection de tension de syscon. \n \n \n\n \n\n \n \nAvec le projet Bert, vous trouverez de la documentation, des schémas, des diagrammes et des scripts pour interagir avec Syscon via l'interface UART.\n \nAvec l'injection de défauts de bert et de tension, vous pouvez réaliser l'exécution de code BootROM à partir d'une carte SD sur la PlayStation Vita/TV.\n \nIl peut être utilisé à la fois pour la recherche et pour « débloquer » des consoles brickées.\n \nLe processus est maintenant entièrement documenté sur : psp2sdboot\n \n \nLe projet est là : Bert pour PS Vita \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184343/in-vita-skgleba-rend-public-son-projet-bert-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1184343/in-vita-skgleba-rend-public-son-projet-bert-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1184343/in-vita-skgleba-rend-public-son-projet-bert-3.jpg"
        }
    },
    "news_8": {
        "title": "[Multi] La version EOL (end of life) de DS4Windows est là",
        "content": "Voilà le chant du signe pour DS4Windows, longtemps annoncé, mais ça y est c'est une réalité, le développement de ce superbe utilitaire prend fin avec la fin de l'année 2023, pour \"fêter\" cela son développeur, Ryochan7, propose une version 3.3.3 symbolique qu'il a nommé EOL release (entendez End of Life), d'ailleurs le Github a bien été archivé, preuve qu'il n'y aura plus de nouvelle version. \n \nUne page se tourne donc avec DS4Windows qui va probablement disparaitre si personne ne prend le relai de son développement et c'est bien dommage. Comme vous le savez probablement DS4Windows est une interface efficace pour paramétrer une manette sur PC, il est basé sur un fork de Jays2Kings. Pour en profiter cela passe par un câble micro-USB, mais il est aussi possible de s'en servir sans fils avec quelques adaptateurs Bluetooth 2.1 (ou supérieur). \n \n \n\n \n \nChangelog : \n \n- Correction de la routine de profil automatique lorsqu'un périphérique n'existe pas pour un emplacement d'entrée\n- Mise à jour de la traduction en portugais. Contribution de Denellyne\n- Fermer les instances de ProfileMigration dans les tests unitaires lorsqu'elles sont terminées\n- Suppression de la classe Net8NoticeWindow inutilisée\n- Correction de la vérification de la migration de la zone morte du bâton Jays2Kings. Report du choix de zone morte non nulle\n \nLe développeur a rajouté un petit texte dans le changelog : EOL Release, Oh, je suis mort. Merci pour toujours. Bref, 2023 aura emporté DS4Windows a tout jamais, c'est bien dommage. Un grand merci Ryochan7 pour nous avoir proposé des évolutions énormes sur cet utilitaire qui a n'en pas douté aura marqué l'histoire de l'émulation console, et facilité l'utilisation de nombreuses manettes sur PC. \n \n \nTéléchargement : DS4Windows 3.3.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184341/in-multi-la-version-eol-end-of-life-de-ds4windows-est-la-1.png"
        }
    },
    "news_9": {
        "title": "Bonne année 2024 !",
        "content": "Encore une année qui s'achève, et nous pouvons déjà faire le même constant qu'en 2022, l'année n'aura tout de même pas été trés facile, que cela soit à tout niveau, mais ce qui nous intéresse c'est le domaine du jeu vidéo et du hack. Pas facile déjà pour Microsoft avec sa Xbox qui a baissé les armes face aux ventes de PS4. 2023 aura été l'année où les ventes de PS5 ont explosées du fait de la disponibilité de la console, plus de 50 millions d'unités (au 09 décembre 2023) contre 25 millions d'unités pour la Xbox Series. Les ventes sont pour Microsoft inférieures de 52% sur 2023 par rapport à 2022, signe que la guerre est pliée encore une fois sur cette génération. \n \nCôté Nintendo tout va bien, la Switch continue elle de se vendre comme des petits pains, 133 millions au 30.09.23, ce chiffre a du dépasser les 145 millions sur 2023.\n \n \n \n\n \n \n \nRétro 2023, les plus gros événements et actualités de l'année qui vient de s'écouler :\n \nDécembre 2023 : \n \n[DSi] L'exploit et le dump du bootrom DSi de PoroCYon dévoilés à la 37C3\n[Switch] Le linker se nomme Mig Switch et son annonce officielle est là\n[PS5] Itemzflow disponible en v1.0.3 avec support des backups PS5\n[PS5] Un premier eboot.bin d'un jeu PS5 patché\n \nNovembre 2023 : \n \n[PSP] L'unbrick d'une PSP-1000 avec un RP2040\n[PS4] L'émulateur fpPS4 a fait d'énormes progrès\n[PS5] Les premiers backups PS5 qui se lancent sur PS5 sont des démos\n[PS5] Sistr0 travaille sur un GoldHen PS5\n[PS5] PS5 Homebrew Store de LightningMods\n \nOctobre 2023 : \n \n[PS5] etaHEN v1.1b Bêta disponible (maj)\n[PS5] Qui est le développeur qui a trouvé les offsets du firmware 4.50 de la PS5\n[PS5] LightningMods montre encore ses progès sur ItemzFlow sur PS5\n[PS5] Les développeurs Sleirsgoevy et Specter multiplient les efforts sur PS5\n[PS5] La PS5 Slim annoncée officiellement par Sony\n[PS5] Vers un chargement de fPKG sans hyperviseur sur la PS5\n \nSeptembre 2023 : \n \n[PS4] GameBato la solution Game Store pour firmware < 9.00\n[PS4/PS5] mast1c0re supporte le firmware 11.00 (PS4) et 3.00 & 4.51 (PS5)\n[PS5] TheFlow confirme que son exploit Bluray fonctionne sur le firmware 7.61\n[PS5] Specter dévoile un payload pour décrypter les fichiers PS5\n \nAout 2023 : \n \n[PS5] L'implémentation de l'exploit PS5 mise à jour\n[Switch/3DS/WiiU] Nintendo aura mis 5 mois pour trouver la solution à ENLBufferPwn\n \nJuillet 2023 : \n \n[Vita] Le bootrom de la PlayStation Vita a été dumpé\n[XB] Microsoft bannit désormais les consoles retail exécutant des émulateurs\n[PS2] La toute première version d'Apollo Save Tool pour la PS2 disponible\n[PS5] Interview de Flat_z suite au dump du PS5 bootrom PSP (Platform Security Processor)\n[3DS] Luma3DS v13.0.1 disponible\n[PS4/PS5] 24 bugs reportés et corrigés par Sony via HackerOne PlayStation\n[Multi] GaryOPA organise une cagnotte pour redémarrer sa vie\n \nJuin 2023 : \n \n[PS4] Abkarino est de retour sur PS4 avec PS4 Syscon Tool\n[PS5] SiSTR0 travaille sur libhijacker\n \nMai 2023 : \n \n[PS5] Une présentation de Specter dans quelques jours sur la PS5\n[Switch] Nintendo engage des demandes de retraits de projets à Github, notamment pour l'outil Lockpick\n[Switch] Les vendeurs chinois vendent des HWfly équipées de RP2040\n \nAvril 2023 : \n \n[PS4] L'émulation Saturn en natif sur PS4\n[Multi] Gary Bowser va être libéré de prison\n[Switch] Nintendo va réparer gratuitement les Joy-Con même sans garantie\n \nMars 2023 : \n \n[Switch] PicoFly la puce à 3 euros qui va révolutionner le monde de la Switch ?\n[PS5] PS5VersionMast1c0re 1.0 disponible\n \nFévrier 2023 : \n \n[PS5] Une pluie d'émulateurs pour PS5\n[DSi] 15 ans après sa sortie la DSi reçoit un exploit webkit\n \nJanvier 2023 : \n \n[PS5] Une méthode pour activer de façon permanente le navigateur sur PS5\n \n \n \n \nQue peut-on se souhaiter pour 2024 ?\n \nComme l'année dernière, on aimerait de nouveaux hardwares, une nouvelle Switch (décidément), mais quoi attendre des autres constructeurs, pas grand chose, Sony a lancé son modèle slim de PS5 (peut être y aura-t-il une superslim dans 2 ans), Microsoft va lancer ses refresh en Novembre 2024 (nom de code Brooklin), pas de quoi relancer les ventes, niveau hardware 2024 sera assez calme, espérons que niveau hack on aura de quoi se mettre sous la dent. \n \nOn peut se souhaiter l'arrivée du linker Switch, et peut être des clones vont suivre, ce qui éviterait à certains de devoir bidouiller leur hardware, on peut se souhaiter un véritable hack universel et élargi, avec des homebrews avec un exploit kernel sur PS5, la Xbox étant sur ce point trop abandonné par les développeurs, il y peu de chance malheureusement que quelque chose arrive de son côté. \n \nSi vous voyez d'autres cadeaux que vous souhaiteriez pour 2024, n'hésitez pas de le mettre en commentaire. \n \n \n \nPassez toutes et tous une excellente année 2024, toute l'équipe de Logic-Sunrise.com vous souhaite : Bonne Année 2024 !\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184339/in-bonne-annee-2024-1.png"
        }
    },
    "news_10": {
        "title": "[PS3] Le lecteur Movian devenu M7 a été mis à jour par Deank",
        "content": "Un autre développeur historique de la PlayStation 3 qui continue de travailler sur la console comme nous en informe PSX-Place.com, Deank, vient de mettre en ligne une nouvelle version de son lecteur multimédia Movian renommé M7.\n \nSi vous vous souvenez bien Movian est une version modifiée du media center original qui avait été lancé sur la PS3, et qui fonctionne maintenant sur Android, Amazon Fire Stick, MacOS, Windows, Linux et Raspberry pi. Le media center s'appelait à l'origine \"Showtime\" sur la PS3 mais a été renommé \"Movian\" par le développeur original Andreas Oman.\n \nDeank a continué à supporter le logiciel, et il a même fait évoluer le fonds puisqu'avec cette nouvelle version il a supprimé l'ancien décodeur/parseur vidéo \"libav\" à l'actuel \"ffmpeg\".\n \n \n\n \n \n \nL'objectif de cette évolution est d'une part passer sur une version supporté car libav a été abandonné, cela devrait aussi permettre d'améliorer la compatibilité et de disposer d'un lecteur multimédia plus actuel et plus polyvalent pour toutes les plateformes supportées, y compris la PS3.\n \nChangelog 7.0.1/7.0.2\nNouveau : Option de transcodage Dolby Digital+ (DD+/EAC3) pour 1536 kbps. Améliore la qualité de l'audio multicanal AAC, OPUS et DTS.\nModifié : Options Dolby Vision : [Auto] [DV&HDR10+] [DV] [HDR10+] [HDR10/HDR]\nMis à jour : Duktape vers 1.8.0 (important)\nCorrigé : AV Sync pendant la sous-exécution\nCorrigé : Les vignettes vidéo sont correctement créées, stockées et chargées depuis le cache (important)\n \nChangelog 7.0.0 Movian MOD 5.0.x est maintenant M7\nNouveau : M7 (Movian 7) remplace Movian 5.0.x MOD\nNouveau : M7 avec un nouvel app-id Android s'installera comme une application séparée\nNouveau : Suppression de l'obsolète \"libav\" de 2015 et remplacement par la dernière version de ffmpeg (4.4.4 2023-12-23)\nNouveau : 7 ans de mises à jour de ffmpeg pour les décodeurs/parseurs audio et vidéo\nlibav : Merci ! ( https://en.wikipedia.org/wiki/Libav ) \nVersion initiale de M7 : 7.0.0\n \n \n \nTéléchargement : Movian M7 v7.0.2 / Les anciennes versions basées sur la 5.0 sont aussi proposées ici.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184303/in-ps3-le-lecteur-movian-devenu-m7-a-ete-mis-a-jour-par-deank-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] Un nouveau projet PS5 PI Server pour Raspberry PI de Stooged",
        "content": "Le développeur Stooged vient de mettre à jour son script PS5 PI Server pour Raspberry PI. Il s'agit d'un nouveau script d'installation qui vous permet de configurer un serveur DNS afin de bloquer les mises à jours, un serveur web, et un hôte d'exploit le tout sur Raspberry PI.\n \nPour y parvenir le script se base sur PS5-Exploit-Host d'Idlesauce, un exploit compatible jusqu'au firmware 4.51.\n \n \n \n\n \n \n \nLes instructions d'installation sont présentes dans le github ci-dessous. \n \nTéléchargement : PS5-PI-Server\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184295/in-ps5-un-nouveau-projet-ps5-pi-server-pour-raspberry-pi-de-stooged-1.jpg"
        }
    },
    "news_12": {
        "title": "[PS5] SelUtil-Patched compatible avec les fichiers PS5 fselfs",
        "content": "Le développeur CyB1K vient de mettre à jour l'utilitaire SelUtil-Patched, le programme permet désormais de créer des fichiers ELF compatible avec la PlayStation 5. \n \nPour la petite histoire, c'est pour patcher l'eboot de la démo de Wolverine que le développeur a du faire évoluer SelUtil-Patched.\n \nVous pouvez simplement glisser et déposer un eboot/prx dans l'exe pour en profiter. \n \n \n\n \n \nPour parler clair, la mise à jour vise à éliminer les informations en double avant le premier segment, et il a ajouté le segment des versions ainsi que de nouvelles options. \n \nChangelog : \n \nhttps://github.com/CyB1K/SelfUtil-Patched/blob/main/README.md\n \nLogiciel SelUtil-Patched :\n \nhttps://github.com/CyB1K/SelfUtil-Patched/blob/main/Debug/selfutil_PS5.exe\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184293/in-ps5-selutil-patched-compatible-avec-les-fichiers-ps5-fselfs-1.png"
        }
    },
    "news_13": {
        "title": "[PS4/PS5] Un nouveau kernel exploit sur PS4 ou PS5 pourrait arriver",
        "content": "Il semblerait qu'un nouvel exploit kernel soit dans les starting-blocks. C'est du moins ce que semble nous dire le développeur Jose Coixao, aussi connu sous le nom de Zecoxao.\n \nIl dévoile en effet que Theflow disposerait de ce nouvel exploit, et qu'il est en train de vérifier s'il est patché sur 11.02/8.40 ou sur 11.50/9.00.\n \n \n\n \n \nPour l'heure rien n'est divulgué, des tests sont en cours et il y a fort à parier que rien ne sorte avant un bon moment. \n \nCependant d'autres travaillent comme sleirsgoevy qui dévoile depuis quelques minutes une évolution de son implémentation.\n \nIl faut voir ces propositions à deux niveaux, cela permettrait de débloquer la PS4 sur 11.02 ou 11.50, et la PS5 sur 8.40 voir 9.00.\n \n \nEvolution sleirsgoevy : ps4jb-payloads\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184291/in-ps4ps5-un-nouveau-kernel-exploit-sur-ps4-ou-ps5-pourrait-arriver-1.png"
        }
    },
    "news_14": {
        "title": "[PS3] La génération PS3 sera toujours là en 2024",
        "content": "A quelques heures de la fin de l'année 2023, quoi dire au sujet de ceux qui pour parti ont marqué l'histoire de la PS3, cette console mal aimée à son lancement car trop chère était complexe à comprendre pour les développeurs car son architecture interne était trop évoluée pour l'époque, du moins trop avancée diront certains. \n \nFin Février 2023, Sony surprenait encore son monde en dévoilant la mise à jour du firmware 4.90, qui avait pour objectif de fournir les dernières clés blu-ray, soit, mais mise à jour quand même. \n \nEt bien sachez qu'en 2024, la PS3 va continuer à vivre au travers des traits de certains développeurs comme Aldo Vargas (aussi connu sous le nom d'Aldostools), ou encore Nathan Martin (alias Evilnat).\n \n \n \n\n \n \n \n \nNous ne citons pas ces développeurs par hasard, c'est surtout qu'ils travaillent activement à la scène PS3, ainsi Aldo Vargas vient de mettre à jour prepISO en version 1.31 afin qu'il permette la copie désormais la clé de chiffrement dans /dev_hdd0/tmp/wmtmp.\n \nCette option n'arrive pas seule puisqu'il propose une nouvelle version de webMAN MOD 1.47.45, avec des corrections d'un problème avec les mots de passe FTP de 20 caractères ou encore l'ajout d'une option pour sélectionner le fichier externe ps1_bios.bin (PSXONPSP660.BIN) dans /setup.ps3.\n \nCes avancées sont aussi effectué pour le prochain CFW qui sera proposé par Nathan Martin, qui vient d'envoyer la 23 ème version Bêta Test de son CFW Evilnat 4.90.2 qui apportera aussi des options nouvelles notamment sur la gestion des ISO 3k3y/Redump, cette gestion dans Cobra qui prend en charge les ISO cryptés sur les disques durs externes à système de fichiers NTFS/exFAT, sans compter les évolutions apportées à xai_plugin. \n \nComme on le voit la PS3 a encore de beaux restes en 2024, on estime qu'environ un peu moins de 3 millions de PS3 sont encore actives dans le monde malgré la fermeture chaotique successive des serveurs PS Store et des studios de développement limitant le jeu en ligne. \n \n \nSource : \n \nhttps://github.com/aldostools/webMAN-MOD/releases\n \nhttps://twitter.com/xXEvilnatXx\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184190/in-ps3-la-generation-ps3-sera-toujours-la-en-2024-1.png"
        }
    },
    "news_15": {
        "title": "[DSi] L'exploit et le dump du bootrom DSi de PoroCYon dévoilés à la 37C3",
        "content": "Nous vous en avions parlé le jour de Noël, ayant découvert la programmation de cette présentation un peu par hasard, mais voilà c'est fait, le développeur PoroCYon a dévoilé lors d'une conférence à la 37 ème édition de la CCC (Chaos Communication Congress), comment il a réussi à dumper le bootrom DSi et trouvé un nouvel exploit. \n \n \n\n \n \nD'une pierre deux coups, il dévoile le dump du bootrom mais aussi un nouvel exploit homebrew basé sur un exploit ARM9. \n \n \n\n \n\n \n \n\n \n\n \n \nLa vidéo complète de présentation se trouve ci-dessous ! \n \n \n\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184189/in-dsi-lexploit-et-le-dump-du-bootrom-dsi-de-porocyon-devoiles-a-la-37c3-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184189/in-dsi-lexploit-et-le-dump-du-bootrom-dsi-de-porocyon-devoiles-a-la-37c3-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1184189/in-dsi-lexploit-et-le-dump-du-bootrom-dsi-de-porocyon-devoiles-a-la-37c3-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1184189/in-dsi-lexploit-et-le-dump-du-bootrom-dsi-de-porocyon-devoiles-a-la-37c3-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1184189/in-dsi-lexploit-et-le-dump-du-bootrom-dsi-de-porocyon-devoiles-a-la-37c3-5.png"
        }
    },
    "news_16": {
        "title": "[Switch] Le linker se nomme Mig Switch et son annonce officielle est là",
        "content": "Nous n'en attendions pas grand chose, mais au final voilà donc l'annonce officielle de ce nouveau linker qui devrait être lancé en Janvier 2024. \n \nAprès la vidéo de démonstration voilà donc que des informations complémentaires fleurissent toujours sur le compte Twitter/X d'After Time X.\n \nLe premier linker de la Switch se nommerait donc Mig Switch, et la communication autour de ce linker est donc désormais officielle et se fait via un site internet : https://migswitch.com/#/ \n \n \n\n \n \n \nIl y aura quelques spécificités à ce linker, à commencer par la manière dont il faudra lancer les jeux, et surtout les dumps devront être fait avec NXDumpTools Rewrite, et il faudrait intégrer le certificat (ce qui n'est que rarement le cas dans les dumps pour éviter les risques de ban). \n \n \n \n\n \n \nConcernant le fait d'enlever et remettre le linker pour changer de jeu, il s'agissait d'un prototype, la version finale ne fonctionne pas comme cela, et qu'ils réfléchissent déjà à une V2 disposant d'un interrupteur. Sur ce dernier point il y a une forme de réticence du fait de la fragilité à long terme sur ce genre de composant. Une solution software serait préférable avec un menu mais peut être que cela n'est techniquement pas réalisable. \n \nBien entendu ce linker serait évolutif, flashable, et indétectable, bon cela reste à voir. La Team accepte dès maintenant les précommandes, et les livraisons commenceront en Janvier 2024. Le gros volume est attendu pour Mars 2024, la Team précise qu'elle ne vend pas au détail, et pas aux utilisateurs finaux. Dernière chose, tout ceci semble russe, encore quelques semaines à attendre et nous serons définitivement fixés. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184126/in-switch-le-linker-se-nomme-migswitch-et-son-annonce-officielle-est-la-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184126/in-switch-le-linker-se-nomme-migswitch-et-son-annonce-officielle-est-la-2.png"
        }
    },
    "news_17": {
        "title": "[Wii/NC] Swiss v0.6 r1562 disponible",
        "content": "Le développeur Extrems propose une mise à jour de son outil Swiss afin d'apporter des corrections indispensables. \n \nComme vous le savez probablement Swiss est le digne successeur de SD-boot, il permet de lancer les homebrews GameCube mais aussi les backups stockés sur carte SD ou un disque dur, SDGecko, WODE, Wiikey Fusion et bien d'autres solutions. \n \nCette nouvelle version v0.6 r1562 apporte pas mal de nouveautés ! \n \n \n\n \n \nChangements apportés par emukidid :\n \n- Correction de la navigation vers le haut d'un répertoire avec X sur les disques ISO9660\n \nChangements apportés par Extrems :\n \n- Optimisation supplémentaire de l'écriture à travers le cache FAT.\n- Invalider la page de cache en cas d'erreur de lecture.\n- Mise à jour de la base de données Redump.\n- Correction d'un bug IDCT dans la première bibliothèque THP.\n- Rendre GC Loader HW2 1.0.0 inéligible en tant que dispositif de correction.\n- Signaler CUBEODE comme \"compatible avec GC Loader\".\n- Utiliser les commandes de lecture de disque après l'installation du fragment pour tester les eaux.\n- Mieux initialiser les structures de gestion des périphériques.\n- Garder une trace de certaines bizarreries de GC Loader.\n- Ajustement pour les changements de libogc2.\n- Corriger le problème pour de vrai, en quelque sorte.\n- N'afficher l'entrée du jeu DVD que dans le répertoire racine.\n- Améliorer quelque peu la détection de la Wii.\n- Mise à jour de la base de données No-Intro.\n \nTéléchargement : Swiss v0.6 r1562\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184077/in-wiinc-swiss-v06-r1562-disponible-1.jpg"
        }
    },
    "news_18": {
        "title": "[Switch] NS-USBloader v7.1 disponible",
        "content": "Le développeur developersu propose la version 7.1 de NS-USBloader, pour rappel NS-USBloader se charge de se substituer au script de python de Tinfoil, et qui est proposé en java pour être lancé sous Windows, Linux et MacOS.\n \nUn programme qui continue de convaincre, malgré que quelques alternatives existent comme DBI, NS-Usbloader reste un programme d'installation NSP Adubbz / TinFoil et GoldLeaf (USB) du côté du PC, avec une interface graphique et les cookies.\n \n \n\n \n \nChangelog : \n \n- Pilotes ajoutés au programme d'installation de Windows. L'application vérifie s'il y a des pilotes dans le dossier de l'application et essaie de les télécharger uniquement s'ils sont absents. Important pour certaines personnes. #156\n- Prise en charge HiDPI ! Eh bien, en quelque sorte vous pouvez modifier la police et la taille de l'application dans les paramètres. Cela a du sens pour les utilisateurs de Rectify11. #153\n- Correction du traitement des paramètres régionaux. Important pour certains utilisateurs Linux. #139\n- Traduction chinoise simplifiée mise à jour par @exiori. Merci!\n- Traduction française mise à jour par @requinDr. Merci!\n- Traduction coréenne mise à jour par @DDinghoya. Merci!\n- justindhillon a corrigé les liens brisés dans 'readme' et 'pom'. Merci!\n \n \n \nTéléchargement : ns-usbloader 7.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184076/in-switch-ns-usbloader-v71-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[Multi] Le code source de GTA V leakée mais pas que...",
        "content": "Rockstar a une nouvelle fois été la cible d'un vol de données, décidemment le studio n'est pas épargné, après le hack qui a permis de dévoiler environ une centaine de vidéos de GTA VI, la bande annonce dévoilée plus tôt, voilà que c'est le code source de GTA V qui a été rendu public contre 2000 $. \n \n \n\n \n \nLe code source a été fourni par un groupe de personnes dans un contexte privé puis le code a été vendu pour une bouchée de pain, avec des modèles et des ressources internes de Rockstar. \n \n\n \n\n \n \nCe serait environ 200 Go de données qui ont été divulguées, en plus du code source il y aurait même quelques allusions à Bully 2, Midnight Club 5 ou encore GTA VI avec des listes de diffusions, des noms complets de 1158 employés de Rockstar Games ou encore certains fichiers sensibles des prochains jeux. \n \n \n\n \nBien entendu Rockstar a supprimé depuis les liens et l'accès aux fichiers mais c'est déjà trop tard, environ 117 nouveaux éléments ont été divulgués lors de la fuite du code source de GTA 5, notamment des vidéos de développement, des captures d'écran et des documents.\n \n \n\n \n \n \nLa source ici : twitter.com/GTAFocal/\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-607508196.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1753973593.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1711829397.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-1439781616.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-483826025.png"
        }
    },
    "news_20": {
        "title": "[NDS/2DS/3DS] TWiLight Menu++ v26.4.0 et Bootstrap v1.1.0 disponibles",
        "content": "Le développeur RocketRobz propose les versions Christmas de TWiLight Menu++ et Bootstrap, l'occasion de mettre à jour ses logiciels. \n \n \n\n \n \nQuoi de neuf dans TWiLight Menu++ :\n \n- DeadSkullzJr : Mise à jour du correctif AP pour Pokémon : Refined Gold Overhaul (v3.1).\n- Ajout d'un message de limitation de RAM (pas de musique) pour Glory Days : Tactical Defense sur DS.\n- DieGo367 : Thèmes basés sur la DSi : Ajustement des conditions du jingle / de la musique de démarrage (#2336).\n- Divers : Mise à jour des traductions.\n \nCorrections de bugs :\n- Correction du fait que le son DSi ne soit pas automatiquement défini comme ROM donneuse afin que les jeux DSi-Enhanced fonctionnent en mode DSi dans les exploits DSiWare (tels que Memory Pit, Flipnote Lenny, stylehax, etc.).\nO- btenir la région SysNAND et les paramètres de l'application launcher fonctionne à nouveau.\n- DieGo367 : Correction du Slot-1 qui ne se chargeait pas dans le menu DS Classic (#2335).\n- DieGo367 : Thèmes basés sur la DSi : Correction de l'effacement de la boîte et des boîtes manquantes (#2338).\n- NightScript370 : Le thème est maintenant l'option musicale par défaut.\n- Correction du jingle de démarrage ne jouant pas dans le thème 3DS avec la musique du menu 3DS réglée.\n \n \nNouveautés de Bootstrap :\n \n- Mode B4DS : La musique est désormais jouée dans Pop Island : Paperfield & Glory Days : Tactical Defense lorsqu'ils sont joués sur des consoles DS debug/dev.\n \nCorrections de bugs :\n- Correction du dysfonctionnement du cloneboot dans certains titres DSiWare.\n- Correction de la lecture du drapeau cloneboot à une adresse de fin de ROM invalide, ce qui empêchait certains ROM hacks de démarrer.\n- Une partie de la RAM utilisée pour les captures d'écran est désormais sauvegardée avant de prendre une capture d'écran. Ceci corrige le cas où un jeu se plantait après avoir pris une capture d'écran.\n- L'accès au Slot-1 est désormais activé pour le DS Download Play.\n \n \nTéléchargement : \n \n \nhttps://github.com/DS-Homebrew/TWiLightMenu/releases\n \n \nhttps://github.com/DS-Homebrew/nds-bootstrap/releases\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184014/in-nds2ds3ds-twilight-menu-v2640-et-bootstrap-v110-disponibles-1.png"
        }
    }
}