{
    "news_1": {
        "title": "[PS4] L'émulateur psOff se met à jour",
        "content": "Le développeur SysRay propose une mise à jour de psOff, l'émulateur PS4, psOff est un émulateur PlayStation 4 à code source fermé (couche de compatibilité), écrit en C++20. Ce projet en est encore à ses débuts et de nombreux jeux ne fonctionneront pas correctement avant un certain temps, mais il améliore régulièrement la compatibilité et les performances.\n \n \n\n \n \n \nChangelog :\n \n- Interface utilisateur : Sélection du GPU\n \n- shader correction de la sortie des couleurs\n \n- correction de la sélection du tampon de profondeur\n \n- shader : correction de la négation de l'opcode\n \n- SaveDataDialog : Ajout de divers types de dialogue (LISTE et ASSISTANT toujours manquants)\n \n \nTéléchargement : psOff\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203916/in-ps4-lemulateur-psoff-se-met-a-jour-1.png"
        }
    },
    "news_2": {
        "title": "[PS5] LightningMods personnalise etaHEN 2.0b pour le kstuff 5.10",
        "content": "Il semblerait que les offsets du firmwares 5.10 nécessitent quelques adaptations, il faut dire que de firmware en firmware Sony a appris de ces erreurs bien qu'on puisse s'étonner que la firme japonaise en fasse encore malgré toutes les générations de consoles. \n \nQuoiqu'il en soit, le développeur LightningMods vient de proposer une version personnalisée d'etaHEN 2.0B pour le kstuff du firmware 5.10. \n \n \n \n\n \n \n \nCe nouveau etaHEN 2.0b (de test) est proposé sur le discord, mais la plupart des développeurs qui proposent des alternatives ont donc mis à jour etaHEN 2.0B dans leur solution. \n \nC'est le cas par exemple d'Aldostools qui s'est empressé de l'intégré dans PS5 Payloads 1.8a Mod, ou encore Master-9 dans son host, ou bien même dans PS5 Homebrew v1.6.\n \n \n \n \n",
        "images": {}
    },
    "news_3": {
        "title": "[PS4] FPKGi v0.87 Nightly disponible",
        "content": " \nLe développeur ItsJokerZz propose deux version successives de FPKGi, et les évolutions sont nombreuses ! Ce projet open-source permet de télécharger et d'installer des fichiers .pkg modifiés, notamment pour les jeux backportés sur des firmwares plus anciens de la PS4. FPKGi est conçu pour être utilisé avec des serveurs personnalisés, permettant aux utilisateurs de peupler l'application avec leur propre contenu via des fichiers .json locaux ou en ligne. \n \nCette mise à jour se concentre sur l'amélioration de la stabilité, la correction des bugs et l'amélioration de l'expérience utilisateur, en particulier autour du téléchargement, de la sauvegarde des configurations et de la réactivité de l'interface. \n \n \n \n\n \n \n \nv0.87 [Nightly] Pré-release \n \nComment mettre à jour :\n \nMets à jour via le Homebrew Store ou ouvre simplement l'application pour voir la notification de mise à jour.\n \nCorrectifs :\n \nProblème #8 : Les configurations ne se sauvegardaient pas ou revenaient aux paramètres par défaut à la fermeture de l'application, sauf si le menu était activé.\n \nProblème #9 : Les utilisateurs ne pouvaient pas télécharger du contenu à cause de modifications récentes dans la gestion des pages.\n \n \nv0.86 [Nightly] Pré-release (Version précédente)\n \nCorrectifs :\n \nLes versions d'applications vides ou nulles s'affichent maintenant comme \"?.??\" au lieu d'une chaîne vide.\n \nCorrection des fonctionnalités de filtrage, tri et basculement ascendant ; le contenu s'affiche et se sauvegarde correctement.\n \nRésolution des problèmes de gel de l'interface et de fermeture de l'application, permettant des actions séquentielles plus fluides.\n \nLa musique de fond ne redémarre plus lors de l'activation du menu et se sauvegarde correctement.\n \nLe compteur de contenu se met à jour correctement après une mise à jour, même si l'application reste ouverte.\n \nCorrection du chargement des images de couverture ; l'image par défaut s'affiche maintenant correctement.\n \nLes configurations au chargement ne causent plus de problèmes, car les valeurs manquantes sont ajoutées aux paramètres par défaut.\n \nAméliorations :\n \nRésolution du Problème #4 : Télécharger l'application elle-même ne la fait plus planter ou se supprimer. À la place, elle ouvre/télécharge et lance LM's HB-Store pour les mises à jour si nécessaire.\n \nLes téléchargements incluent maintenant une limite de 20 Mo pour éviter les faux téléchargements et les problèmes associés.\n \nLes titres longs dans l'interface des détails défilent maintenant pour une visibilité complète au lieu d'être coupés.\n \nAjouts :\n \nAjout d'une vérification des mises à jour au lancement, qui installe et lance HB-Store si ce n'est pas déjà présent.\n \nLes valeurs se mettent à jour lors de la visualisation des détails de l'application sous les pages \"Homebrew\" ou \"TOUT\".\n \nIntroduction d'une nouvelle page par défaut pour afficher tout le contenu, définie pour les nouveaux utilisateurs au premier lancement.\n \nAjout de pages dédiées pour les thèmes, émulateurs, jeux PS1/PS2, jeux PSP et tout le contenu en un seul endroit.\n \nOptimisations et autres :\n \nCorrection des problèmes de chargement des images de fond et d'autres contenus avec des URL locales. Les utilisateurs doivent ajouter \"http(s)://\" pour que les connexions locales fonctionnent.\n \nRéduction des délais, gels et écrans noirs, notamment au premier lancement, améliorant la stabilité globale.\n \nAjustement des valeurs par défaut pour les JSON de contenu générés afin de mieux refléter les types de contenu.\n \n \n \nTéléchargement : FPKGi v0.87 Nightly\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203893/in-ps4-fpkgi-v087-nightly-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] PS5-Jar-Loader v4.1.0 disponible",
        "content": "Le développeur Hammer-83 dévoile une nouvelle version de PS5-Jar-Loader, il s'agit de la version v4.1.0 qui est proposée avec de nouvelles fonctions. \n \nComme vous le savez, l'utilisation de l'exploit BD-J permet d'accéder à des possibilités qui ne sont pas directement accessible à l'exploit webkit, du fait de sa sécurité accrue. \n \nAvec l'exploit bluray, il est possible d'en profiter jusqu'au firmware 7.61.\n \n \n\n \n \nNouvelles fonctionnalités notables :\n \n- Plusieurs améliorations du SDK.\n- Transferts DMA paginés implémentés.\n \nCorrections notables :\n \n- Jailbreak JAR fonctionne désormais avec Menu Loader et est inclus dans Full ISO.\n- Les répertoires auparavant inaccessibles peuvent désormais être lus (bug dans l'utilisation des E/S de fichiers natifs).\n \n \nTéléchargement : PS5-Jar-Loader v4.1.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203892/in-ps5-ps5-jar-loader-v410-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[XB360] Le piratage de l'hyperviseur de la Xbox 360 est possible",
        "content": "Le développeur Ryan M (se faisant appelé Grimdoomer sur X) vient de dévoiler un article très intéressant sur tout un tas de documents et de dossiers qu'il dispose sur le piratage de l'hyperviseur de la Xbox 360. \n \nIl ne s'agit que du premier article (la partie 1) de tout d'un tas de réflexion concernant la conception et le hack de l'hyperviseur et des fonctionnalités matérielles de sécurité de la Xbox 360. \n \nCe premier article sert d'introduction a ce que sera la seconde partie qui contiendra la façon dont casser l'hyperviseur et un PoC ou l'exploit lui même. \n \nAfin de rassurer tout le monde, Ryan M explique que cet exploit de l'hyperviseur fonctionne sur la dernière version du firmware Xbox 360 à savoir le 17559. \n \n \n \n\n \n \n \nL'exploit en lui même n'est pas persistant, à savoir qu'il ne s'agit pas d'un softmod, il faudra lancer l'exploit à chaque démarrage, et il dispose d'un taux de réussite très faible, de l'ordre de 30 %, il ne lancera que moins d'une fois sur 3, et son temps d'exécution peut aller jusqu'à 20 minutes. \n \n \n \n\n \nRyan M reste lucide, il ne pense pas que cet exploit pourra être utilisé de manière fiable et permanente, son intention est de montrer qu'il est possible de casser les sécurités de l'hyperviseur de la Xbox 360.\n \nLes fichiers qui seront publiés dans la seconde partie de l'article, dont la diffusion serait prévue pour la semaine prochaine, permettront de patcher l'hyperviseur, et donc d'exécuter du code non signé, à priori un seul exécutable, il n'y aura pas la suppression des contrôles de signatures, ou l'exécution de payloads de développement ou d'exécutables. \n \n \n \n\n \n \nL'hyperviseur de la Xbox 360 est un élément de code très sécurisé, renforcé par des fonctionnalités de sécurité matérielles, et dont l'objectif est unique : empêcher le piratage de la console. Cela présente les défis suivants pour les attaquants :\n \n- L'hyperviseur a très peu de surface d'attaque pour trouver des bugs.\n- La surface d'attaque disponible effectue une validation approfondie de toutes les données et paramètres fournis par le mode noyau.\n- Toutes les communications avec les autres périphériques de la carte mère sont effectuées par le noyau.\n- L'hyperviseur n'effectue aucune analyse des données provenant de ces périphériques (lecteur de DVD, disque dur, port réseau, USB, etc.).\n- La mémoire de l’hyperviseur est protégée par un cryptage et des contrôles d’intégrité.\n- Cela rend très difficile la réalisation d’attaques de corruption de mémoire.\n- L'hyperviseur n'accède presque jamais à la mémoire qui n'est pas protégée.\n \n \nLa première partie de l'article se trouve ici : icode4.coffee\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203875/in-xb360-le-piratage-de-lhyperviseur-de-la-xbox-360-est-possible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203875/in-xb360-le-piratage-de-lhyperviseur-de-la-xbox-360-est-possible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1203875/in-xb360-le-piratage-de-lhyperviseur-de-la-xbox-360-est-possible-3.png"
        }
    },
    "news_6": {
        "title": "[PS5] LightningMods a créé etaHEN-SDK sur les bases de PS5-payloads-dev SDK",
        "content": "Le développeur LightningMods a décidé de faire un fork de PS5-payloads-dev SDK en l'appelant etaHEN SDK, ce fork est basé sur la proposition de John Tornblom qui regroupe un ensemble SDK détaillé pour créer des payloads PS5 spécifiquement taillé pour etaHEN.\n \n \n\n \n \n \nChangelog : \n \n- Basé sur le SDK 0.21.1, dernière version connue pour fonctionner avec etaHEN\n- Offsets mis à jour pour les firmwares 1.xx - 7.61\n \n \n \nTéléchargement : etaHEN SDK Rev 1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203874/in-ps5-lightningmods-a-cree-etahen-sdk-sur-les-bases-de-ps5-payloads-dev-sdk-1.png"
        }
    },
    "news_7": {
        "title": "[PS5] PS5-Xplorer v1.04 pour la PS5 disponible",
        "content": "Le développeur Lapy propose aussi la mise à jour de PS5-Xplorer, la version PS5 de PS4-Xplorer, il confirme avoir apporté les mêmes correctifs que sur la version 2.04 de PS4-Xplorer. \n \n \n\n \n \nTéléchargement : PS5-Xplorer 1.04\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203867/in-ps5-ps5-xplorer-v104-pour-la-ps5-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[PS4] Avatar Changer pour PS4 de Lapy disponible",
        "content": "Le développeur Lapy propose un tout nouvel utilitaire à destination de la PS4, il s'agit d'Avatar Changer\n \n \n\n \n \nChangelog :\n \n- Changez votre photo de profil plus facilement que jamais \n- Vous pouvez également modifier le nom de votre profil pour les comptes activés\n- Remerciement à Anubis_Qz, Wr0zen, DouglasSampaioz et OrlandoLian.\n \n \nTéléchargement : Avatar Changer pour PS4\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203866/in-ps4-avatar-changer-pour-ps4-de-lapy-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[PS5] Une première version d'Itemzflow compatible avec kstuff 5.10",
        "content": "Le développeur LightningMods dévoile déjà une première version d'Itemzflow compatible avec le tout nouveau kstuff pour le firmware 5.10. \n \n \n\n \n \n \n \nIl a du adapter Itemzflow pour qu'il fonctionne, officiellement il ne s'agit que d'une version de test, la dernière version officielle proposée étant la v1.08. \n \n \nTéléchargement : Itemzflow compatible Kstuff 5.10 (version de test)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203826/in-ps5-une-premiere-version-ditemzflow-compatible-avec-kstuff-510-1.png"
        }
    },
    "news_10": {
        "title": "[PS5] Le Kstuff est désormais disponible sur le firmware 5.10 de la PS5",
        "content": "Grâce aux efforts communs de plusieurs développeurs dont LightningMods, EchoStretch, Zecoxao et d'autres personnes notamment pour les clés, le Kstuff pour le firmware 5.10 vient d'être rendu disponible. \n \nCela signifie que le fichier ELF permettant de lancer le kernel exploit sur le firmware 5.10 vient d'être rendu public. \n \nLe développeur LightningMods apporte tout de même quelques précisions, il a ajouté une clause de non-responsabilité au fichier readme du SDK des plugins d'etaHEN pour noter qu'avec kstuff, le chargement d'un plugin peut prendre jusqu'à une minute, c'est parce que kstuff ralentit beaucoup les choses, y compris le chargement des plugins, les plugins devraient se charger beaucoup plus rapidement au démarrage qu'après le chargement de kstuff.\n \n \n \n\n \n \n \nAutre chose, seul le firmware 5.10 est supporté, le firmware 5.50 n'est pas supporté, cela demande des offsets spécifiques, et il semblerait qu'il faille aussi modifier certains autres paramètres. \n \nLe kstuff pour le firmware 5.10 est désormais disponible un peu partout mais il est possible de le trouver ici par exemple.\n \n \n \n",
        "images": {}
    },
    "news_11": {
        "title": "[PS4] PS4-Xplorer 2.04 disponible",
        "content": "PS4-Xplorer est un outil populaire utilisé dans la communauté des consoles PlayStation 4 modifiées (jailbreak) pour gérer les fichiers système. Les mises à jour de ce type de logiciel sont généralement une bonne nouvelle, apportant quelques corrections. \n \nAttention, l'utilisation de tels outils peut entraîner des risques, comme le bannissement de PSN ou l'endommagement de votre console. Assurez-vous de bien comprendre les implications avant de procéder à toute modification.\n \n \n\n \n \nLapy vient de dévoiler la v2.04 qui vient corriger deux problèmes. \n \nChangelog PS4-Xplorer 2.04 :\n \n- Correction de l'option de suppression pour certains dossiers problématiques.\n- Réduction de la taille du PKG (à nouveau)\n \nMerci à Wr0zen pour le test bêta et à tous ceux qui ont signalé le bug, en particulier NanospeedGamer et Xalfie de Discord.\n \nAttention, pour ceux qui disposent d'une licence, il n'est pas nécessaire de désinstaller la version précédente, simplement d'installer la mise à jour par dessus. \n \n \n \nTéléchargement : PS4-Xplorer 2.04\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203812/in-ps4-ps4-xplorer-204-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[PS4] OpenOrbis PS4 Toolchain v0.5.3 disponible",
        "content": " \nBien qu'elle commence à prendre de l'âge, la scène PlayStation 4 est toujours très active, voilà qu'elle nous le prouve avec l'arrivée d'une nouvelle version de la Toolchain d'OpenOrbis qui passe en 0.5.3. \n \nPour ceux qui ne connaitraient pas l'OpenOrbis-PS4-Toolchain est un ensemble d'outils qui permet aux développeurs de construire des fichiers ELFs sans avoir à utiliser le SDK officiel de Sony, ainsi seuls des outils libres de droit sont nécessaires pour réaliser un homebrew. La façon de les lancer reste la même à savoir passer par l'exploit kernel.\n \n \n\n \n \n \nLes contributeurs ont été très nombreux à proposer des évolutions, de Bucanero, à Al-Azif, de Cpasjuste à Sleirsgoevy, d'illusion0001 à xXxTheDarkprogramerxXx, et encore de nombreux autres développeurs, ils sont venus apporter de nombreuses améliorations, corriger des bugs de compilation, ajouter de nouvelles définitions pour la gestion des trophées et des applications, améliorer la prise en charge des extensions de contrôleurs et des fonctions réseau. En outre, la gestion des fichiers ELF a été améliorée, et la compatiblité LLVM 14+ a été intégrée. \n \n \nLe changelog important se trouve ici : OpenOrbis-PS4-Toolchain\n \n\n \nWhat's Changed\n \n- Fix OrbisSaveDataParam definition by @bucanero in #174\n- Fix SaveData.h compiling error in #173\n- Update SystemService.h to include dependency by @Al-Azif in #175\n- Piglet sample: censor out sceKernelDlsym by @sleirsgoevy in #182\n- libkernel.h: add scePthreadSelf definition by @Cpasjuste in #184\n- Add RegMgr methods by @bucanero in #179\n- .NET Core 3.0 Runtime is required to run LibOrbisPkg by @illusion0001 in #176\n- Update libkernel.h by @Backporter in #186\n- Readd keyboard sample (fixed a typo) by @Klairm in #183\n- Remove specific versioning from Dockerfile by @Al-Azif in #194\n- Fix #178 by @Al-Azif in #193\n- Add Trophy Support and add a sample for the trophy system by @Backporter in #188\n- Add HTTP sample by @bucanero in #196\n- Add a MsgDialog sample by @bucanero in #197\n- Update Rtc.h by @Backporter in #202\n- Add sceNetResolver...() methods by @bucanero in #207\n- fix firmware structure, fix sceKernelFstat's args, sceRtcCurrentClockLocalTime's args, add error dialog - structures and function definitions, add Np defs. by @Backporter in #203\n- For convenience, add 2 XML tags to MyTemplate.vstemplate by @SummerFalls in #204\n- Update fliprate and Screenshot Overlay Stub by @illusion0001 in #212\n- CI: fix build by @illusion0001 in #217\n- Add user service methods by @bucanero in #215\n- Update bash script to exclude non make folders by @illusion0001 in #222\n- dialogs: use show_dialog for condition example by @illusion0001 in #221\n- Force sce sections to appear in the elf. by @nkrapivin in #211\n- Move fliprate to enum by @illusion0001 in #216\n- Update ScreenShot defs by @illusion0001 in #214\n- Add appinfo data type and functions. by @OSM-Made in #220\n- Defined some networking functions. by @OSM-Made in #219\n- Fix net http build by @illusion0001 in #224\n- Update readme badges by @illusion0001 in #225\n- CI: Download latest releases from URLs by @illusion0001 in #227\n- add definitions by @bucanero in #230\n- Fix C definitions by @bucanero in #231\n- Add sceUsbd definitions by @InvoxiPlayGames in #229\n- Update save_data.h by @illusion0001 in #234\n- Fix #endif order by @illusion0001 in #233\n- Add some definitions for GnmDriver and VideoOut by @pipehuffer in #235\n- Add extension controller support to Pad.h header. by @InvoxiPlayGames in #228\n- kernel: replace BSD types with stdint's in kevent's flags by @pipehuffer in #236\n- Update scePadReadExt+scePadReadStateExt by @illusion0001 in #246\n- Rename int to int32_t and unsigned int to uint32_t by @illusion0001 in #248\n- Update .gitignore by @illusion0001 in #244\n- Fix build for llvm 14+ by @illusion0001 in #242\n- Fix undefined symbols by @illusion0001 in #245\n- Change sys/time.h to time.h in save_data.h in #238\n- Added Save Data Missing Info by @xXxTheDarkprogramerxXx in #187\n- App launching definitions (from @LightningMods) by @illusion0001 in #232\n- Convert macro definitions into enums by @illusion0001 in #243\n- Fix map protection types by @illusion0001 in #247\n- Update libmonovm.h by @kiwidoggie in #251\n- GnmDriver: Add definitions for SetEmbeddedShader and DrawIndexAuto by @pipehuffer in #240\n- Update CommonDialog.h by @illusion0001 in #252\n- Update CRT version to 1.00 to allow building on older firmwares. by @kiwidoggie in #253\n- build library stub from separate file by @0xcaff in #258\n- Update action versions and rebuild every month by @illusion0001 in #263\n \n\n \n\n \nTéléchargement : OpenOrbis PS4 Toolchain v0.5.3\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203798/in-ps4-openorbis-ps4-toolchain-v053-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[WiiU] Minutes v1.2 disponible",
        "content": "Un peu plus de trois semaines après la v1.1, voilà que débarque la version 1.2 de Minutes, l'outil qui permet de remplacer le boot1 de la Nintendo Wii U, un peu comparable à BootMii. \n \nLe développement de Minute a été initié par dazjo, puis repris par StroopwafelCFW, est désormais entre les mains de Jan Hofmeier qui s'efforce de le soutenir pour corriger quelques bugs. \n \n \n\n \n \n \nChangelog v1.2 : \n \n- correction des incohérences sur l'écran lors du démarrage rapide\n- correcton du mode éco\n \nTéléchargement : Minutes v1.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203795/in-wiiu-minutes-v12-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[PS3] RPCN 1.4.2 disponible pour RPCS3",
        "content": "L'émulateur PSN portant le nom de RPCN évolue une nouvelle fois avec la version 1.4.2 qui comme vous le savez se destine à l'émulateur PS3 RPCS3. \n \nRPCN est un serveur personnalisé conçu pour émuler les services en ligne du PlayStation Network (PSN) sur la PS3. RPCN vise à recréer l'infrastructure multijoueur, permettant aux utilisateurs de jouer en ligne, d'accéder au matchmaking personnalisé et même d'héberger des communautés privées.\n \nDepuis quelques jours son développeur principal, RipleyTom, propose des évolutions intéressantes de RPCN qui est successivement passé de la version 1.4.0 à 1.4.2.\n \n \n\n \n \nChangelog 1.4.1 : \n- Utiliser la configuration originale pour hasher les nouveaux comptes\n \nChangelog 1.4.2 : \n- Correction Notification à la cible de RequestSignalingInfos envoyant des informations IP erronées\n- CookiePLMonster : Correction de l'ordre du tableau d'affichage pour Super Hang-On\n- Mise à jour des dépendances\n \nUne liste de compatibilité est accessible ici : wiki.rpcs3.net\n \n \nTéléchargement : RPCN 1.4.2\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203794/in-ps3-rpcn-142-disponible-pour-rpcs3-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS5] PS5 Homebrew v1.5 et AirPSX pkg v1.0 de Master-s",
        "content": "Le développeur Master-s semble s'intéresser fortement au tout nouveau payload AirPSX, il faut dire que ce payload amène le support d'etaHEN et des jeux PS4 ! \n \n \n\n \n \nPour fêter cela il a proposé la version 1.5 de PS5 Homebrew qui intègre désormais airpsx.elf même s'il s'agit déjà d'une version obsolète puisqu'il s'agit de la v1.0.\n \n \n \n\n \n \n \nTéléchargement : PS5 Homebrew v1.5\n \n \nAutre proposition de Master-s, la disponibilité de la version PKG de PS5 AirPSX, dans cette première version, cela permet d'accéder aux informations de la PS5, mais s'il intègre la dernière version les possibilités vont être beaucoup plus large. \n \n \nTéléchargement : AirPSX pkg 1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203773/in-ps5-ps5-homebrew-v15-et-airpsx-pkg-v10-de-master-s-1.png"
        }
    },
    "news_16": {
        "title": "[PS5] AirPSX 0.0.4 disponible avec le support de etaHEN et des jeux PS4",
        "content": "AirPSX, un payload conçu pour la PlayStation 5 (PS5) qui permet de gérer diverses opérations de la console via une interface web, passe en version 0.0.4. Ce projet est similaire à AirDroid, mais adapté pour la PS5 via une interface web, offrant des fonctionnalités comme la gestion des fichiers, l’exécution de scripts, et bien plus encore.\n \nLe développeur précise qu’il n’est pas responsable des dommages causés à la console ou de l’utilisation abusive de l’outil. AirPSX est construit avec le framework web hxwell, le code source est écrit en Haxe, qui est transpilé en C++ et compilé à l’aide du PS5 Payload SDK.\n \nCela évolue très vite, etaHEN est supporté comme désormais le lancement de jeux PS4 sur la v0.0.4 qui vient de sortir !\n \n \n\n \n \n \nComment utiliser AirPSX\n \nAvec elfldr :\n \n1.Exécutez la charge utile elfldr.\n \n2.Utilisez la commande suivante sous Linux :\n \nbash\n \nsocat -t 99999999 - TCP:PS5_HOST:9021 < \"airpsx.elf\"\n \nAvec etaHEN :\n \n1.Exécutez la charge utile etaHEN.\n \n2.Connectez-vous via FTP (ports courants : 1337, 2121).\n \n3.Placez le fichier airpsx.plugin dans le dossier /data/etaHEN/plugins.\n \n4.Activez le plugin via Debug Settings -> etaHEN Toolbox -> Plugins.\n \n5.Optionnellement, vous pouvez activer airpsx.plugin pour qu’il démarre automatiquement au démarrage de la console.\n \nAvec websrv :\n \nCette méthode est déconseillée, car AirPSX se ferme dès que le navigateur est fermé.\n \n \n \n \nTéléchargement : AirPSX 0.0.4\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203771/in-ps5-airpsx-004-disponible-avec-le-support-de-etahen-et-des-jeux-ps4-1.png"
        }
    },
    "news_17": {
        "title": "[Switch] MigUpdater et firmware 1.1.7 pour le MigFlash",
        "content": "L'équipe en charge du MigFlash propose une nouvelle version du firmware de leur linker permettant de copier et lancer les jeux dont vous disposez, MigFlash propose en effet la version 1.1.7 du firmware, qui apporte une correction d'un problème empêchant la mise à jour de Mig Dumper pour les utilisateurs Mac et Linux.\n \nDe plus, l'équipe a ajouté une fonctionnalité permettant d'afficher la version du firmware sous forme de fichier (1.1.7) dans le dossier racine de la GameCard. Cela facilite la vérification de la version du firmware en cours d'exécution.\n \n \n \n\n \n \n \n \nEnfin, la team propose un nouvel outil, MigUpdater, il s'agit d'une application de bureau compatible avec Windows, Mac et Linux qui permet de vérifier et mettre à jour le firmware de Mig Dumper.\n \nCet outil est conçu comme une méthode de secours si la méthode traditionnelle de glisser-déposer ne fonctionne pas. Ce MigUpdater est disponible dans la section téléchargement du site officiel. \n \nTéléchargement : MigUpdater et firmware 1.1.7\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203764/in-switch-migupdater-et-firmware-117-pour-le-migflash-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] JoyShockMapper disponible en v3.6.1",
        "content": "JoyShockMapper permet d'améliorer l'expérience utilisateur avec notamment la visée gyroscopique ou le flick stick, permettant ainsi de profiter des trois axes de ces contrôleurs Nintendo, ce que ne permettent pas les contrôleurs Xbox par exemple. JoyShockMapper convertit les entrées de contrôleur de jeu courantes en événements de clavier, de souris et de contrôleur virtuel afin que vous puissiez jouer à des jeux PC avec ces contrôleurs. Utilisez les commandes gyroscopiques et le stick analogique pour jouer à des jeux avec plus de précision que n'importe quelle autre console.\n \n \n\n \n \nL'alternative à DS4Windows qui n'est plus supporté passe en version v3.6.1 :\n \nDans cette mise à jour, le développeur a réparé ce qu'il avait cassé en insistant sur les bugs et les crashs : \n \n- Corrections de bugs\n- Correction d'un crash lors d'une pression simultanée\n- Correction d'un crash sur une action de commande\n- Améliorer la gestion du chevauchement des pressions simulées et des pressions diagnostiques\n- Correction du mode stick SCROLL_WHEEL\n \n \nTéléchargement : JoyShockMapper v3.6.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203763/in-switch-joyshockmapper-disponible-en-v361-1.jpg"
        }
    },
    "news_19": {
        "title": "[3DS] 3DSident v0.9.3 disponible",
        "content": "Le développeur Joel16 propose une nouvelle version de 3DSident, 3DSident, un peu comme un CPU-Z ou un GPU-Z sur PC, le logiciel va vous permettre d'obtenir facilement des informations critiques comme le modèle, la langue, le firmware installé avec la version du Kernel, l'adresse MAC , le statut de la batterie, et le programme évolue encore plus avec l'arrivée de cette version.\n \nDans cette nouvelle version 0.9.3 le développeur a apporté pas mal de corrections liés au NNID. \n \n \n\n \n \n \nChangelog :\n \nCorrection des informations NNID affichant de manière incorrecte les informations suivantes :\n- ID persistante\n- Base d'identification transférable\n- ID principal\nLes informations NNID affichent désormais les informations suivantes :\n- ID de compte\n- Statut du compte (si le compte du serveur a été supprimé ou est actif)\n- Pays lié au compte NNID\n \n \n \nTéléchargement : 3DSident v0.9.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203762/in-3ds-3dsident-v093-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS3] L'équipe RPCS3 demande le retrait d'aPS3e pour violation de licence",
        "content": "On ne rigole pas avec les licences, l\"équipe en charge du développement de RPCS3 impose le respect des licences en demandant le retrait du dépôt GitHub de l'émulateur PS3 pour Android, aPS3e, en invoquant une violation de la licence GPLv2. \n \nLe développeur d'aPS3e, connu sous le nom d'Aenu, avait refusé de publier le code source complet de son émulateur, malgré l'utilisation du code de RPCS3, un émulateur open-source pour PC. De plus, Aenu avait placé le code source derrière un paywall, demandant 2000 USD pour le rendre accessible. \n \n \n\n \n \n \nCette situation a conduit l'équipe RPCS3 à déposer une plainte DMCA, soulignant que la licence GPLv2 exige que tout fork soit également publié en open-source. Cette action a entraîné la suppression du dépôt GitHub d'aPS3e, rendant le projet actuellement inaccessible. \n \nC'est dommage d'en arriver là, le projet aPS3e peut être un bon portage de RPCS3 sur Android, mais pour cela il faut respecter les règles. \n \nSource : \n \nhttps://www.androidauthority.com/aps3e-ps3-emulator-3526869/\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-392587576.jpg"
        }
    }
}