{
    "news_1": {
        "title": "[Switch] L'équipe Mig Switch va annoncer sa V2 et propose une mise à jour firmware de la V1",
        "content": "L'équipe Mig Switch vient d'annoncer une \"V2\" de son linker qui se destine comme vous le savez à la Nintendo Switch, une forme de concurrence s'est imposé avec UnlockSwitch même si ce dernier n'a pour l'heure pas encore été dévoilé officiellement, plus que quelques jours à attendre. \n \nDeadSpecimen et Nick Moses confirment qu'ils ont eu quelques informations sur cette nouvelle version du linker, l'intégration du bouton qui permet de changer de jeu, sans avoir la contrainte de réaliser la manipulation d'éjection, mais ce n'est probablement pas tout. \n \n \n\n \n \nL'équipe russe vient de dévoiler une mise à jour firmware 1.1.4 pour ce que nous appelerons désormais la version 1 du Mig Switch, elle permet d'élargir le support des cartes microSD a de nombreuses marques, mais surtout dans son message, la team annonce que Samedi elle annoncera cette nouvelle version \" Restez à l'écoute, car ce samedi, nous aurons une annonce officielle pour notre mise à jour la plus demandée qui arrive enfin bientôt \" . \n \nCe week-end va donc être assez chaud, car les deux équipes vont annoncer leur produit en même temps. Depuis quelques temps, la team Mig Switch semble subir des ruptures occasionnant des retards dans les livraisons.\nAu sujet du Mig Switch 2, un appui court et un appui long permettront d'avancer et de reculer dans les jeux installés sur la carte SD.\n \n \nTéléchargement : migswitch.com\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191262/in-switch-lequipe-mig-switch-va-annoncer-sa-v2-et-propose-une-mise-a-jour-firmware-de-la-v1-1.png"
        }
    },
    "news_2": {
        "title": "[PS3] La 9eme Bêta du CFW Evilnat 4.91.2 PEX/D-PEX est là",
        "content": "Le développeur Nathan Martin a récemment publié la neuvième version bêta de son CFW Evilnat 4.91.2 pour les PlayStation 3. Cette mise à jour inclut plusieurs nouvelles fonctionnalités, notamment de nouvelles corrections suite à la mise en test de la huitième version.\n \nIl a donc opérer quelques modifications, et surtout des corrections importantes, cette nouvelle version ayant été testée notamment par Zecoxao qui a largement contribué à faire évoluer le CFW. A l'heure où nous écrivons les version CEX, D-PEX, DEX et PEX sont proposées, les déclinaisons noBD/noBT/Overclock ne sont pour le moment pas en ligne. \n \n \n \n\n \n \n \nVoici le changelog par rapport à la version précédente : \n \n- Vérification externe du kernel corrigée lors de l’utilisation de l’option [Swap Kernel] en PEX/D-PEX\n- Écran noir aléatoire corrigé lors de l’activation des QA Flags\n- Mises à jour avancés des QA Flag (grâce à Zecoxao et Soul)\n- Code d’erreur 0x800299D2 et écran noir corrigés (lecture Blu-ray/DVD en mode CEX/DEX)\n- Option [Activer le mode OFW au démarrage] mise à jour pour permettre la restauration automatique des system calls\n- PlayStation Home ajouté (par DeViL303)\n- eula_cddb_plugin.rco personnalisé ajouté (par DeViL303)\n \n \nTéléchargement : CFW Evilnat 4.91.2 Beta 9\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191216/in-ps3-la-9eme-beta-du-cfw-evilnat-4912-pexd-pex-est-la-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS4] PPPwnUI Release 3.0 disponible et ajoute le support de Linux",
        "content": "Les propositions autour de PPPwn sont nombreuses, dans un peu plus d'une semaine le développeur TheFlow présentera officiellement ses recherches, mais les avancées sont nombreuses depuis qu'il a dévoilé son hack. \n \nPPPwnUI version 3.0 est disponible et s’est encore amélioré ! Ce programme ajoute une interface utilisateur (UI) à l’exploit PPPwn créé par TheFlow. L’interface graphique proposée par Memz a été largement optimisée ces derniers jours, notamment avec les ajouts récents. De plus, l’outil a été mis à jour pour intégrer le support de GoldHEN_v2.4b17.2 de SiSTR0. \n \n \n \n\n \n \n \nVoici les principales modifications apportées dans cette version PPPwnUI version 3.0 :\n \n- Prise en charge de Linux pour l’interface utilisateur (UI) : La dernière version inclut désormais une compatibilité avec Linux, permettant aux utilisateurs d’exécuter PPPwnUI sur des systèmes Linux.\n- Mises à jour GoldHEN : Le programme intègre la dernière version de GoldHEN (2.4b17.2), améliorant la compatibilité et les performances.\n- Options de firmware GoldHEN étendues : Les options de firmware GoldHEN ont été élargies pour inclure les versions 10.00 et 10.01.\n- Prise en charge étendue des firmwares : PPPwnUI prend désormais en charge les firmwares 7.00, 7.01 et 7.02.\n- Nettoyage et optimisation :\n- Les fichiers inutilisés ont été supprimés.\n- Les scripts redondants ont été remplacés par le script officiel de TheFlow.\n- Un grand merci à Aldostools d’avoir rendu cette mise à jour possible !\n \n \nTéléchargement : PPPwnUI 3.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191215/in-ps4-pppwnui-release-30-disponible-et-ajoute-le-support-de-linux-1.png"
        }
    },
    "news_4": {
        "title": "[PS4/PS5] PS Multi Tools v14.1.4 disponible",
        "content": " \nLe développeur SvenGDK a proposé successivement ces derniers jours de nombreuses évolutions pour sa solution PS Multi Tools, il a en effet offert au public la semaine dernière la v14.1.2 et 14.1.3, et il y a quelques heures il a livré la v14.1.4.\n \n \n\n \n \n \n\n \n \nChangelog PS Multi Tools v14.1.4 : \n \nPS4 :\n \n- Outil PPPwner\n- Mise à jour de PPPwn++ avec les derniers changements (20 mai 2024)\n- Mise à jour des fichiers SiSTRo/GoldHEN stage2 pour FW 9.00 & 11.00\n- Ajout de fichiers SiSTRo/GoldHEN stage2 et support pour FW 10.00 & 10.01\n- Mise à jour de GoldHEN en v2.4b17.2\n- Cette mise à jour supporte maintenant GoldHEN sur les firmwares 10.00 & 10.01\n \nPS5 :\n- Téléchargeur de correctifs de jeux\n- Correction d'un crash possible lors du chargement du téléchargeur de correctifs de jeux.\n \nChangelog PS Multi Tools v14.1.3 : \n \nGénéral :\n- Changement mineur de l'Updater\n- Ne pas télécharger à nouveau l'Updater s'il existe déjà (PSMT-Update.exe)\n \nPS4 :\n- Mise à jour de PPPwn avec les derniers changements (14 mai 2024)\n \n \nChangelog PS Multi Tools v14.1.2 :\n \nPS3 & PS Vita\n- PKG Browser & Downloader\n- Correction d'un crash lors d'une recherche par Nom / Titre ID ou Contenu ID (survenait lorsqu'aucune base de données n'était chargée)\n \nPS4\n- Mise à jour de l'interface graphique de PPPwn pour PS4\n- Remplacement de la version Python de PPPwn par PPPwn c++ (cela peut générer un faux positif \"Trojan:Win32/Wacatac.B!ml\" dans MS Defender)\n- Ajout du support pour FW 7.50 / 7.51 / 7.55 / 8.00 / 8.01 / 8.03 (PoC uniquement)\n- Ajout d'une sortie de journal\n- Ajout d'une nouvelle option \"Auto-Retry\" à partir de PPPwn c++\n- La sélection de l'adaptateur Ethernet affiche maintenant plus d'informations\n \n \nTéléchargement : PS Multi Tools v14.1.4\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191185/in-ps4ps5-ps-multi-tools-v1414-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191185/in-ps4ps5-ps-multi-tools-v1414-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS4] Le payload GoldHEN v2.4b17.2 disponible avec support 10.00 et 10.01",
        "content": "Bonne nouvelle pour ceux qui sont bloqués sur le firmware 10.00 ou 10.01 en raison d'une corruption ou défaillance de leur lecteur blu-ray, ils vont pouvoir profiter de l'exploit PPPwn en utilisant le payload GoldHEN. \n \nLe développeur Sistr0 a en effet rajouté les bons offsets afin de rendre son payload GoldHEN compatible sur les deux firmwares 10.00 et 10.01. Un travail est aussi en cours sur le firmware 9.60 mais cela semble un peu plus complexe. \n \n \n\n \n \nComme d'habitude, la version personnalisé du stage2 cherchera le payload qui sera présent en racine d'une clé USB, et si elle la trouve, il sera copié sur le disque dur interne permettant ainsi de se passer de la clé USB.\n \nActuellement les versions 9.00, 10.00, 10.01 et 11.00 sont supportées, en plus des 5.05, 6.71 et 6.72, sachant qu'il a libéré le tout sur Github. \n \nTéléchargement : GoldHEN v2.4b17.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-872062260.png"
        }
    },
    "news_6": {
        "title": "[3DS] Anemone3DS v3.0.0b Pre-Release disponible",
        "content": "\n \nDepuis quasiment 2 ans, nous n'avions pas pu bénficier d'une mise à jour d'Anemone3DS, et bien voilà chose rectifié dans le sens où astronautlevel2 vient de mettre en ligne la v3.0.0b Pre-Release de son outil. \n \nComme le dit son auteur, c'est probablement la plus grosse mise à jour que le logiciel a pu avoir depuis longtemps, et il compte ajouter quelques traductions avant l'arrivée de la version finale. \n \nPour rappel, Anemone3DS est un gestionnaire de thèmes et de splashs screens (les écrans de démarrages) développé par astronautlevel2, il permet la prise en charge de l'installation d'un seul thème sur votre 3DS jusqu'à 10 thèmes aléatoires. Il vous propose un effet de prévisualisation de vos thèmes avant leur installation et le support d'installation pour les boot splashs (uniquement sous Luma3DS).\n \n \n \n\n \n \n\n\n \nBugfixes\nFixed various errors when downloading themes via the QR code reader\nFix bug with files with * in their name (by @Zemogiter)\nFix bugs with Unicode filenames\nAllow x-zip-compressed to be a valid Mime type\nDisable home button after installing theme; this was deemed to be the root of a number of corruption issues\n \nNew Features\nTranslation framework allowing for Anemone3DS to be displayed in your native language! Currently only Portugese and French are present, but we're accepting PRs for more languages - feel free to message me or ping me on ThemePlaza or Nintendo Homebrew if you want instructions!\nAdded French translation by @cooolgamer\nAdded Portuguese translation by @iveurne\nSupport for Korean region systems using the home menu patch (thanks to @cooolgamer)\nassemble a splash preview if none was found (thanks to @Jan200101)\nSignificant performance improvements, especially when scrolling between many themes\nNew User Interface which should be both more intuitive (no more button combos!) and also more touch-screen friendly\nRespect Parental Controls which lock the user out of the browser and require a PIN on access if that restriction is enabled\nWarn the user on installing a theme with mono audio - this can cause many audio issues with the home menu\nAdd libcurl fallback so that Anemone can scan QR Codes from anywhere - not just HTTP websites.\n \n\n \n\n \n \nTéléchargement : Anemone3DS v3.0.0b Pre-Release \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-102430297.png"
        }
    },
    "news_7": {
        "title": "[Switch] UnlockSwitch reparle de sa première solution qui ne devrait plus trop tarder",
        "content": " \nL'équipe en charge du développement de l'UnlockSwitch reparle de leur produit, selon elle, la présentation de la première version de l'UnlockSwitch sera effectuée au plus tôt le week-end prochain, ce qui signifie que la team se laisse aussi la possibilité de réaliser cette présentation plus tard. \n \nLa solution UnlockSwitch disposera d'un boitier transparent, et l'équipe informe qu'elle proposera les liens de téléchargement des fichiers 3D du boitier pour pouvoir personnaliser le boitier via une imprimante 3D par exemple. Cette nouvelle version dispose d'un PCB différent, plus performant, ou du moins qui serait plus solide ou intégrant des composants plus efficaces. \n\nUn interrupteur permettra d'allumer et d'éteindre l'appareil, et la team l'annonce l'injection et extraction du linker ne sera plus nécessaire.\n \nLe linker sera livré avec un programmateur intégré sur port-USB permettant de le flasher, et la conversion de fichiers sera possible directement dans le logiciel de programmation.\n \nUne option supplémentaire sera présentée lors de l'annonce, mais difficile de dire à quoi cela correspond. Dernière information, le tout sera commercialisé à 29 $.\n \nTout est là : UnlockSwitch\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191170/in-switch-unlockswitch-reparle-de-sa-premiere-solution-qui-ne-devrait-plus-trop-tarder-1.jpg"
        }
    },
    "news_8": {
        "title": "[3DS] Citra Enhanced v1.1.0 disponible",
        "content": " \nDepuis l'arrangement trouvé entre Tropic Haze et Nintendo, Yuzu et Citra ont officiellement disparu de la scène, cependant de nombreux forks sont nés des cendres des versions natives. \n \nL'un des projets qui a attiré notre attention est Citra Enhanced, qui est un fork de Citra développé par Gamer64ytb, qui apporte de nombreuses modifications supplémentaires, comme par exemple des évolutions sur Android, la possibilité d'ajuster les boutons de l'écran tactile, la possibilité de faire pivoter l'écran, ou encore des améliorations sur les versions PC et Android. \n \nEn plus de tout cela, des améliorations ont été amenées sur l'interface utilisateur, sur le support audio, ou encore des performances et la comptabilité avec les jeux. \n \n \n \n\n \n \n \nChangelog Citra Enhanced 1.1.0 :\n \n- Android : Retour à la limite de vitesse de 200\n- Android : Correction de quelques crashs occasionnels de l'écran de rotation (GPUCode)\n- PC : Ajout de certains jeux à la liste de compatibilité\n- PC & Android : Migration de Microprofile vers Tracy (GPUCode), cela devrait également libérer de la RAM.\n- PC : QT UI Redesign (kleidis)\n- Android & PC : Améliorer la performance et l'allocation du stream buffer\n- Android : Correction de quelques fuites de mémoire du backend audio Oboe (Ishan09811)\n- Android : Changement de l'ID de l'application (cette version sera installée comme un nouvel APK)\n- Android : Implémenter GameAboutDialog (Ishan09811), maintenant vous avez une nouvelle interface lorsque vous appuyez longuement sur un jeu.\n- Android & PC : Correction des problèmes de Priority Boost avec les cutscenes\n- Android & PC : Amélioration de la logique de ValidateByReinterpretation, peut corriger des choses.\n- PC : Restaurer l'onglet web (rtiangha), maintenant vous pouvez activer la présence riche de discord\n- Android : Optimisation de AreQuaternionsOpposite, corrige batman, isaac et probablement plus de jeux, et probablement de meilleures performances pour certains jeux\n- Android et PC : Activation de Priority Boost par défaut, à cause des cutscenes corrigé maintenant\n- PC : Implémenter Mica pour Windows (kleidis)\n- PC : Ajout du support pour les favoris, les raccourcis de bureau, et le suivi du temps de jeu (FearlessTobi) + quelques améliorations de OpenSauce04 et rtiangha\n- Android & PC : Implémentation de l'Upscaling Hack, peut résoudre les problèmes de ghosting sur certains jeux\n- Android & PC : Implémentation de l'option audio en temps réel, dites adieu au lag audio si le jeu tourne à moins de 100% de sa vitesse !\n- Android : Traduction de certains textes en espagnol\n- Android & PC : Correction de quelques problèmes de performance pour Street Fighter 4 et Luigi's Mansion Dark Moon\n- Android & PC : Autres améliorations et nettoyages mineurs\n \nTéléchargement : Citra Enhanced v1.1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191096/in-3ds-citra-enhanced-v110-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[PS4] Vous pouvez exécuter PPPwn sur les smart TV de LG",
        "content": "L'exploit PPPwn est une véritable révolution pour la PS4, après le PC, le Raspberry Pi, un smartphone Android, voilà que la solution arrive sur les téléviseurs connectés LG.\n \nPour pouvoir réaliser l'opération, il faudra bien entendu que la télévision soit rootée, car cette méthode se base sur PPLGPwn du développeur zauceee, avec lui vous allez pouvoir jailbreaker votre console avec votre TV LG, qui utilise le systeme WebOS, un kernel Linux propriétaire. \n \nLe jailbreak de votre TV LG s'effectue avec l'exploit \"DejaVuLN\"\n-> https://github.com/throwaway96/dejavuln-autoroot\n \n \n\n \n \nLes deux développeurs, llbranco et zauceee (aka kodeine) ont décidé de se concentrer sur un seul projet, nous avons les mêmes objectifs et en travaillant ensemble ils aurons beaucoup plus à offrir que séparément.\n \n \n\n \n \nCe projet est ouvert mais seulement limité au firmware 11.00, il se peut que vous deviez remplacer manuellement le binaire pppwn s'il est aarch64, cette méthode utilise la version C++ de PPPwn, réalisée par xfangxfang PPPwn_cpp\n \nAttention ce projet n'est pas compatible avec Roku tv, Amazon Fire Stick, Samsung tv ou Android TV, il n'est pas certain que ça arrive un jour, mais tout comme on ne peut pas l'exclure. \n \nTout est là : PPLGPwn\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191090/in-ps4-vous-pouvez-executer-pppwn-sur-les-smart-tv-de-lg-1.png"
        }
    },
    "news_10": {
        "title": "[XBO] Une méthode pour dumper et décrypter les jeux Xbox One",
        "content": "Depuis quelques jours a été dévoilé une nouvelle méthode qui permet de décrypter et télécharger sur Xbox One, du moins cette méthode a été décrite ici : \n \nhttps://xboxoneresearch.github.io/games/2024/05/15/xbox-dump-games.html\n \nLe moddeur Baw a réussi à dumper un jeu Xbox (sur une console commerciale) afin de modifier Halo, il dit qu'il est capable de dumper n'importe quel jeu.\n \n\n \nPour y parvenir il exécute sur le système Xbox dans sa version System OS : 10.0.22621.3446 avec la vulnérabilité CVE-2023 21768 afin d'écrire une primitive dans le kernel. C'est un bug dans le système d'exploitation qui est utilisé, les recherches plus approfondies sur les méthodes alternatives étaient minces, sans avoir à travailler sur l'avancement de la chaîne pour un exploit du système d'exploitation hôte, un oubli a été découvert dans le système d'exploitation du jeu (ERA).\n \nAinsi il explique que lorsque vous chargez un jeu sur une Xbox, le système d'exploitation rassemble les données pertinentes relatives au lancement du titre, telles que le chemin d'accès au XVC sur le disque dur/SSD, ainsi que le XVD « temporaire » attribué au titre de lancement. Ces données sont envoyées au système d'exploitation hôte lors du démarrage de la machine virtuelle Game OS. Une fois que le système d'exploitation du jeu commence à démarrer, un service appelé comsrvhost.exe initialise le montage du jeu et d'autres configurations supplémentaires à l'aide des données fournies par SRA et validées par l'hôte.\n \n\nMais le principal point d'intérêt arrive lors de la gestion du montage 'temp' du XVD, si vous voulez en savoir davantage c'est ci-dessous ! \n \n\nSi cet exploit vous intéresse c'est par ici : xboxoneresearch.github.io\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191058/in-xbo-une-methode-pour-dumper-et-decrypter-les-jeux-xbox-one-1.png"
        }
    },
    "news_11": {
        "title": "[3DS] Artic Base Server proposé pour réduire les déchets électroniques",
        "content": " \nArtic Base Server est un outil open source permettant de diffuser des jeux depuis votre Nintendo 3DS vers un émulateur ! Artic Base permet de jouer à votre collection de jeux 3DS, physiques ou numériques, sur un émulateur compatible sans avoir à les dumper au préalable. De plus, l'outil synchronise les données de sauvegarde, afin que vous puissiez reprendre votre progression à tout moment depuis la console. Vous trouverez ci-dessous la liste des fonctionnalités fournies par cet outil, provenant du référentiel github Artic Base Server .\n \n\n \n \n \nCaractéristiques :\n- Jouez à des jeux depuis votre console sans avoir à les dumper.\n- Synchronisez les données de sauvegarde/extdata du jeu diffusé pendant la session de jeu.\n- Chargez les données externes partagées et les archives NCCH depuis votre console.\n- Supprimez le besoin de vider les clés AES, car le déchiffrement est effectué par le système d'exploitation de la console.\n- Avantages par rapport au jeu sur une vraie console​\n- Jouez à vos jeux à des résolutions plus élevées.\n- Utilisez des contrôleurs externes qui pourraient mieux correspondre à votre style de jeu.\n- Basculez entre jouer sur votre PC à la maison et sur votre console en déplacement.\n- Réduisez les e-déchets en réutilisant les consoles partiellement cassées pour diffuser vos jeux sur votre PC.\n- Permettez aux musées ou aux organisations à but non lucratif de préservation de jeux de disposer d'une base de données centralisée de jeux préservés, tout en utilisant un serveur Artic Base Server + un émulateur compatible pour effectuer des recherches si nécessaire.\n \nComme le prétend l'auteur de l'outil, Artic Base vise à aider les joueurs à profiter de leur collection de jeux Nintendo 3DS avec plusieurs avantages, tels que la possibilité de jouer à des résolutions plus élevées, de basculer entre le jeu sur une 3DS en déplacement et sur un PC à la maison, et en utilisant leurs contrôleurs externes préférés. De plus, cela contribue à réduire les déchets électroniques en permettant d'utiliser des consoles partiellement cassées pour faire office de serveur au lieu de devoir les jeter/remplacer. L’outil supprime également le besoin de faire face aux manigances classiques de l’émulateur, telles que devoir dumper des jeux ou obtenir des clés cryptographiques. Gardez toutefois à l’esprit qu’en raison de la vitesse du réseau de la 3DS, des temps de chargement plus lents peuvent être rencontrés.\n \nArtic Base est lié à Citra, la première version est une version fork montée par PabloMK7. Une démonstration d'Artic Base a été publiée sur la chaîne YouTube de PabloMK7 il y a quelques jours, montrant Shovel Knight diffusé sur un PC.\n \n \n \n\n \n \nTéléchargement : Artic Base Server\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191047/in-3ds-artic-base-server-propose-pour-reduire-les-dechets-electroniques-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] La team UnlockSwitch informe que le linker est gold",
        "content": "La Team UnlockSwitch informe que sa solution est désormais finalisée, du moins que la première version finale d'UnlockSwitch est officiellement terminée et prête à lancer les premiers échantillons.\n \nElle a rajouté qu'aucune demande d'échantillon ne sera acceptée, et que les évaluateurs seront sélectionnés par elle-même avant le lancement du produit.\n \nElle rappelle qu'elle refuse toute précommande, et que tout site qui en propose serait un scam. La première version qui sera équipée de ice40/esp32s sera vendu 29.90 $ suite à un vote sur Twitter.\n \n \n\n \n \nA priori il sera nécessaire de réaliser le flash du linker, une vidéo démo sera proposée avec les fichiers.\n \nPour rappel, cette première version ne permettrait pas de dumper les jeux, une solution matérielle serait en cours d'étude, son nom de code est The eXtractor (l'extracteur). \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191008/in-switch-la-team-unlockswitch-informe-que-le-linker-est-gold-1.png"
        }
    },
    "news_13": {
        "title": "[PS3] Les premiers dumps d'une PS3 Super Slim DECH 4000 (DEX)",
        "content": "Le développeur Zecoxao partage quelques nouveautés sur la scène PS3, il s'agit en fait du partage du jeton QA flag et la signature respective tirés d'une console Super Slim DECH de la série 4000 avec le numéro de série 0000001 (le premier du genre).\n \nIl semble que cela provienne d'un utilisateur de discord qui a proposé le dump nvs complet de l'eprom.\n \n \n\n \n \nPour l'heure ce n'est pas encore utilisable pour parvenir à un CFW sur un firmware supérieur au 3.56, peut être que cela pourrait conduire à un CFW jusqu'au firmware 4.21.\n \nJoonie, le célèbre développeur de l'ancienne team Rebug, quand à lui pense que cela pourrait permettre de faciliter le downgrade OFW vers OFW. Zecoxao précise qu'à partir du firmware 4.21 tout a changé avec l'introduction de clé différente.\n \n \nSi le sujet vous intéresse :  QA Flag d'une Superslim_DEX / Psx-place.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191007/in-ps3-les-premiers-dumps-dune-ps3-super-slim-dech-4000-dex-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS4] PS4 App Lock v1.07 disponible",
        "content": " \nPS4 App Lock v1.07 est une application développée par Lapy qui permet de verrouiller l’exécution de jeux et d’applications homebrew sur le dashboard de la console PlayStation 4. \n \n \n \n\n \n \nVoici quelques fonctionnalités de cette application :\n \n- Création d’un code PIN unique.\n- Verrouillage individuel des jeux et des applications.\n- Affichage des classifications PEGI (en lisant le niveau de contrôle parental depuis le fichier SFO).\n- Affichage d’un message bloqué lorsque vous essayez d’ouvrir une application ou un jeu verrouillé\n \nCette nouvelle version 1.07 apporte le support du firmware 5.00 au firmware 11.00.\n \n \nTéléchargement : PS4 App Lock v1.07\n \n   \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190936/in-ps4-ps4-app-lock-v107-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS3] La 8ème Bêta du CFW 4.91.2 Evilnat est là",
        "content": "Le développeur Evilnat a récemment publié une nouvelle version bêta de son CFW (Custom Firmware) pour la PS3, la version 4.91.2 Beta 8. Cette mise à jour inclut plusieurs nouvelles fonctionnalités, notamment le support des consoles sans un lecteur blu-ray fonctionnel. \n \nCette version intègre en effet le support des consoles avec des lecteurs HS, qui pourront donc mettre à jour vers cette version et ainsi disposer des dernières évolutions. \n \nTrès peu de changements depuis la version Bêta 7.0, sur les CEX/DEX/PEX et D-PEX, mais comme le rappelle le développeur il faut faire attention lors de l'overclocking de la console.\n \n \n\n \n \nChangelog : \n \n- Mise à jour du chargement de la charge utile Cobra à un décalage différent dans le noyau LV2\n- Recompilation du noyau LV2\n- Recompilation de l'étage 2 du Cobra\n- Ajout d'une vérification de la charge externe du noyau LV2 lors de l'utilisation de l'option [CEX2DEX Tools > Swap Kernel].\n- Ajout d'une vérification MD5 pour les fichiers dtbImage.ps3.bin et dtbImage.ps3.bin.minimal pour OtherOS\n- [XAI] Ajout d'une nouvelle option pour alterner entre libaudio.sprx d'origine et suuport, patché avec un troisième casque BT (peut échouer avec certains)\n- [XAI] Réactivation de l'option [Toggle External Cobra] dans xai_plugin\n \n \nTéléchargement : CFW 4.91.2 Evilnat Beta 8\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190928/in-ps3-la-8eme-beta-du-cfw-4912-evilnat-est-la-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS4] PS4-Xplorer 2.03, PS4 Player 1.08 et PS4 Player 3D 1.01",
        "content": "Le développeur Lapy est en pleine forme, il déplace des montagnes pour proposer ses meilleurs homebrews sur la PS4 pour intégrer le support des derniers firmwares exploitables. \n \nAinsi il propose son PS4-Xplorer 2.03, PS4 Player 1.08 et PS4 Player 3D 1.01, l'idée étant d'apporter le support des firmwares du 5.00 au 11.00 bien entendu.\n \n \n\n \n\n \n\n \n \nTéléchargement : PS4-Xplorer 2.03 / PS4 Player 1.08 / PS4 Player 3D 1.01\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190859/in-ps4-ps4-xplorer-203-ps4-player-108-et-ps4-player-3d-101-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1190859/in-ps4-ps4-xplorer-203-ps4-player-108-et-ps4-player-3d-101-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1190859/in-ps4-ps4-xplorer-203-ps4-player-108-et-ps4-player-3d-101-3.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] PS4 Temperature v1.07 disponible",
        "content": " \nLe développeur Lapy a récemment publié une mise à jour pour son outil PS4 Temperature. Cet utilitaire permet non seulement d’afficher la température en degrés Celsius et Fahrenheit, mais aussi de définir une limite à partir de laquelle le ventilateur commence à tourner plus rapidement. \n \nSi vous êtes un utilisateur de la PS4, cela pourrait être utile pour surveiller la température de votre console et ajuster les paramètres du ventilateur en conséquence.\n \n \n\n \n \nCette version 1.07 de PS4 Temperature apporte le support du firmware 5.00 à 11.00 à l'aide du soutient de notnotzecoxao et de LightningMods.\n \n \nTéléchargement : PS4 Temperature 1.07\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190833/in-ps4-ps4-temperature-v107-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[2DS/3DS] Luma3DS v13.1.1 disponible",
        "content": " \nLuma3DS v13.1.1 vient d’être publié, ce qui est de nouveau une excellente nouvelle pour les amateurs de Nintendo 3DS ! Voici les détails de cette mise à jour :\n \n\n \nChangelog : \n \n- Correction d'un bug où l'option de connexion sans fil remplaçait le remplacement du volume\n- Forcer le menu wifi : gérer correctement les emplacements wifi non configurés\n- Modifications mineures du loader de plugin\n \n \nTéléchargement : Luma3DS v13.1.1 \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190797/in-2ds3ds-luma3ds-v1311-disponible-1.jpg"
        }
    },
    "news_19": {
        "title": "[WiiU] Les plugins Region Free, SDCafiine, SwipSwapMe, Wiiload, FTPiiU et Screenshot",
        "content": " \nDe nombreux plugins ont été mis à jour à destination de la Nintendo Wii U, il faut dire que Maschell a mis à jour de nombreux d'entre eux suite à l'arrivée de la nouvelle version d'Aroma. \n \n \n\n \n \nPlugin ftpiiu v0.4.2 \n \n- La commande LIST qui affiche la liste des fichiers et dossiers a été corrigée.\n- Changer le CWD par défaut en / pour corriger l'accès à n'importe quel répertoire de carte non-dd pour certains clients ftp    \n \nTéléchargement : Plugin ftpiiu v0.4.2\n \n \nSDCafiine Plugin v0.1.5\n \n- Correction de la modification du paramètre pour appliquer automatiquement les modpacks dans l'écran de démarrage.\n \nTéléchargement : SDCafiine Plugin v0.1.5\n \n \nSwipSwapMe v0.1.2\n \n \n- Support de WUPS 0.8.0\n- Ajout de la prise en charge du miroir TV/DRC\n \n \nTéléchargement : SwipSwapMe v0.1.2\n \n \nsdcafiine plugin v0.1.5\n \n- Support for WUPS 0.8.1\n- Correction de la modification du paramètre d'application automatique directement dans l'écran d'accueil\n \nTéléchargement : sdcafiine_plugin v0.1.5\n \n \nRegion Free plugin v0.2.6\n \n- Correction de l'affichage de l'écran de démarrage sans région en 576i et 480i\n \nTéléchargement : Region Free plugin v0.2.6\n \n \nGamePad Auto Standby 0.6\n \n- Mise à jour vers WUPS 0.8.1.\n- L'option de mise hors/sous tension du GamePad basculera désormais entre la mise hors et sous tension pendant que le menu de configuration reste ouvert.\n- Amélioration de la fonctionnalité de mise hors tension au démarrage :\n-- Ne s'éteindra plus lors d'une relance du système d'exploitation (par exemple en quittant les paramètres système).\n-- Ne s'éteindra plus lors d'un rechargement du plugin (déterminé par la disponibilité du système d'exploitation < 5 minutes).\n- Des réparations liées à des bugs.\n \nTéléchargement : GamePad Auto Standby 0.6\n \n \nHomebrew on Menu 0.1.8 \n \n \n- Donner aux utilisateurs des conseils pour résoudre l'erreur 150-3030 lorsqu'ils la rencontrent dans le menu Wii U\n- Rediriger uniquement le répertoire de sauvegarde de l'utilisateur actuel\n \n \nTéléchargement : Homebrew on Menu 0.1.8 \n \n \n \nScreenshot Plugin v0.1.3\n \n- Prise en charge de WUPS 0.8.0, utilisation de l'heure de création de la capture d'écran dans le nom du fichier\n \nTéléchargement : Screenshot Plugin v0.1.3\n \n \nwiiload plugin v0.2.3\n \n- Ajout des notifications d'erreur si le wiiloading d'un rpx/wuhb échoue\n- Refonte pour support WUPS 0.8.0\n \nTéléchargement : wiiload plugin v0.2.3\n \n \n \nAroma Updater v0.2.3\n \n- Charger le certificat intégré pour permettre l'utilisation de l'Updater dans Tiramisu\n- Mise à jour du fichier cacerts.pem\n \nTéléchargement : Aroma Updater v0.2.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-660015649.png"
        }
    },
    "news_20": {
        "title": "[PS4] La réécriture de PPPwn_cpp ( PPPwn en C++) est finalisée",
        "content": "Le développeur xfangfang affirme avoir finalisé la réécriture C++ de PPPwn, comme vous le savez désormais cette réécriture permet d'utiliser et d'améliorer l'exploit sur les appareils moins puissants comme les routeurs ou les Raspberry Pi.\n \n \n\n \n \n \nCes dernières optimisations permettent d'améliorer la vitesse de l'exploit ainsi que sa fiabilité d'exécution selon le développeur. Les stages 3 et 4 ont été ajoutés, et de nouvelles options ont été rajoutées comme l'une d'entre elle qui permet de relancer automatiquement le stage 1 quand il est en échec. Des améliorations sur l'IPv6 à partir d'une adresse MAC ont également été intégrées par le développeur. \n \n \n \n\n \n \n \nTéléchargement : PPPwn_cpp\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190791/in-ps4-la-reecriture-de-pppwn-cpp-pppwn-en-c-est-finalisee-1.png"
        }
    }
}