{
    "news_1": {
        "title": "[Switch] Le rapport de Ryujinx est enfin là",
        "content": "L'équipe en charge du développement de Ryujinx propose sur son blog son nouveau rapport sur son émulateur, cela faisait un peu plus de 2 mois que nous avions pas eu ce rapport et il faut avouer que cela nous avait manqué. \n \nBien entendu la Team l'explique par le fait qu'elle a pris un peu de vacances, et donc il était important de faire un point sur toutes les évolutions apportées sur ces 2 derniers mois. \n \n \n\n \n \nRyujinx a connu des problématiques similaires à ceux de Yuzu notamment sous Red Dead Redemption, ainsi des corrections ont été faite sur des bugs liés à Vulkan, mais il y a aussi d'autres jeux, et en conséquence des bugs sur OpenGL, sur des textures d'objets notamment. \n \n \n \n \n\n \n \nLe GPU Switch dispose de certaines méthodes qui lui permettent de charger des données arbitraires dans des tampons à tout moment sans avoir besoin de barrières supplémentaires. Vulkan, en revanche, n'a aucune fonctionnalité permettant ces mises à jour arbitraires ; vous devez être en dehors d'une passe de rendu et effectuer manuellement une copie dans la mémoire tampon ou une écriture calculée pour obtenir un résultat similaire. Sur les GPU de bureau, interrompre une passe de rendu n’est pas particulièrement coûteux et peut même être considéré comme gratuit. Ce n’est malheureusement pas le cas sur les GPU mobiles (comme ceux que l’on trouve dans les puces M1/M2), où mettre fin à une passe de rendu est bien plus un engagement.\n \nLa solution à ce problème intrigant est à juste titre ingénieuse. Chaque fois qu'un jeu demande une mise à jour du tampon en ligne, nous pouvons prendre un « miroir » de la liaison actuelle, effectuer la mise à jour, puis effectuer une nouvelle liaison vers le nouveau tampon miroir. Cela peut considérablement améliorer les performances des Mac M1/M2 en fonction de la fréquence à laquelle ils utilisent ces mises à jour de tampon en ligne. La plupart des jeux les exécutent dans une certaine mesure, les améliorations sont donc globales.\n \n \n\n \n \nIl y eu aussi de nombreuses évolutions dans la gestion de la mémoire, dans la taille du tampon de rendu, l'ajustement des installations scalaires mais aussi de l'interface, ainsi les performances ne diffèrent plus selon la taille de la fenêtre. Auparavant, une petite fenêtre fonctionnait mieux qu’une fenêtre plein écran ! Les performances générales et la réactivité du framework se sont considérablement améliorées. La barre de titre correspondra enfin au thème de couleur de votre système sous Windows. De nombreux éléments mal alignés sur macOS ont été résolus. et enfin Ryujinx est compatible Flatpak! C'était le principal problème avant la version 11.0, si cela n'avait pas été fait les utilisateurs de Linux auraient été laissés pour compte.\n \n \nTout est là : blog.ryujinx.org\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177905/in-switch-le-rapport-de-ryujinx-est-enfin-la-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1177905/in-switch-le-rapport-de-ryujinx-est-enfin-la-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1177905/in-switch-le-rapport-de-ryujinx-est-enfin-la-3.png"
        }
    },
    "news_2": {
        "title": "[3DS/Switch/GC] PKHeX du 16.09.2023 disponible",
        "content": "Les petits gars en charge du développement de PKHeX viennent de mettre en ligne une nouvelle version de leur outil à destination de la Nintendo 3DS, Switch, et de la Gamecube. \n \nComme vous le savez avec PKHeX les utilisateurs peuvent manipuler divers fichiers de sauvegarde .sav,.dsv,.dat,.gci,.raw et .bin. PKHeX peut également lire et écrire les fichiers .pk, qui sont des fichiers Pokémon individuels, et les fichiers .pgt,.pcd,.pgf,.wc, qui sont des fichiers Mystery Gift.\n \nCette version 23.09.16 apporte quelques changements intéressants, avec notamment la prise en charge de Pokemon Scarlet & Violet 2.0.1 (Teal Mask).\n \n \n \n\n \n \n \nChangelog : \n \n- Ajout de la prise en charge de Scarlet & Violet 2.0.1 (Teal Mask)\n- Légalité : Ajout de rencontres / changements selon les ajustements du DLC Teal Mask.\n- Il peut encore y avoir des problèmes avec les croisements / les permissions de capacités cachées.\n- Modifié : le critère Evolve-Knowing-Move a été réécrit pour une meilleure vérification et précision des jeux annexes.\n- Modifié : Plus de corrections du générateur de rencontres implémentées (quelques propriétés manquaient).\n- Corrigé : L'effacement des entrées individuelles du Pokédex Gen9 n'efface plus que l'entrée au lieu de tout ce qui suit. Merci @Alexander3a !\n- Corrigé : L'importation des CGear Skin de la Gen5 donne maintenant le bon message d'erreur lorsque trop de tuiles uniques sont importées.\n \n \nTéléchargement : PKHeX 23.09.16\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177900/in-3dsswitchgc-pkhex-du-16092023-disponible-1.png"
        }
    },
    "news_3": {
        "title": "[PS5] PS5 Payload ELF Loader v0.3, ELF Loader v1.7.0+ et payload ftpsrv v0.1",
        "content": "Le développeur John Tornblom propose une mise à jour de nombreuses de ses propositions, notamment de PS5 Payload ELF Loader, ELF Loader et de payload ftpsrv. Commençons par PS5 BD-JB ELF qui passe en version 1.7.0+, il s'agit là apporter la possibilité d'installer des fichiers PKG et fPKG via TargetID Dex, bien qu'encore limitée uniquement aux DLC qui ont PPSA comme ID dans titre, à noter aussi que les firmwares inférieurs au 4.00 seront plus stable. \n \n \n\n \n \nIl a aussi mis à jour PS5 Payload ELF Loader en version 0.3, il s'agit là de s'assurer que le laoder elf reprend son exécution lorsque le PS5 sort du mode repos.\n \nEnfin il propose aussi payload ftpsrv, il s'agit là d'un payload ftps5 qui est un simple serveur FTP qui peut être exécuté sur une Playstation 5 qui a été jailbreakée via les points d'entrée BD-J ou webkit.\n \n \n\n \n \nTéléchargement : ELF Loader v1.7.0+\n \nTéléchargement : payload ftpsrv v0.1\n \nTéléchargement : payload elfldr v0.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177899/in-ps5-ps5-payload-elf-loader-v03-elf-loader-v170-et-payload-ftpsrv-v01-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1177899/in-ps5-ps5-payload-elf-loader-v03-elf-loader-v170-et-payload-ftpsrv-v01-1.png"
        }
    },
    "news_4": {
        "title": "[XO/XB360] FATXplorer V3.0.0.25018 (Bêta 27) disponible",
        "content": "Une nouvelle mise à jour de FATXplorer a été proposée afin d'améliorer  encore la solution qui permet de profiter des périphériques de stockage des consoles Xbox Orignale et de la Xbox 360, et notamment avec la prise en charge des disques durs internes jusqu'à 16 To. \n \nCette version Bêta 27 apporte le passage de la version 7.3 à 7.4 pour SmartMoonTools (Smart Monitoring Tools), et de nombreuses mises à jour, notamment des correctif liés au BSOD sous Windows 7 ou encore des pilotes Windows 11 ARM. \n \nDes correctifs ont aussi été apportés pour le nouvel outil XL HDD Fix afin de réparer l'erreur E69 sur les disques durs XL.\n \n\n \nChangelog :\n \n- Mise à jour des SmartMonTools inclus de v7.3 à v7.4.\n- Nouvelles fonctions des outils de sécurité du disque dur dans le menu Options :\n- Déverrouiller le périphérique sélectionné à l'aide du mot de passe : cette nouvelle fonction permet de déverrouiller les périphériques à l'aide du mot de passe utilisateur complet de 64 caractères si vous le connaissez. Elle propose également de supprimer le mot de passe utilisateur une fois le déverrouillage effectué. Cette fonction est utile pour récupérer les mots de passe directement à partir du micrologiciel du disque, et peut également être utilisée à d'autres fins que celles de la Xbox.\n- Afficher la clé du disque dur de l'appareil sélectionné : Pour les périphériques que FATXplorer a réussi à déverrouiller, vous pouvez utiliser cette option pour copier la clé du disque dur qui a été utilisée.\n- Pilote mis à jour en v22.0.8623. Cette version comporte 2 corrections importantes. Les mises à jour du pilote peuvent nécessiter un redémarrage.\n- Correction d'un problème où un BSOD se produisait lors de l'installation ou de la mise à jour du pilote sur les systèmes Windows 11 ARM (MacBook).\n- Correction du problème de BSOD NTFS_FILE_SYSTEM aléatoire sous Windows 7.\n- La date d'expiration est désormais fixée au 6 décembre 2023.\n \n \nTéléchargement : FATXplorer V3.0.0.25018 (Bêta 27)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177885/in-xoxb360-fatxplorer-v30025018-beta-27-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS5] La version 0.2 Bêta du jailbreak PS5 BD-J Tools",
        "content": "Le développeur John Tornblom vient de mettre en ligne une nouvelle version de son utilitaire de Jailbreak PS5 BD-J Tools, comme vous le savez il s'agit d'une ISO précompilée qui intègre plusieurs fonctionnalités.\n \nCe sont plusieurs fonctions qui ont été introduites avec cette nouvelle version 0.2 Bêta, comme par exemple le service FTP, le service Klog ou encore la possibilité de désactiver ou d'activer les mises à jour PS5, des informations sur le matériel PS5 comme la version du système d'exploitation ou la possibilité de charger des ELF, des JAR ou des LUA sur différents ports. \n \n \n \n\n \n \n \nComme nous pouvons le voir, les possibilités offertes s'approchent de celles de Libhijacker, comme la capacité du loader à fonctionner même après l'arrêt du lecteur BD-J.\n \n \nChangelog PS5 Jailbreak BD-J Tools v0.2 Beta :\n \n[+] FTP Service \n[+] Klog Service \n[+] My PS5 information\n[+] Disable or Enable PS5 Updates\n[+] OS hardware information\n[+] ELF parasitic process \n \n \nTéléchargement : PS5 BD-J Tools 0.2 Bêta\n \n \n",
        "images": {}
    },
    "news_6": {
        "title": "[Vita] PSP2DipswTool disponible pour la PS Vita",
        "content": "Le développeur Mathieulh a publié un tout nouvel outil développé par Princess-of-Sleeping et qui se destine à la PlayStation Vita. \n \n \n\n \n \n \nCet outil vous permettra, au delà de ressortir votre PlayStation Vita, d'activer ou de désactiver les différents DIPSW. Vous l'aurez compris cet outil se destine principalement aux développeurs et aux utilisateurs expérimentés car une mauvaise manipulation pourrait entrainer des dommages irréversibles pour votre console. \n \n \n\n \n\n \n\n \n\n \n \nTéléchargement : PSP2DipswTool\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177871/in-vita-psp2dipswtool-disponible-pour-la-ps-vita-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1177871/in-vita-psp2dipswtool-disponible-pour-la-ps-vita-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1177871/in-vita-psp2dipswtool-disponible-pour-la-ps-vita-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1177871/in-vita-psp2dipswtool-disponible-pour-la-ps-vita-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1177871/in-vita-psp2dipswtool-disponible-pour-la-ps-vita-5.png"
        }
    },
    "news_7": {
        "title": "[Switch] Le rapport Yuzu fait état de nombreuses modifications",
        "content": "Le rapport de GoldenX86 et CaptV0rt3x vient de sortir pour Yuzu, dommage que la concurrence ryujinx ne fasse pas autant puisque cela va faire 2 mois désormais que nous n'avons pas eu de rapport. \n \nLes utilisateurs de Yuzu, appelés Yuz-ers, vont pouvoir bénéficier d'encore de nombreuses nouveautés et optimisations de leur émulateur préféré, l'équipe rapport avoir travaillé à plein régime durant le mois d'Aout. \n \nAinsi comme tous les mois, l'équipement en charge du développement nous informe qu'elle a travaille sur les limitations GPU, sur plusieurs correctifs du système de fichiers, sur la prise en charge du framework Skyline, ou encore sur le support d'Android et MacOS. \n \n \n\n \n \nDe nombreuses optimisations GPU ont été apportées, avec des mises en mémoire cache spécifique, d'autres optimisations comme sur le rendu ont été effectuées, et certaines parties du développement relèvent comme des véritables défis, comme le développeur Blinkhawk qui a décidé de retravailler le cache de requêtes pour résoudre des problèmes et moderniser le code. \n \n \n\n \n \nIl y a encore beaucoup à faire comme analyser le Dynamic GPU Duo, comma la gestion de la mémoire tampon, ou encore sur OpenGL qui indirectement améliore aussi Vulkan. \n \n \n\n \n \nEnfin une longue liste de titres dont les versions eShop ne pouvaient pas démarrer auparavant sont désormais exécutables parfaitement jouables, et leurs RomFS peuvent être entièrement dumpées.\n \nTous ces changements et bien plus encore se trouvent ici : yuzu-emu.org\n \n \nPetite information complémentaire, Cemu, le petit émulateur Wii U lui aussi est de retour avec la version expérimentale Cemu v2.0-49 \n \nTéléchargement : Cemu v2.0-49 (expérimentale)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177852/in-switch-le-rapport-yuzu-fait-etat-de-nombreuses-modifications-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1177852/in-switch-le-rapport-yuzu-fait-etat-de-nombreuses-modifications-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1177852/in-switch-le-rapport-yuzu-fait-etat-de-nombreuses-modifications-1.png"
        }
    },
    "news_8": {
        "title": "[PS4/PS5] mast1c0re supporte le firmware 11.00 (PS4) et 3.00 &#38; 4.51 (PS5)",
        "content": "Le support partiel des firmwares 11.00 sur PS4, et de l'ensemble des firmwares 3.00 à 4.51 (notamment le 4.00) a été ajouté à l'exploit mast1c0re.\n \n \n\n \n \nLe développeur McCaulay vient en effet de rajouter aujourd'hui le support du firmware 11.00, en ouvrant les offsets nécessaires, et il a fait de même pour les firmwares 3.00 et 4.51 de la PS5. \n \n \nTéléchargement : mast1c0re\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177851/in-ps4ps5-mast1c0re-supporte-le-firmware-1100-ps4-et-300-451-ps5-1.png"
        }
    },
    "news_9": {
        "title": "[PS4/PS5] Les firmwares 8.00 pour la PS5 et 11.00 pour la PS4 sont là",
        "content": "Sony dévoile ses nouveaux firmwares à destination de la current-gen et de la old-gen, ne parlons plus de next-gen désormais vu que nous arrivons au troisième anniversaire de la PS5.\n \nCommençons par celle-ci, Sony vient de dévoiler le nouveau firmware 8.00 de la PS5, comme vous le savez, les firmwares terminant par x.00 sont des propositions majeures avec des grands changements. \n \nCette mise à jour massive apporte donc de nombreuses fonctionnalités suite à une longue phase de bêta test. Ce firware PS5 8.00 prend en charge le Dolby Atmos, jusqu'à 8 To pour le SSD M.2 et aussi des évolutions sur une manette d'assistance lorsque vous utilisez une manette sans fil DualSense ou DualSense Edge, ou une manette tierce prise en charge par la PS5 comme manette principale.\n \nL'ensemble des changements se trouve ici : system-software-info 8.00\n \n \n \n\n \n \n \nCôté \"Old-Gen\", c'est le firmware 11.00 qui est proposé pour la PS4, avec cette version il sera possible de se log dans sa PS4 sans mot de passe avec l'App PS, vous pouvez scanner un QR code comme sur PS5, et via des notifications. \n \nVous allez pouvoir également profiter des réactions via des emoli dans vos messages, et d'ailleurs Sony a amélioré l'utilisation et la lisibilité des messages et de quelques écrans. \n \nComme toujours, ces versions majeures n'apportent pas de nouvelles sécurités, ce sont davantage les numérotations intermédiaires qui servent à cela, mais si vous en avez la possibilité le mieux est de rester sur le firmware le plus bas. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177807/in-ps4ps5-les-firmwares-800-pour-la-ps5-et-1100-pour-la-ps4-sont-la-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] Les exploits Webkit et Kernel compatibles (enfin) avec le firmware 4.00",
        "content": "Vous le saviez probablement mais le firmware 4.00 était un peu le parent pauvre du hack PS5, à savoir qu'aucune solution n'avait été porté sur ce firmware. Assez bizarre, aucun offset, aucun hack, le firmware 4.00 était jusqu'alors le seul firmware à ne pas bénéficier d'une solution officielle, comme nous le rappelle Wololo.net. \n \n \n\n \n \nLa principale raison était que les fonctions critiques du kernel, qui sont accessibles lorsqu'on réalise les décalages d'offsets corrects, n'avaient pas été travaillés par les développeurs, ou du moins n'étaient pas connus officiellement. \n \nC'était jusqu'à aujourd'hui puisque Specter vient officiellement aujourd'hui de référencer son exploit pour supporter officiellement le firmware 4.00.\n \n \n \n\nBien entendu, ce support amène tout ce qu'il faut à savoir les offsets permettant d'accéder aux fonctions spécifiques du kernel, ces valeurs sont toutes différentes d'un firmware à l'autre, parce que tout simplement les bibliothèques sont différentes, ou bien parce que Sony ajoute du code ou tente de protéger les sécurités. \n \nSur PS4, c'était clairement plus simple de trouver ses décalages, mais sur PS5, les processus se sont complexifiés du fait qu'il n'est possible de lire la mémoire du kernel, il faut donc passer par la force brute. Sans trop de surprise, il semble que les offsets sont assez proche de ceux trouvé sur les firmwares 4.02 et 4.03, cependant le mapping permettant d'exécuter les gadgets pour exécuter les premières étapes de l’exploit (chaîne rop), est très différente. Il était donc impossible que l'exploit fonctionne sur le firmware 4.00 sans ces changements.\n \nTéléchargement : PS5-IPV6-Kernel-Exploit offsets 4.00\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177767/in-ps5-les-exploits-webkit-et-kernel-compatibles-enfin-avec-le-firmware-400-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1177767/in-ps5-les-exploits-webkit-et-kernel-compatibles-enfin-avec-le-firmware-400-1.png"
        }
    },
    "news_11": {
        "title": "[Switch/PS4/Vita] pEMU v6.7.1 disponible",
        "content": "Notre ami sunriseur et développeur Cpasjuste nous propose de découvrir une nouvelle version pEMU, qui pour rappel est une suite de différents émulateurs \"p\" tels que pFBA, pSNES, pNES... Voilà donc que débarquent donc la version 6.7.1 de pFNB, pfbNEO, et pNES pour la Sony PS4, Linux et la Nintendo Switch.\n \nAvec cette nouvelle version, les fichiers inconnus sont désormais ajoutés à tous les émulateurs et un \"gamelist.xml\" distinct peut être utilisé. Le rapport hauteur/largeur et la mise à l'échelle des polices peuvent être ajustés et les extensions de fichiers peuvent être masquées dans la liste des ROM. De plus, une résolution de 720p est désormais toujours appliquée.\n \nPour pNES, le core Nestopia a été mis à jour vers la v1.52.0 , le chemin des données a été corrigé et les boutons A/B de la Switch ont été échangés. pFBN, pSNES et pGEN ont également été mis à jour vers la dernière version de FB-Neo/Genesis Plus GX/Snes9x .\n \n \n\n \n \nChangelog \n \n- commun : nettoyage du code de chargement des médias\n- commun : ajout des fichiers inconnus même s'ils n'existent pas dans gamelist.xml\n- commun : modification de la position des éléments du menu\n- commun : correction des chemins des jeux commençant par ./\n- commun : correction des chemins des médias avec le format recalbox gamelist.xml\n- commun : ajout de la possibilité d'utiliser un fichier gamelist.xml personnalisé dans les dossiers roms, remplaçant le fichier gamelist.xml intégré (romfs)\n- commun : ajout de l'option SHOW_AVAILABLE pour cacher les fichiers/roms/systèmes manquants de la gamelist (redémarrage requis)\n- ui : meilleure gestion de la résolution automatique de l'écran\n- ui : ajout d'une option de mise à l'échelle des polices\n- ui : ajout d'une option de ratio d'aspect\n- ui : ne pas montrer les extensions dans la liste des roms\n- skins : correction de la taille des boutons start et select \n- Skins : correction de la position du titre du menu d'option\n- skins : retrait du grand skin (font scaling and aspect ratio options should be enough now)\n- skins : ajout config.cfg.override et config.cfg.override.43 support\n- skins : permet/corrige skin override du répertoire data\n- pnes : passage de nestopia à 1.52.0\n- pnes : correction des chemins de données (sauvegardes nestopia, etc...)\n- pfbneo : passage à la dernière version de fbneo\n- pgen : passage à la dernière version de Genesis-Plus-GX  \n- pgen : correction des grésillements audio de la vita (chute des fps)\n- psnes : passage à la dernière révision de psnes \n- vita, 3ds, windows : compilation des correctifs\n- vita : activation du driver cps3 back (OPTION_LIGHT)\n- vita : correction de la version de l'application dans la création du sfo\n- switch(pnes) : inversion par défaut des boutons A/B \n- switch : force la résolution 720p\n \nTéléchargement : pEMU v6.7.1\n \n \nMerci Cpasjuste ! \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177753/in-switchps4vita-pemu-v671-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[PS5] TheFlow confirme que son exploit Bluray fonctionne sur le firmware 7.61",
        "content": "Le 10 Août 2023 Sony lançait le firmware 7.61 pour la PlayStation 5, et comme tous les firmwares récents, impossible de lancer en théorie un exploit qu'il soit webkit ou bien lié au lecteur bluray. \n \nEt bien cette affirmation est désormais fausse puisque TheFlow vient d'annoncer que son exploit 0day bd-jb fonctionne parfaitement sur le dernier firmware, à savoir le 7.61.\n \n \n\n \n \n \nBien entendu, il précise qu'il faut aussi que l'exploit soit implémenté, ce qui avait été effectué par sleirsgoevy en Juin 2022, et donc il rajoute qu'il pense que la vulnérabilité utilisée par sleirsgoevy est corrigée, ce qui est effectivement le cas autour du firmware 6.50. \n \n \nDonc cela pourrait signifier que l'exploit BD-JB pourrait être porté sur un firmware inférieur au 7.61, et supérieur au 4.51.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177751/in-ps5-theflow-confirme-que-son-exploit-bluray-fonctionne-sur-le-firmware-761-1.jpg"
        }
    },
    "news_13": {
        "title": "[Vita] PPSSPP 1.16 disponible",
        "content": "L'équipe en charge du développement de PPSSPP est de retour, le développement est plutôt en dents de scie, à savoir que nous avons eu le plaisir de découvrir plusieurs versions durant le mois de Mai 2023, mais depuis c'était le calme plat, et pareil en début d'année jusqu'au mois de Mai.\n \nTant et si bien que cette version 1.16 est la sixième version officielle de l'année 2023, ce qui au final n'est pas énorme mais permet de proposer de nombreuses corrections. \n \n \n \n\n \n \n \n \nChangelog 1.16 :\n \n- Remerciements particuliers à [Unknown] pour les nouveaux compilateurs JIT, et à fp64 pour avoir enfin découvert l'instruction vrnd.\n- Support des RetroAchievements ([#17589], [#17631], et bien d'autres). Voir RetroAchievements sur ppsspp.org.\n \nNouveaux backends JIT :\n- RISC-V, basé sur IR\n- JIT x86 basé sur IR. Souvent plus rapide que l'existant.\n- Corrections sur les entrées\n \n Amélioration du comportement en cas de conflit entre les entrées analogiques et numériques ([#17960])\n- Le mappage des combinaisons est maintenant désactivé par défaut ([#17673])\n- Android : Meilleur suivi des noms de périphériques ([#17562], auto config)\n- Correction de la correspondance entre les boutons tactiles personnalisés et les entrées analogiques ([#17433])\n \nPerformances de rendu et corrections\n- Correction du scintillement dans WWE Smackdown vs Raw 2006 ([#18009]), scintillement vidéo dans Naruto 2 ([#18008])\n- Correction des mauvaises couleurs dans le menu de Syphon Filter : Logan's Shadow ([#17965])\n- Sur les périphériques bas de gamme, éviter les shaders \"uber\" en raison de bugs de performance et de pilotes ([#17449], [#17922])\n- Désactivation de V-sync sur Android avec Vulkan, plus de plateformes SDL ([#17903], [#18087])\n- Sur Vulkan, réduction du décalage d'entrée lorsque \"Buffer graphics commands\" est désactivé ([#17831])\n- Diverses améliorations mineures ([#17810], [#17505], [#17478], [#17471], [#17452], [#17446], [#17442])\n- Correction des ombres dans MotorStorm ([#17602]) (pas vraiment un problème de rendu)\n- Correction d'un problème de rendu dans Lunar Silver Star ([#17451])\n- Ajout d'un cache pour MakePixelsTexture, améliorant les performances dans God of War ([#17534])\n- Beaucoup d'améliorations du moteur de rendu logiciel ([#17571], [#17569], [#17619], [#17621], [#17618], [#17609], ...)\n \nMise en réseau\n- La prise en charge HTTPS est désormais activée dans le magasin et pour RA sur Windows, Android, Mac, iOS ([#17744], ...)\n- Ad-hoc : Correction du problème Metal Gear Acid avec Link Battle ([#17947])\n \nCorrections de remplacement de textures\n- Correction des problèmes de texture de Tactics Ogre ([#18001], [#18011])\n- Correction d'un problème de filtrage anisotropique ([#17930])\n- Correction de problèmes sur D3D11 avec les textures KTX2 ([#17749])\n \nModifications de l'interface utilisateur\n- Support des emoji en couleur sur certaines plateformes ([#17854], [#17856])\n- Utilisation des polices TTF sur SDL lorsqu'elles sont disponibles (macOS, Linux/Steam Deck) ([#17844]), support du HiDPI ([#17651])\n- Permet de régler directement l'adresse MAC de la PSP ([#17755])\n- Amélioration des notifications ([#17606], [#17674], [#17672])\n \nCodes de triches\n- Correction du chargement des bases de données de triche sur les appareils Android avec un espace de stockage limité ([#17834])\n- VR (Quest, autres appareils VR Android)\n \n- Améliorations du mode écran de cinéma ([#17704], [#17752])\n- Mode passthrough pour Quest uniquement ([#17591])\n- Nettoyages, corrections de compatibilité, réglage des paramètres VR par jeu ([#17636], [#17656], [#17598], [#17518])\n \nAutres\n- Correction d'un horrible problème audio dans After Burner ([#18076])\n- Emulation précise de l'instruction vrnd ([#17506], [#17549])\n- Correction d'un problème de timing causant des ralentissements dans les matchs de MLB ([#17676], [#17677])\n- Prise en charge du clavier UWP, nombreuses autres mises à jour ([#17952], [#17974])\n- Possibilité de choisir la résolution de l'écran sur Android ([#17473])\n- Correction d'un problème d'exécution de certains types de fichiers hors du dossier Download sur Android ([#17466])\n \n \n \nTéléchargement : PPSSPP 1.16\n \n \n \n \n \n \n",
        "images": {}
    },
    "news_14": {
        "title": "[XBO] Artifice, un outil personnalisé pour amener des privilèges en mode développeur",
        "content": "Le développeur Kudayasu vient d'ouvrir les portes de son travail connu sous le nom de code Artifice, sous ce nom semble se trouver un travail collossal permettant de proposer un outil personnalisé conçu pour réaliser une escalade des privilèges de manière autonome pour le mode développeur de la Xbox One.\n \n \n\n \n \n \nUn superbe article présente Artifice :\n \nComment fonctionne l'outil par ordre chronologique\nPourquoi certaines méthodes ont été créées d'une manière particulière\nCe que vous pouvez accomplir avec des privilèges élevés\n \n \n\n \n \n \nL'article explique les 10 étapes qui permettent d'arriver en temps qu'utilisateur avec les droits administrateurs actifs, et ainsi vous allez pouvoir : \n \n- Désactivez les nombreux services de télémétrie ( fortement recommandé) \n- Fouillez correctement avec PWSH ( fortement recommandé NtObjectManager ) \n- Exécutez votre propre logiciel\n- Explorez et modifiez le registre à distance \n- Dumpez votre flash\n- Chargez manuellement les pilotes du kernel tels que KsDumper ( Durango ) \n- Créez votre propre \" superposition \" xvd pour SystemOS (avec quelques mises en garde) \n- Déboguer le mode utilisateur avec dbgsrv + windbg (éviter les problèmes de pare-feu avec clicon )\n \n \nTout est là : Artifice v1.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177725/in-xbo-artifice-un-outil-personnalise-pour-amener-des-privileges-en-mode-developpeur-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1177725/in-xbo-artifice-un-outil-personnalise-pour-amener-des-privileges-en-mode-developpeur-2.png"
        }
    },
    "news_15": {
        "title": "[PS5] Specter dévoile un payload pour décrypter les fichiers PS5",
        "content": "Specter vient d'annoncer la disponibilité d'un tout nouveau payload permettant de décrypter les fichiers SPRX et SELF sur tous les firmwares exploitables, l'information a été reprise par Wololo.net ici. \n \nJusqu'à ce jour, le décryptage de fichiers n'était possible que sur le firmware 4.03 grâce à l'utilisation du débogeur Prosper0 de Sleirsgoevy, mais comme quoi cela continue de bouger puisque cette possibilité est désormais possible sur tous les firmwares exploitables. \n \n \n\n \n \n \nLa plupart des fichiers PS5, y compris les binaires système, les bibliothèques des applications, et les jeux sont cryptés, leur décryptage est la première étape pour analyser leur contenu et leur sécurité, et ainsi trouver des vulnérabilités. \n \n \n\n \n \n \nLa sortie de ce payload fait suite à une annonce de Specter sur \" X \" qui a laissé entendre que quelques chose a été opéré sur la PSP ( Platform Secure Processor ). \n \nLe code source doit être compilé et il faudra utiliser une clé USB avec de nombreuses étapes, ce qui n'est pas facile pour des utilisateurs peu expérimentés. \n \nLe code sera amélioré avec notamment une possibilité de sortir plus facilement, pour augmenter la stabilité ou encore améliorer diverses fonctions. \n \nDans sa présentation de hardwear_io, il avait expliqué à quel point les attaques portant uniquement sur les données peuvent être sous-estimées. Il prouve que le décryptage des fichiers système en envoyant des messages à la PSP avec uniquement la lecture arbitrage en lecture/écriture du kernel est possible. \n \n \nTout est là : SpecterDev\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177713/in-ps5-specter-devoile-un-payload-pour-decrypter-les-fichiers-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1177713/in-ps5-specter-devoile-un-payload-pour-decrypter-les-fichiers-ps5-1.jpg"
        }
    },
    "news_16": {
        "title": "[2DS/3DS/DS] TWiLight Menu++ v26.1.0 et nds-bootstrap v1.0.0 disponibles",
        "content": "Le développeur RocketRobz propose à la scène 3DS de découvrir une nouvelle version de TWiLight Menu++ et de nds-bootstrap qui passent respectivement en v26.1.0 et 1.0.0.\n \nLe rythme d'une version par mois est maintenu, c'est une bonne chose pour TWiLightMenu++ qui pour rappel est un menu alternatif, open source et personnalisable pour lancer des homebrews DS, jeux et roms DS, GBA, BD via la DS, 3DS ou 2DS.\n \nCette version de nds-bootstrap prend enfin en charge  Golden Sun : The Dark Twilight . Toute personne intéressée peut trouver une explication complète de ce qui devait être fait sur GitHub. De plus, certains programmes Nintendo tels que NTR EVA/Aging et Wii Sequencer fonctionnent désormais également.\n \n \n\n \n \nLes jeux DSi ne plantent plus après un certain temps sur la 3DS et la compatibilité globale a encore été améliorée.\n \nDans  TWiLight Menu++, le correctif anti-piratage pour le hack ROM \"Pokémon: Refined Gold Overhaul\" a été mis à jour vers la version 2.0 et la prise en charge des couvertures transparentes a été ajoutée. Bref, comme nous pouvons le voir le programme évolue dans le bon sens. \n \n \nTéléchargement : TWiLightMenu / nds-bootstrap\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177705/in-2ds3dsds-twilight-menu-v2610-et-nds-bootstrap-v100-disponibles-1.jpg"
        }
    },
    "news_17": {
        "title": "[Wii] Priiloader 0.10.0 : Version Kappa compatbile vWii",
        "content": "Développé par DacoTaco, PriiLoader est un programme issu d'une version modifiée et améliorée de Preloader 0.30, il a su évoluer notamment l'année dernière en amenant le support de la Wii Mini. Comme vous le savez cet utilitaire permet de réparer des semis-bricks, permet d'activer et de paramétrer le menu système, la Homebrew Channel, BootMii IOS ou encore d'ajouter  des correctifs pour bloquer les mises à jour.\n \nDans cette nouvelle version la grosse nouveauté est qu'il est disponible en version stable, mais c'est surtout l'arrivée du support du mode Wii de la Wii U. \n \n \n \n \n\n \n \n \n \nTechniquement, le priiloader de la vWii fonctionne en  remplaçant l'index de démarrage du menu système de la vWii par celui du  loader BC-NAND NAND , qui est également une  image ancast signée  . BC-NAND démarre ensuite l'index de démarrage 1, qui est remplacé par le priiloader - l'original à l'index 1 est déplacé à la fin du contenu du titre. Le priiloader déchiffre ensuite l'image ancast et la corrige afin que l'index de boot1 soit transmis à la fin et que le menu système déchiffré soit démarré.\n \nSystem Menu 1.0 est également pris en charge et après l'installation et le retour au menu système, Priiloader s'affiche directement, ce qui facilite la configuration sur une Wii Mini car aucun clavier USB n'est requis. Les hacks qui bloquent le démarrage automatique d'un disque, suppriment le scintillement de l'image et marquent toutes les connexions réseau comme « testées » sont également nouveaux. De plus, les disques Wii et, sur les systèmes pris en charge,  GameCube peuvent être lus, en contournant la vérification de la région. En plus de nombreuses corrections de bugs, une option a également été ajoutée pour revenir au fichier installé .\n \n \nTéléchargement : Priiloader 0.10.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177701/in-wii-priiloader-0100-version-kappa-compatbile-vwii-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS4] Psx2Ps4 v1.5.1, nouvel emulateur et ajout du multi-discs",
        "content": "Voici la version 1.5.1 de mon script PSX 2 PS4.bat vous permettant d'injecter vos propre ISO ps1 afin de les exécuter sur vos PS4.  Petite update de mon script en 1.5.1, qui ajoute le nouvel émulateur PS1 officiel de Sony (Syphon Filter v3) apportant une meilleure compatibilité des titres PS1, des corrections de sons, de glitchs et bien d'autres...J' ai également enfin ajouté le multi-discs (sous certaines conditions) permettant de jouer aux titres PS1 contenant plusieurs CD (comme la plus part des Final Fantasy par exemple). Mais attention !!! Seul les jeux permettant la sauvegarde AVANT le swap disc fonctionneront, en effet une fois la save créé (avant le swap disc) il vous suffira de lancer le 2ème CD (dans les options de l'émulateur) et de charger cette même save tout juste créé...  Vidéo tuto:  Changelog: v1.0:- Release de base v1.1:- Ajout du support Multi CD, 4 cds possible (merci @Oxeres pour la manip)- Ajout d' une option Compilation (5 jeux max par PKG)- Ajout du 60hz pour les jeux PAL- Modification du CUSA en SLUS V1.2:- Support des fichiers configs- Support des fichiers .lua- Ajout d' une option Tuto Vidéo V1.3:- Nouveau mode Expert- Création des .TOC- Fusion des .bin- Nouvelle vidéo tuto pour la création du .TOC- Ajout d'un lien vers les config et .lua V1.4:- Création du .toc automatiquement (merci à Goatman13  pour le .exe)- Ajout d'une option pour choisir entre 50 hz ou 60hz pour les jeux PAL V1.5:- Fusion des .bin automatiquement (la partie Merge et Toc totalement automatique)- Ajout d' une option pour skipper les logos Playstation et Sony- Ajout d'une option pour skipper l image d'aide Start-Select (manette ps4)- Ajout d' une option pour ajouter un nouveau Bios- Ajout d' une option pour avoir 60 FPS- Ajout d' une option pour changer le bouton de validation (X > O)- Ajout de l' icône Save-data.png- Correction d' un bug qui affectait les .cue V1.5.1:- Ajout du nouvel émulateur officiel Sony (Syphon Filter v3)- Ajout du Multi-discs (sous certianes conditions) Pour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:https://www.paypal.com/paypalme/markus00095 Télécharger Psx2PS4 v1.5.1 ",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177662/in-ps4-psx2ps4-v151-nouvel-emulateur-et-ajout-du-multi-discs-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1177662/in-ps4-psx2ps4-v151-nouvel-emulateur-et-ajout-du-multi-discs-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS4] PS4 PKG Tool v1.6 et PS4 Syscon Tools v1.6 disponibles",
        "content": " \nA quelques heures d'intervalles viennent de sortir les versions 1.6 de deux logiciels pour la PlayStation 4 et PlayStation 4 Pro, il s'agit de PS4 Syscon Tools et de PS4 PKG Tool.\n \nPS4 Syscon Tools v1.6\n \nProposé par Abkarino, bien connu de la scène PS3, PS4 Syscon Tools est l'alternative gratuite à tous les outils de dumps. Avec son ami EgyCnq, le développeur s'est mis en tête de faire autant voir mieux que les solutions payantes, de là sont nés PS4 Syscon Tools et PS4 Syscon Flasher, le premier est une solution gratuite (software & hardware) qui vous permet de manipuler la puce Syscon originale de la PlayStation 4 (Renesas RL78/G13). \n \n \n \n\n \n \n \nPS4 Syscon Tools v1.6 Changelog :\n \n- Ajout de la prise en charge du nouveau firmware PS4 Syscon Flasher v2.01.\n- Correction d'un problème qui faisait que l'application se bloquait pendant le processus de dumping dans certains cas.\n- Correction d'un problème dans l'obtention d'informations sur le firmware syscon dans certains cas.\n- Ajout d'une fonction de vérification automatique après le processus d'écriture partielle du firmware.\n- Ajout d'une fonction de vérification automatique après le processus d'écriture SNVS/NVS.\n \nPS4 Syscon Flasher v2.01 Changelog :\n \n- Optimisation et amélioration du processus de dumping du firmware.\n- Correction d'un problème sur les firmware Teensy 4.0 & Teensy 4.1 qui empêchait le PS4 Syscon Flasher de faire des glitchs sur les syscons non debug mode.\n- Nettoyage du code.\n \nTéléchargement : PS4 Syscon Tools v1.6\n \n \n \nPS4 PKG Tool v1.6\n \nProposé par Pearlxcore, PS4 PKG Tool est un outil PS4 PKG Tool qui est livré en version 1.6, et cette nouvelle version apporte de nombreuses corrections. Cet outil nous permet d'afficher la bibliothèque PS4 PKG, de gérer et d'effectuer diverses opérations sur vos PKG comme :\n \n- Scannez et visualisez votre collection de la bibliothèque PS4 PKG.\n- Visualisez les informations sur les PKG telles que les paramètres de l'ECG, la liste des trophées de l'ECG et l'entrée de l'ECG.\n- Renommez et exportez les noms des PKG vers un fichier Excel.\n- Vérifier la mise à jour du PKG.\n \n \n\n \n \nChangelog 1.6 :\n \n- Migration de PS4 PKG Tool et des bibliothèques associées vers .NET 7.\n- Ajout d'une option pour extraire complètement les fichiers PKG dans l'onglet View and Extract.\n- Activation de la sélection multiple pour les opérations PKG. (Problème n°46)\n- Correction de l'erreur de lecture du fichier PKG pour Homebrew Store et Remote Package Installer. (Problème n°52)\n- Correction de l'erreur de lecture du fichier PKG dans le lecteur flash. (Problème n°50)\n- Correction de l'erreur de lecture du fichier PKG dans le répertoire racine. (Problème n°40)\n- Ajout des balises \"(Patch)\" au nom de fichier du PKG de patch pendant le renommage du PKG pour éviter les conflits de noms.\n- Activation de la sélection de plusieurs fichiers pour extraire les fichiers PKG.\n- Ajout de caractères génériques de dénomination : {SYSTEM_VERSION}, {VERSION}. (Problème n°41)\n- Ajout d'une couleur personnalisée pour les étiquettes PKG dans la vue grille en fonction de la catégorie PKG (Game, Patch, Addon, App).\n- Ajout d'une option pour déplacer les fichiers PKG dans des dossiers séparés en fonction du titre et de sa catégorie (Game, Patch, Addon, App). Format du nom du dossier : Titre (Titre Id). (Problème n°57)\n- Ajout d'une colonne Backport dans la vue grille, permettant aux utilisateurs d'ajouter des étiquettes/remarques de backport aux fichiers PKG (Expérimental).\n- Ajout d'une option pour vérifier les fichiers PKG dupliqués.\n- Ajout du filtrage des PKG par application.\n- Amélioration de l'affichage et de l'extraction de la liste des fichiers PKG.\n- Amélioration de la journalisation.\n- Déplacement des noms personnalisés de renommage du PKG dans les paramètres du programme.\n- Modification de l'espace réservé à la dénomination.\n- Modification du nom du dossier temporaire de l'outil PS4 PKG en \"PS4PKGToolTemp\", qui sera désormais créé dans le répertoire local du programme.\n- La configuration du programme est maintenant stockée dans \"Settings.conf\" dans le dossier \"PS4PKGToolTemp\".\n- Modification du style de l'interface utilisateur.\n- La vérification de la rétrocompatibilité avec la PS5 est désormais une option. Les utilisateurs doivent télécharger manuellement le PS5 Backward Compatibility Status JSON dans les paramètres du programme pour utiliser le PS5 Backward Compatibility check. Le fichier JSON de rétrocompatibilité PS5 (\"ps5bc.json\") sera téléchargé dans \"PS4PKGToolTemp\".\n- PS4 PKG Tool n'est plus fourni avec l'outil de publication de Sony et \"curl.exe\". Les utilisateurs doivent placer manuellement les fichiers requis dans \"PS4PKGToolTemp\".\n- Suppression de l'icône du menu de la bande d'outils (Le projet a été crashé et a perdu quelques icônes, j'ai décidé d'enlever tout).\n- L'option View PKG Change Info est maintenant activée pour les catégories PKG.\n \n \nTéléchargement : PS4 PKG Tool v1.6\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177633/in-ps4-ps4-pkg-tool-v16-et-ps4-syscon-tools-v16-disponibles-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1177633/in-ps4-ps4-pkg-tool-v16-et-ps4-syscon-tools-v16-disponibles-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] ldn_mitm 1.16.0 disponible",
        "content": "Le développeur Spacemeowx2 a mis en ligne une nouvelle version de son KIP personnalisé, ldn_mitm est désormais proposé en 1.16.0. \n \nLe module ldn_mitm, si votre console est bannie ou que vous souhaitez tout simplement vous protéger d'un éventuel ban, vous permet de prendre en charge presque tous les jeux supportant le réseau sans fil local. Ce fichier KIP, nommé Ldn_mitm, vient en complément de switch-lan-play. Le module n'avait pas été mis à jour depuis Mars 2023.\n \n \n \n \n\n \n \n \n \nEn mettant à jour les bibliothèques Atmosphere sous-jacentes, ldn_mitm prend désormais en charge à la fois le dernier firmware et la dernière version d'Atmosphere.\n \n \nListe de compatibilité : ici\n \nTéléchargement : ldn_mitm 1.16.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177629/in-switch-ldn-mitm-1160-disponible-1.png"
        }
    }
}