{
    "news_1": {
        "title": "[Switch] Yuzu sort son rapport de Novembre 2023",
        "content": "La Team Yuzu vient de dévoiler son rapport de novembre 2023, et elle nous informe qu'elle a proposée de nombreuses évolutions et de corrections essentiellement au niveau de la gestion GPU. \n \nCe sont des corrections au niveau du GPU mais aussi de nouveaux pilotes, des changements importants sur Android/ARM, encore plus de travail sur les applets, et bien entendu des projets encore top secret. \n \nComme nous l'explique la Team Yuzu elle a travaillé sur la musique de Super Mario Bros mais aussi amélioré les graphismes, notamment les utilisateurs nVidia qui faisaient face à un rendu défectueux. \n \nLe projet NiCE est le passage d'un émulateur PC compatible Android à un émulateur Android totalement \"natif\". \n \nLa prise en charge de NCE (Native Code Execution) implique un travail important dans le code GPU, et il convient de recompiler certaines choses pour les rendre compatible nativement avec les appareils ARM. Un travail important là encore à été effectué par GPUCode et byte[]. \n \n \n\n \n \nDes modifications graphiques importantes ont également été opérées avec notamment un paramètre nommé Force maximum clocks qui semble causer beaucoup de confusion pour les utilisateurs. Un paramètre à l'origine intégré pour résoudre des problèmes AMD, certaines cartes AMD souffrant de downclocking sévère. Force maximum clocks, qui sur le bureau Yuzu génère simplement une charge de calcul factice à exécuter sur le GPU, déclenchant l'horloge forcée de la carte. Bien que cela corrige le problème et place les performances des cartes AMD à égalité avec celles de NVIDIA (et aide même les cartes NVIDIA dans certains scénarios), exécuter une charge de calcul comme celle-ci n'est pas une option viable pour les GPU intégrés. Il a fallu corriger certaines choses afin d'être prudent avec son utilisation. \n \n \n\n \n \nLa Team explique ensuite les divers changements qu'elle a pu faire notamment suite à la sortie du firmware 17.0.0, puis sur le pilote Vulkan des pilotes Vega et Polaris qui est plus ancien que celui du pilote matériel basé sur RDNA, et tous les GPU AMD exécutant cette configuration mixte exécuteront un seul pilote Vulkan. Cela entraîne un recul des fonctionnalités et des correctifs pour le GPU basé sur RDNA juste pour maintenir la compatibilité.\n \n \n\n \n \nBref, encore un billet très complet, qu'il reste intéressant de découvrir ici : https://yuzu-emu.org/entry/yuzu-progress-report-nov-2023/\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-650931029.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-690845378.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1527683436.png"
        }
    },
    "news_2": {
        "title": "[PS4/PS5] PS4 Reaper Studio intègre le support de la PS5",
        "content": "Le développeur ShininGami propose une nouvelle version de PS4 Reaper Studio, qui passe en version v01.0.4.1. Ce logiciel est un studio de développement destiné aux utilisateurs PC sous Windows, et il permet de les aider à créer et partager des cheats pour les jeux PS4, il succède à MultiTrainer. \n \nPS4 Reaper Studio intègre un débogueur, un convertisseur, un code training pour tester les codes et les cheats, avec des calculateurs et un éditeur hexadécimal. \n \nLa grosse nouveauté de cette version est l'arrivée du support de la console PS5, car ce logiciel se sert de PS4Debug sur PS4 et donc désormais de PS5Debug sur PS5. \n \nCette mise à jour intègre de nombreux correctifs pour la PS5, des crashs, des optimisations le changelog intégral se trouve sur le Ko-fi.com du développeur. \n \n \n\n \n \nChangeLog 1.0.2.128745 public beta 3.2 (mis à jour par CTN) :\n-Correction des offsets pour PS5.\n-Correction d'un espace à la fin d'un nouveau nom de projet qui fait que le projet n'est pas trouvé.\n-Correction d'un crash lors de l'ajout de commentaires (//) asm avec des caractères [,].\n-Correction d'un blocage lors de l'ajout de nouvelles lignes au milieu du code asm.\n-Correction d'un blocage lors de l'utilisation de GetStack avec une valeur dépassant la profondeur de la pile.\n-Correction d'un crash lorsque le titre du projet ne correspond pas au jeu en cours.\n-Correction de l'importation de shn avec une section non-0.\n-Activation de la fonctionnalité Analyse de l'exécutable, de l'organigramme et de la fonction de recherche. (Expérimental)\n--->Désactivée par défaut, peut être activée via le menu Options.\n-Mise à jour de la présentation de l'organigramme.\n-Correction d'un problème avec les fonctions vides dans l'organigramme.\n-Ajout d'une option pour activer/désactiver l'organigramme, la fonction de recherche et l'analyse exe.\n-Correction d'un crash du jeu lors de l'activation d'une triche avec un élément de la liste déroulante non sélectionné.\n-Ne se déconnecte pas si l'identifiant du titre est incorrect.\n-Correction de la fusion du code des grottes où les grottes sont fusionnées incorrectement.\n-Correction des breakpoints < 0x400000.\n-Correction du problème du convertisseur \"ToASM\" avec les sauts en double.\n \nTout est là : PS4 Reaper Studio v1.0.4.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183711/in-ps4ps5-ps4-reaper-studio-integre-le-support-de-la-ps5-1.jpg"
        }
    },
    "news_3": {
        "title": "[3DS/Switch/GC] PKHeX du 18.12.2023 disponible",
        "content": "Il y a quelques heures a été publiée la toute dernière version de PKHeX, comme vous le savez avec PKHeX les utilisateurs peuvent manipuler divers fichiers de sauvegarde .sav,.dsv,.dat,.gci,.raw et .bin. PKHeX peut également lire et écrire les fichiers .pk, qui sont des fichiers Pokémon individuels, et les fichiers .pgt,.pcd,.pgf,.wc, qui sont des fichiers Mystery Gift.\n \nCette nouvelle version de leur outil Nintendo 3DS, Switch, et de la Gamecube apporte le support de .NET 8 proposé par Microsoft, mais aussi le support de la version 3.0.0 de Scarlet et Violet, mais aussi tout un tas de corrections X et Y, entres autres. \n \n \n \n\n \n \n \nChangelog : \nModifié : PKHeX utilise désormais .NET 8 pour son runtime (mis à jour à partir de .NET 7) !\nNécessite un système d'exploitation Windows 64bit, avec le .NET Desktop Runtime 8.0.x\nhttps://dotnet.microsoft.com/en-us/download/dotnet/8.0\nAjout du support pour Scarlet & Violet 3.0.0 (Indigo Disk)\nLégalité : Ajout de rencontres / changements selon les ajustements du DLC Indigo Disk.\nIl y aura toujours des problèmes avec les croisements, Minior, et les emplacements des rencontres. Ces problèmes seront résolus lors de la prochaine version.\nCorrigé : Le comportement du rerolling du PID de Manaphy Gen4 a été mis à jour. Merci @Lincoln-LM !\nAjouté : L'aperçu au survol affiche maintenant une info-bulle personnalisée. L'ancien comportement peut être rétabli via les paramètres.\nAjouté : Edition de la position/rotation de la carte Gen6-9. Merci @abcboy101 !\nAjouté : Gen6 XY Roamer editor. Merci @foohyfooh !\nAjouté : Editeur d'accessoires musicaux pour la Gen5. Merci @foohyfooh !\nAjouté : Gen4/5 Chatter editor. Merci @abcboy101 !\nAjouté : Convertisseur Gen4 KOR<->INT/JPN pour les fichiers de sauvegarde. Merci @abcboy101 !\nAjouté : Gen2 Mystery Gift item / unlock flag editing. Merci @RainingChain !\nCorrection : String conversion has been rewritten for easier maintenance. Les prochaines mises à jour géreront mieux les cas de Farfetch'd et autres.\nCorrigé : Les noms de pays/régions de la Gen6/7 pour le dernier manifeste régional de la 3DS. Merci @abcboy101 !\nCorrigé : Le cheat Pokétch Unlock Gen4 met à jour le nombre total d'applications maintenant. Merci @foohyfooh !\nCorrigé : Le cheat Gen4 Complete Dex met à jour correctement les bitflags féminins. Merci @DeadSkullzJr !\nCorrigé : Les flags de Gen3 Colosseum Fateful Encounter lisent/écrivent maintenant correctement en fonction du contexte du fichier de sauvegarde japonais/international.\nCorrigé : Les sauvegardes Gen3 Mainline mettent à jour les index de courrier de la partie lorsqu'il n'y a pas d'objet détenu par courrier (empêche l'icône de courrier invalide).\nCorrigé : Les sauvegardes Gen1 RBY qui n'ont pas encore reçu de starter se différencient maintenant correctement. Merci @fattard !\n \n \nTéléchargement : PKHeX du 18.12.2023\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183691/in-3dsswitchgc-pkhex-du-18122023-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[Switch] NSZ 4.6.1 disponible",
        "content": "Le développeur Nicoboss (Nico Bosshard) dévoile ce qui sera probablement la dernière version de NSZ de 2023. \n \nComme vous le savez il s'agit d'un script python qui permet de proposer le format de compression spécifique à la scène Switch, qui vous permet de compresser et décompresser les fichiers .nsz.\n \nLes fichiers NSZ sont très proches des NSP, ils sont compressés, ce n'est pas tout à fait un nouveau format, le script est assez simple à utiliser, et sachez que NSC_Builder prend en charge la compression de fichier NSP dans NSZ et la décompression de fichier NSZ dans NSP.\n \nCette version 4.6.0 succède à la 4.5.0 proposée le 01 Octobre 2023, les changements sont pour certains des évolutions majeures pour le script alors que d'autres sont des corrections de bugs.\n \n \n\n \n \nA noter qu'un problème pourrait subvenir : \nProblème avec NSZ 4.6.0 : MPLUS1p-Medium.ttf introuvable\nLes utilisateurs concernés par le problème #154 peuvent rencontrer ce problème tel que rapporté dans le #164. Une nouvelle version de NSZ qui corrige ce problème sera déployée plus tard dans la journée. Supprimez le fichier suivant pour faire fonctionner l'interface graphique de NSZ 4.6 :\nWindows : C:\\NUsers\\N<Nom de l'utilisateur>\\NConfig.ini\nLinus : /home/<Nomd'utilisateur>/.kivy/config.ini\nmacOS : /Users/<UserName>/.kivy/config.ini\n \n \nPrincipales nouveautés\n--verify utilise désormais la validation du hachage sha256 NSP au niveau du fichier. --verify garantit maintenant que le hachage sha256 du fichier original et du fichier décompressé correspondra et donc que le fichier est recréé à l'identique.\n- Réécriture majeure de XCI/XCZ pour supporter les partitions XCI multiples : Spécifiez --keep pour conserver toutes les partitions, y compris leur contenu. Par défaut, le contenu de toutes les partitions sauf la partition sécurisée est supprimé mais la partition vide elle-même est conservée pour la compatibilité avec l'émulateur Yuzu.\n \nCorrections de bugs\n- Ajout d'un terminateur nul manquant à la fin de la table des chaînes. Ceci corrige le problème #151\n- Correction d'un problème avec l'en-tête PFS0 chevauchant le premier fichier lorsque l'option --remove-padding est utilisée.\n- Correction de la logique responsable de la gestion des tailles d'en-tête PFS0 trop courtes\n- Correction du remplissage de l'en-tête PFS0 afin qu'il soit conforme à la spécification PFS0. Ceci corrige le problème #150\n- Nous ne voulons pas toucher à la police Kivy par défaut mais plutôt utiliser LabelBase pour définir DEFAULT_FONT pour cette application spécifique. Ceci corrige #154\n- Ajout de la possibilité de lire les dumps xci complets grâce à @alucryd\n- Ajout du hachage de la clé master_key_10 grâce à @seiya-git\n- Meilleur support de la suppression des fichiers sources. Ceci corrige #141\n \nModification des arguments de la ligne de commande\n- L'option --remove-padding a été renommée --fix-padding. Ceci a été fait car cette option fait maintenant correspondre le padding de NSP au standard No-Intro.\n- Renommé --keep-delta en --keep car il n'est plus seulement utilisé pour conserver les fichiers NDV0 mais aussi pour conserver toutes les partitions XCI.\n--verify et --remove-padding sont incompatibles entre eux. Pour des raisons de compatibilité, --quick-verify sera automatiquement utilisé si cette situation se produit pour correspondre au comportement des arguments de la ligne de commande avant NSZ v4.6.0.\n \n \nTéléchargement : NSZ 4.6.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183690/in-switch-nsz-460-disponible-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS5] PS Mac Tools v1.5 disponible",
        "content": "Le développeur SvenGDK pensent aux détenteurs d'ordinateurs Apple, il vient de mettre en ligne une première version de son outil PS Multi Tools pour les Mac. \n \nSon outil porte fort logiquement le nom de PS Mac Tools, et ambitionne d'offrir les mêmes services que la version PC Windows. \n \nCette version 1.5 de PS Mac Tools intègre les librairies de sauvegardes PS5 game/app, et les outils PS5 pour MacOS.\n \n\n \n \nOutils PS5 : \n- Bibliothèques de Jeux/Applications\n- Paylaod sender (ELF, BIN & JAR)\n- Navigateur FTP\n- Dumper Grabber FTP (Game Dumper)\n- Fusion de PKG\n- Edtiteur Param & Manifest JSON \n- Graveur de disques Blu Ray\n- Téléchargements et liens\n \nS'agissant d'une nouvelle app, vous allez devoir ouvrir une exception lors du premier lancement de l'utilitaire : https://support.apple.com/en-gb/guide/mac-help/mh40616/mac \n \n \n \nTéléchargement : PS Mac Tools 1.5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183688/in-ps5-ps-mac-tools-v15-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[Multi] DS4Windows v3.3.0 amène le support .NET 8",
        "content": "Le développeur Travis Nickles, connu aussi sous le pseudo Ryochan, nous propose de découvrir une nouvelle version de DS4Windows. Comme vous le savez probablement DS4Windows est une interface efficace pour paramétrer une manette sur PC, il est basé sur un fork de Jays2Kings. Pour en profiter cela passe par un câble micro-USB, mais il est aussi possible de s'en servir sans fils avec quelques adaptateurs Bluetooth 2.1 (ou supérieur). \n \nOn se rapproche inéluctablement des dernières versions de DS4Windows, le développeur ayant annoncé l'arrêt du développement pour fin 2023, bien dommage quand on voit le travail accompli et les efforts qu'il a pu mettre dans ce logiciel, et chaque nouvelle version apporte un lot de nouveautés énormes. \n \n \n\n \n \nVersion .NET 8. est nécessaire. \n \n.NET 8 Desktop Runtime x64\nhttps://dotnet.microsoft.com/en-us/download/dotnet/thank-you/runtime-desktop-8.0.0- installateur Windows-x64 \n \n.NET 8 Desktop Runtime x86\nhttps://dotnet.microsoft.com/en-us/download/dotnet/thank-you/runtime-desktop-8.0.0- installateur Windows-x86 \n \n- Mise à jour du projet pour cibler .NET 8 Desktop Runtime\n- Bibliothèques groupées mises à jour pour cibler .NET 8\n- Ajout du projet de test unitaire initial à la solution\n- Utilisation mise à jour de la classe ProfileMigration\n- Modification de la façon dont la chaîne XML migrée est récupérée à partir de la classe ProfileMigration\n- Correction de problèmes de conversion d'anciens profils à partir de versions antérieures de DS4Windows, y compris les builds Jays2Kings\n- Forcer l'attente de la fin de la routine du mappeur avant de changer de profil. - Résout les problèmes de barre lumineuse BT principalement avec DualSense\n- Annulez l'enregistrement anticipé du DataContext utilisé pour lier les VM. - Purgez la mémoire plus tôt et réduisez l’utilisation de la mémoire. Merci à kurtanr d'avoir identifié le problème\n- Desserrer le mappage analogique à la molette de la souris\n- Augmentation du RWC pour FlickStick dans l'éditeur. Autoriser une limite supérieure de 200\n- Modification de la technique pour arrêter la routine de mappage à partir du thread d'entrée. Permet à certaines routines de continuer à s'exécuter pendant le chargement du profil\n- Assurez-vous que l'instance XmlReader est fermée après avoir utilisé la classe ProfileMigration\n- Ajustements rapides de démarrage du serveur UDP\n- Ajoutez les identifiants des boutons manquants aux gyroTriggerItems. Contribution de christranq\n- DEL DualSense : échangez les lecteurs 4 et amp; joueur 6. Contribution de RobbyCBennett\n \n \n \nTéléchargement : DS4Windows v3.3.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183645/in-multi-ds4windows-v330-amene-le-support-net-8-1.png"
        }
    },
    "news_7": {
        "title": "[PS3] PS3netsrv 20231215 d'Aldostools disponible",
        "content": "Le développeur Aldostools, Aldo Vargas, vient de dévoiler sur Twitter/X qu'il propose une nouvelle version de son application ps3netsrv portant donc la référence 20231215. ps3netsrv est un programme PC qui vous permet de diffuser du contenu sur votre console PS3.\n \n \nCette nouvelle version intègre la recherche d'extensions redumps .key et .dkey au format binaire (16 octects) et hexadécimal (32 octects). Comme vous vous en doutez, cette mise à jour est en relation directe avec les modifications opérées par Nathan Martin pour son CFW Evilnat 4.90.2.\n \n \n\n \n\n \n \nPour utiliser ps3netsrv vous avez deux possibilités, soit utiliser l'interface graphique prévue à cet effet, soit si vous êtes un utilisateur un peu plus averti, vous pouvez taper des lignes de commandes.\n \n \nTéléchargement : PS3netsrv 20231215\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183644/in-ps3-ps3netsrv-20231215-daldostools-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1183644/in-ps3-ps3netsrv-20231215-daldostools-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[Wii U] NUSspli se met à jour en version v1.143",
        "content": "Les développeurs V10lator, Xpl0itU, et dependabot-bot se sont efforcés de mettre à jour NUSspli en corrigeant de nombreux bugs, comme vous le savez il s'agit du dernier loader et installateur de packages pour la Nintendo Wii U qui s'appuie sur un fork de l'excellent WUPDownloader de Poke303.\n \n \n\n \n \nEn effet, NUSspli est un plugin qui vous permet d'installer du contenu directement depuis les serveurs de mise à jour Nintendo sur votre Wii U. Cette mise à jour permet encore et toujours d'améliorer la stabilité de l'outil, qui est proposé pour toutes les versions et tous les formats existants, que ce soit pour Aroma, pour la Homebrew Channel, HBL ou encore en version Lite, et Debug. \n \n \n\n \n \nCette nouvelle version corrige des problèmes liés au cache, apporte des modifications de récupération , et des options permettant de se passer des intros.\n \nChangelog\n \nv1.143 \n- Correction de la vérification RPXLoader_GetPathOfRunningExecutable(). \n \nv1.142\n- Créer un journal des modifications  \n- Correction du cache  \n- Modifier la profondeur de récupération. \n- Expérimental : autoriser l'installation d'ensembles sans introduction.  \n- Bump actions/upload-artefact de 3 à 4  \n- Demande d'extraction de fusion #259 de V10lator/dependabot/github_actions/actions/upload-artifact-4  \n- Faire passer zlib de 79a0e44 à 643e17b \n- Déprécier les fonctions de mémoire statique.  \n- Ajoutez plus de débogage au vérificateur d'environnement.  \n- Boucle de bosse.  \n- WIP : Imprimer l'erreur CFW à l'écran. \n- Terminez le dernier commit.\n \n \nTéléchargement : NUSspli\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183643/in-wii-u-nusspli-se-met-a-jour-en-version-v1143-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1183643/in-wii-u-nusspli-se-met-a-jour-en-version-v1143-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS4] Le DLC Valhalla déjà proposé en backport sur 5.05/6.72/7.xx/8.xx/9.00",
        "content": "Il y a déjà 3 jours sortait le DLC gratuit de God of War Ragnarol nommé Valhalla, à ne pas confondre avec un certain Assassin's Creed. \n \nEntièrement gratuit ce contenu s'accompagne d'une mise à jour 5.01 pesant quelques 8.8 Go sur PS4, nous avons droit à toutes les versions que ce soit celle de CyB1K que celles de Opoisso893.\n \n \n \n\n \n \n \nBien entendu cette mise à jour vient également corriger des bugs et optimiser certains éléments de gameplay. \n \n \n\n \n \nCorrections de bugs\n \nÉquipement :\n- Correction d’un problème qui faisait que la bannière de la Lance Draupnir n’avait plus l’air améliorée lorsqu’elle était utilisée en transmogrification.\n- Correction d’un problème qui empêchait l’armure de taille Flawless Berserker d’avoir un effet lumineux.\n \nLocalisation : \n- Correction d’un problème d’alignement qui faisait chevaucher une icône avec le diagramme du contrôleur.\n \nProblème connu :\n- Si un utilisateur installe God of War Ragnarök: Valhalla avant d’installer God of War Ragnarök, puis essaie de lancer le DLC avant la fin du téléchargement du jeu de base, il obtiendra un écran de chargement infini.\nSOLUTION DE CONTOURNEMENT: Terminez le téléchargement de God of War Ragnarök avant de tenter d’accéder au DLC.\n \nTout est là : blog.playstation.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183617/in-ps4-le-dlc-valhalla-deja-propose-en-backport-sur-5056727xx8xx900-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] Le PlayStation Portal s'offre une mise à jour firmware 2.0.5",
        "content": "Le ou La PlayStation Portal vient de s'offrir une mise à jour firmware, en proposant la mise à jour 2.0.5 Sony souhaite améliorer la stabilité du système. \n \nL'idée de cette mise à jour est également d'optimiser les messages et la convivialité de certains écrans comme nous en informe le développeur emuonpsp. \n \n \n \n\n \n \n \nA noter aussi qu'une mise à jour a été publiée pour la DualSense, ce qui laisse supposer qu'elles sont indirectement liées. \n \n \n \n\n \n \n \nPSPortal v2.0.5 est sorti....\nQue signifie l’amélioration de la stabilité ?\n \n===\nVersion : 2.0.5\nStabilité améliorée du logiciel système.\nMessages améliorés et opérabilité sur certains écrans.\n \n \n \nPour l'heure, il n'existe pas de hack lié à la PlayStation Portal, à quoi cela pourrait servir de modifier un tel périphérique, à part pour y faire tourner des OS différents, pas très intéressant pour les développeurs. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183614/in-ps5-le-playstation-portal-soffre-une-mise-a-jour-firmware-205-1.jpg"
        }
    },
    "news_11": {
        "title": "[Switch/PC/Android] Nouvelle version disponible de NooDS (rolling release)",
        "content": "Le développeur Hydr8gon vient de sortir une nouvelle version de son émulateur NooDS\nL'objectif de NooDS est d'être un émulateur Nintendo DS rapide et portable. Ce n'est pas tout à fait là en terme de vitesse, mais il offre la plupart des autres fonctionnalités que vous pouvez attendre d'un émulateur DS. Il prend même en charge la rétrocompatibilité GBA ! Je fais ça pour le plaisir et comme expérience d'apprentissage, et aussi parce que je suis un grand fan de la DS. Ce n'est peut-être pas encore un concurrent digne des autres émulateurs DS, mais je pense que je pourrai y arriver un jour. Sinon c'est bien aussi ; comme je l'ai dit, je m'amuse juste !\n \nCe projet n'a donc pas de changelog à chaque mis à jour, mais au bout de plusieurs versions consécutives des nouvelles seront données pour rappeler l'existence du projet et ainsi pousser les utilisateurs à tester ce dernier et faire des retours au développeur.\n \nLes dernières modifications : \n- Android : correction de quelques problèmes de disposition des boutons\n \nNooDS est disponible pour Linux, macOS, Windows, Switch, Vita et Android. Les builds automatiques sont fournis via\nGitHub Actions ; vous pouvez les télécharger à partir de la page des versions",
        "images": {
            "image_1": "https://d1eh9yux7w8iql.cloudfront.net/product_images/1525772372.19.jpg"
        }
    },
    "news_12": {
        "title": "[PS3] Une option pour décrypter les ISO 3k3y/Redump dans Evilnat 4.90.2",
        "content": "Le développeur Nathan Martin, Evilnat, vient de dévoiler sur Twitter / X une option qui sera intégrée dans son prochain CFW, l'Evilnat 4.90.2.\n \nComme le présente Evilnat, cette option vise à permettre le décryptage permanent des ISO 3k3y/Redump à l'aide de la clé disque (disk key). Même si elle doit encore être testée, cette nouvelle option sera innovante.\n \n \n\n \n \n \nIl rajoute qu'il aimerait ajouter à Cobra la possibilité de décrypter les ISO à la volée, mais il n'a pas encore trouvé la solution technique.\n \n",
        "images": {}
    },
    "news_13": {
        "title": "[PS5] PS5CodeReader v1.0.0.2 disponible",
        "content": "Le développeur amoamare dévoile un nouvel utilitaire à destination des PlayStation 5, la console commence à devenir intéressante.\n \nIl s'agit par ailleurs d'un simple outil permettant sous Windows de lire le registre UART de la console PS5 et de le supprimer, déjà 3 versions ont été proposées par le développeur. \n \n \n\n \n \n \nA noter que son utilisation ne nécessite pas de droit administratif, il permet de lire les logs UART et de les effacer, sachant que les runtimes .net 7.0 sont nécessaires pour le faire fonctionner : https://dotnet.microsoft.com/en-us/download/dotnet/7.0\n \nDans la version 1.0.0.2 proposée il y a quelques minutes, le développeur a ajouté des options pour d'autres consoles PlayStation, une mise à jour et correction du journal clair, ajouté un mode moniteur pour écouter l'UART si quelque chose doit être transmis, et ajouté la possibilité d'annuler des opérations. \n \n \n\n \n \nIl en a profité pour modifier l'interface utilisateur et ajouté une boîte d'opérations pour effectuer d'autres opérations, il a également ajouté la possibilité d'ouvrir une liste txt de commandes pour aider à trouver de nouvelles commandes.\n \n \nTéléchargement : PS5CodeReader v1.0.0.2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183560/in-ps5-ps5codereader-v1002-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1183560/in-ps5-ps5codereader-v1002-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[XB/XB360] FATXplorer v3.0 Beta 28 disponible",
        "content": "Une nouvelle mise à jour de FATXplorer a été proposée afin d'améliorer  encore la solution qui permet de profiter des périphériques de stockage des consoles Xbox Originale et de la Xbox 360, et notamment avec la prise en charge des disques durs internes jusqu'à 16 To. \n \n \n\n \n \n \nCette version Bêta 28 apporte son lot de nouveautés avec notamment le nouveau système de licence, à partir de cette version, vous pouvez désormais entrer votre numéro de série/clé de licence si vous en avez une. Une question fréquemment posée par les utilisateurs de la version beta est \"Quand/où puis-je entrer mon numéro de série ?\" La réponse est : maintenant ! Il vous suffit de le saisir lorsque FATXplorer vous le demandera. Le système de licence est entièrement nouveau et extrêmement léger. La v2.5 utilisait un système de licence tiers lourd qui n'est plus supporté. Il a été remplacé par une solution développée sur mesure.\n \n- Une connexion internet n'est pas nécessaire. Ce n'est pas nouveau, mais nous sommes dans un monde où tout nécessite une connexion internet, il est donc important de le préciser. La seule exception à cette règle est que si vous entrez un numéro de série FATXLIC, désormais obsolète, FATXplorer devra aller en ligne pour le convertir dans le nouveau format de clé de licence. Il n'est pas nécessaire d'être en ligne pour saisir une clé de licence.\n- La période d'essai est la même (7 jours).\n- Les périodes d'essai peuvent désormais être prolongées automatiquement en cliquant sur un bouton. Cela nécessite une connexion internet pour fonctionner, mais c'est une grande amélioration par rapport au système précédent où vous deviez envoyer un code de limite à l'assistance et attendre un code d'extension. Ces extensions automatiques sont soumises à certaines limites afin d'éviter les abus. Si vous n'avez pas de connexion internet sur l'appareil qui exécute FATXplorer et que vous avez besoin d'une extension d'essai, il y a aussi une option hors ligne où vous pouvez copier un ID, l'envoyer au support depuis un appareil en ligne, et ensuite entrer un code d'extension similaire à la façon dont cela fonctionne dans la v2.5.\n- La fenêtre de licence n'est plus affichée au démarrage. FATXplorer ne l'affichera que lorsqu'une fonction payante est accessible, ou lorsque vous l'invoquez depuis le menu Aide.\n- Ajout d'une vérification des partitions de cache de la Xbox 360 pour déterminer si elles sont formatées en FATX. Si ce n'est pas le cas, un message s'affichera et le montage ne se fera pas.\n- Pilote mis à jour en v22.0.8707. Correction d'un problème qui pouvait empêcher le montage sur des ordinateurs lents (1-2 cœurs de CPU). Les mises à jour du pilote peuvent nécessiter un redémarrage.\n- La date d'expiration a été modifiée au 3 mars 2024.\n \n \n \nTéléchargement : FATXplorer v3.0 Beta 28\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183559/in-xbxb360-fatxplorer-v30-beta-28-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[PS4] L'exploit kernel 9.00 de la PS4 porté vers les firmware 8.xx",
        "content": "Le développeur abc vient une nouvelle fois de montrer ses talents sur PS4, il vient en effet de prouver qu'il est possible de backporter l'exploit kernel PS4 du firmware 9.00 vers des firmwares inférieurs. \n \nDit comme ça cela peut paraitre inutile, cependant en utilisant l'exploit webkit PSFree de Celesteblue, il fait descendre l'exploit kernel ChendoChap pOOBs4 vers les firmwares 8.x, voir inférieur comme le 7.55. \n \nAvec une telle évolution, cela se permet de se passer de clé ou de dongle, et ainsi apporter l'utilisation d'exploits peu fiables des firmwares inférieurs (entre 6.72 et 8.xx) et ainsi apporter de la stabilité avec l'utilisation de pOOBs4 sur ces firmwares.\n \n \n\n \n \nC'est assez complexe, mais pour résumé cela apportera de la stabilité pour les firmware 7.55 et 8.xx, alors que jusqu'à présent il utilise du code trafiqué de kernel exploit peu stable. \n \nPour prouver ses dires il dévoile et une belle image et un script disponible ici : Script .\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183541/in-ps4-lexploit-kernel-900-de-la-ps4-porte-vers-les-firmware-8xx-1.png"
        }
    },
    "news_16": {
        "title": "[Switch] De nouvelles versions de DBI disponibles!",
        "content": "Le développeur rashevskyv a publié deux nouvelles versions de son homebrew DBI. Ces nouvelles versions apportent de nouvelles fonctionnalités, corrigent des bugs et améliorent certains points.\n \n\n \nLa version 652 est une mise à jour majeure qui apporte de nombreuses nouvelles fonctionnalités et améliorations. La version 653, quant à elle, corrige un petit problème.\n \nChangelog : \n \nDBI 653 :\n \n- Apporte une correction importante pour les petits transferts de fichiers par FTP\n \nDBI 652 : \n \n- Ajout d'une nouvelle fonctionnalité ainsi que filtrage dans les applications, les tickets et les sauvegardes\n \n- De nombreux problèmes ont été corrigés ainsi que beaucoup d'améliorations tout au long de l'homebrew\n \n- Le journal d'activité de DBI est amélioré pour une meilleure expérience utilisateur\n \n- Suppression de la traduction chinoise de DBI à la demande du traducteur\n \nTélécharger la source : https://github.com/rashevskyv/dbi/releases\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183539/in-switch-de-nouvelles-versions-de-dbi-disponibles-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] Apollo Save Tool PS4 v1.4.2 disponible",
        "content": "Le développeur Bucanero propose une nouvelle version d'Apollo Save Tool mais cette fois-ci à destination de la PlayStation 4. \n \nRentrons un peu dans le détail de cette nouvelle version, PS4 Apollo Save Tool est un utilitaire, également proposé sur PS3, et qui vous permet de gérer les fichiers de sauvegarde de jeu sur PlayStation 4 et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur votre PS4. \n \n \n\n \n \nCette version 1.4.2 apporte pas mal de corrections. \n \nAdded\nAuto-detect X/O button settings (@illusion0001)\nNetwork HTTP proxy settings support\nNew cheat codes\nGrand Theft Auto V\nMetal Gear Solid 5: The Phantom Pain\nCustom decryption support\nMetal Gear Solid 5: The Phantom Pain\nCustom checksum support\nGrand Theft Auto V\nMetal Gear Solid 5: The Phantom Pain\nShantae and the Pirate's Curse\nShantae: Risky's Revenge\n \nMisc\nInclude original keystones for 116 games\nUpdated audio library to libs3m\nUpdated apollo-lib Patch Engine to v0.6.0\nAdd host callbacks (username, wlan mac, psid, account id)\nAdd murmu3_32, jhash hash functions\nAdd Patapon 3 PSP decryption\nAdd MGS5 decryption (PS3/PS4)\nAdd Monster Hunter 2G/3rd PSP decryption\nAdd Castlevania:LoS checksum\nAdd Rockstar checksum\nFix SaveWizard Code Type C\nFix right() on little-endian platforms\n \n \nTéléchargement : Apollo Save Tool PS4 v1.4.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183506/in-ps4-apollo-save-tool-ps4-v142-disponible-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS4] Une mise à jour de GameBato Store disponible",
        "content": "Le développement de GameBato Store continue de s'opérer sur PlayStation 4 sous firmware 5.05, 7.55 et 9.00. Voilà donc que débarque un patch permettant de mettre à jour GameBato. \n \n \nComme vous le savez GameBato est un store compatible avec les firmwares 5.05, 7.55 et 9.00 de la PlayStation 4 et qui permet de profiter pleinement des capacités de la console. \n \nLes changements sans être révolutionnaires restent intéressants ainsi elle apporte la résolution d'un problème où l'application restait bloquée sur l'écran de chargement. A noter que ce correctif oblige l'arrêt des téléchargements qui seront supprimés. \n \n\n \n \nChangelog :\n \n- Correction d'un problème qui bloquait l'application sur l'écran de chargement de l'application GamBaTo.\nSi vous rencontrez ce problème, procédez comme suit :\n- Ouvrez l'application et laissez-la se mettre à jour.\n- Lorsqu'elle atteint l'écran de chargement de l'application GamBaTo, attendez 9 secondes.\n- L'application se prépare automatiquement à la réparation et quitte l'écran.\n- Rouvrez l'application et laissez-la se mettre à jour à nouveau.\n- L'application se lancera avec succès.\n \n- Après avoir appliqué ce correctif, seulement pour ceux dont l'application était bloquée, tous vos téléchargements en cours seront effacés.\n \n- Utilisez l'option Quitter dans le menu de l'application ou appuyez sur le bouton CERCLE sur l'écran principal de l'application chaque fois que vous souhaitez fermer l'application.\n \n \nTout est là : gamebatoapp.ir\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183505/in-ps4-une-mise-a-jour-de-gamebato-store-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] Un nouvelle version de PS5 Game File Dumper disponible",
        "content": "Le développeur EchoStretch nous informe via Twitter / X que d'autres jeux sont en cours de tests, clairement la solution proposée par LightningMods semble porter ses fruits, mais elle est longue car il semblerait qu'il faille patcher chaque jeu. \n \nLe développeur en est convaincu, tous les jeux vont tomber un jour ou l'autre et Spider-Man 2 en fait parti, il rappelle que tous les jeux ne fonctionnent pas encore, il n'existe pas une méthode globale, de nombreux dumps ont été envoyés, mais pour pouvoir réaliser ses dumps il faut des outils, c'est pourquoi un nouveau Game File Dumper vient d'être proposé.\n \nToujours proposé sous la forme de script python, dans cette version l'étape 2 à 6 a été remplacé\npar un processus automatique, attention pour en profiter il vous faudra Linux ou WSL2 (Sous-système Windows pour Linux 2).\n \n \n \n \n\n \n \n \n \n### Steps for dumping game files\nAt This time it seems digital games and some physical games will work\n**NOTE** PS5 SELF Dumper will only work on 4.03/4.50/4.51\n \n1) Dump Game ( Opened Game ) /mnt/sandbox/pfsmnt\n   https://github.com/logic-68/pfsmnt-dumper\n \n2) Dump Game Files (copy folder content (files and folders))\n   /system_data/priv/appmeta/PPSAXXXXX/ -->> PPSAXXXXX-app0\\sce_sys\\\n \n3) Dump Game Files (copy folder content) \n   /user/appmeta/PPSAXXXXX -->> PPSAXXXXX-app0\\sce_sys\n \n4) Open npbind.dat to see uds and trophy folder 000000080->04->0F\n \n5) uds00.ucp ( named uds.ucp )\n   /user/np_uds/nobackup/conf/NPWRXXXXX_00/uds.ucp -->>PPSAXXXXX-app0\\sce_sys\\uds\\uds00.ucp\n \n6) trophy00.ucp (named TROPHY.UCP )\n   /user/trophy2/nobackup/conf/NPWRXXXXX_00/TROPHY.UCP -->>PPSAXXXXX-app0\\sce_sys\\trophy2\\trophy00.ucp\n \n7) Decyrpt self files with sleirs ps5-self-dumper then copy files to game dir\n   https://github.com/sleirsgoevy/ps4jb-payloads/tree/bd-jb/ps5-self-dumper\n   1) Download socat\n      https://github.com/tech128/socat-1.7.3.0-windows\n   2) Place ps5-self-dumper payload in socat folder\n      https://www.sendspace.com/file/k87zug\n   3) Open PS5 browser to Specter host\n   4) Open windows cmd in socat folder and type both commands\n      socat -u FILE:dumpgame.bin TCP:<ps5 ip>:9020\n      socat -u -d -d -d TCP:<ps5 ip>:9023,reuseaddr OPEN:game.tar,creat\n   5) Open game.tar and copy/replace files in PPSAXXXXX-app0\n \n \n \nTéléchargement : ps5-game-file-dumper\n \n \n",
        "images": {}
    },
    "news_20": {
        "title": "[Switch] Status Monitor Overlay v1.0.2 disponible",
        "content": "Le développeur masagrator a dévoilé une mise à jour de son outil Status Monitor Overlay pour la Nintendo Switch. Comme son nom l'indique il s'agit d'un overlay Tesla permettant sous Atmosphere de surveiller le statut et la charge des différents composants de la Switch.\n \nL'application permet de surveiller la console Switch pendant le jeu en cours en affichant la fréquence du CPU, du GPU et de la RAM, ainsi que la température et le niveau de rotation du ventilateur. L'outil propose à ce titre six modes (profils) différents à choisir dans le menu principal, Complet , Mini , Micro , Compteur FPS , Batterie et Divers.\n \nLa mise à jour qui débarque un mois après la précédente ajoute de nouvelles options sur la configuration, notamment grâce à l'arrivée de nouvelles options  \"battery_avg_iir_filter\" et \"battery_time_left_refreshrate\", mais aussi le déplacement du graphique et du compteur FPS. \n \n \n \n\n \n \n \nChangelog : \n \n- Ajout de nouvelles clés à la configuration : Battery_avg_iir_filter et Battery_time_left_refreshrate, plus dans CONFIG\n> La modification de battery_avg_iir_filter sur true entraîne le changement de la période de tension moyenne à 45 s et à 11,25 s pour l'ampérage.\n- Suppression de toute la logique derrière le PR #56 au lieu de s'appuyer désormais sur le registre TTE max17050\n- Modification du code de communication i2c pour éviter les problèmes de lectures erronées (merci à ~lineon)\n- Déplacement du graphique FPS et du compteur FPS vers une sous-catégorie \"FPS\"\n \n \nTéléchargement : Status Monitor Overlay v1.0.2 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183486/in-switch-status-monitor-overlay-v102-disponible-1.jpg"
        }
    }
}