{
    "news_1": {
        "title": "[PS4/PS5] etaHEN et Itemzflow bientôt mis à jour par LightningMods",
        "content": "Le développeur LightningMods nous informe qu'il est en train de travailler sur des nouvelles versions d'etaHEN et d'Itemzflow. Cette solution a révolutionné le monde de la PS5 et fait bouger celui de la PS4.\n \n \n\n \n \n \nLightningMods nous informe via son profil Twitter que dans la prochaine mise à jour d'etaHEN et d'Itemzflow, il existera une option pour ouvrir itemzflow si vous maintenez le bouton PS enfoncé via un raccourci à l'échelle du système pour rouvrir rapidement Itemzflow.\n \n \n \n\n \n \n \nIl y a fort à parier que cette nouvelle option (comme nous pouvons le voir sur la vidéo il s'agit de la version 1.6) ne soit qu'une partie des nouveautés qui seront introduites, il ne reste plus qu'à patienter un peu avant de pouvoir en profiter. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186645/in-ps4ps5-etahen-et-itemzflow-bientot-mis-a-jour-par-lightningmods-1.png"
        }
    },
    "news_2": {
        "title": "[PS4] Une nouvelle version de PSFree d'abc disponible",
        "content": "Le développeur abc propose une nouvelle version de PSFree qui aurait été optimisée pour démarrer beaucoup plus rapidement. \n \nPSFree est un exploit webkit qui permet un démarrage beaucoup plus rapide que les autres exploits disponibles sur PS4, surtout sur le firmware 9.00, et il permet en plus d'élargir le support du 6.00 au 9.60 contrairement aux autres exploits qui sont souvent limités à quelques firmwares.\n \nEncore mieux, PSFree est supporté sur PS5, mais il faut encore qu'un exploit kernel soit adapté, ce qui n'est pas encore le cas. \n \nEn attendant, les développeurs peuvent s'entraîner sur PS4, et optimise déjà PSFree, abc proposant une nouvelle version bénéficiant d'un démarre beaucoup plus rapide estimé en 2 secondes couplé avec GoldHEN 2.4b16.2.\n \n \n \n\n \n \n \n \nLes hosts vont devoir être remis à jour, mais cela en vaut clairement la peine. \n \n",
        "images": {}
    },
    "news_3": {
        "title": "[Multi] Dolphin fait son rapport après 3 mois",
        "content": "L'équipe en charge du développement de l'émulateur Dolphin est de retour avec un nouveau rapport après les fêtes de fin d'année, il est temps pour eux, sur le blog, de se remettre au travail.\n \n \n\n \n \nEt cette fois-ci, l'équipe aborde une série de changements qui couvrent à peu près tout ce que vous pouvez imaginer. Pour ceux qui souhaitent profiter des derniers homebrews avec DSP-HLE, Dolphin prend désormais en charge les derniers microcodes homebrew ! Pour les jeux de détail, une mise à jour mineure du microcode Zelda-HLE a été appliquée pour corriger un effet manquant depuis longtemps.\n \nDans des nouvelles plus importantes, pour ceux d'entre vous qui ont des problèmes d'espace disque lorsqu'ils utilisent Dolphin sur Windows depuis la dernière beta, un correctif est maintenant disponible. Et pour ceux qui recherchent l'image la plus claire possible, l'heuristique mipmap de Dolphin a été réduite pour permettre des mipmaps de plus haute résolution sur plus de textures. \n \n \nEt bien sûr, si vous voulez une image parfaite, les rapports d'aspect personnalisés permettront d'utiliser plus facilement les hacks pour écran ultra-large et bien plus encore ! Ajoutez à tout cela une énorme correction de bugs pour les anciennes révisions des Steam Decks, un autre chapitre de la saga Bounding Box, voir un classique d'une toute nouvelle façon, et encore un autre chapitre de pilotes GPU cassés, et vous avez un rapport d'avancement de Dolphin.\n \n \n\n \n \n \nTout est là : Dolphin\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186634/in-multi-dolphin-fait-son-rapport-apres-3-mois-1.jpg"
        }
    },
    "news_4": {
        "title": "[PS3] webMAN-Mod mis à jour par aldostools",
        "content": "Le développeur aldostools, Aldo Vargas, vient de publier une mise à jour de webMAN-Mod pour la PlayStation 3. \n \nwebMAN est un plugin développé par Deank qui permet de lancer des backups de jeux PS3, PS2, PS1, PSP ainsi que des Blu-ray ou des DVD, stocké sur disque dur (y compris en NTFS) ou sur le réseau local, au format JB ou ISO. M@tsumot0 et Aldostools ont proposé une version MOD de webMan, apportant notamment le support de 21 langages utilisant des fichiers externes, un installer/updater pour CFW Cobra et NonCobra, le spoof IDPS/PSID, la désactivation des syscalls du cfw, et de nombreuses autres évolutions qui se sont succédées.\n \n \n \n\n \n \nChangelog : \n \n- Mise à jour de ps3netsrv 20240210 \n- Ajout de la conversion des dossiers PS3 en ISO local.\n- Ajout du décryptage des ISO PS3 cryptées en ISO locales.\n- Glisser-déposer un dossier ou un ISO PS3 crypté pour une conversion automatique.\n- Ajout d'un outil makeiso basé sur ps3netsrv pour une utilisation plus facile.\n \n \nTéléchargement : webMAN_MOD_1.47.45_Installer.pkg / ps3netsrv_20240210.zip\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186632/in-ps3-webman-mod-mis-a-jour-par-aldostools-1.png"
        }
    },
    "news_5": {
        "title": "[PS5] Les DLC des fpkgs PS4 bientôt sur PS5",
        "content": "Le développeur idlesauce vient de mettre en ligne un script qui va faire bouger les choses pour la PS5, il s'agit de ps4-5-eboot-dlc-patcher. \n \nL'information ne vient pas de nulle part, c'est BedroZen qui nous informe que nous avons maintenant un moyen d'activer le DLC pour les fpkgs PS4 sur PS5. \n \nPar contre, cette proposition nécessite plus de travail, mais il est possible de voir davantage de fpkgs modifiés publiés pour que tout le monde puisse les télécharger. \n \nLe développeur BredoZen propose déjà 2 jeux PS4 qui activent désormais le DLC sur PS5, Resident Evil Village PS4 et House Flipper PS4.\n \n \n\n \n \nUtilisation :\n \n1. extraire eboot.bin de la mise à jour (ou du pkg de base si vous n'avez pas de mise à jour) et le désosser.\n2. chargez eboot.elf dans IDA (assurez-vous de sélectionner PS4 - Main Module - ASLR type lors de l'ouverture, si vous ne voyez pas cette option, il se peut que eboot.bin soit encore un fself)\n3. attendez que l'analyse se termine. La barre en haut devrait être principalement bleue (fonctions régulières).\n4) Allez dans File->Script file... et sélectionnez le script python de ce github.com.\n5. suivez les instructions, si vous voyez Patching complete c'est bon.\n6. extrayez tous les fichiers du pkg de mise à jour.\n7 Remplacez le fichier eboot.bin du dossier Image0 du pkg de mise à jour extrait par notre fichier patché (renommez-le en eboot.bin).\n8. pendant le processus de patching, on vous demande d'entrer une liste d'identifiants de contenu, l'ordre de ces identifiants est l'ordre dans lequel le nouveau dossier dlc doit être :\n \nGEDLC00000000001 -> dlc0/\nTRAUMAPACK000000 -> dlc1/\nGEPREDLC00000001 -> dlc2/\n \nCréez ces dossiers dans le dossier Image0 de la mise à jour extraite, puis extrayez le contenu de l'Image0 de chaque dlc dans leur dossier dlcx/ respectif.\n9. remballez (repackez) le pkg de mise à jour et vous avez terminé.\n \n \nTout est là : ps4-5-eboot-dlc-patcher\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186586/in-ps5-les-dlc-des-fpkgs-ps4-bientot-sur-ps5-1.jpg"
        }
    },
    "news_6": {
        "title": "[Wii/WiiU] WiiStation v3.0 disponible",
        "content": "Le développeur xjsxjs197 vient de mettre à jour WiiStation, comme vous le savez l'émulateur WiiSX-RX a changé son nom en WiiStation, pour rappel le programme permet d'émuler les titres de la PlayStation 1 (PS1 / PSX / PSone) sur les consoles Wii et Wii U, basé à son tour sur le port de PCSX-Reloaded et avec beaucoup plus de modifications que PCSX-ReARMed.\n \nL'image peut désormais être affichée en 240p . Le lightgun, la souris et le multitap sont désormais supportés et il est également possible de forcer le mode NTSC. En utilisant les modules actuels de PCSX ReARMed, la compatibilité et la vitesse de l'émulateur ont été encore améliorées . Pour les jeux où Lightrec Dynarec ne fonctionne pas, vous pouvez désormais choisir l'ancien kernel Dynarec. De plus, des paramètres individuels peuvent enfin être enregistrés pour chaque jeu.\n \n \n \n \n\n \n \n \n \nChangelog :\n \n- Prise en charge 240p/Lightgun/Souris/Multitap.\n- Prise en charge du format compressé CHD v1-v5.\n- Ajout du force mode ntsc.\n- Logique de décodage PCM réécrite à l'aide de l'instruction unique appariée,\nIl y a une légère augmentation de la vitesse correspondante.\n- Importation des derniers modules SPU, GPU, BIOS, Cdrom et autres de PCSX ReARMed.\n- Ajout d'une fonction de sauvegarde distincte, chaque jeu peut enregistrer ses propres paramètres.\n- Ajout de l'ancien core de compilation dynamique, pour les jeux où le core Lightrec ne peut pas fonctionner, vous pouvez essayer l'ancien core de compilation dynamique.\n- Beaucoup d'autres corrections mineures.\n \nTéléchargement : WiiStation 3.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186555/in-wiiwiiu-wiistation-v30-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[Switch] Moonlight Switch v1.0.0 disponible",
        "content": "Le fork de Moonlight-NX, auparavant connu sous le nom de Moonlight-libreto, Moonlight Switch passe en version 1.0.0. Pour rappel Moonlight est l'implémentation open-source du protocole GameStream de nVidia, ce qui implique l'utilisation d'une carte graphique nVidia compatible PC vers la Switch. \n \nSi vous avec un PC avec une carte graphique NVIDIA, il vous suffit de downloader nVidia Expérience et d'activer le partage d'application SHIELD dans les options.\n \nEnsuite sur votre SWITCH ou même sur un smartphone Android vous pouvez installer Moonlight pour vous connecter sur votre PC et jouer aux jeux partagés.\n \nLes jeux partageables doivent être compatibles nVidia Experience, attention tous ne le sont pas mais il existe une astuce c'est de partager un exécutable Windows (par exemple mstsc.exe) et vous aurez accès à tout votre PC Windows depuis la Switch et ensuite pourrez lancer n'importe quel jeux.\n \n \n \n\n \n \nCette version 1.0.0 apporte la prise en charge de la saisie SixAxis, et d'un mode de saisie tactile, et pas mal d'autres améliorations. \n \n \nNouveautés :\n \n- Prise en charge des SixAxis\n- Mode de saisie tactile\n- Prise en charge des transitaires NSP\n \nAméliorations :\n \n- Meilleures gestion des vibrations \n- Stabilité de l'application\n- Écran de blocage pour les applications lancées en mode applet\n- Moonlight-Common-C mis à jour vers la dernière version\n \n \nTéléchargement : Moonlight-Switch v1.0.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186525/in-switch-moonlight-switch-v100-disponible-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS4/PS5] Les firmwares 9.00 Beta et 11.50 Beta 2.00 en test",
        "content": "Sony vient de convier certains utilisateurs à tester les firmwares 11.50 Bêta 2 sur PS4 et firmwares 9.00 Bêta sur PS5. \n \nLes mises à jour ont été envoyées à certains testeurs, et comme toujours il est conseillé de ne pas mettre votre console en mise à jour automatique, mais les apports de ces firmwares sont réels. \n \n \n \n\n \n \nAméliorations audio du contrôleur sans fil DualSense intégrées et contrôleurs haut-parleurs \n- Nous avons mis à jour le logiciel de l'appareil des contrôleurs sans fil DualSense et DualSense Edge pour améliorer leurs fonctionnalités sonores. \n- Améliorations apportées par le haut-parleur du contrôleur. Les haut-parleurs de contrôleur peuvent maintenant produire un son plus volumineux, ce qui vous permet d'entendre plus clairement les sons dans le jeu et l'audio du chat vocal. \n- Amélioration de l'annulation du bruit. La qualité d'entrée de micro sur ces contrôleurs a été améliorée, grâce à un nouveau modèle d'apprentissage automatique d'IA. Le bruit de fond provenant des appuis sur les boutons et de l'audio du jeu est supprimé, ce qui donne une meilleure expérience de chat vocal. Installez le logiciel système bêta et mettez à jour le logiciel de l'appareil de contrôleur pour profiter d'une plus grande clarté de votre audio de chat vocal lors de l'utilisation du micro contrôleur. \n- Avec cette mise à jour, vous pouvez avoir l'impression que les sons provenant de votre haut-parleur de contrôleur peuvent sembler plus fort. Vous pouvez régler le volume du haut-parleur du contrôleur à partir du centre de contrôle. \n \nInteractions de l'écran \n- Les joueurs regardant Share Screen en mode plein écran peuvent maintenant utiliser des pointeurs et des réactions emoji pour interagir avec le gameplay de l'hôte. \n- Les spectateurs peuvent déplacer un pointeur, envoyer un ping ou tracer une ligne sur l'écran partagé, ce qui leur permet de mettre en évidence certains objets ou zones pour guider plus précisément le lecteur hôte. Les spectateurs peuvent envoyer des réactions basées sur des emoji à l'écran de l'hôte pour encourager et célébrer visuellement les actions de gameplay. \n- Remarque: cette fonctionnalité est disponible par défaut mais peut être désactivée par l'hôte dans les paramètres de l'écran de partage. L'hôte et le spectateur doivent participer à la bêta pour utiliser cette fonctionnalité pendant la période bêta. \n \nAjuster la luminosité de l'indicateur de puissance PS5 \n- Vous pouvez maintenant ajuster la luminosité de l'indicateur de puissance de votre console PS5. \n \n \nBien entendu, vous vous doutez bien que les améliorations ne sont pas les seules apports de ces versions, qui peuvent aussi corriger des failles utilisables ou exploitables par certains. \n \nA noter que Michael Crump propose depuis quelques heures de découvrir l'implémentation de l'exploit RCE sur PS4 et PS5. \n \n \n\n \n \n \nPour rappel, cette faille a été corrigé au dessus du firmware 11.00 sur PS4 et 8.20 sur PS5. \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186523/in-ps4ps5-les-firmwares-900-beta-et-1150-beta-200-en-test-1.jpg"
        }
    },
    "news_9": {
        "title": "[Retro] Hacker une Xbox originale aujourd'hui avec un JTAG CPU !",
        "content": "Hacker la Xbox originale aujourd'hui avec un JTAG, cela n'a pas d'intérêt mais c'est tellement fun de faire ça que c'est ce s'est mis en tête Markus Gaasedelen.\n \nSortie en novembre 2001, la Xbox originale était la première aventure de Microsoft dans l'industrie des consoles de jeux. Avec son matériel ressemblant beaucoup à un PC bon marché mais polyvalent du début des années 2000, l'appareil a été immédiatement surveillé par des amateurs techniques cherchant à y exécuter du code « homebrew » et des systèmes d'exploitation alternatifs.\n \nAu cours de sa vie, la Xbox a été piratée unilatéralement grâce à un large éventail d'attaques matérielles et logicielles. Mais à 20 ans d'âge, ce système Pentium III basé sur Intel constitue une plate-forme étonnante pour apprendre ou explorer une multitude de sujets liés à la sécurité et à l'ingénierie des systèmes informatiques qui sont toujours d'actualité à ce jour.\n \n \n\n \n \nPour s'éloigner de notre contenu habituel, cet article exploite une certaine nostalgie pour relever un défi lancé par certaines des premières réflexions des chercheurs Xbox originaux : « pirater » la Xbox originale via le processeur Intel x86 JTAG.\n \n \n\n \n\n \nLa Xbox originale, contrairement aux autres consoles des années 2000, disposait d'une architecture simple, un processeur Intel et un GPU nVidia, avec de la mémoire unifiée. La sécurité de la Xbox reposait fortement sur un bootrom « secret » de 512 octets soigneusement caché dans le  Southbridge nVidia MCPX. Moins de trois mois après son lancement, ce bootrom secret a été tristement célèbre par Andrew « bunnie » Huang, ouvrant ainsi la console à des recherches plus approfondies.\n \n \n\n \nBunnie a dumpé la ROM secrète à l'aide d'un FPGA sur le bus HyperTransport alors qu'elle quittait le MCPX en direction du Northbridge/GPU, avant de passer par le bus frontal jusqu'au CPU. Cette attaque (entre autres) est décrite en détail dans le livre de Bunnie de 2003 : « Hacking The Xbox » (maintenant gratuit.).\n \n \n\n \n\n \nEn poussant un peu les recherches, le développeurs se sont aperçus que Microsoft avait intentionnellement relié la broche TRST à la terre sous le processeur Xbox dans le but de désactiver l'interface Intel JTAG et de dissuader quiconque de fouiller en ce sens.\n \nPlus important encore, la boîte noire inversant les instructions JTAG privées d'Intel afin d'interroger la mémoire, les registres ou d'effectuer d'autres actions de type débogueur était considérée comme non exploitable. \n \n \n\n \nDans son article de blog, Markus Gaasedelen détaille comment il est arrivé à exploiter le JTAG sur l'Intel x86, il a fallu un examen poussé des fiches techniques des processeurs Intel, des manuels de développeurs, des conceptions de références pour comprendre au mieux le fonctionnement des débogueurs matériels. \n \n \n\n \nSon article de blog revisite une vieille idée selon laquelle la Microsoft Xbox originale aurait pu être piratée via l'interface JTAG du processeur x86 d'Intel. Un PCB interposeur du CPU personnalisé a été créé pour transmettre les signaux JTAG à un débogueur matériel CodeTAP. Le bootrom secret de la Xbox a été dumpé avec succès via Intel JTAG, avec de réelles capacités de débogage dès la toute première instruction d'exécution, clôturant ainsi le chapitre d'une théorie vieille de 20 ans.\n \n\n \n\n \n \nSi l'article complet vous intéresse : jtag-hacking-the-original-xbox\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186388/in-retro-hacker-une-xbox-originale-aujourdhui-avec-un-jtag-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1186388/in-retro-hacker-une-xbox-originale-aujourdhui-avec-un-jtag-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1186388/in-retro-hacker-une-xbox-originale-aujourdhui-avec-un-jtag-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1186388/in-retro-hacker-une-xbox-originale-aujourdhui-avec-un-jtag-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1186388/in-retro-hacker-une-xbox-originale-aujourdhui-avec-un-jtag-5.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1186388/in-retro-hacker-une-xbox-originale-aujourdhui-avec-un-jtag-1.png",
            "image_7": "https://www.logic-sunrise.com/images/news/1186388/in-retro-hacker-une-xbox-originale-aujourdhui-avec-un-jtag-6.jpg",
            "image_8": "https://www.logic-sunrise.com/images/news/1186388/in-retro-hacker-une-xbox-originale-aujourdhui-avec-un-jtag-7.jpg",
            "image_9": "https://www.logic-sunrise.com/images/news/1186388/in-retro-hacker-une-xbox-originale-aujourdhui-avec-un-jtag-8.jpg",
            "image_10": "https://www.logic-sunrise.com/images/news/1186388/in-retro-hacker-une-xbox-originale-aujourdhui-avec-un-jtag-2.png"
        }
    },
    "news_10": {
        "title": "[Switch] Mig Switch lance MigDumpTool v0.0.1",
        "content": "La team Mig Switch vient de mettre en ligne MigDumpTool Version 0.0.1 dans sa version NRO mais aussi dans son code source.\n \nComme nous pouvions nous en douter, il s'agit d'une version C de nxdumptool réduite au strict minimum pour les cartes de jeu + la marque.\n \n \n\n \n \n02/02/2024 : Présentation de MigDumpTool, l'application de dumper de carte de jeu de Mig Switch.\n \nPour les personnes n'utilisant pas notre Mig Dumper (hardware), cette application fournit un moyen sans tracas de sauvegarder tous vos jeux Nintendo Switch et de récupérer toutes les données requises par notre carte flash Mig Switch en un simple clic !\n \nFonctions :\n- Prend en charge plusieurs périphériques de stockage de sortie (carte micro SD, PC, stockage USB).\n- Offre un menu de paramètres avancés pour contrôler le processus de dump.\n- Interface utilisateur élégante et facile à utiliser.\n- Utilisation gratuite.\n- Entièrement open source (sous licence GPLv3).\n \nCrédits : DarkMatterCore, pour nxdumptool, qui a servi de base à ce projet.\n \n \nTéléchargement : MigDumpTool v0.0.1 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186386/in-switch-mig-switch-lance-migdumptool-v001-1.jpg"
        }
    },
    "news_11": {
        "title": "[PS5] etaHEN mis à jour en version 1.5b par LightningMods",
        "content": "Le développeur LightningMods informe que etaHEN a été mis à jour en version 1.5b, la solution s'améliore une nouvelle fois avec désormais la prise en charge des cheats Libhijacker qui fonctionne désormais avec les homebrews.\n \n \n\n \n\n \n \nChangelog : \n \n- Les codes cheats de Libhijacker fonctionnent maintenant avec les homebrew\n- Ajout d'un paramètre permettant d'autoriser /data dans les sandboxes des applications (activé par défaut)\n- (4.5x UNIQUEMENT) Correction d'un problème qui pouvait faire planter etaHEN\n- Correction du dumping des patches depuis les disques externes (pour itemzflow 1.06)\n- Les messages de démarrage ont été consolidés\n- Ajout d'un journal pour etaHEN (/data/etaHEN/etaHEN.log)\n- Désactivation du téléchargement vers /dev via FTP\n- Ajout d'un paramètre caché pour activer le téléchargement vers /dev\n- Ajout de mutexs pour tous les threads utilisant un hijacker\n- Ajout d'un terminateur nul aux messages de commande IPC\n- Ajout d'un délai d'attente maximum pour le jailbreaking\n- Ajout de contrôles de nullité pour les commandes IPC\n \n \nTéléchargement : etaHEN 1.5B\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186383/in-ps5-etahen-mis-a-jour-en-version-15b-par-lightningmods-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1186383/in-ps5-etahen-mis-a-jour-en-version-15b-par-lightningmods-2.jpg"
        }
    },
    "news_12": {
        "title": "[Multi] RetroArch v1.17.0 disponible",
        "content": "La Team LibRetro dévoile enfin une nouvelle version de RetroArch, les nouveautés sont nombreuses, il faut dire que les nouvelles versions sont de plus en plus espacées dans le temps. \n \nLa version précédente, la v1.16.0, a été proposée en Septembre dernier. \n \n \n\n \n \nIl y a plus de changements que ceux mentionnés ici, mais par souci de concision, voici les changements depuis la 1.16.0.\n \n \nACCESSIBILITÉ/TTS : correction de la langue cible et gestion manquante du langage espeak sous Linux\nIA : service d'IA retravaillé : augmentation des performances, traduction automatique, placement des sous-titres configurable, etc.\nAPPLE : Correction d'un crash de WebDAV avec l'authentification Digest (Cloud Sync)\nAPPLE : correctifs de synchronisation dans le cloud – ignorez les fichiers .DS_Store et resynchronisez au premier plan de l'application\nAPPLE : Ne recréez pas les répertoires par défaut\nAPPLE : Afficher correctement les informations Git\nAUDIO/SYNC : gérez mieux le réglage de l'inclinaison Hz pour des taux de rafraîchissement élevés (BFI, intervalle d'échange)\nAUDIO/MIXER : conditions séparées pour ffmpeg/mpv et audiomixer\nAUDIO/WASAPI : fonctionnement du tampon partagé retravaillé pour plus de flexibilité, correction de la boucle du dernier tampon en mode exclusif lors de l'entrée dans le menu\nCONFIG/OVERRIDES : correction du paramètre savefile_directory dans le fichier de remplacement\nCONFIG : forcer les paramètres régionaux fixes pour les nombres\nCHEEVOS : Mise à niveau vers rcheevos 11.0\nCHEEVOS : utilisez rc_client pour la gestion de l'état\nCHEEVOS : ne suivez pas les modifications du disque lorsque les succès sont désactivés\nCHEEVOS : réinitialiser le tampon de rembobinage après le chargement du jeu avec les succès\nCHEEVOS : informer l'utilisateur lorsque le serveur est inaccessible\nCHEEVOS : Correction d'un crash lors du premier chargement du jeu avec des succès avec une vidéo en fil de discussion\nEMSCRIPTEN : Augmenter la taille des fragments pour les lectures/écritures\nEMSCRIPTEN : modularisez le JavaScript et nettoyez la version Web\nEMSCRIPTEN : préfixez le nom du noyau avec libretro_ pour les exportations\nEMSCRIPTEN : remplacez les tirets par des traits de soulignement dans les noms de noyau (correctif pour les noyaux Vitaquake)\nEMSCRIPTEN : Utiliser ZipFS pour le bundle d'actifs du lecteur Web\nEMSCRIPTEN : modifiez le débit audio par défaut à 44 100\nIOS : Correction du widget sur IOS17\nIOS : Quitter au lieu de planter sur certaines erreurs\nIOS : correction de ios-vulkan-ppsspp\nIOS : activer la prise en charge HDR sur IOS\nIOS : Ajout d'une option pour désactiver le respect du mode silencieux\nIOS : autoriser l'ignorance de la zone de sécurité (plein écran sur encoche)\nIOS : par défaut, la manette de jeu n'est pas activée\nIOS : correction de XRGB8888 dans le pilote GL\nIOS : autoriser la modification de l'icône de l'application\nIOS : ajouter HAVE_ACCESSIBILITY aux versions iOS\nIOS/TVOS : créer un contexte GL en tant que GLES3 pour résoudre certains problèmes de performances de rendu\nINPUT : correction de l'entrée fantôme lors de la configuration de RETROK_UNKNOWN\nINPUT : 'Bind Hold' par défaut sur 0 pour éviter les problèmes avec les contrôleurs qui ne reposent pas à l'état nul\nENTRÉE : Ajouter un paramètre pour autoriser les directions du turbo D-Pad\nINPUT : Ne pas enregistrer les boutons de la souris dans la configuration automatique\nINPUT/MENU : ajout d'une option pour fusionner les types de périphériques « Hotkey Enable »\nINPUT/mFI : désactivez secondaire_joypad pour éviter les problèmes avec les contrôleurs détectés à la fois comme HID et mFI\nINPUT/UDEV : remplacez la détection d'événements par une interrogation dans udev_joypad\nINPUT/WAYLAND : utilisez un mouvement non accéléré du pointeur pour éviter la zone morte de la souris\nLAKKA : Ajouter de nouvelles options de menu pour Switch (overclock, CEC, BT ERTM)\nLIBRETRO : Ajouter une commande d'environnement pour obtenir le chemin de la playlist\nLIBRETRO/NETPACKET : changer le numéro d'appel de l'environnement de 76 à 78 (retirer le 76 car il n'a jamais été utilisé par aucun noyau). Simplifiez les diffusions en supprimant l'option d'envoi à tous les clients sauf un, utilisez plutôt une constante RETRO_NETPACKET_BROADCAST explicite. Séparez le vidage explicite et l’interrogation du paquet entrant en deux opérations. Activez un noyau pour spécifier une chaîne de version de protocole qui peut être utilisée à la place de la version du noyau pour déterminer la compatibilité entre deux lecteurs. Enregistrez et notifiez un message séparé en cas de non-concordance de contenu CRC lors de l'utilisation de cette interface pour indiquer qu'elle est moins grave.\nMENU : Correction de la navigation dans le menu avec le stick analogique (1.16.0.1)\nMENU : Ajouter une option pour rechercher des images miniatures par nom de fichier rom de playlist (1.16.0.2)\nMENU : ne traite pas les événements de menu pendant le vidage de l'entrée (1.16.0.2)\nMENU : Empêcher de passer à la liaison suivante en cas de liaison simple (1.16.0.3)\nMENU : Correction des faux positifs dans le menu de l'écran tactile en cas de chevauchement\nMENU : Trier les playlists en ignorant l'extension (La Playstation 2 devrait venir après la Playstation)\nMENU : Traiter le dossier Informations sur le volume système comme étant masqué sur toutes les plates-formes\nMENU : Ajouter une option de langue biélorusse\nMENU : correction du comportement des miniatures de l'état de sauvegarde lors du retour à la liste de lecture alors que le contenu est toujours en cours d'exécution\nMENU : Correction de la longueur du widget renvoyé à la ligne\nMENU : Ajouter un texte d'aide aux pilotes du contrôleur\nMENU : Correction de l'option Quitter lors de la fermeture du contenu\nMENU : correction des vignettes dans l'historique pour le contenu chargé via Charger le contenu\nMENU : correspondance flexible des vignettes (nom de la ROM – nom de la base de données – nom court)\nMENU : Supprimer le téléchargeur de pack de vignettes hérité\nMENU/GLUI : Corrections des icônes\nMENU/OZONE : correctifs liés aux vignettes (barre de vignettes manquante, vignette en plein écran clignotante, focus de la barre latérale)\nMENU/RGUI : Correction de la mise à l'échelle du texte en 16:9\nMENU/XMB : les images d'arrière-plan ont priorité sur les thèmes de couleurs, l'opacité de l'image par défaut est la même que celle du thème de couleurs.\nMENU/XMB : Correction d'un défaut de segmentation lorsque l'image de fond est manquante\nMENU/XMB : Plusieurs corrections et nettoyages\nMENU/XMB : corrections de mise en page/vignettes – Ajustements de la mise en page des vignettes, améliorations du titre d'en-tête, ajustements de la mise en page de l'ordinateur de poche\nRÉSEAU/NETPLAY : ajout de la prise en charge pour rejoindre les serveurs MITM à partir de la ligne de commande\nRÉSEAU/NETPACKET : améliorations du flux de connexion de l'interface\nOSX : correction de la prise en charge de la souris pour MelonDS DS sur OSX\nOSX : option pour créer une version portable\nPATCHES : ajout de la prise en charge des correctifs au format XDelta.\nPATCHS : correction des correctifs pour les cœurs prenant en charge le mode sans contenu\nPS2 : Correction de l'absence de son\nPS2 : corrigez les journaux de 0 octet et ajoutez des statistiques de mémoire\nPSP : Correction d'une fuite de mémoire dans le pilote audio\nRUNLOOP : Frame Rest, fonctionnalité de veille expérimentale visant à réduire l'utilisation et la température du processeur lors de l'utilisation de certains modes vsync gourmands en processeur\nRPI : Correction de l'échec de compilation de videocore + switchres\nSCAN : effectuez une vérification CRC sur le contenu PSP/PSP(PSN)\nTVOS : activer la prise en charge de la superposition\nVIDÉO/BFI : Insertion de cadre noir ajoutée à DirectX10/11/12. La gamme BFI Hz couvre désormais tous les multiples de 60 Hz inférieurs à 1 000 Hz. Longueur du stroboscope variable via la nouvelle option « Dark Frames », algorithme pour sélectionner automatiquement le choix « décent » des Dark Frames.\nVIDEO/GLSL : ajouter la prise en charge de FinalViewportSize à GLSL\nVIDEO/GLSL : changez le type de rotation en int pour maximiser la compatibilité\nVIDÉO : utilisez le taux de rafraîchissement vidéo au lieu du taux de rafraîchissement principal pour limiter les images du menu\nVIDÉO : limiter le taux de rafraîchissement des vidéos en pause\nVIDÉO : Appliquer l'intervalle d'échange 1 dans le menu si vsync est activé\nWII : Activer Cheevos pour les versions Wii\nWIIU : Correction du fichier de configuration et de la lecture des informations de base\nWIIU : correction des entrées directionnelles « Haut » et « Gauche » pour les deux sticks analogiques pour l'adaptateur GC\nWIIU : Correction de 3 contrôleurs USB (NES/SNES/Retrode)\nWIIU : Correction d'une fuite de descripteur de fichier\nWIN32 : préférez D3D11 et WASAPI comme pilotes vidéo et audio par défaut\nWIN32 : correction de la taille de la fenêtre lorsque le rapport hauteur/largeur est < 0\nWIN32 : correction de la résolution de l'écran toujours liée au moniteur principal\nWAYLAND : activer le repli pour l'inhibition de l'économiseur d'écran via D-Bus\nWAYLAND : introduisez le protocole wp_fractional_scale_v1 pour une mise à l'échelle fractionnaire appropriée\nWAYLAND : mettre à jour la version des protocoles Wayland vers la version 1.31\n \n \nTout est là : RetroArch 1.7.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186380/in-multi-retroarch-v1170-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[3DS/Switch] The Guardian a rédigé un article sur Gary Bowser",
        "content": "Le célèbre journal The Guardian a dévoilé un article intéressant sur Gary Bowser, bien que l'article contienne une petit erreur puisque Gary Bowser a passé 30 mois derrière les barreaux et non 14, l'ex pirate le met en avant sur son profil Twitter (X). \n \nIl rajoute The Guardian a enfin publié un bel article sur moi, l'histoire de ma vie, les problèmes juridiques, le redémarrage de ma vie. Il est tiré d'une série d'interviews que j'ai réalisées il y a quelque temps avec eux. C'est bon de le voir imprimé. Jetez-y un coup d'oeil, et je répondrai à toutes vos questions.\n \nDans l'article, Gary Bowser confirme qu'il a réalisé l'entièreté de sa détention sans avoir été libéré sous caution, une première détention de 14 mois, puis de 16 mois entre les prisons fédérales de Seatax, ICE en attente d'expulsion vers le Canada. \n \nDans l'ICE, il n'était pas dans une cellule mais plutôt dans un dortoir, il avait la possibilité de sortir dans une cour une heure par jour, et disposait d'une Xbox 360 ! \n \nEn 2010, il s'implique avec la Team Xecuter dans le piratage de console Nintendo, en 2020 il est arrêté, et les ennuis de santé l'ont épuisé, notamment parce qu'il a eu un coronavirus assez fort.\n \n \n\n \n \nSon avenir il le voit dans le matériel rétro, avec du soutien reçu d'une page GoFundMe, mais sa passion pour ce type de matériel l'amènera certainement quelque part. \n \nL'article de TheGuardian est ici : L'homme qui doit 14 millions de dollars à Nintendo : Gary Bowser et l'affaire de piratage la plus célèbre du monde du jeu vidéo\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186373/in-3dsswitch-the-guardian-a-redige-un-article-sur-gary-bowser-1.png"
        }
    },
    "news_14": {
        "title": "[PS4/PS5] TheFlow présentera sa vulnérabilité le 31 Mai 2024",
        "content": "Excellente nouvelle, nous venons d'apprendre que TheFlow présentera sa vulnérabilité RCE permettant d'obtenir les privilèges kernel sur PlayStation 4 lors de l'événement TyphoonCon24 qui se tiendra du 27 au 31 Mai 2024 à Séoul en Corée du Sud.\n \nSon exploit kernel basé sur certaines vulnérabilités dans les protocoles réseau permet avec un RCE (Remote Code Execution) d'accéder au kernel exploit sur la console PS4. \n \nIl sera intéressant de voir si l'on parle d'un exploit uniquement accessible sur PS4, et sur quel firmware car il se murmure le firmware 11.0, ce qui débloquerait enfin la console du firmware 9.00. L'autre point à surveiller est le côté PS5. \n \n \n \n\n \n\n \n \nCet exposé portera sur l'exploitation réussie de vulnérabilités du kernel dans un protocole réseau sur la PlayStation 4 qui est basée sur FreeBSD. Je montrerai comment les éléments internes du protocole IPv6 peuvent être exploités pour obtenir une fuite d'information et pour rediriger le flux de contrôle afin d'obtenir un RCE avec les privilèges du kernel sur la console. Les stratégies d'exploitation peuvent également s'appliquer à XNU car ils partagent un code très similaire. De plus, cet exploit permet un jailbreak sans nécessiter de point d'entrée utilisateur tel qu'un exploit webKit.\n \nLa dernière phrase laisse rêveur, on est sur un exploit kernel directement accessible, sans exploit webkit, une première sur PS4, laissant entrevoir une nouvelle fois le spectre des CFW ? \n \nTout est là: typhooncon.com\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186369/in-ps4ps5-theflow-presentera-sa-vulnerabilite-le-31-mai-2024-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1186369/in-ps4ps5-theflow-presentera-sa-vulnerabilite-le-31-mai-2024-1.png"
        }
    },
    "news_15": {
        "title": "[Switch] L4T Fedora 39 v5.1.2 disponible",
        "content": "Azkali, le développeur de L4T Fedora, est fier de présenter une nouvelle version conçue pour la Nintendo Switch, L4T Fedora 39 5.1.2. Comme vous le savez cette version de Linux est conç pourle compte de Switchroot permettant de profiter des dernières innovations en la matière. \n \n \n\n \n \n \nPrincipaux points forts :\n \n- Désormais basé sur KDE spin\n- Avec BSP 32.7.4 par défaut\n- Nombreuses corrections de bugs et améliorations comme une plus grande stabilité\n \n \nCette mise à jour apporte aussi le passage de Pulseaudio à pipewire pour le système audio, permettant d'offrir un support plus large et plus complet. \n \nL'arrivée de BSP 32.7.4 a Vulkan 1.2 permet là aussi des performances optimales dans les jeux et application, tout comme la correction de certains bugs. \n \nLa mise à jour de FFmeg en 6.0.1, d'un pipeline CUDA, ou encore l'ajout du référentiel d'application facile l'installation de nouvelles applications. \n \n\n \nChangelog 5.1.2 :\n \nUse pipewire instead of Pulseaudio and add full support for it\nAdd 32.7.4 BSP for vulkan 1.2 and set it by default\nReverted to fedora's Glibc as widevine patches are not needed anymore\nUpdate FFmpeg to 6.0.1\nAdd Apps repo by default\nPR fix for hangover compilation\nFix Vita3k build in apps repo\nComplete cleanup of OBS repos\nAdd KDE spin and use it by default\nCreated pipeline for CUDA\nAdded CUDA 10.2\nAdd GCC-7 for CUDA\nFixed BSP override bug\nImprove dock-hotplug to use most common DM greeters when available\nFix kernel src symlink for kmod\nUse nvidia container toolkit from new nvidia repo\nEnable USB_SERIAL_CH341 module\nFix and use onboard\nShow onboard in sddm and initial-setup\nFix nvpmodel fan_available_profile sysfs node check (credits )\nDecrease time spent in initramfs by uncluterring it\nChromium is now weekly updated (credits )\n \nKnown bugs\nOnboard (the visual keyboard) can crash sometimes (recovered automatically by a service)\nOnboard layout except Compact bug on special characters such as ,.?!\nOnboard can crash in sddm (quick fix: reboot or enable autologin)\nUSB serial doesn't work (uart_port=4 in ini)\n \n\n \n\n \n \nTéléchargement : \n \nhttps://wiki.switchroot.org/wiki/linux/linux-changelog\n \nhttps://twitter.com/AzkaliManad/status/1753311074735067381\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186350/in-switch-l4t-fedora-39-v512-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[PS4] Gran Turismo Sport enfin patché pour les sauvegardes",
        "content": "Alors que depuis des années les développeurs cherchent à faire fonctionner les sauvegardes de progression hors ligne sur Gran Turismo Sport, cette possibilité vient d'arriver sans que personne ne s'y attende, un peu comme le transfert d'Hamilton en 2025 de Mercedes vers Ferrari.\n \nGran Turismo Sport a été l'un des premiers jeux à \"profiter\" des sauvegardes en ligne sur les serveurs de Polyphony Digital, les sauvegardes de progression étant lié à des fichiers obligatoirement hébergés sur ce serveur. \n \n \n\n \n \n \nC'est certainement pour des raisons de coûts d'entretiens de ces serveurs que le studio a décidé de proposer un patch pour Gran Turismo Sport, supprimant au passage toutes les possibilités en ligne du jeu, mettant fin aux services, Open Lobby ou en encore Sport Mode seront inaccessibles, mais grâce au patch vous aurez vos progressions. \n \n\"Nous souhaitons remercier les nombreux utilisateurs du service en ligne Gran Turismo Sport depuis son premier lancement en 2017\", a déclaré Polyphony Digital. \"À partir d'aujourd'hui, nous continuerons à améliorer les services en ligne pour le titre Gran Turismo 7 actuellement disponible.\"\n \nIl aura fallu attendre 7 ans pour que nous puissions enfin librement disposer des sauvegardes en ligne avec cette mise à jour 1.69 de Gran Turismo Sport, rendez-vous en 2029 pour Gran Turismo 7.\n \n \nMerci Lestat___ pour l'information.\n \n \nTout est là : gran-turismo.com\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186349/in-ps4-gran-turismo-sport-enfin-patche-pour-les-sauvegardes-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] PS2 2 PS4 V1.2: Convertir vos jeux ps2 pour PS4",
        "content": "Il aura mis du temps mais le voici enfin, PS2 2 PS4 v1.2, un petit utilitaire vous permettant de convertir vos jeux PS2 au format FPKG et donc jouable sur PS4.\n \nEn effet, annoncé depuis un petit moment sur mon tweeter, je publie enfin une version publique avec de gros changements. A la base programmé en batch pour la v1.0 et V1.1, j' ai revu le code entièrement qui passe maintenant en Python afin d' y ajouter une interface graphique bien plus convivial que de simple lignes d'instructions.\n \n\n \nSon fonctionnement en rien inchangé, sélectionner votre iso PS2, vos covers, background, ajouter si besoin vos fichiers de configurations (.lua et .conf) pour améliorer l'émulation puis lancer la création de FPKG.\n \nPetite précision importante, il vous faudra installer (si ce n est pas déjà fait) Python 3, version 3.12.1 au mieux, mais aussi les dépendances (je vous fournir un fichier .bat qui automatise l' installation de ces dernières)\nVous retrouverez toute la manip, installation et utilisation dans ma vidéo tuto ci dessous, cette dernière concerne la PS5 mais cela fonctionne exactement pareil pour PS4 seul l'interface graphique change...\n \nAutre petite chose à savoir, les 2 images (PS2 cover, Background) sont OBLIGATOIRES, sans l 'une des 2 le programme vous donnera un message d'erreur...\n \nDe plus ce programme ne règle pas les soucis rencontrés en jeu (lags, black screen, lignes vertes, etc...) pour réparer ceci vous devrez intégrer à votre FPKG des fichiers .lua et .config qui EUX règlent les soucis rencontrés. Vous les trouvez sur le PS DEV wiki ici\n \nBeaucoup de tests ont été fait, le programme fonctionne parfaitement, donc si vous rencontrez des erreurs ou autre avec, cela viendra de vos configs ou d' une mauvaise manip de votre part (je reste bien sur à votre disposition ici ou sur mon tweeter pour toute questions ou aide...)\nJe remercie donc les testeurs Hyndrid, Arksama et Mega Gonzales pour leur nombreux tests qui m' ont grandement aidé...\n \nInstallation et utilisation:\n \n\n- Installer Python3\n- Installer les dépendances en lançant le .bat fourni (Install_pillow.bat)\n- Lancer le .py (PS2_2_PS5.py)\n- Suivre les instructions\n- Lancer la création du FPKG\n \n\n \n\n \nPour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:\nhttps://www.paypal.com/paypalme/markus00095\n \nTélécharger: PS2 2 PS4 V1.2\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186299/in-ps4-ps2-2-ps4-v12-convertir-vos-jeux-ps2-pour-ps4-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] PS2 2 PS5 V1.1: Convertir vos jeux ps2 pour PS5",
        "content": "Il aura mis du temps mais le voici enfin, PS2 2 PS5 v1.1, un petit utilitaire vous permettant de convertir vos jeux PS2 au format FPKG et donc jouable sur PS5.\n \nEn effet, annoncé depuis un petit moment sur mon tweeter, je publie enfin une version publique avec de gros changements. A la base programmé en batch pour la v1.0, j' ai revu le code entièrement qui passe maintenant en Python afin d' y ajouter une interface graphique bien plus convivial que de simple lignes d'instructions.\n \n\n \nSon fonctionnement rien inchangé, sélectionner votre iso PS2, vos covers, background et BG menu, ajouter si besoin vos fichiers de configurations (.lua et .conf) pour améliorer l'émulation puis lancer la création de FPKG.\n \nPetite précision importante, il vous faudra installer (si ce n est pas déjà fait) Python 3, version 3.12.1 au mieux, mais aussi les dépendances (je vous fournir un fichier .bat qui automatise l' installation de ces dernières)\nVous retrouverez toute la manip, installation et utilisation dans ma vidéo tuto ci dessous...\n \n\n \nAutre petite chose à savoir, les 3 images (PS2 cover, Background et BG Menu) sont OBLIGATOIRES, sans l 'une des 3 le programme vous donnera un message d'erreur...\n \nDe plus ce programme ne règle pas les soucis rencontrés en jeu (lags, black screen, lignes vertes, etc...) pour réparer ceci vous devrez intégrer à votre FPKG des fichiers .lua et .config qui EUX règlent les soucis rencontrés. Vous les trouvez sur le PS DEV wiki ici\n \nBeaucoup de tests ont été fait, le programme fonctionne parfaitement, donc si vous rencontrez des erreurs ou autre avec, cela viendra de vos configs ou d' une mauvaise manip de votre part (je reste bien sur à votre disposition ici ou sur mon tweeter pour toute questions ou aide...)\nJe remercie donc les testeurs Hyndrid, Arksama et Mega Gonzales pour leur nombreux tests qui m' ont grandement aidé...\n \nUne version pour la PS4 arrive très très prochainement...\n \nInstallation et utilisation:\n \n\n- Installer Python3\n- Installer les dépendances en lançant le .bat fourni (Install_pillow.bat)\n- Lancer le .py (PS2_2_PS5.py)\n- Suivre les instructions\n- Lancer la création du FPKG\n\n \nVideo tuto:\n \n\n \n \nPour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:\nhttps://www.paypal.com/paypalme/markus00095\n \nTélécharger PS2 2 PS5 V1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186291/in-ps5-ps2-2-ps5-v11-convertir-vos-jeux-ps2-pour-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1186291/in-ps5-ps2-2-ps5-v11-convertir-vos-jeux-ps2-pour-ps5-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS4/PS5] Le PoC sur la faille à 50 000 $ dévoilé ?",
        "content": "Le POC \"Proof of Concept\" CVE-2006-4304 pour PS4/PS5 fait sensation, le flux étant censé être secret via la notion de non divulgation lié à HackerOne. Cette découverte mérite l'attention de la communauté, car elle pourrait ouvrir la porte à d'éventuels jailbreaks dans le futur.\n \nEn fait l'exploit aurait leaké ou du moins il aurait été publié, ce supposé POC du flux a été divulgué sur plusieurs serveurs Discord. C'était à l'origine un POC incomplet mais le développeur Robbedcolek l'a complété.\n \n \n\n \n \n \nCe n'est toujours pas un exploit du kernel, mais il peut peut-être être utilisé pour écrire un exploit kernel, notamment parce qu'il permettrait d'être accessible sur le firmware 11.00 et inférieur sur PlayStation 4, et sur firmware 8.20 et inférieur sur PlayStation 5. \n \n \nTout est là : RobbedColek\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186244/in-ps4ps5-le-poc-sur-la-faille-a-50-000-devoilee-1.png"
        }
    },
    "news_20": {
        "title": "[PS4] Le payload GoldHEN mis à jour par SiSTRo en v2.4b16",
        "content": "Le développeur SiSTRo dévoile la toute première mise à jour de l'année 2024 de son payload GoldHEN.\n \nTaillé pour la plupart des firmwares sensibles de la PS4, le payload a été particulièrement mis à jour pour les 5.05, 6.72 et 9.00, comme vous le savez il s'agit de la solution ultime pour PS4 et bientôt pour la PS5. \n \nAvec cette mise à jour, le développeur a mis l'accent sur le chargement de plugin avec une amélioration du loader, et sur une meilleure prise en charge du FTP. De plus, il a ajouté un plugin de patch de jeu et une surcouche d'informations système pour le jeu. Une section \"A propos\" a été également rajouté avant de mettre en avant ceux qui participent aux développements de GoldHEN.\n \n \n \n\n \n \n \nPour ce qui est d'obtenir cette nouvelle version, nous ne pouvons que vous conseillez de supporter le développeur en lui offrant un café. \n \nAprès avoir sorti la 2.4v15, un petit bug a été trouvé, de fait la version 2.4b16 corrige ce problème. \n \n",
        "images": {}
    }
}