{
    "news_1": {
        "title": "[PS4/PS5] Que se passe-t-il avec le PSN en panne depuis plus de 10 heures",
        "content": "Depuis ce matin, cela fait plus de 10 heures, que le PSN est hors service, les accès PSN de la PS4 et de la PS5 ne sont plus fonctionnels, il est impossible de se connecter au PlayStation Network, et accessoirement de jouer en ligne. \n \nC'est une panne de grande ampleur qui empêche plusieurs millions de joueurs de profiter de leur jeu en ligne ou du PlayStation Store. La frustration est élevée, les joueurs payent pour y avoir accès.\n \nAu début le PSN a été signalé comme étant en maintenance, puis plus de 2 heures après PlayStation Japon a commenté l'incident en déclarant une panne. 3h00 après la panne, Sony a enfin modifié \"Ask PlayStation\", le service d'assistance pour reconnaitre le problème. \n \n\n \n \n \nMalheureusement cela tombe mal, en plein week-end, en début de vacances pour certains, et pour le moment cela dure, il est possible qu'on soit face à un hack ou une attaque DDOS. \n \nMerci Darkdogg93 pour l'information\n \n \nTout est là : https://status.playstation.com/fr-fr/\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203428/in-ps4ps5-que-se-passe-t-il-avec-le-psn-en-panne-depuis-plus-de-10-heures-1.png"
        }
    },
    "news_2": {
        "title": "[PS5] Specter et zi prévoient une formation sur les attaques des hyperviseurs",
        "content": "Comme vous le savez la conférence Hardware.io est surtout l'occasion pour de nombreux acteurs de se rencontrer et d'exposer leurs travaux, mais c'est surtout l'occasion durant 3 à 4 jours de se former sur la sécurité informatique.\n \nC'est pourquoi les développeurs Specter et Zi, qui pour information est co-fondateur de Dayzerosec, ont décidé de proposer une formation sur les attaques des hyperviseurs lors d'une présentation à la Hardwear.io. \n \n \n\n \n \nL'idée est avant tout de fournir aux étudiants une compréhension approfondie de l'architecture de virtualisation moderne et des moyens d'attaquer les hyperviseurs. Ces attaques mettront l'accent sur la machine virtuelle basée sur le kernel (KVM), la protection du kernel en temps réel sur Samsung Know (RKP), l'environnement d'exécution de l'hyperviseur Huawei (HHEE) et Microsoft Hyper-V. \n \nIl n'est donc pas question directement de la protection de la PS5, mais l'axe qui est pris à savoir les attaques sur les hyperviseurs, plus larges seront les connaissances, plus larges seront les attaques envisageables. \n \nLa formation aura lieu du 27 au 29 Mai 2025 à Santa Clara au Marriott, les séances se dérouleront de 9h00 à 17h30 et sont destinés uniquement aux participants de niveau intermédiaire à avancé. \n \nTout est là : hardwear.io\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203427/in-ps5-specter-et-zi-prevoient-une-formation-sur-les-attaques-des-hyperviseurs-1.jpg"
        }
    },
    "news_3": {
        "title": "[DS/3DS] L'émulateur NesDS se perfectionne en v2.0",
        "content": "Le développeur RocketRobz est ravi d'annoncer la sortie d'une nouvelle version de NesDS, l'émulateur de Nintendo Entertainment System (NES) pour Nintendo DS. \n \nCette mise à jour apporte son lot d'améliorations et de corrections de bugs pour une expérience de jeu encore plus fluide et fidèle.\n \nLes nouveautés de cette version :\n \nAmélioration de la compatibilité : Plus de jeux sont désormais parfaitement jouables, avec une meilleure gestion des graphismes et du son.\n \nOptimisation des performances : Les ralentissements ont été réduits, offrant une expérience plus stable, même sur les jeux les plus exigeants.\n \nCorrection de bugs : Plusieurs problèmes techniques ont été résolus, notamment des crashs occasionnels et des erreurs d'affichage.\n \nInterface utilisateur améliorée : Des ajustements ont été apportés pour rendre la navigation plus intuitive.\n \n \n\n \n \n \n \nChangelog v2.0 : \n \n- Initialement prévu pour une sortie pendant les vacances, le développeur nous informe avoir oublié de la publier à cause de son travail sur d'autres projets.\n \nInstallation pour les utilisateurs de TWLMenu++ :\n \n- Placer nesDS.nds dans sd:/_nds/TWiLightMenu/emulators/.\n \nChangelog :\n \n- De nombreuses améliorations par@FluBBaOfWard. (ex. corrections du mappeur, ajout de l'émulation du verrou de bus ppu, ajout de l'émulation du registre d'adresses et de données OAM.)\n- Émulation RP2C02 corrigée pour corriger l'arrière-plan dans Punch-Out .\n- Échelles retravaillées et préréglages ajoutés.\n- Correction du problème 3DS CIA essayant de démarrer Slot-1 au lieu de nesDS.\n \n \nTéléchargement : NesDS v2.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203397/in-ds3ds-lemulateur-nesds-se-perfectionne-en-v20-1.jpg"
        }
    },
    "news_4": {
        "title": "[PSP] Le Wifi WPA2 arrive sur la PSP grâce à un plugin",
        "content": "\nDe la nouveauté sur PSP, oui c'est possible en 2025, et pour cause, c'est l'arrivée de la prise en charge d'un nouveau système de cryptage de données Wifi, le WPA2-AES. A l'époque de la PSP, le Wifi avec cryptage WPA2-AES n'existait pas, de fait la console ne l'a jamais supporté. \n \nCette limitation est désormais levée, avec notamment le développeur Moment qui propose un tout nouveau plugin qui permet d'amener la connectivité réseau Wifi WPA2-AES. \n \nAppelé wpa2psp, ce plugin peut etre installé de manière permanente en modifiant le fichier TXT des plugins, ainsi cette connectivité fonctionnera dans tous les modes in-game, XMB et VSH.\n \n \n \n\n \n \n \nIl y a quelques spécifications : \n \n- Fréquence 2,4 GHz uniquement, fonctionne uniquement avec un WiFi en 2,4 GHz.\n- Si votre routeur utilise un seul SSID pour les réseaux 2,4 GHz et 5 GHz, vous devrez peut-être les séparer et connecter votre PSP au réseau 2,4 GHz.\n- WPA2 AES uniquement : Nécessite le chiffrement WPA2 avec AES (AES-CCMP).\n- Le chiffrement TKIP n'est pas pris en charge et ne fonctionnera pas.\n- Lorsque le plugin est activé, les chiffrements WEP et WPA ne fonctionneront pas.\n- Pour utiliser à nouveau WEP ou WPA, désactivez le plugin, et ils fonctionneront normalement.\n- Si votre routeur est configuré en mode mixte WPA2/WPA3, votre PSP pourrait avoir des difficultés à obtenir une adresse IP.\n- Essayez de configurer manuellement l'adresse IP au lieu d'utiliser le DHCP en mode [AUTO].\n \n \n \nTout est là : reddit.com\n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203392/in-psp-le-wifi-wpa2-arrive-sur-la-psp-grace-a-un-plugin-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS5] Kstuff bientôt porté sur les firmwares 5.xx",
        "content": "D'un côté c'est un message de Zecoxao, de l'autre c'est une confirmation directe de EchoStretch qui annonce son intention de chercher les offsets pour les firmwares 5.xx pour kstuff. L'intention est bonne et louable, mais il semblerait que tout ne soit pas aussi simple qu'on voudrait y croire.\n \nLe développeur EchoStretch, qui travaille beaucoup sur la scène PS5, avec notamment des version personnalisée de Self Dumper, des correctifs Byepervisor, se penche sérieusement sur le portage de kstuff sur les firmware 5.xx de la PS5.\n \n \n\n \n \n \nIl semblerait qu'il ne manque pas grand chose pour y parvenir, de l'ouverture de quelques offsets, et de références utiles du script de portage de Sleirsgoevy, pour rappel kstuff permet d'exécuter des jeux sans avoir à modifier l'Hyperviseur de la PS5.\n \nL'autre confirmation vient de Zecoxao qui informe avoir partagé des bonnes pistes sur le kernel pour trouver les offsets sur les firmwares 5.xx, la seule chose qui reste à faire est d'implémenter nmap dans MAP_SELF avec les scripts de Sleirsgoevy.\n \n \n \n\n \n \n \nRappelons ceci, Sleirgoevy a proposé des outils de scripts pour faciliter le portage de kstuff sur les firmwares 3.00 à 4.51, au dessus il y a des références \"parasites\" qui complexifient le portage et le fonctionnement du payload kstuff. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203385/in-ps5-kstuff-bientot-porte-sur-les-firmwares-5xx-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203385/in-ps5-kstuff-bientot-porte-sur-les-firmwares-5xx-2.png"
        }
    },
    "news_6": {
        "title": "[Switch] Sudachi 1.0.14 est là",
        "content": "L'arrivée d'une nouvelle version de Sudachi ne se fait pas sans nouveautées, voilà que débarque la version 1.0.14, désormais disponible pour les plateformes Windows, Linux et Android. Cette mise à jour apporte plusieurs améliorations, corrections de bugs et nouvelles fonctionnalités pour enrichir votre expérience avec Sudachi, l'analyseur de texte japonais puissant et polyvalent.\n \nLe développeur Jarrod Norwell propose une mise à jour de Sudachi en version 1.0.14. On vous a déjà parlé, et c'est une première malgré les injonctions de Nintendo, le développeur continue le développement de l'émulateur. \n \n \n\n \n \n \nChangelog 1.0.14 : \n \n- Ajout de la prise en charge pour lancer l'écran de configuration initiale via -setup\n- Disponible uniquement sur Linux, macOS et Windows via le terminal ou Outils > Ouvrir la configuration initiale.\n- Pour le moment, seule une prise en charge partielle est disponible, mais elle sera améliorée à l'avenir.\n- Ajout de plusieurs fonctions manquantes pour permettre le lancement de l'écran de configuration initiale.\n- Correction d'un problème empêchant le démarrage de certains jeux récents.\n- Résolution d'un problème avec mm:u où Get et GetOld ne retournaient pas après avoir atteint la valeur minimale d'une session trouvée.\n- Début de la refonte de caps, caps:a et caps:su pour améliorer la précision.\n \nTéléchargement : Sudachi 1.0.14\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203379/in-switch-sudachi-1014-est-la-1.png"
        }
    },
    "news_7": {
        "title": "[WiiU] Cemu 2.6 disponible",
        "content": "La dernière version de Cemu, l'émulateur Wii U, vient d'être publiée par l'équipe en charge de son développement. Cette mise à jour apporte des corrections de bugs, des améliorations de performance et de compatibilité avec plusieurs jeux. Les utilisateurs peuvent télécharger la version directement depuis la page des releases : Cemu Releases. A titre d'information, cette version 2.6 est la pre-release sachant qu'elle est distribuée pour MacOS, Ubuntu, Windows x64 et Linux\n \nParmi les nouveautés :\n \n- Améliorations de stabilité : Résolution de plusieurs crashs et bugs rencontrés dans les versions précédentes.\n \n- Optimisations graphiques : Meilleure prise en charge des shaders et des effets visuels pour une expérience plus fluide.\n \n- Compatibilité étendue : Ajout du support pour de nouveaux jeux et corrections pour des titres déjà pris en charge.\n \n \n \n\n \n \n \nChangelog version 2.6 : \n \n \nExportation des sauvegardes : L'exportation des sauvegardes via le gestionnaire de titres ne plante plus lorsque le chemin d'exportation contient des caractères Unicode.\n \nCorrection d'une régression : Un problème dans les titres DS Virtual Console a été résolu (#1440).\n \nCorrection d'un bug : L'option de débogage des shaders (debug shader dumping) essayait d'écrire des fichiers dans le mauvais répertoire. Ce problème est maintenant corrigé.\n \nAmélioration du débogueur : Un menu contextuel (clic droit) a été ajouté à la vue désassemblage du débogueur PPC, et quelques petits bugs dans le débogueur ont été corrigés.\n \nChangement de backend pour HID/USB : Libusb est maintenant utilisé comme backend pour les périphériques HID/USB sous Windows (#1471).\n \nOptimisation de la mémoire Vulkan : Réduction du nombre d'objets d'échantillonnage (sampler objects) créés avec Vulkan. Cela diminue légèrement l'utilisation de la mémoire et évite les plantages sur les pilotes ayant une limite basse pour ces objets.\n \nAmélioration de la mise en cache des données d'index sur Vulkan : Cela peut apporter un très léger gain de performance dans certains jeux.\n \nCorrection de l'option --force-interpreter : L'option de ligne de commande --force-interpreter utilise maintenant toujours l'émulation CPU mono-thread comme prévu initialement.\n \n \n \nTéléchargement : Cemu 2.6 (Pre-release)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203371/in-wiiu-cemu-26-disponible-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS5] LightningMods dévoile une nouvelle version de son store pour etaHEN 2.0b Pre-release",
        "content": "La scène du jailbreak PlayStation 5 est en effervescence, bon il faut avouer qu'on commence un peu à tourner en rond, mais LightningMods continue de vouloir faire bouger les choses, cette nuit il a dévoilé qu'ils ont réussi à localiser pourquoi kstuff (avec ou sans etaHEN) ne finissait pas son chargement tant que l'application du lecteur de disque n'était pas fermée, c'est pas grand chose, mais cela permettra d'améliorer son lancement sur ISO. Autre chose, hier il a dévoilé une nouvelle version de son store, spécialement conçue pour etaHEN 2.0b Pre-Release. Cette mise à jour marque une étape importante pour les utilisateurs de PS5 jailbreakées, offrant un accès simplifié à une multitude de homebrews, applications et outils personnalisés.\n \n \n\n \n \nQuoi de neuf dans cette version ?\n \nLa nouvelle version du store LightningMods apporte plusieurs améliorations et fonctionnalités clés :\n- Compatibilité avec etaHEN 2.0b : Optimisé pour fonctionner parfaitement avec la version préliminaire d’etaHEN, le store offre une expérience fluide et stable.\n- Interface utilisateur améliorée : Une interface plus intuitive et réactive facilite la navigation et la découverte de nouveaux contenus.\n- Contenu enrichi : Le store propose désormais une bibliothèque élargie de homebrews, de mods et d’utilitaires pour PS5, répondant aux besoins des joueurs et des développeurs.\n \nLes utilisateurs peuvent désormais profiter de mises à jour automatiques pour les applications et les outils disponibles sur le store. Pour rappel, etaHEN est une avancée majeure, c'est une version préliminaire du célèbre exploit pour PS5, permettant l’exécution de homebrews et de logiciels personnalisés. Avec cette version, les utilisateurs peuvent explorer de nouvelles possibilités sur leur console, et l’intégration du store LightningMods vient renforcer cette liberté en centralisant l’accès aux outils et applications.\n \nComment accéder au store ?\n \nPour profiter du nouveau store LightningMods, les utilisateurs doivent disposer d’une PS5 jailbreakée avec etaHEN 2.0b Pre-Release installé. Une fois l’exploit activé, le store peut être téléchargé et installé directement depuis la console, offrant un accès instantané à une multitude de ressources. \n \n \nTéléchargement : Store apps\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203353/in-ps5-lightningmods-devoile-une-nouvelle-version-de-son-store-pour-etahen-20b-pre-release-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS5] PS Fetchpkg v1.0 disponible",
        "content": "PS fetchpkg est un outil simple pour télécharger les mises à jour des jeux PS4 et PS5, le projet fetchpkg est un outil open source basé sur cURL qui permet de télécharger les mises à jour officielles des jeux PlayStation 4 et PlayStation 5. Conçu pour fonctionner sur GNU/Linux, Windows (64 bits) et les PS5 jailbreakées, cet outil offre une solution pratique pour les joueurs et développeurs souhaitant accéder aux fichiers de mise à jour des jeux.\n \n \n\n \n \nFonctionnalités clés :\n \n- Téléchargement automatisé : fetchpkg permet de télécharger les mises à jour des jeux à partir d’une URL pointant vers un manifeste au format JSON.\n \n- Fusion des fichiers : Les mises à jour divisées en plusieurs fichiers sont automatiquement fusionnées lors du téléchargement.\n \n- Support des proxys : Pour les utilisateurs derrière un pare-feu ou sur une PS5 jailbreakée sans accès direct à Internet, fetchpkg prend en charge les téléchargements via un serveur proxy.\n \n- Multiplateforme : L’outil est compatible avec Linux, Windows et les PS5 modifiées.\n \n \n \n\n \n \nUtilisation sur PS5 :\n \n- Pour utiliser fetchpkg sur une PS5 jailbreakée, il est nécessaire de charger l’exécutable via un chargeur ELF (comme shsrv) et de transférer le fichier sur la console (par exemple, via ftpsrv). Une fois l’outil exécuté, les fichiers PKG peuvent être téléchargés sur un support externe comme une clé USB.\n \nMaster-s dévoile la version 1.0 de PS Fetchpkg, il s'agit d'une amélioration sous forme de fork de la version proposée par John Tornblom. \n \n \nTéléchargement : PS Fetchpkg v1.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203352/in-ps5-ps-fetchpkg-v10-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203352/in-ps5-ps-fetchpkg-v10-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] PS5 Homebrew Apps_v1.4 disponible",
        "content": "Le développeur Master-s propose une nouvelle version de PS5 Homebrew Apps qui est maintenant affublé de la numérotation 1.4.\n \nPS5 Homebrew Apps est un ensemble d'homebrews qui fonctionne avec websrv. websrv est un serveur Web simple qui peut être exécuté sur une Playstation 5 jailbreakée via les points d'entrée BD-J ou Webkit . Il peut être utilisé pour lancer des homebrews via le navigateur Webkit intégré à la PS5, ou à distance depuis votre PC, smartphone...\n \n \n\n \n \nDans cette version 1.4 le développeur a ajouté fetchpkg.elf et kstuff.elf.\n \nTéléchargement : PS5 Homebrew Apps_v1.4 \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203347/in-ps5-ps5-homebrew-apps-v14-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[PSP] ChronoSwitch v7.6.3 disponible",
        "content": "Il aura fallu attendre 6 ans, mais voilà que débarque une nouvelle version de ChronoSwitch Downgrader, l'outil qui permet de downgrade la console PSP, développé à l'origine par Davee, l'utilitaire a repris du service grâce au développeur krazynez. \n \nLa mise à jour a démarré il y quelques jours puisque les premiers changements ont eu lieu le 30 décembre 2024, avec notamment l'ajoute de nouveaux prints pour diagnostiquer des problèmes avec l'Eboot.pbp grâce à une analyse poussée des fichiers et des tampons ainsi que des rapport d'erreurs. \n \n \n\n \n \n \nChangelog ChronoSwitch v7.6.3 :\n \n- Firmware downgrader pour la Playstation Portable (PSP)\n- Mise à jour pour utiliser la somme de contrôle md5 pour le firmware PSP GO\n- Plus de clarté dans la sélection du firmware de base afin d'exécuter ChronoSwitch \n \n \n\n \n \nDes améliorations ont été apportées sur l'utilisation des contrôles MD5 pour le firmware PSPgo, pour installer Chronoswitch Downgrader vous allez devoir télécharger et extraite le contenu dans le dossier PSP de votre console. \n \nTéléchargement : ChronoSwitch Downgrader v7.6.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203345/in-psp-chronoswitch-v763-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203345/in-psp-chronoswitch-v763-disponible-1.jpg"
        }
    },
    "news_12": {
        "title": "[WiiU] minutes v1.1 disponible",
        "content": "Le développeur jan-hofmeier propose une mise à jour de minute_minute, qui comme vous le savez permet de remplacer le boot1 de la Nintendo Wii U, un peu comparable à BootMii. \n \nMinute_minute ne s'affichent plus pendant le démarrage automatique et le rechargement de l'IOSU.\n \n \n\n \n\n \n \n \nChangelog :\n \n- masque les minutes au démarrage automatique\n- masque les minutes lors du rechargement d'iosu\n \n \nTéléchargement : minute_minute v1.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203343/in-wiiu-minutes-v11-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203343/in-wiiu-minutes-v11-disponible-2.png"
        }
    },
    "news_13": {
        "title": "[Switch] Switchroot LineageOS Downloader v1.0.1 disponible",
        "content": "Le développeur sthetix a dévoilé Switchroot LineageOS Downloader qui passe déjà en v1.0.1. De quoi s'agit-il, d'un petit programme Windows qui permet de simplifier le processus de téléchargement et d'organisation des builds LineageOS pour la console Switch. \n \nCette petite application permet de télécharger les fichiers nécessaires, elle va se charger de vérifier l'intégrité avec les contrôles SHA-256, l'idée est aussi d'organiser les dossiers correctement pour une installatio simplifiée, voir pour les variantes des tablettes ou des android TV.\n \nLe logiciel se charge automatiquement de créer des dossiers, y compris swithroot et bootloader, qui va générer le fichiers android.ini, ce logiciel s'appuie aussi sur les téléchargements multithreads, sur des fonctions de reprises de téléchargements, ou encore d'optimisation de bande passante. \n \n \n \n\n \n \n \nChangelog 1.0.1 : \n \n- Gestion des téléchargements améliorée : processus rationalisés pour une gestion plus facile des fichiers et une gestion plus efficace des téléchargements ayant échoué.\n- Barre de progression améliorée : un indicateur de progression visuellement amélioré qui compte les fichiers téléchargés (par exemple, 1 sur 10) au lieu d'afficher la taille totale du fichier.\n- Compatibilité multiplateforme : inclut un script Python spécial, LineageOSDownloader-mac-pc.py, conçu pour la compatibilité avec Mac et PC (Remarque : non testé sur macOS).\n \nChangelog 1.0.0 : \n \n- Interface graphique facile à utiliser : une interface claire et intuitive pour une navigation fluide.\n- Thème sombre : un thème sombre moderne pour une utilisation confortable.\n- Structure de dossiers automatique : crée les dossiers nécessaires ( switchroot, bootloader, etc.) et génère le fichier android.in requis.\n- Téléchargements multithreads : télécharge plusieurs fichiers simultanément pour des performances plus rapides.\n- Vérification de la somme de contrôle : garantit l'intégrité des fichiers en vérifiant les sommes de contrôle SHA-256 pour les fichiers téléchargés.\n- Téléchargements reprenables : prend en charge la reprise des téléchargements interrompus, économisant ainsi du temps et de la bande passante.\n- Suivi de la progression : mises à jour de la progression en temps réel avec une barre de progression et des statistiques de téléchargement détaillées.\n- Gestion des erreurs : réessaye automatiquement les téléchargements ayant échoué et enregistre les erreurs à des fins de dépannage.\n- Répertoire de téléchargement personnalisable : les utilisateurs peuvent sélectionner un dossier de téléchargement personnalisé.\n- Portable : Aucune installation requise ; téléchargez simplement le fichier EXE et exécutez-le.\n \nTéléchargement : Switchroot LineageOS Downloader v1.0.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203319/in-switch-switchroot-lineageos-downloader-v101-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[PS5] etaHEN 2.0b pre-release intégré dans IPV6-BDJ-etaHEN",
        "content": "Si vous suivez l'actualité de la scène PS5, cela ne vous aura pas échappé que LightningMods propose depuis quelques jours de tester etaHEN 2.0b Pre-Release. Bien entendu cette version doit être utilisé avec la toute dernière version ItemzFlow, l'ensemble se trouvant ici : https://github.com/etaHEN/etaHEN/releases/tag/2.0b-pre\n \nLightningMods a informé qu'il n'y aura plus de mise à jour d'etaHEN avant l'arrivée de la version finale, sans pour autant s'engager sur un délai de disponibilité, cette pre-release servant de beta-test. La première des choses qui frappe est que le poids a été divisé par trois, cette version préliminaire ne sera pas mise à jour. Toutes les corrections ou mises à jour effectuées après cette version seront enregistrées et ajoutées à la version finale.\n \n \nTéléchargement : etaHEN 2.0b pre-release\n \n \nLe développeur vient également de publié une version d'IPV6-BDJ-etaHEN intégrant cette version d'etaHEN 2.0b Pre-Release, il s'agit d'une version ISO qui peut être lancé avec l'exploit blu-ray BDJ qui fonctionnera sur les firmwares 3.00 à 4.51 (l'exploit blu-ray lui fonctionnant au dessus, mais pas l'exploit kernel). \n \n \n \n\n \n \n \n \nTéléchargement : IPV6-BDJ-etaHEN avec etaHEN 2.0b Pre-Release\n \n \n \n",
        "images": {}
    },
    "news_15": {
        "title": "[Multi] Des failles dans les AMD Zen 1 à Zen 4",
        "content": "Notre ami sunriseur rim-k06 nous informe via le tchat que des failles de sécurité ont été découvertes sur les CPU Zen 1 à Zen 4, des vulnérabilités de vérification de firmwares présentes et exploitables sur de nombreux appareils et qui pourraient être utilisé à des fins malveillantes. \n \nGoogle, via son équipe Google Security Research, a récemment publié un avertissement de sécurité (GHSA-4xq7-4mgh-gp6w) mettant en garde contre une vulnérabilité critique affectant un logiciel ou une bibliothèque open source largement utilisée. Bien que les détails techniques exacts n’aient pas été divulgués publiquement pour éviter toute exploitation malveillante, l’avertissement indique que cette faille pourrait permettre à un attaquant d’exécuter du code à distance ou de provoquer un déni de service.\n \nSelon les experts en sécurité, cette vulnérabilité pourrait toucher des milliers de systèmes et d’applications dépendants de la bibliothèque ou du logiciel concerné. Les secteurs les plus à risque incluent les services cloud, les infrastructures critiques et les applications web. Google a noté que les attaquants pourraient exploiter cette faille pour prendre le contrôle de systèmes vulnérables ou interrompre des services essentiels.\n \n \n\n \n \nGoogle a collaboré avec les acteurs du projet concerné pour publier un correctif. Les utilisateurs et administrateurs sont vivement encouragés à :\n \n- Vérifier s’ils utilisent une version affectée du logiciel ou de la bibliothèque.\n- Appliquer immédiatement les mises à jour ou correctifs fournis.\n- Surveiller les systèmes pour détecter toute activité suspecte.\n \nCet avertissement souligne l’importance de la collaboration entre les chercheurs en sécurité et les macteurs de projets open source. Google Security Research joue un rôle clé dans l’identification et la correction des vulnérabilités avant qu’elles ne soient exploitées à grande échelle.\n \nPour plus de détails techniques, les utilisateurs peuvent consulter le document officiel sur GitHub : GHSA-4xq7-4mgh-gp6w.\n \n \nA l'image de ce qui se passe sur le programme bounty, les failles ont été rapportées le 25 septembre 2024, et n'ont été dévoilées qu'hier, laissant le temps à AMD et aux acteurs de réagir, AMD a ensuite fourni un correctif sous embargo à ses clients le 17 décembre 2024. Pour coordonner nos efforts avec AMD, nous avons fait une exception ponctuelle à notre politique standard de divulgation des vulnérabilités et avons retardé la divulgation publique jusqu'à aujourd'hui, le 3 février 2025. \" Cette divulgation conjointe intervient 46 jours après qu'AMD a partagé le correctif avec ses clients et 131 jours après le rapport initial de Google. En raison de la chaîne d'approvisionnement, de la séquence et de la coordination approfondies requises pour résoudre ce problème, nous ne partagerons pas tous les détails pour le moment afin de donner aux utilisateurs le temps de rétablir la confiance dans leurs charges de travail informatiques confidentielles. Nous partagerons des détails et des outils supplémentaires le 5 mars 2025. \" \n \n \nMerci rim-k06 pour l'information. \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203298/in-multi-des-failles-dans-les-amd-zen-1-a-zen-4-1.png"
        }
    },
    "news_16": {
        "title": "[PS3] PS3HEN Open Beta (release candidate) d'esc0rtd3w disponible",
        "content": "Le développeur esc0rtd3w propose depuis quelques jours de tester une version Bêta de ce qui sera le prochain PS3HEN, nous sommes déjà à la version 9 de ce test grand public qui est ce que l'on pourrait qualifier d'Open Bêta. \n \nLes changements ne sont pas forcément le fruit d'esc0rtd3w, Aldostools a largement contribué à modifier certains paramétrages. Cette version du 02.02.2025 est la version la plus aboutie, appelée Version Candidate n°1 entre les firmwares 4.80 et 4.91 en CEX.\n \n \nCette version 3.3.1 apporte bien entendu pas mal de changements.\n \n \n\n \n \n \n3.3.1 Source :\n \n- Modifications du plugin HEN\n- Ajout de la fonctionnalité de restauration HEN pour le nouveau package qui prend en charge la survie de HEN après un reformatage du disque dur (merci @LuanTeles )\n- Ajout de la fonction create_default_dirs pour créer des dossiers standard s'ils manquent sur dev_hdd0 (merci @LuanTeles )\n- Ajout de la fonction DLOG pour la sortie vers usb000 (développeurs uniquement)\n- Ajout du nettoyage des fichiers PSN (merci @LuanTeles )\n- Fonction clear_web_cache_check nettoyée\n- Fonctions mises à jour pour les préréglages LED\n- Fonction set_build_type mise à jour pour vérifier les ports USB 000 - 007 (pour le mode développeur)\n- Programme d'installation d'urgence mis à jour pour vérifier les ports USB 000 - 007 (HEN_UPD.pkg depuis USB)\n- Modifications du payload\n- Les fichiers du plug-in de démarrage sont désormais renommés temporairement, au lieu de les supprimer si WMM est détecté lors de l'installation\n- Mise à jour des décalages cellFsMkdir_symbol\n- Ajout de cellFsRename_symbol\n- Ajout de la prise en charge de rap.bin. Il recherche /dev_hdd0/game/PS3XPLOIT/USRDIR/rap.bin lorsque la fonction make_rif s'exécute.\n- Modifications apportées à la fonctionnalité make_rif pour de meilleures performances (merci @aldostools )\n- Mise en œuvre d'une fonctionnalité de lecture optimisée de rap.bin (merci @Evilnat )\n- Modifications des ressources\n- Ajout de nouveaux fichiers RAF de coldboot personnalisés pour la publication, le débogage, l'USB et DEX (merci @Charles_n_town )\n- Utilisation du répertoire de jeu PS3XPLOIT pour ajouter l'état d'installation de HEN à la base de données GAMEDATA, pour survivre au format HDD (masqué du XMB) (merci @LuanTeles )\n- Entrée seg_mcutility corrigée dans category_game.xml (répare le problème avec l'élément de menu de la carte mémoire virtuelle PS1/PS2) (merci @LuanTeles )\n- Ajout du lien d'installation/lanceur PS Home sous la catégorie PSN (merci @DeViL303 )\n \n \n \nTest n°9 (02-02-2025) : version candidate n°1 (firmware entre 4.80 - 4.91 CEX)\n \nAttention : il y a un lien par firmware ! \n \n \nTout est là : psx-place.com\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203278/in-ps3-ps3hen-open-beta-release-candidate-desc0rtd3w-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[Switch] ezRemote mis à jour sur PS3, Switch et Vita",
        "content": "Le développeur cy33hc propose une nouvelle version d'ezRemote, mais comme toujours, ce sont toutes les consoles qui profitent de ces évolutions. Il n'y a que la version PS4 qui n'a étrangement pas été mise à jour. \n \n \n\n \n \nChangelog : \n \n- Correction d'un crash aléatoire lors de la connexion à archive.org\n- Mise en oeuvre d'une optimisation de la mémoire lors de l'analyse de listes HTML volumineuses dans archive.org et le site Web myrient. Certaines listes volumineuses de quelques milliers ne devraient plus faire planter l'application maintenant. L'application peut toujours planter s'il y a plus de 5 000 listes dans un répertoire.\n- L'application demandera désormais un filtre lorsque la liste des répertoires archive.org et myrient contient plus de 500 listes. Il est recommandé d'appliquer un filtre pour réduire les résultats afin d'éviter le plantage de l'application\n \n \n \nTéléchargement : ezRemote v1.09 / ps3-ezremote 1.10 / vita-ezremote 1.10\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203267/in-switch-ezremote-mis-a-jour-sur-ps3-switch-et-vita-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS3] WebMAN MOD 1.47.47n disponible",
        "content": "Le développeur Aldo Vargas, connu sous le pseudonyme d'Aldostools, vient de publier une nouvelle version de son plugin WebMAN MOD qui est désormais proposé en v1.47.47n.\n \nComme vous le savez son plugin développé par Deank permet de lancer des backups de jeux PS3, PS2, PS1, PSP ainsi que des Blu-ray ou des DVD, stocké sur disque dur (y compris en NTFS) ou sur le réseau local, au format JB ou ISO. M@tsumot0 et Aldostools ont proposé une version MOD de webMan, apportant notamment le support de 21 langages utilisant des fichiers externes, un installer/updater pour CFW Cobra et NonCobra, le spoof IDPS/PSID, la désactivation des syscalls du cfw, et de nombreuses autres évolutions qui se sont succédées.\n \n \n \n\n \n \nChangelog : \n \n- Mise à jour cumulative (comprend plus de 29 changements sur l'ensemble d'outils depuis la version initiale de 1.47.46).\n- Correction de la détection des clés partielles dans language.h #1170\n- Régression corrigée dans l'affichage de /setup.ps3\n- Correction d'une erreur typographique dans le code setu qui dupliquait les paramètres pour « Attendre qu'un périphérique USB soit prêt » #1169\n- Correction automatiquement l'horloge PS3 si la date est antérieure au 24/12/2024.\n- Nouvelles mises à jour de la base de données de configuration PS2 avec corrections de bugs@mrjaredbetaet@kozarovv.\n- Configuration webMAN : ajout d'un sous-menu pour activer/désactiver webMAN MOD Lite\n- Création de répertoire par défaut modifiée en fonction du type de contenu sélectionné dans /setup.ps3\n- Divers correctifs mis en œuvre par@sunnyqeen #1158  #1155  #1145 ",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203266/in-ps3-webman-mod-14747n-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] Une demande de retrait DMCA pour Bloodborne étrange",
        "content": "Sony a récemment envoyé une notification DMCA (Digital Millennium Copyright Act) concernant un patch pour le jeu Bloodborne qui avait été publié en 2021, c'est ce que rapporte IGN.com. Ce patch, développé par des passionnés, vise à améliorer l'expérience de jeu sur PlayStation 4, notamment en ajustant le taux de rafraîchissement et en corrigeant certains bugs.\n \n \n\n \n \nBien que le patch ait été disponible depuis plusieurs années, Sony semble maintenant prendre des mesures pour empêcher sa distribution. La notification DMCA cible spécifiquement les liens et les ressources liés à ce patch, invoquant des violations de droits d'auteur.\n \nCette décision a suscité des réactions mitigées dans la communauté des joueurs. Certains soutiennent que Sony protège légitimement sa propriété intellectuelle, tandis que d'autres estiment que le patch était une contribution positive pour les fans de Bloodborne, un jeu qui n'a jamais reçu de mise à jour officielle pour les consoles next-gen comme la PlayStation 5.\n \nPour l'instant, il reste à voir si cette action de Sony aura un impact plus large sur les mods et les patches créés par la communauté pour d'autres jeux de la marque, mais il pourrait s'agir avant tout d'une demande de FromSoftware. \n \n \n \n\n \n \nBloodborne est bien sûr l'une des plus grandes énigmes de l'industrie du jeu vidéo. Le chef-d'oeuvre de FromSoftware a été lancé sur PS4 et a été salué par la critique et le public, mais depuis, Sony et FromSoftware n'y ont plus touché, il semblerait qu'un remake ou un remaster soit donc dans les projets, ce qui viendrait justifier cette demande de DMCA. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203246/in-ps4-une-demande-de-retrait-dmca-pour-bloodborne-etrange-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203246/in-ps4-une-demande-de-retrait-dmca-pour-bloodborne-etrange-2.png"
        }
    },
    "news_20": {
        "title": "[PS4] Les GoldHEN Cheats mis à jour encore et toujours",
        "content": "De manière régulière les cheats codes de GoldHEN Cheat sont mis à jour par de nombreux développeurs et utilisateurs, la liste de codes est très régulièrement mise à jour, il faut dire que cela évolue vite. \n \nAu délà de rajouter ou modifier certains codes, ce sont de nouveaux supports qui sont aussi ajoutés, et certains sont spécifiques selon les jeux, ainsi depuis le début de l'année des jeux comme Final Fantasy 7 Remake 1.02, Astérix, Devil May Cry Définitive Edition, ou encore The Witcher 3 Wild Hunt 4.06 ont vu débarquer des updates spécifiques. \n \nPour mettre à jour les cheats codes il est préférable d'utiliser GoldHEN_Cheat_Manager de Bucanero, même si ce dernier a été archivé.\n \n \n \n\n \n \n \nComme vous le savez, activer ce genre de fonctions, de vies, d'argent ou de munitions illimitées peuvent gâcher un peu le plaisir de jouer et l'équilibre défini par les développeurs des jeux, donc à utiliser avec parcimonie.\n \n \nTéléchargement : GoldHEN_Cheat_Repository (01/02/2025)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203243/in-ps4-les-goldhen-cheats-mis-a-jour-encore-et-toujours-1.jpg"
        }
    }
}