{
    "news_1": {
        "title": "[PS5] PS5 BD-JB ELF Loader v1.6.2 disponible",
        "content": "Le développeur John Törnblom vient de publier une mise à jour de PS5 BD-JB ELF Loader pour PlayStation 5. Pour rappel, l'ISO exploite les vulnérabilités découvertes dans la couche BD-J du firmware 4.51 de la PS5 et les versions antérieures de la console PlayStation 5, il vous faudra donc une console avec un lecteur fonctionnel et de quoi graver le bluray, en plus du bon firmware compatible. \n \n \n\n \n \n \nDans cette nouvelle version 1.6.2 de PS5 BD-JB ELF Loader, le développeur a introduit la prise en charge des payloads indépendamment de la position dans le code. Cela signifie que les payloads peuvent désormais s'exécuter n'importe où sur le système ou l'appareil, sans être limitées à un emplacement spécifique. Cette flexibilité permet aux utilisateurs d'exécuter le code souhaité de manière plus polyvalente, sans dépendre de chemins fixes ou prédéfinis.\n \n \nIl a mis à jour également le SDK : ps5-payload-sdk\n \n \nTéléchargement : PS5 BD-JB ELF Loader v1.6.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174775/in-ps5-ps5-bd-jb-elf-loader-v162-disponible-1.jpg"
        }
    },
    "news_2": {
        "title": "[Multi] DS4Windows améliore la gestion des DualShock 3",
        "content": "Le développeur Ryochan7 vient de proposer une nouvelle version de son utilitaire DS4Windows qui comme vous le savez permet de détecter et de configurer de nombreuses manettes sur un PC. \n \nAvec cette version les nouvelles corrections se focalise sur quelques optimisations pour les DualShoc 3, mais aussi la gestion de la compensation du gyroscope des souris. Comme vous le savez DS4Windows est une interface efficace pour paramétrer une manette sur PC, il est basé sur un fork de Jays2Kings. Pour en profiter cela passe par un câble micro-USB, mais il est aussi possible de s'en servir sans fils avec quelques adaptateurs Bluetooth 2.1 (ou supérieur). \n \n \n\n \n\n \n \n \n \nChangelog : \n \n- Ajout de l'enregistrement des tâches à la méthode de reprise\n- Augmentation de la période d'attente dans la routine de reprise\n- Mise à jour du lien d'installation de HidHide vers la version 1.2.128.0\n- Modification de la vérification de la frontière pour le placement de la fenêtre principale au démarrage\n- Ajout d'une compensation de gigue pour le Gyro Mouse Joystick\n- Rendre optionnelle la prise en charge des périphériques DS3. Le séparer de la prise en charge de la manette DS4\n- Abaissement de la limite X- du JoyCon LS lorsqu'il n'y a pas de calibration utilisateur.\n- Mise à jour des fichiers FakerInputDll.dll avec correction du drapeau d'écriture de fichier\n- Correction de l'enregistrement initial de l'état d'activation par défaut pour les contrôleurs non-DS4. Modifie principalement l'enregistrement dans le dossier AppData\n- Mise à jour de la traduction française. Contribution de EnzoChaussivert\n- Correction de la restauration de la position de la fenêtre sur les systèmes multi-moniteurs. Contribution de kurtanr \n \nTéléchargement : DS4Windows 3.2.11\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174772/in-multi-ds4windows-ameliore-la-gestion-des-dualshock-3-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174772/in-multi-ds4windows-ameliore-la-gestion-des-dualshock-3-2.png"
        }
    },
    "news_3": {
        "title": "[PS4] Le développeur Noob404 apporte Windows 10 à la PS4",
        "content": "Le développeur Noob404 que l'on connait bien sur PlayStation 4 et PlayStation 4 Pro pour avoir apporter de nombreuses distributions Linux vient de mettre en ligne un nouvel OS pour la console de Sony. \n \n \n \n\n \n \n \nProxmox OS pour PS4 est une solution qui vous permet de virtualiser Microsoft Windows 10 sur votre console PlayStation 4 à l'aide du système d'exploitation Proxmox, cela signifie que vous allez pouvoir installer et faire tourner Windows 10 sur PS4 via cette plate-forme de virtualisation d'entreprise open-source.\n \n \n\n \n \n \nLe gros avantage de Proxmox OS est de proposer une interface Web permettant de gérer les machines virtuelles, mais aussi le réseau, l'espace des stockage : \n \n- GUI Web Admin : Proxmox OS fournit une interface d'administration basée sur une interface graphique accessible via un navigateur Web. Cela permet aux utilisateurs de gérer facilement les machines virtuelles, les conteneurs, le stockage et la mise en réseau directement depuis la console PS4.\n- Accéder à Internet via Ethernet : La console PS4 est capable de se connecter à Internet via une connexion Ethernet.\n- Possibilité de faire tourner Windows : Grâce à la virtualisation offerte par Proxmox OS , il est possible de créer et faire tourner des machines virtuelles Windows 10 sur la console PS4. Cela signifie que vous pouvez utiliser des applications et des jeux compatibles avec Windows.\n- Console intégrée, accessible via un navigateur : Proxmox OS pour PS4 propose une console intégrée accessible via un navigateur Web. Cela vous permet d'interagir directement avec les machines virtuelles et les conteneurs créés sur la console PS4.\n- Accès SSH et FTP activés : Proxmox OS pour PS4 prend en charge l'accès via SSH (Secure Shell) et FTP (File Transfer Protocol). Cela permet aux utilisateurs d'accéder à distance à la console PS4 et de gérer les fichiers système et les configurations.\n \nTout n'est pas parfait, et certains bugs seront présents, les machines virtuelles créées sur Proxmox pour PS4 ne peuvent pas accéder directement au GPU de la console. Cela signifie que les performances graphiques des machines virtuelles peuvent être limitées, et le Wifi de la console PS4 n'est pas encore prise en charge dans le cadre de Proxmox pour PS4, par conséquent, les machines virtuelles créées sur Proxmox OS devront s'appuyer sur une connexion Ethernet pour accéder à Internet.\n \n \n \n\n \n \n \nComment installer la bête : toutes les instructions ici \n \n \nTéléchargement : Proxmox pour PS4 (bêta)\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-16315622.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-791830903.png"
        }
    },
    "news_4": {
        "title": "[PS3] RPCS3 v0.0.28 Alpha disponible",
        "content": "La Team RPCS3 vient de mettre en ligne une nouvelle version majeure de leur émulateur PlayStation. Il y a maintenant 12 ans commencé le développement de RPCS3 avec une petite équipe de programmeurs dirigée par DH et Hykem, aujourd'hui le programme est le meilleur émulateur PS3 supportant DirectX12, Vulkan et OpenGL. \n \nC'est le développeur Nekotekina qui est en charge de RPCS3 mais il n'agit pas seul, il a toute une armée de programmeurs avec lui qui continuent de faire progresser le logiciel. \n \n \n\n \n \nL'équipe annonce une grande nouvelle pour les fans de Gran Turismo, les jeux GT sont désormais très stables sur RPCS3 ! Bien qu'ils ne puissent pas encore être considérés comme jouables en raison de quelques problèmes graphiques et de performances, vous pouvez maintenant avoir une bonne expérience si vous avez un bon PC et si vous suivez la page wiki pour les jeux.\n \n \n\n \n \n\nEt pour une fois, la Team diffuse un changelog en regroupant les dernières modifications sous Github.\n \n- rsx: Implémenter des allocations différées de tampons pour l'écriture GPU par @kd-11 dans #13473\n- pkg install: Renvoyer une erreur correcte si possible par @Megamouse dans #13478\n- cellMic: Améliorations aléatoires par @Megamouse dans #13426\n- Qt: Désactiver le réglage psn dans les paramètres globaux par @Megamouse dans #13480\n- rpcn: Lancer une exception lors de l'utilisation des fonctionnalités rpcn sans une configuration appropriée par @Megamouse dans #13482\n- Patches: Patches virtuels pour déplacer/supprimer/créer des fichiers de jeu par @elad335 dans #13483\n- Correction de la connexion wolfssl par @RipleyTom dans #13487\n- VFS: Correction du montage de chemins inexistants par @elad335 dans #13488\n- Qt: Désactiver certains paramètres réseau dans la configuration globale. Réactiver RPCN dans la configuration globale. par @Megamouse dans #13489\n- patches: Correction de l'erreur move_file/hide_file par @Megamouse dans #13491\n- overlays: Ajout de la notification de compilation PPU et mise à jour des notifications de compilation existantes par @Megamouse dans #13423\n- cellVdec: Annuler le changement d'alignement RGBA par @Megamouse dans #13496\n- hid: Essayer de corriger linux par @Megamouse dans #13499\n- cellSaveData: Achèvement lent de la sauvegarde (réintroduit les icônes emblématiques de sauvegarde de jeu) par @elad335 dans #13492\n- Utiliser NBIO pour RPCN par @RipleyTom dans #13511\n- Ajouter une meilleure gestion des erreurs pour RequestSignalingInfos par @RipleyTom dans #13514\n- PPU: Ne pas interrompre sur un TOC inattendu par @elad335 dans #13490\n- Ajouter l'icône de rotation manquante à partir des ressources par @RipleyTom dans #13521\n- Correction de hid_pad_handler par @RipleyTom dans #13525\n- llvm: Mettre à jour le code vers la nouvelle API par @oltolm dans #13500\n- SPU LLVM: Correction de la régression de #13500 par @Nekotekina dans #13533\n- Utiliser la nouvelle API LLVM dans SPURecompiler par @oltolm dans #13536\n- Utiliser des URLs relatives dans .gitmodules par @RipleyTom dans #13547\n- Trophies: Enregistrer des erreurs plus spécifiques en cas d'échec de l'installation par @Megamouse dans #13544\n- Correction des horodatages dans signaling_handler par @RipleyTom dans #13551\n- Signaling: Indiquer l'état inactif sur une connexion inconnue par @RipleyTom dans #13553\n- Correction de l'utilisation intensive du CPU dans recvn par @RipleyTom dans #13543\n- Amélioration de la gestion des invitations par @RipleyTom dans #13552\n- cellFsReaddir: Correction de la séquence de terminaison / Correction du plantage de l'état de sauvegarde lors du chargement par @elad335\n- Correction de l'utilisation du thread de microphone par @RipleyTom dans #13593\n- cellMusicExport : première implémentation par @Megamouse dans #13596\n- Ajout des fichiers .autosave de Qt Creator à .gitignore par @elad335 dans #13597\n- sys_fs et VFS : Corrections diverses de bugs par @brian218 dans #13477\n- Correction du crash de l'émulateur lors de l'arrêt de l'émulation après une pause par @elad335 dans #13530\n- Mise à jour des dépendances par @Megamouse dans #13613\n- Mise à jour vers LLVM 16 par @Nekotekina dans #13534\n- rsx : Ajout d'un contournement de la largeur de découpage pour certains jeux défectueux par @kd-11 dans #13623\n- llvm : correction du chemin du sous-module par @Megamouse dans #13622\n- cellGcm : ajout de plusieurs énumérations par @Megamouse dans #13587\n- Ajout de modes d'affichage 3D alternatifs par @headassbtw dans #13582\n- Amélioration de la planification des threads cellMic et sys_usbd par @RipleyTom dans #13601\n- Correction de l'option BUILD_LLVM par @RipleyTom dans #13627\n- Mise à jour de BUILDING.md selon les modifications apportées par #13622 par @brian218 dans #13628\n- Suppression des conversions de pointeur inutiles par @oltolm dans #13617\n- Mise à jour vers LLVM 16.0.1 par @Nekotekina dans #13629\n- Transferts audio de Skylander Portal : Trap Team par @deReeperJosh dans #13565\n- Mise à jour de build-mac.sh par @nastys dans #13644\n- Correction du deref dans cellSaveData par @RipleyTom dans #13646\n- Loader : rendre l'analyse des exécutables ne pas interrompre l'interface utilisateur lors du lancement des jeux par @elad335 dans #13630\n- Force des opérations FP déterministes lors de la connexion en ligne par @RipleyTom dans #13608\n- vk : contournement pour GTX970 par @kd-11 dans #13577\n- Debugger : correction du pas par-dessus par @elad335 dans #13649\n- cellMic : fallback vers un nombre de canaux et un taux d'échantillonnage inférieurs si la demande n'est pas prise en charge par @Megamouse dans #13614\n- Ajout de boutons de sauvegarde d'état au menu principal par @elad335 dans #13562\n- PPU LLVM : désactivation de la passe DSE par @Nekotekina dans #13651\n- SPU LLVM : utilisation des chargements atomiques pour la lecture du nombre de canaux par @Nekotekina dans #13659\n- Correction du chemin temporaire dans l'outil de mise à jour par @RipleyTom dans #13661\n- jit : correction de vec_cmp_eq par @kd-11 dans #13665\n- SPU LLVM : utilisation des enregistrements volatiles pour la mise à jour du PC par @Nekotekina dans #13670\n- Arrondir les valeurs des axes en forme de cercle au nombre entier le plus proche par @shockdude dans #13671\n- Inverser la liaison de l'axe du crossfader de la platine DJ Hero par @shockdude dans #13636\n- Implémenter sceNpManagerGetCachedInfo par @RipleyTom dans #13687\n- SPU LLVM : optimiser les enregistrements des registres par @Nekotekina dans #13672\n- vk : Promouvoir l'interpolation barycentrique à 64 bits par @kd-11 dans #13690\n- BufferUtils : corriger le chemin SSE2 pour les permutations de bytes par @Nekotekina dans #13691\n- Qt : ajouter une case à cocher à la boîte de dialogue de redémarrage par @Megamouse dans #13695\n- Qt : ajouter des filtres de grille par @Megamouse dans #13699\n- Qt : ajouter l'option de réinitialisation du temps de jeu par @Megamouse dans #13698\n- Conserver le chiffre 0 seconde dans les chaînes du micrologiciel par @Megamouse dans #13697\n- gl : Réorganiser la logique de suppression des pièces jointes par @kd-11 dans #13701\n- SPU LLVM : améliorer l'élimination des expressions mortes par @Nekotekina dans #13702\n- Chemin vers la bibliothèque LLVM corrigé en mode Debug par @luizfernandonb dans #13703\n- Réduire les E/S avec le chargement de la bibliothèque de jeux par @elad335 dans #13715\n- Supprimer certains avertissements par @Megamouse dans #13717\n- SPU LLVM : changement expérimental par @Nekotekina dans #13710\n- Mettre à jour les structures et la documentation Unself par @Megamouse dans #13711\n- Emu : Mettre en cache games.yml et enregistrer uniquement lorsque cela est nécessaire par @Megamouse dans #13716\n- Correction pour #13720 par @Nekotekina dans #13722\n- Qt : Optimiser le rafraîchissement de la liste dure par @Megamouse dans #13712\n- Mettre à jour les dépendances par @Megamouse dans #13725\n- Qt : Définir correctement la fonction de calcul de la taille du jeu par @Megamouse dans #13726\n- Interface utilisateur : Améliorations de la recherche de jeux par @elad335 dans #13719\n- Qt : corriger l'utilisation du délégué d'élément de tableau par @Megamouse dans #13737\n- SPU LLVM : corriger le bogue pour les processeurs AMD FX par @Nekotekina dans #13738\n- Qt : charger paresseusement les icônes des trophées par @Megamouse dans #13739\n- Qt : corriger l'exception de la boîte de dialogue de sauvegarde par @Megamouse dans #13743\n- Qt : chargement paresseux des icônes de sauvegarde par @Megamouse dans #13754\n- Qt : correction de l'ajout de vsh à la liste de jeux par @Megamouse dans #13758\n- rsx : corriger la largeur du framebuffer si la largeur de l'étrier convient mais pas la largeur de découpe par @kd-11 dans #13753\n- Qt : charger la liste de jeux de manière asynchrone tout en affichant une boîte de dialogue de progression par @Megamouse dans #13756\n- Réduire certaines inclusions de folie par @Megamouse dans #13766\n- Qt : corriger les courses de données et le comportement indéfini dans games_config, corriger l'annulation prématurée du futurewatcher par @Megamouse dans #13768\n- Optimiser le comportement de rafraîchissement de la liste de jeux par @Megamouse dans #13770\n- savestates : /sys_spu : corriger la sauvegarde des joints par @elad335 dans #13764\n- Qt : corrections de la liste de jeux par @Megamouse dans #13778\n- Loader : scinder add_only en une fonction distincte par @Megamouse dans #13760\n- Changer l'emballage AppImage pour un système activement maintenu par @hcorion dans #13777\n- Réintégrer la suppression de la bibliothèque wayland-client par @hcorion dans #13789\n- Utiliser une bibliothèque LLVM séparée pour la construction de l'AppImage sous Linux par @hcorion dans #13786\n- gl : corriger l'erreur de validation GL_INVALID_OPERATION dans blur_intensity par @AniLeo dans #13790\n- Qt/Utilities : fusionner la visionneuse de mémoire avec le moteur de recherche par @elad335 dans #13558\n- Ne pas inclure le dossier git par @Megamouse dans #13791\n- Forcer STATIC_LINK_LLVM avec BUILD_LLVM=ON par @RipleyTom dans #13794\n- Qt : corriger le premier icône invisible dans la liste de jeux par @Megamouse dans #13796\n- Corriger le blocage dans games_config par @RipleyTom dans #13797\n- vk : amélioration de l'interpolation des attributs pour NVIDIA par @kd-11 dans #13798\n- vk : propager le drapeau de permutation dans le moteur de copie en matériel par @kd-11 dans #13799\n- gl : corriger les conversions sans type par @kd-11 dans #13804\n- [Mise à jour de LLVM - correction de bogue] Ajouter la prise en charge de l'instruction BEXTR par @Nekotekina dans #13807\n- build : corriger USE_SYSTEM_SDL par @stefantalpalaru dans #13805\n- Qt : implémenter une disposition en flux pour la grille de jeux par @Megamouse dans #13801\n- Qt : filtrer les fichiers rpcs3_*.qm lors de l'énumération des langues par @Megamouse dans #13812\n- sys_fs & sys_game : améliorations diverses des appels système par @brian218 dans #13662\n- Corrections ASAN par @oltolm dans #13650\n- Modifications de FREST, FRQEST, FI par @RipleyTom dans #13723\n- Correction de la réinitialisation de la configuration rpcn\n- Corriger quelques avertissements par @Megamouse dans #13830\n- SPU/PPU/Debugger : Assurer des frames de pile ascendantes par @elad335 dans #13833\n- Obtenir le répertoire des polices depuis Windows par @oltolm dans #13825\n- System.cpp : Rendre le démarrage des mises à jour du disque plus strict par @elad335 dans #13832\n- Logs : corriger la lecture du paramètre \"Stack Cell Errors\" par @elad335 dans #13858\n- vk/rsx : améliorer la gestion des erreurs de mémoire par @kd-11 dans #13859\n- Outil de déchargement du code exécutable SPU par @elad335 dans #13852\n- Meilleure précision pour FREST/FRSQEST par @RipleyTom dans #13863\n- cli : ajouter la possibilité de journaliser les codecs ffmpeg par @Megamouse dans #13872\n- sys_usbd : émuler la base Disney Infinity par @deReeperJosh dans #13851\n- [Testeurs nécessaires] Prise en charge des instruments MIDI pour Rock Band 3 par @DarkRTA dans #13632\n- Qt : ne pas rafraîchir la grille de jeux après l'arrêt de l'émulateur par @Megamouse dans #13878\n- Logs/Debugger : Signal \"Go-To-Address\" à partir du texte du journal par @elad335 dans #13874\n- Windows : Utiliser un vecteur pour l'allocation des données des compteurs de performance par @Megamouse dans #13879\n- Mises à jour diverses par @Megamouse dans #13869\n- Qt : autoriser la possibilité de masquer les colonnes du tableau des trophées par @Megamouse dans #13880\n- rsx : corriger certains cas particuliers dans le découpage de la région d'atlas par @kd-11 dans #13875\n- input : ajouter l'option de maintenir les manettes connectées par @Megamouse dans #13881\n- Qt : ne pas rafraîchir la liste des micros et des midi dans le constructeur par @Megamouse dans #13887\n- cellSpurs : corriger le compte prêt par @elad335 dans #13889\n- Corriger spu_fm par @RipleyTom dans #13891\n- Débogueur : Implémenter le défilement des touches à travers les threads par @elad335 dans #13892\n- input : ajouter des vérifications de cohérence pour buf_size par @Megamouse in #13894\n- overlays : ne pas jouer de sons en cas de répétition automatique rapide par @Megamouse in #13898\n- SPU/Debug : Corrections par @elad335 in #13900\n- sceNpTrophy : définir les horodatages de déverrouillage par @Megamouse in #13867\n- vk : Ajouter la prise en charge de VK_EXT_custom_border_color par @kd-11 in #13901\n- pine : corriger quelques avertissements par @Megamouse in #13904\n- Mises à jour par @Megamouse in #13905\n- Profiter de l'API des noms de thread WIN10 par @elad335 in #13910\n- Overlays : aligner la largeur de l'étiquette du graphique avec la largeur du graphique par @Megamouse in #13918\n- Mettre à jour MVK vers 1.2.4 pour Vulkan SDK 1.3.250 par @shinra-electric in #13908\n- [TESTEURS NÉCESSAIRES] input : ajouter des fichiers de configuration pour l'entrée émulée par @Megamouse in #13896\n- cellCamera : ne pas passer au thread principal à moins que ce ne soit vraiment nécessaire par @Megamouse in #13920\n- Input/hid : ajouter quelques journaux supplémentaires par @Megamouse in #13921\n- rsx/overlays : corriger le plantage à la sortie du jeu par @elad335 in #13915\n- overlays : corriger l'interception des pads dans la boîte de dialogue de la liste des médias par @Megamouse in #13924\n- Qt/Debugger : Ajouter Ctrl+F (rechercher le thread), Ctrl+C (copier) par @elad335 in #13923\n- Corriger les doubles événements de debugger_frame par @elad335 in #13930\n- vk : Réécrire les allocations de descripteurs par @kd-11 in #13927\n- Trophées : Ajouter plus de vérifications de cohérence pour le backend pugixml par @Megamouse in #13925\n- Correction supplémentaire PS3_EXTRA par @elad335 in #13934\n- Qt/Loader : Permettre aux utilisateurs de choisir les packages à installer par @Megamouse in #13932\n- rsx : Améliorer la gestion de la mémoire cache des surfaces par @kd-11 in #13933\n- Améliorations Gran Turismo par @elad335 in #13917\n- rpcs3_version : Passer à la version 0.0.28 par @AniLeo in #13939\n \n \nTéléchargement :  RPCS3 v0.0.28 Alpha\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174735/in-ps3-rpcs3-v0028-alpha-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174735/in-ps3-rpcs3-v0028-alpha-disponible-2.png"
        }
    },
    "news_5": {
        "title": "[Switch] LineageOS 18.1 (Android 11) dévoilé pour Switch",
        "content": "La toute première version d'Android 11 vient d'être dévoilé par SwitchRoot, l'équipe en charge du portage d'Android sur Nintendo Switch. \n \nCette version est la première version bêta de LineageOS 18.1 (la ROM est basée sur une version pour Nvidia Shield TV). Basé sur Android 11, c'est la première fois que cette version d'Android est portée, sachant que tous les modèles de Switch sont pris en charge, Mariko et Aula compris.\n \n \nToutes les instructions d'installation se trouve ici : wiki.switchroot.org/en/Android/Setup-11\n \n \n\n \n \nIl y a tout un tas de spécificités à cette nouvelle version :\n \n- Mise à jour vers Android 11/LineageOS 18.1\n- Basculez vers Lineage Recovery comme récupération par défaut (TWRP disponible en tant qu'image flashable autonome sur la page de téléchargement)\n- Prise en charge de tous les modèles Mariko (v2, Lite, OLED)\n- Migration du chargeur de démarrage vers le chargeur L4T\n- GSM intégré\n- Prise en charge du bureau GL\n- Composition/superpositions matérielles complètes (y compris lors de l'amarrage)\n- Profils d'overclocking ajoutés via les entrées hekate ini (voir wiki pour plus de détails)\n- JoyCons fonctionne maintenant dans plus d'applications (y compris GeForce Now)\n- Mise à jour du contenu du stock Shield, du micrologiciel, etc. vers Shield Experience 9.1.1\n- Prise en charge et cohérence Wi-Fi considérablement améliorées (plus de solution de contournement de canal)\n- DeviceSettings amélioré (maintenant Switch Configuration) avec des options de configuration JoyCon pour remplacer les zips comme joycon-xbox et de nouvelles options de panneau\n- Docking pris en charge avec ou sans mise en miroir du panneau interne\n- Lanceur de console (https://www.consolelauncher.app/) intégré, avec mise à niveau Pro incluse gratuitement pour tous les utilisateurs de Switchroot (Merci @TheKyle#8441 !)\n- Claviers tactiles et contrôleurs intégrés sur les distributions ATV et tablette\n- Thème Switchroot, y compris l'arrière-plan et certains éléments de palette de couleurs\n- Corrections pour l'enregistrement de certains boutons sur les contrôleurs Nintendo dans différentes applications\n- La plupart des améliorations côté kernel dans L4T (comme la prise en charge de ddr200 pour les cartes SD compatibles) s'appliquent également ici\n- Beaucoup plus de changements et de correctifs  - lisez les journaux de validation pour plus d'informations\n \n \n\n \n\n \n\n \n\n \n Crédit images Twitter SaoriYuki\n \n \nAttention quelques bugs sont connus et seront corrigés plus tard si c'est possible : \n \n- L'amarrage nécessite parfois de se déconnecter et de se reconnecter et certains affichages étranges ne fonctionnent parfois pas - cela s'améliorera avec les mises à jour\n- L'amarrage utilise parfois par défaut une résolution stupide - il suffit de régler dans l'application Switch Configuration\n- L'IMU semble être cassé sur tous les appareils - aucun support n'est prévu pour l'IMU Invensense trouvé dans l'OLED, mais ceux du STM devraient fonctionner - je ne sais pas pourquoi ils ne le font pas\n- CEC ne fonctionne pas\n- L'interface utilisateur du volume ne fonctionne pas en raison d'un bogue de la plate-forme\n- RSMouse n'est pas inclus\n- Le trackpad Shield TV Remote ne fonctionne pas\n- La journalisation du framebuffer ne fonctionne pas dans notre U-Boot, donc si vous vous bloquez en raison d'une initialisation incorrecte de la carte (erreur de puce), rien ne s'imprimera - cela devrait être corrigé dans une mise à jour\n- adb, mtp, etc. ne fonctionnent pas lorsque USB3 est désactivé\n- Le premier démarrage après une mise à niveau sur place peut entraîner un plantage ou un redémarrage immédiat vers la récupération - cela ne devrait être que temporaire et vous devriez pouvoir l'ignorer en toute sécurité\n- De mauvaises performances sur les mises à niveau d'Erista ont été signalées - essayez une nouvelle installation si vous rencontrez ce problème, et notez qu'il peut y avoir des problèmes de performances d'Erista dans l'ensemble - si nous trouvons la source, nous corrigerons dans une mise à jour de suivi\n \n \nTéléchargement :  LineageOS 18.1 (Android 11) pour Switch\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174734/in-switch-lineageos-181-android-11-devoilee-pour-switch-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1174734/in-switch-lineageos-181-android-11-devoilee-pour-switch-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1174734/in-switch-lineageos-181-android-11-devoilee-pour-switch-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1174734/in-switch-lineageos-181-android-11-devoilee-pour-switch-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1174734/in-switch-lineageos-181-android-11-devoilee-pour-switch-5.jpg"
        }
    },
    "news_6": {
        "title": "[PS4] Street Fighter 6 en cours de backport",
        "content": "Il n'aura fallu pas bien longtemps à CyB1K pour backporter Street Fighter 6 sur PlayStation 4 et PlayStation 4 Pro pour les firmwares 5.05 / 6.72 / 7.02 / 7.55 et 9.00. \n \nCe n'est, à proprement parler, pas encore fait, mais clairement il est déjà en train de stabiliser le jeu, il a réussi à le backporter mais il doit encore régler quelques bugs. \n \n \n\n \n \nIl annonce avoir réussi à fixer le jeu pour qu'il tourne, cependant comme un peu tous les derniers jeux, il rencontre encore un soucis important. Il semblerait que le jeu dispose d'une sécurité ne rendant accès qu'au mode entrainement, et qu'il réponde que le jeu est en cours d'installation.\n \n\n \nLe développeur vient de réagir en annonçant que ce n'est pas ce qu'il pensait, ce qui peut laisser croire qu'il a réussi à contourner ce blocage. \n \n \n \n\n \n \n \nLe développeur CyB1K continue son travail remarquable sur les backports PS4, et nous ne pouvons que l'on remercier. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174733/in-ps4-street-fighter-6-en-cours-de-backport-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1174733/in-ps4-street-fighter-6-en-cours-de-backport-1.png"
        }
    },
    "news_7": {
        "title": "[PS4] GoldHEN Cheats Manager v1.1.0 disponible",
        "content": "Le développeur Bucanero vient de mettre en ligne une nouvelle version de GoldHEN Cheats Manager, comme vous le savez en plus de pouvoir sélectionner des astuces pour les cheatscodes, il permet d'appliquer des correctifs par exemple ceux créés par illusion0001. Au delà de ça, il permet aussi de convertir les types de cheats codes selon le format (classique par adresse, GoldHEN et SHN).\n \n \n\n \n \nChangelog 1.1.0\n \nAjouté : \n- Possibilité de supprimer les paramètres des patchs\n- Prise en charge des patchs à motifs masqués pour le filtrage\n- Nouveau menu de mise à jour\n- Mise à jour des Cheats depuis le Web, le disque dur, l'USB (@illusion0001)\n- Mise à jour des patchs depuis le Web, le disque dur, l'USB\n- Sauvegarde des fichiers de triche locaux au format .Zip (HDD/USB)\n- Sauvegarde des fichiers de correctifs locaux au format .Zip (HDD/USB)\n \nDivers :\n- Inclut le dernier cheat+patch pack officiel (2023-06-01)\n \n \nTéléchargement : GoldHEN Cheats Manager v1.1.0 \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174707/in-ps4-goldhen-cheats-manager-v110-disponible-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] DBI 576",
        "content": "Rashevskyv, le développeur de DBI propose une nouvelle version de son logiciel, la version 576. DBI, pour DB Installer, est un gestionnaire et installateur de fichiers NSP/NSZ/XCI et XCZ via SD, USB. Il fonctionne tout aussi bien en standalone ou bien en créant son propre serveur http local. Il permet aussi de gérer et supprimer les fichiers orphelins les tickets (mise à jours par exemple). Hormis une tendance très minimaliste exacerbée, DBI est apprécié pour ses fonctionnalités et une partie backend de Windows qui permet de faciliter les transferts.\n \nChangelog 576 :\n- Fixed a memory allocation bug for buffers (\"Extra buffers exceeded\"): This addresses a memory management issue where the maximum number of buffers was exceeded.\n- Fixed a visual glitch on the dbibackend standby screen: This presumably refers to a rectification of a visual defect present on the standby screen of the dbibackend system or application (#224)\nImplemented secure password and certificate support for SSH File Transfer Protocol (with keys '/switch/.ssh/id_rsa' and '/switch/.ssh/id_rsa.pub'): This denotes a security improvement where SSH authentication using passwords and certificates has been supported.\n- Updated libnx implementation: This signifies that the implementation of libnx (a library often used in the context of Nintendo Switch homebrew development) has been updated.\nTéléchargement: DBI 576\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174698/in-switch-dbi-576-1.jpg"
        }
    },
    "news_9": {
        "title": "[Switch] L'émulateur Switch Yuzu a été porté sur Android",
        "content": "L'équipe en charge du développement de Yuzu vient d'annoncer que la version Android de Yuzu vient d'être mise en ligne. Il s'agit là d'une nouvelle étape dans l'essor de Yuzu, apportant ainsi une diversité plus large des plates-formes permettant de faire tourner l'émulateur puisque cela ouvre le monde aux tablettes et au smartphones. \n \nForcément cette première version est loin d'égaler la version PC qui court après des années de développement, elle n'a pas de fonctions multi-joueurs, l'idée étant d'abord de se concentrer sur le développement pur et les optimisations avant de s'ouvrir à des modes alternatifs. \n \nIl y a quelques limites à l'utilisation de Yuzu sur Android, il faut obligatoirement utilisé au minimum Android 11 et des extensions de l'API Vulkan. \n \n \n \n\n \n\n \n \n \nLa Team s'exprime sur leur site\n \nPourquoi ?\n \nAu cours de l'année écoulée, nous avons fait des progrès considérables pour améliorer la précision et les performances de Yuzu. Et avec de nombreuses autres améliorations en cours, nous avons compris que plus nous attendions, plus il deviendrait difficile pour nous de supporter une version Android.\n \nA partir de cette version publique, toutes les futures activités de développement de yuzu tiendront compte de la compatibilité des fonctionnalités et de la plateforme pour Android. Cela devrait permettre de faciliter et de rationaliser notre processus de développement afin de mieux atteindre notre objectif d'indépendance vis-à-vis des plateformes.\n \nNous espérons accueillir des développeurs Android désireux de mettre leur expertise au service d'un projet de pointe et de produire de nouvelles fonctionnalités, des optimisations et d'autres améliorations pour yuzu !\n \n \n\n \n\n \n \nExigences matérielles\n \nPour l'instant, yuzu nécessite des appareils équipés de processeurs Qualcomm Snapdragon dotés de GPU Adreno. Les appareils équipés de SoC comme Exynos, Mediatek... ne devraient pas fonctionner du tout en raison de leurs pilotes de GPU \"moins bons qu'Adreno\", du moins dans un avenir proche. De plus, yuzu sur Android a des exigences élevées en matière de mémoire vive, c'est pourquoi les appareils haut de gamme offrent la meilleure expérience (par exemple, SD 865 et 8 Go de mémoire vive ou plus).\n \nyuzu sur Android est livré avec la possibilité d'exécuter des pilotes de GPU personnalisés, tels que les nouveaux pilotes officiels Adreno, ou Turnip utilisant libadrenotools pour améliorer les performances sur les SoC Snapdragon d'ancienne génération. Par ailleurs, il reste encore beaucoup d'optimisations spécifiques à Android à réaliser. Nous avons de nombreuses possibilités d'améliorer les performances, mais cela explique les exigences minimales actuelles du système.\n \nCette version initiale a été délibérément réduite au minimum afin que nous puissions nous concentrer sur l'amélioration des performances et de la stabilité. Comme nous l'avons déjà dit, nous nous engageons à atteindre la parité des fonctionnalités avec nos versions pour PC, mais il faut s'attendre à ce que cela se fasse lentement et pas immédiatement.\n \n \n\n \n \nTout est là : yuzu-emu.org\n \nTéléchargement : play.google.com (la version Early Access est vendue 5.49 euros)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174660/in-switch-lemulateur-switch-yuzu-a-ete-porte-sur-android-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174660/in-switch-lemulateur-switch-yuzu-a-ete-porte-sur-android-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1174660/in-switch-lemulateur-switch-yuzu-a-ete-porte-sur-android-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1174660/in-switch-lemulateur-switch-yuzu-a-ete-porte-sur-android-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1174660/in-switch-lemulateur-switch-yuzu-a-ete-porte-sur-android-5.png"
        }
    },
    "news_10": {
        "title": "[PS4] Sistr0 a ajouté 8 315 symboles au référentiel ps4_symbols",
        "content": "Le développeur Sistr0 vient de mettre à jour le github \"ps4_symbols\", ces fichiers sont très importants pour la scène, ils compilent des informations nécessaires au développement pour les studios PlayStation. \n \n \n\n \n \nLes symboles sont des éléments principaux pour les développeurs, le travail de compilation fourni par Sistr0 est essentiel pour les développeurs qui essaient de comprendre et d'utiliser correctement les symboles et les noms dans leurs projets.\n \nCe sont 8 315 symboles PS4 qui ont été ajoutés au référentiel github (de 42 787 à 51 102), les symbols sont des fonctions qui sont codées dans le firmware, les décrypter, les connaitre, les identifier permet de mieux trouver des changements entre les firmwares. \n \n \n\n \n \n \nPour obtenir la liste des symboles à partir d'un fichier ELF spécifique, vous pouvez utiliser la commande nm suivie du nom du fichier ELF et diriger la sortie vers un fichier texte.\n \nPar exemple, si le nom de votre fichier ELF est nome_elf.elf et que vous souhaitez enregistrer la liste des symboles dans un fichier appelé liste.txt, vous pouvez exécuter la commande suivante : nm nome_elf.elf > liste.txt\n \nEncore mieux depuis 2 heures, il a même ajouté des symbols PS5 avec l'apport de flatz. \n \n \n \nTéléchargement : code source sce_symbols\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174654/in-ps4-sistr0-a-ajoute-plus-de-10-000-symboles-au-referentiel-ps4-symbols-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1174654/in-ps4-sistr0-a-ajoute-plus-de-10-000-symboles-au-referentiel-ps4-symbols-1.png"
        }
    },
    "news_11": {
        "title": "[New2DS/3DS] L'exploit Super-skaterhax supporte le firmware 11.17",
        "content": "L'exploit super-skaterhax vient d'être mis à jour par le développeur zoogie, l'objectif principal étant de prendre en charge le tout dernier firmware 11.17 pour les consoles New2DS et New3DS. Cet exploit Super-skaterhax est le successeur direct de l'exploit New Browserhax XL corrigé dans le firmware 11.4 qui exploitait une vulnérabilité UAF (use-after-free) présente dans le navigateur Web de la console. Il a vu le jour en Mars 2023.\n \n \n \n\n \n \nIl se base sur une attaque UAF qui s'appuie sur un exploit de la mémoire, une corruption de données, et des plantages, qui donne suite à une exécution de code, il prend en charge les firmwares 11.15, 11.16 et 11.17, mais uniquement pour les consoles New 3DS et New 2DS. En utilisant unSAFE_MODE, il est même possible d'installer un firmware personnalisé sans avoir à utiliser seedminer .\n \nAvec cette version 1.1, le support des systèmes américains (US) avec le firmware 11.17 a été rajouté. \n \n \nTéléchargement : super-skaterhax v1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174648/in-new2ds3ds-lexploit-super-skaterhax-supporte-le-firmware-1117-1.jpg"
        }
    },
    "news_12": {
        "title": "[PS4/XBO] Un nouvel exploit SMU AMD sur LM32 dévoilé",
        "content": "Un nouvel exploit sur les SMU AMD vient d'être dévoilé, il est basé sur LM32 version 7 et pourrait affecter les APU de vos consoles, on vous explique tout. \n \nLes CPU, APU et GPU d'AMD sont régulièrement testés et approuvés pour découvrir des failles et des exploits dans leur code, régulièrement des pirates dévoilent ou revendent des failles afin d'en tirer bénéfice, juste pour la gloire, ou pour marquer l'histoire. \n \n \n\n \n \n \nCet exploit qui vient de paraitre se base sur le SMU de votre APU, cependant il concerne l'architecture juste avant Zen, il est basé sur les caractéristiques de l'architecture LM32 alors que Zen et les versions ultérieures ont adopté les noyaux Xtensa pour leurs SMU.\n \nL'ingénieur en sécurité Jevin Sweval a révélé un exploit de sécurité pour les anciens coprocesseurs AMD SMU (pré-Zen) cependant il mentionne qu'il n'a pas été en mesure de faire fonctionner l'exploit sur PS4, bien que cela puisse fonctionner en théorie.\n \n \n \n\n \n \nLes anciens coprocesseurs AMD SMU (y compris celui de la PS4) sont basés sur l' architecture LM32 . Jevin Sweval a mis au point une technique pour extraire la clé de cryptage HMAC du firmware du SMU, permettant de signer son propre firmware personnalisé pour le SMU. \n \nBien entendu ce n'est pas un CFW, mais il permet un contrôle total sur le SMU, et permettrait en théorie d'obtenir les super-privilèges, ou du moins d'en être un point d'entrée. \n \nVoilà ce qu'il rapporte sur Twitter : \n \nIl s'avère qu'AMD a intégré le LM32 si complètement qu'il a conservé sa fonctionnalité de débogage. Depuis le SMU, vous pouvez désactiver les protections SRAM en lecture/écriture et lire le bootrom. Je ne possède pas de Xbox One et je n'y ai pas testé. L'APU/SMU de la PS4 a quelques bizarreries qui empêchent cette attaque dans sa forme actuelle (ou je fais juste une erreur stupide quelque part). Mais nous avons le bootrom et le FW PS4 SMU vidé par d'autres moyens et pouvons l'analyser pour d'autres vulnérabilités qui pourraient permettre l'exécution de code. Je travaille également sur un PCIe MITM comme Marcan l'a fait pour mieux comprendre le processus de démarrage de la PS4 sur PCIe au lieu de la lecture normale à partir du flash SPI.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174611/in-ps4xbo-un-nouvel-exploit-smu-amd-sur-lm32-devoile-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174611/in-ps4xbo-un-nouvel-exploit-smu-amd-sur-lm32-devoile-2.png"
        }
    },
    "news_13": {
        "title": "[Multi] RetroArch victime d'un hack d'une ampleur importante",
        "content": "Sans réellement parler d'une grande ampleur, la Team LibRetro a annoncé avoir été victime d'un piratage assez important, en début d'après-midi LibRetro a annoncé sur son Twitter avoir un \"problème\" avec le site web RetroArch. \n \nPuis l'équipe a commencé à parler d'une défaillance, puis vers 20h00 l'équipe a annoncé avoir été victime d'un \"hack\". Dans ce hack, les liens de téléchargement du site RetroArch.com ont été changés toute personne ayant téléchargé RetroArch via un lien MediaFire lundi peut avoir attrapé un logiciel malveillant.\n \nL'histoire semble se répéter, il y a deux ans, les buildbot et github de LibRetro avaient déjà été compromis. \n \nIl semblerait que les téléchargements renvoyaient vers des liens Mediafire, et que un (ou des membres) d'Evaderz soit impliqué, cependant le responsable de l'équipe Evaderz Discord , dirigée par Ryan , a décidé de prendre la parole pour nier toute implication dans la faille de sécurité de RetroArch et Libretro .\n \n\n \n \nDans une déclaration officielle, Ryan a exprimé sa condamnation de cet acte et a déclaré que la philosophie de leur communauté est basée sur le fair-play, le respect mutuel et la création d'un environnement sûr pour ses membres.\n \nBref, tout cela n'a peut être qu'un seul but, mettre aussi dans une mauvaise situation Evaderz.\n \nEspérons que tout cela soit rapidement colmaté, et que cela ne fragilise aucun des sites.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174604/in-multi-retroarch-victime-dun-hack-dune-ampleur-importante-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] Sys-patch 1.4.2, Tesla Menu 1.2.3 et Status Monitor Overlay 0.9.1",
        "content": "Petit tour de piste pour la scène Nintendo Switch, quelques homebrews à surveiller ont été mis à jour par leur développeur. \n \nEn premier lieu c'est Sys-patch qui a été mis à jour par ITotalJustice, le script qui permet de patcher fs, es, ldr et nifm lors du boot est désormais proposé en version 1.4.2, qui est venue remplacé successivement la 1.4.0 et 1.4.1. \n \n \n\n \n \nAu chapitre des nouveautés, la correction du module système nifm pour le test de connexion afin qu'il fonctionne toujours sur les serveurs bloqués par Nintendo. De plus, les patchs peuvent désormais être désactivés individuellement. Cela signifie que les utilisateurs peuvent choisir d'activer ou de désactiver des correctifs spécifiques en fonction de leurs besoins ou de leurs préférences, ou bien si un correctif pause des problèmes de compatibilités.\n \nChangelog : \n \n- Ajout d'un patch ctest\n- Ajout par bascule de patch\n- Permet de rendre la superposition plus organisée\n- Correction de la détection de l'application du patch nifm ctest (1.4.1)\n- Correction de la non-concordance de la touche \"logging\" des options entre sysmod et overlay (1.4.2)\n \nTéléchargement : Sys-patch 1.4.2\n \n \nLe développeur WerWolv quand à lui propose la mise à jour de Tesla-Menu afin qu'il supporte la dernière mise à jour libtesla. Comme vous le savez Tesla se compose de trois parties individuelles : nx-ovlloader, TeslaMenu et libtesla. TeslaMenu est l'équivalent du menu hbmenu. C'est l'élément initial chargé par nx-ovlloader et qui agit comme un hub pour vous permettre de sélectionner tous les autres overlays.\n \n \n\n \n \nTéléchargement : Tesla-Menu\n \n \n \nEnfin le développeur Masagrator vient lui de mettre en ligne la 0.9.1 de Status Monitor. L'application permet de surveiller la console Switch pendant le jeu en cours en affichant la fréquence du CPU, du GPU et de la RAM, ainsi que la température et le niveau de rotation du ventilateur. L'outil propose à ce titre six modes (profils) différents à choisir dans le menu principal, Complet , Mini , Micro , Compteur FPS , Batterie et Divers, et certaines fonctions permettant de sauvegarder certains registres.\n \n \n\n \n \nChangelog : \n \n- Désormais, le chemin d'accès au fichier pour le mode Micro n'est pas codé en dur, il est récupéré via le menu Tesla.\n- Pour l'utiliser avec un nom de fichier modifié, il est nécessaire de mettre à jour Tesla Menu à la version 1.2.3 au minimum.\n- Sur les versions plus anciennes de Tesla Menu, il se comporte de la même manière que la version 0.9.0.\n \n \nTéléchargement : Status-Monitor-Overlay\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174552/in-switch-sys-patch-142-tesla-menu-123-et-status-monitor-overlay-091-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174552/in-switch-sys-patch-142-tesla-menu-123-et-status-monitor-overlay-091-1.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1174552/in-switch-sys-patch-142-tesla-menu-123-et-status-monitor-overlay-091-2.jpg"
        }
    },
    "news_15": {
        "title": "[Multi] Nintendo a envoyé un DMCA à Valve pour l'émulateur Dolphin",
        "content": "Nintendo ratisse large, le géant japonais vient d'envoyer à Valve une notification DMCA pour l'émulateur Dolphin, de là à dire que l'émulateur est dans le viseur du père de Mario il n'y a qu'un pas que nous pouvons franchir. \n \n \n \n\n \n \n \nL'histoire entre Valve (Steam) et l'émulateur Dolphin n'aura pas duré longtemps, l'équipe Dolphin vient de déposer un billet sur son blog : \n \n \nC'est avec beaucoup de déception que nous devons annoncer que la sortie de Dolphin sur Steam a été reportée sine die. Nous avons été informés par Valve que Nintendo a émis un DMCA contre la page Steam de Dolphin et a supprimé Dolphin de Steam jusqu'à ce que l'affaire soit réglée. Nous étudions actuellement nos options et aurons une réponse plus détaillée dans un proche avenir. Nous apprécions votre patience en attendant.\n \n \nAnnoncée en grande pompe fin Mars 2023, l'arrivée de l'émulateur Dolphin sur Steam n'aura tenu que quelques jours.\n \n \n\n \n \nLes portes paroles de Nintendo sur la raison du DMCA : \n \n \nParce que l'émulateur Dolphin viole les droits de propriété intellectuelle de Nintendo, y compris, mais sans s'y limiter, ses droits en vertu des dispositions anti-contournement et anti-trafic du Digital Millennium Copyright Act (DMCA), nous vous fournissons cet avis de votre obligation pour supprimer l'offre de l'émulateur Dolphin du store Steam.\n \n \nC'est sans appel, Nintendo dispose d'environ deux semaines pour décider de poursuivre ou non. Si ce n'est pas le cas, Dolphin pourrait alors potentiellement être rajouté à Steam.\n \nLes précédents procès en rapport avec l'émulation, intentés par Sony contre Bleem ! et Connectix , tous deux ont constaté que les émulateurs n'avaient pas violé les droits d'auteur avec leur utilisation du BIOS et du firmware PlayStation. Ces poursuites ont longtemps été utilisées comme précédent pour maintenir l'émulation comme légale aux États-Unis, mais c'est un sujet complexe connu comme une zone grise, et le cas de Nintendo ici serait probablement plaidé sur différents fondements juridiques. Pour l'heure, la Team à l'origine de l'émulateur Dolphin n'est pas attaqué par Nintendo, il ne s'agit que du retrait de Steam, mais cela laisse entendre que la firme va tôt ou tard s'en préoccuper. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174489/in-multi-nintendo-a-envoye-un-dmca-a-valve-pour-lemulateur-dolphin-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174489/in-multi-nintendo-a-envoye-un-dmca-a-valve-pour-lemulateur-dolphin-2.png"
        }
    },
    "news_16": {
        "title": "[XB] Cerbios Tool v1.1.1 et Cerbios v2.3.0 Beta disponibles",
        "content": "La Team Resurgent vient de mettre en ligne une nouvelle version de leur solution, pour rappel Cerbios est un firmware personnalisé pour la toute première Xbox originale et qui permet en premier lieu de supporter les disques durs de grande capacité, notamment jusqu'à 8 To, mais aussi 128 Mo de RAM, la lecture de fichiers ISO et les animations de démarrage personnalisées.\n \nIls ont profité de l'occasion pour mettre à jour Cerbios Tool qui est un outil qui vous permettra de personnaliser certaines fonctionnalités de Cerbios. Cerbios Tool vous permet de configurer des options telles que le mode UDMA, l'affichage du logo Cerbios et d'autres paramètres spécifiques. Cet outil offre la possibilité d'ajuster le BIOS à vos préférences et besoins, permettant une plus grande flexibilité et personnalisation de l' expérience Xbox.\n \n \n\n \n \nChangelog Cerbios 2.3.0 Beta :\n \n- Ajout de la possibilité de personnaliser le BIOS via Cerbios Tool sous Windows.\n- Ajout d'une fonction pour créer des thèmes pour le logo Cerbios à l'aide de Cerbios Tool.\n- Ajout de la possibilité de redimensionner ou de masquer complètement le logo Cerbios via l'outil Cerbios.\n- Ajout du mode expérimental UDMA 6, nécessitant l'utilisation de câbles IDE/ATA Ultra DMA (80 conducteurs) et d'adaptateurs Startech.\n- Suppression des clés IGR personnalisées du fichier INI et désormais configurables via Cerbios Tool.\n- Ajout de la possibilité d'utiliser des lettres de lecteur dans les chemins et au format \\Device*.\n- Ajout d'une fonction pour définir les modes UDMA 2-6 via Cerbios Tool.\n- Ajout de la possibilité de définir automatiquement le mode UDMA à l'aide de Cerbios Tool for Startech ou d'adaptateurs Sata vers IDE génériques. Le mode automatique détectera le mode UDMA pris en charge par l'appareil et le réglera en conséquence. Cependant, cette fonctionnalité est expérimentale et le mode UDMA 2 (mode sans échec) peut être lancé en démarrant la console Xbox via l'éjection. Les résultats du mode automatique peuvent être partagés dans la salle Discord dédiée.\n- Ajout du démarrage automatique en mode sans échec si l'erreur 9 ou 13 due à un mode UDMA incompatible est rencontrée.\n- Fichier mis à jour Cerbios.ini pour prendre également en charge les noms de chemin d'accès aux lettres de lecteur.\n- Améliorations générales de la stabilité du système.\n \n\n \n \n \nLe NFO est disponible ici : xboxnfo2472.nfo\n \n \n\n \n \nTéléchargement : Cerbios Tool V1.1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1340560260.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-888423032.png",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-851340870.png"
        }
    },
    "news_17": {
        "title": "[Switch] switch_AIO_LS_pack 4.14.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 4.14.0.Pour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.Le homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables. Depuis cette news les évolutions sont les suivantes:- Changelog pour la version 4.13.0:La luminosité par défaut dans Hekate est réglée à 100%.Mise à jour de Atmosphere, de DBI et de AIO-Switch-Updater vers la dernière version de ceux-ci.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 4.13.0:Ajout de la possibilité, via les fichiers de configuration, d'ajouter des fichiers complémentaires au pack (utile pour ceux souhaitant mettre en place des logos personnalisés par exemple).La luminosité par défaut dans Hekate est réglée à 100%.Correction d'un bug critique dans le système de traduction.Correction d'un bug critique dans le système de chargement des fichiers de configuration du homebrew.Correction d'un bug critique lorsque le homebrew était chargé depuis un autre dossier que son dossier \"switch/AIO_LS_pack_Updater\" (merci à @Cdtthor pour m'avoir beaucoup aidé à identifier le bug); de plus lorsqu'il est chargé depuis un autre emplacement il est déplacé à cet emplacement au lancement du homebrew.Correction d'un bug potentiel dans la vérification du type d'emunand.Notez que beaucoup de bugs critiques ont été corrigés dans le homebrew AIO_LS_pack_Updater, si vous utilisez le homebrew mettez-le impérativement à jour via celui-ci ou manuellement avant tout autre action.- Changelog pour la version 4.14.0:Ajout du module Sys-patch.Mise à jour de DBI, de Tesla-Menu et de Status-Monitor-Overlay vers la dernière version de ceux-ci.Mise à jour des crédits dans la documentation.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 4.14.1:Ajout d'une fonction de vérification d'une mise à jour du homebrew au lancement de celui-ci ou durant le changement de mode dans celui-ci. Si une mise à jour est trouvée il sera proposé à l'utilisateur de l'installer.Si une mise à jour du homebrew existe, celle-ci devra être faite avant d'installer/mettre à jour le pack ou le firmware.Ajout de la vérification du sha256 du fichier zip complémentaire au pack.Compilé avec la dernière version de la Libnx.D'autres changements mineurs dans le code sources.Pour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.N'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues.Si vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-4.jpg"
        }
    },
    "news_18": {
        "title": "[Switch] sys-patch publié, le module patch la Switch au boot",
        "content": "Le développeur ITotalJustice vient de claquer un grand coup sur la table, un nouvel homebrew pour la Switch sous la forme d'un sys-patch. sys-patch est un sysmodule qui va s'exécuter au démarrage de votre Switch et il va corriger automatiquement à la fois le FS et l'ES du firmware, ainsi que le laoder d'Atmosphere pour donner essentiellement le même effet que ce que font les patchs signature, sans avoir besoin de s'appuyer sur la présence des patchs sur la carte SD.\n \nCe sysmodule a de grands avantages, pas besoin de maintenance ou de mise à jour car il effectue automatiquement les correctifs sans s'appuyer sur les hashs de fichiers comme le font les correctifs IPS réels, et s'appuie à la place sur les modèles de code/données réels à corriger.\n \n \n\n \n \nLe développeur l'explique peut être un peu mieux : \n \nL'avantage de sys-patch est qu'il n'a besoin d'être mis à jour que lorsque quelque chose de majeur sera corrigé, la dernière fois que cela s'est produit, c'était avec le firmware 15.0.0.\n \nUn autre avantage est que le patching LDR n'aura (probablement) jamais besoin d'être mis à jour. Dans le passé, si une mise à jour silencieuse d'Atmosphère se produisait, cela brisait les sigpatches (à moins que vous ne les mettiez à jour à nouveau).\n \nsys-patch produit également un journal dans lequel vous pouvez voir quels correctifs ont été appliqués, lesquels ont échoué et d'autres données utiles. Vous pouvez lire manuellement le journal ou utiliser la surcouche, que vous pouvez également utiliser pour modifier la configuration.\n \n \n\n \n \nTotalJustice recommande de garder pour le moment les sys-patch actuels, et considérer cette solution comme une solution alternative, comme une solution de secours au cas où certaines mises à jour rompraient la compatibilité avec sys-patch, mais on peut penser que très bientôt il aura la même stabilité et facultés, tous les avantages en plus. \n \n \nTéléchargement : sys-patch v1.3.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174445/in-switch-sys-patch-publie-le-module-patch-la-switch-au-boot-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174445/in-switch-sys-patch-publie-le-module-patch-la-switch-au-boot-2.png"
        }
    },
    "news_19": {
        "title": "[PS5] Le payload ps5-self-dumper compatible avec les .prx",
        "content": "Le développeur sleirsgoevy vient de mettre à jour il y a quelques heurs son payload ps5-self-dumper afin qu'il supporte désormais le dump des fichiers avec l'extension .prx. \n \nAinsi cela permet de supporter sur PlayStation 5 le dump de fichier .prx, cela signifie que les utilisateurs pourront désormais capturer et enregistrer des fichiers .prx à partir de la PS5, leur permettant de les consulter ou de les utiliser à des fins de modification et de personnalisation.\n \nCette mise à jour étend les fonctionnalités du payload qui permettaient auparavant de télécharger des fichiers eboot.bin et différents modules, encore une fois, cela ne permet pas d'exécuter les fpkgs, mais désormais les jeux sont dumpés en leur totalité. \n \n \n \n \n\n \n \nA noter que sleirsgoevy vient également de mettre à jour ps5-kstuff en ajoutant les macros pour lire les registres de débogage. Bref sleirsgoevy est très en forme et fait évoluer les choses, espérons le dans le bon sens.\n \n \nTout est là : ps5-self-dumper\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174438/in-ps5-le-payload-ps5-self-dumper-compatible-avec-les-prx-1.jpg"
        }
    },
    "news_20": {
        "title": "[PS5] Une présentation de Specter dans quelques jours sur la PS5",
        "content": "Dans quelques jours, le 02 Juin 2023 pour être précis, le développeur Specter (ou SpecterDev) fera une présentation d'environ 45 minutes lors de la prochaine conférence Hardwear.io. Nous ne présentons plus hardwear.io, il s'agit d'une site spécialisé sur la sécurité informatique, durant laquelle un certain TheFlow avait présenté son exploit Bluray il y a tout juste un an. \n \n \n \n\n \nTheFlow en Juin 2022 \n \n \n \nDans cette présentation, Specter parlera de la sécurité de la PS5, d'ailleurs nous connaissons déjà le titre de la conférence \"Next-Gen Exploitation: Exploring the PS5 Security Landscape\" que l'on pourrait traduire par \"Exploit sur console Next-Gen : Explorez le paysage de la sécurité de la PS5\".\n \n \n\n \n \n\n \n \n \nRésumé :\n \nLa PlayStation 5 (PS5) représente une avancée technologique significative, en particulier en termes de mesures de sécurité, qui ont subi des améliorations substantielles par rapport à son prédécesseur, la PS4. En raison du manque de documentation publique sur les techniques de renforcement de la sécurité, il existe une certaine incompréhension de l'infrastructure de sécurité du système. Cette conférence vise à faire la lumière sur l'architecture du système de la PS5, en se concentrant sur les efforts de Sony pour empêcher l'ingénierie inverse et atténuer l'impact de la corruption de la mémoire du noyau.\n \nCette présentation se penchera sur les subtilités des mécanismes de sécurité de la PS5, en analysant l'évolution de la surface d'attaque et l'introduction de mesures d'atténuation modernes telles que la prévention de l'accès au mode superviseur (SMAP), la protection de l'exécution en mode superviseur (SMEP), l'intégrité du flux de contrôle du noyau (kCFI) et la mémoire eXecute Only Memory (XOM). En outre, nous étudierons le fonctionnement interne de l'hyperviseur du PS5 et analyserons son rôle dans la protection du système contre les attaquants disposant de privilèges élevés. Nous parlerons également de la manière dont ces mesures d'atténuation peuvent être contournées et nous mettrons en évidence quelques pistes et idées pour la recherche future.\n \n \nBiographie de l'orateur :\n \nSpecterDev est un chercheur en sécurité spécialisé dans l'exploitation du kernel sous linux, mobile et console. Il a commencé à faire de la recherche sur les consoles il y a cinq ans sur la PlayStation 4, et s'est récemment concentré sur la PlayStation 5 et l'AMD Secure Processor. Il coanime également un podcast hebdomadaire et un canal média appelé dayzerosec, qui suit et discute de diverses vulnérabilités récentes, d'exploits et de recherches.\n \n \nTout est là : specter.php  /  schedule.php\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174383/in-ps5-une-presentation-de-specter-dans-quelques-jours-sur-la-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174383/in-ps5-une-presentation-de-specter-dans-quelques-jours-sur-la-ps5-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1174383/in-ps5-une-presentation-de-specter-dans-quelques-jours-sur-la-ps5-3.png"
        }
    }
}