{
    "news_1": {
        "title": "[PS4] Le DLC Valhalla déjà proposé en backport sur 5.05/6.72/7.xx/8.xx/9.00",
        "content": "Il y a déjà 3 jours sortait le DLC gratuit de God of War Ragnarol nommé Valhalla, à ne pas confondre avec un certain Assassin's Creed. \n \nEntièrement gratuit ce contenu s'accompagne d'une mise à jour 5.01 pesant quelques 8.8 Go sur PS4, nous avons droit à toutes les versions que ce soit celle de CyB1K que celles de Opoisso893.\n \n \n \n\n \n \n \nBien entendu cette mise à jour vient également corriger des bugs et optimiser certains éléments de gameplay. \n \n \n\n \n \nCorrections de bugs\n \nÉquipement :\n- Correction d’un problème qui faisait que la bannière de la Lance Draupnir n’avait plus l’air améliorée lorsqu’elle était utilisée en transmogrification.\n- Correction d’un problème qui empêchait l’armure de taille Flawless Berserker d’avoir un effet lumineux.\n \nLocalisation : \n- Correction d’un problème d’alignement qui faisait chevaucher une icône avec le diagramme du contrôleur.\n \nProblème connu :\n- Si un utilisateur installe God of War Ragnarök: Valhalla avant d’installer God of War Ragnarök, puis essaie de lancer le DLC avant la fin du téléchargement du jeu de base, il obtiendra un écran de chargement infini.\nSOLUTION DE CONTOURNEMENT: Terminez le téléchargement de God of War Ragnarök avant de tenter d’accéder au DLC.\n \nTout est là : blog.playstation.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183617/in-ps4-le-dlc-valhalla-deja-propose-en-backport-sur-5056727xx8xx900-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS5] Le PlayStation Portal s'offre une mise à jour firmware 2.0.5",
        "content": "Le ou La PlayStation Portal vient de s'offrir une mise à jour firmware, en proposant la mise à jour 2.0.5 Sony souhaite améliorer la stabilité du système. \n \nL'idée de cette mise à jour est également d'optimiser les messages et la convivialité de certains écrans comme nous en informe le développeur emuonpsp. \n \n \n \n\n \n \n \nA noter aussi qu'une mise à jour a été publiée pour la DualSense, ce qui laisse supposer qu'elles sont indirectement liées. \n \n \n \n\n \n \n \nPSPortal v2.0.5 est sorti....\nQue signifie l’amélioration de la stabilité ?\n \n===\nVersion : 2.0.5\nStabilité améliorée du logiciel système.\nMessages améliorés et opérabilité sur certains écrans.\n \n \n \nPour l'heure, il n'existe pas de hack lié à la PlayStation Portal, à quoi cela pourrait servir de modifier un tel périphérique, à part pour y faire tourner des OS différents, pas très intéressant pour les développeurs. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183614/in-ps5-le-playstation-portal-soffre-une-mise-a-jour-firmware-205-1.jpg"
        }
    },
    "news_3": {
        "title": "[Switch/PC/Android] Nouvelle version disponible de NooDS (rolling release)",
        "content": "Le développeur Hydr8gon vient de sortir une nouvelle version de son émulateur NooDS\nL'objectif de NooDS est d'être un émulateur Nintendo DS rapide et portable. Ce n'est pas tout à fait là en terme de vitesse, mais il offre la plupart des autres fonctionnalités que vous pouvez attendre d'un émulateur DS. Il prend même en charge la rétrocompatibilité GBA ! Je fais ça pour le plaisir et comme expérience d'apprentissage, et aussi parce que je suis un grand fan de la DS. Ce n'est peut-être pas encore un concurrent digne des autres émulateurs DS, mais je pense que je pourrai y arriver un jour. Sinon c'est bien aussi ; comme je l'ai dit, je m'amuse juste !\n \nCe projet n'a donc pas de changelog à chaque mis à jour, mais au bout de plusieurs versions consécutives des nouvelles seront données pour rappeler l'existence du projet et ainsi pousser les utilisateurs à tester ce dernier et faire des retours au développeur.\n \nLes dernières modifications : \n- Android : correction de quelques problèmes de disposition des boutons\n \nNooDS est disponible pour Linux, macOS, Windows, Switch, Vita et Android. Les builds automatiques sont fournis via\nGitHub Actions ; vous pouvez les télécharger à partir de la page des versions",
        "images": {
            "image_1": "https://d1eh9yux7w8iql.cloudfront.net/product_images/1525772372.19.jpg"
        }
    },
    "news_4": {
        "title": "[PS3] Une option pour décrypter les ISO 3k3y/Redump dans Evilnat 4.90.2",
        "content": "Le développeur Nathan Martin, Evilnat, vient de dévoiler sur Twitter / X une option qui sera intégrée dans son prochain CFW, l'Evilnat 4.90.2.\n \nComme le présente Evilnat, cette option vise à permettre le décryptage permanent des ISO 3k3y/Redump à l'aide de la clé disque (disk key). Même si elle doit encore être testée, cette nouvelle option sera innovante.\n \n \n\n \n \n \nIl rajoute qu'il aimerait ajouter à Cobra la possibilité de décrypter les ISO à la volée, mais il n'a pas encore trouvé la solution technique.\n \n",
        "images": {}
    },
    "news_5": {
        "title": "[PS5] PS5CodeReader v1.0.0.2 disponible",
        "content": "Le développeur amoamare dévoile un nouvel utilitaire à destination des PlayStation 5, la console commence à devenir intéressante.\n \nIl s'agit par ailleurs d'un simple outil permettant sous Windows de lire le registre UART de la console PS5 et de le supprimer, déjà 3 versions ont été proposées par le développeur. \n \n \n\n \n \n \nA noter que son utilisation ne nécessite pas de droit administratif, il permet de lire les logs UART et de les effacer, sachant que les runtimes .net 7.0 sont nécessaires pour le faire fonctionner : https://dotnet.microsoft.com/en-us/download/dotnet/7.0\n \nDans la version 1.0.0.2 proposée il y a quelques minutes, le développeur a ajouté des options pour d'autres consoles PlayStation, une mise à jour et correction du journal clair, ajouté un mode moniteur pour écouter l'UART si quelque chose doit être transmis, et ajouté la possibilité d'annuler des opérations. \n \n \n\n \n \nIl en a profité pour modifier l'interface utilisateur et ajouté une boîte d'opérations pour effectuer d'autres opérations, il a également ajouté la possibilité d'ouvrir une liste txt de commandes pour aider à trouver de nouvelles commandes.\n \n \nTéléchargement : PS5CodeReader v1.0.0.2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183560/in-ps5-ps5codereader-v1002-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1183560/in-ps5-ps5codereader-v1002-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[XB/XB360] FATXplorer v3.0 Beta 28 disponible",
        "content": "Une nouvelle mise à jour de FATXplorer a été proposée afin d'améliorer  encore la solution qui permet de profiter des périphériques de stockage des consoles Xbox Originale et de la Xbox 360, et notamment avec la prise en charge des disques durs internes jusqu'à 16 To. \n \n \n\n \n \n \nCette version Bêta 28 apporte son lot de nouveautés avec notamment le nouveau système de licence, à partir de cette version, vous pouvez désormais entrer votre numéro de série/clé de licence si vous en avez une. Une question fréquemment posée par les utilisateurs de la version beta est \"Quand/où puis-je entrer mon numéro de série ?\" La réponse est : maintenant ! Il vous suffit de le saisir lorsque FATXplorer vous le demandera. Le système de licence est entièrement nouveau et extrêmement léger. La v2.5 utilisait un système de licence tiers lourd qui n'est plus supporté. Il a été remplacé par une solution développée sur mesure.\n \n- Une connexion internet n'est pas nécessaire. Ce n'est pas nouveau, mais nous sommes dans un monde où tout nécessite une connexion internet, il est donc important de le préciser. La seule exception à cette règle est que si vous entrez un numéro de série FATXLIC, désormais obsolète, FATXplorer devra aller en ligne pour le convertir dans le nouveau format de clé de licence. Il n'est pas nécessaire d'être en ligne pour saisir une clé de licence.\n- La période d'essai est la même (7 jours).\n- Les périodes d'essai peuvent désormais être prolongées automatiquement en cliquant sur un bouton. Cela nécessite une connexion internet pour fonctionner, mais c'est une grande amélioration par rapport au système précédent où vous deviez envoyer un code de limite à l'assistance et attendre un code d'extension. Ces extensions automatiques sont soumises à certaines limites afin d'éviter les abus. Si vous n'avez pas de connexion internet sur l'appareil qui exécute FATXplorer et que vous avez besoin d'une extension d'essai, il y a aussi une option hors ligne où vous pouvez copier un ID, l'envoyer au support depuis un appareil en ligne, et ensuite entrer un code d'extension similaire à la façon dont cela fonctionne dans la v2.5.\n- La fenêtre de licence n'est plus affichée au démarrage. FATXplorer ne l'affichera que lorsqu'une fonction payante est accessible, ou lorsque vous l'invoquez depuis le menu Aide.\n- Ajout d'une vérification des partitions de cache de la Xbox 360 pour déterminer si elles sont formatées en FATX. Si ce n'est pas le cas, un message s'affichera et le montage ne se fera pas.\n- Pilote mis à jour en v22.0.8707. Correction d'un problème qui pouvait empêcher le montage sur des ordinateurs lents (1-2 cœurs de CPU). Les mises à jour du pilote peuvent nécessiter un redémarrage.\n- La date d'expiration a été modifiée au 3 mars 2024.\n \n \n \nTéléchargement : FATXplorer v3.0 Beta 28\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183559/in-xbxb360-fatxplorer-v30-beta-28-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[PS4] L'exploit kernel 9.00 de la PS4 porté vers les firmware 8.xx",
        "content": "Le développeur abc vient une nouvelle fois de montrer ses talents sur PS4, il vient en effet de prouver qu'il est possible de backporter l'exploit kernel PS4 du firmware 9.00 vers des firmwares inférieurs. \n \nDit comme ça cela peut paraitre inutile, cependant en utilisant l'exploit webkit PSFree de Celesteblue, il fait descendre l'exploit kernel ChendoChap pOOBs4 vers les firmwares 8.x, voir inférieur comme le 7.55. \n \nAvec une telle évolution, cela se permet de se passer de clé ou de dongle, et ainsi apporter l'utilisation d'exploits peu fiables des firmwares inférieurs (entre 6.72 et 8.xx) et ainsi apporter de la stabilité avec l'utilisation de pOOBs4 sur ces firmwares.\n \n \n\n \n \nC'est assez complexe, mais pour résumé cela apportera de la stabilité pour les firmware 7.55 et 8.xx, alors que jusqu'à présent il utilise du code trafiqué de kernel exploit peu stable. \n \nPour prouver ses dires il dévoile et une belle image et un script disponible ici : Script .\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183541/in-ps4-lexploit-kernel-900-de-la-ps4-porte-vers-les-firmware-8xx-1.png"
        }
    },
    "news_8": {
        "title": "[Switch] De nouvelles versions de DBI disponibles!",
        "content": "Le développeur rashevskyv a publié deux nouvelles versions de son homebrew DBI. Ces nouvelles versions apportent de nouvelles fonctionnalités, corrigent des bugs et améliorent certains points.\n \n\n \nLa version 652 est une mise à jour majeure qui apporte de nombreuses nouvelles fonctionnalités et améliorations. La version 653, quant à elle, corrige un petit problème.\n \nChangelog : \n \nDBI 653 :\n \n- Apporte une correction importante pour les petits transferts de fichiers par FTP\n \nDBI 652 : \n \n- Ajout d'une nouvelle fonctionnalité ainsi que filtrage dans les applications, les tickets et les sauvegardes\n \n- De nombreux problèmes ont été corrigés ainsi que beaucoup d'améliorations tout au long de l'homebrew\n \n- Le journal d'activité de DBI est amélioré pour une meilleure expérience utilisateur\n \n- Suppression de la traduction chinoise de DBI à la demande du traducteur\n \nTélécharger la source : https://github.com/rashevskyv/dbi/releases\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183539/in-switch-de-nouvelles-versions-de-dbi-disponibles-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS4] Apollo Save Tool PS4 v1.4.2 disponible",
        "content": "Le développeur Bucanero propose une nouvelle version d'Apollo Save Tool mais cette fois-ci à destination de la PlayStation 4. \n \nRentrons un peu dans le détail de cette nouvelle version, PS4 Apollo Save Tool est un utilitaire, également proposé sur PS3, et qui vous permet de gérer les fichiers de sauvegarde de jeu sur PlayStation 4 et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur votre PS4. \n \n \n\n \n \nCette version 1.4.2 apporte pas mal de corrections. \n \nAdded\nAuto-detect X/O button settings (@illusion0001)\nNetwork HTTP proxy settings support\nNew cheat codes\nGrand Theft Auto V\nMetal Gear Solid 5: The Phantom Pain\nCustom decryption support\nMetal Gear Solid 5: The Phantom Pain\nCustom checksum support\nGrand Theft Auto V\nMetal Gear Solid 5: The Phantom Pain\nShantae and the Pirate's Curse\nShantae: Risky's Revenge\n \nMisc\nInclude original keystones for 116 games\nUpdated audio library to libs3m\nUpdated apollo-lib Patch Engine to v0.6.0\nAdd host callbacks (username, wlan mac, psid, account id)\nAdd murmu3_32, jhash hash functions\nAdd Patapon 3 PSP decryption\nAdd MGS5 decryption (PS3/PS4)\nAdd Monster Hunter 2G/3rd PSP decryption\nAdd Castlevania:LoS checksum\nAdd Rockstar checksum\nFix SaveWizard Code Type C\nFix right() on little-endian platforms\n \n \nTéléchargement : Apollo Save Tool PS4 v1.4.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183506/in-ps4-apollo-save-tool-ps4-v142-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS4] Une mise à jour de GameBato Store disponible",
        "content": "Le développement de GameBato Store continue de s'opérer sur PlayStation 4 sous firmware 5.05, 7.55 et 9.00. Voilà donc que débarque un patch permettant de mettre à jour GameBato. \n \n \nComme vous le savez GameBato est un store compatible avec les firmwares 5.05, 7.55 et 9.00 de la PlayStation 4 et qui permet de profiter pleinement des capacités de la console. \n \nLes changements sans être révolutionnaires restent intéressants ainsi elle apporte la résolution d'un problème où l'application restait bloquée sur l'écran de chargement. A noter que ce correctif oblige l'arrêt des téléchargements qui seront supprimés. \n \n\n \n \nChangelog :\n \n- Correction d'un problème qui bloquait l'application sur l'écran de chargement de l'application GamBaTo.\nSi vous rencontrez ce problème, procédez comme suit :\n- Ouvrez l'application et laissez-la se mettre à jour.\n- Lorsqu'elle atteint l'écran de chargement de l'application GamBaTo, attendez 9 secondes.\n- L'application se prépare automatiquement à la réparation et quitte l'écran.\n- Rouvrez l'application et laissez-la se mettre à jour à nouveau.\n- L'application se lancera avec succès.\n \n- Après avoir appliqué ce correctif, seulement pour ceux dont l'application était bloquée, tous vos téléchargements en cours seront effacés.\n \n- Utilisez l'option Quitter dans le menu de l'application ou appuyez sur le bouton CERCLE sur l'écran principal de l'application chaque fois que vous souhaitez fermer l'application.\n \n \nTout est là : gamebatoapp.ir\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183505/in-ps4-une-mise-a-jour-de-gamebato-store-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] Un nouvelle version de PS5 Game File Dumper disponible",
        "content": "Le développeur EchoStretch nous informe via Twitter / X que d'autres jeux sont en cours de tests, clairement la solution proposée par LightningMods semble porter ses fruits, mais elle est longue car il semblerait qu'il faille patcher chaque jeu. \n \nLe développeur en est convaincu, tous les jeux vont tomber un jour ou l'autre et Spider-Man 2 en fait parti, il rappelle que tous les jeux ne fonctionnent pas encore, il n'existe pas une méthode globale, de nombreux dumps ont été envoyés, mais pour pouvoir réaliser ses dumps il faut des outils, c'est pourquoi un nouveau Game File Dumper vient d'être proposé.\n \nToujours proposé sous la forme de script python, dans cette version l'étape 2 à 6 a été remplacé\npar un processus automatique, attention pour en profiter il vous faudra Linux ou WSL2 (Sous-système Windows pour Linux 2).\n \n \n \n \n\n \n \n \n \n### Steps for dumping game files\nAt This time it seems digital games and some physical games will work\n**NOTE** PS5 SELF Dumper will only work on 4.03/4.50/4.51\n \n1) Dump Game ( Opened Game ) /mnt/sandbox/pfsmnt\n   https://github.com/logic-68/pfsmnt-dumper\n \n2) Dump Game Files (copy folder content (files and folders))\n   /system_data/priv/appmeta/PPSAXXXXX/ -->> PPSAXXXXX-app0\\sce_sys\\\n \n3) Dump Game Files (copy folder content) \n   /user/appmeta/PPSAXXXXX -->> PPSAXXXXX-app0\\sce_sys\n \n4) Open npbind.dat to see uds and trophy folder 000000080->04->0F\n \n5) uds00.ucp ( named uds.ucp )\n   /user/np_uds/nobackup/conf/NPWRXXXXX_00/uds.ucp -->>PPSAXXXXX-app0\\sce_sys\\uds\\uds00.ucp\n \n6) trophy00.ucp (named TROPHY.UCP )\n   /user/trophy2/nobackup/conf/NPWRXXXXX_00/TROPHY.UCP -->>PPSAXXXXX-app0\\sce_sys\\trophy2\\trophy00.ucp\n \n7) Decyrpt self files with sleirs ps5-self-dumper then copy files to game dir\n   https://github.com/sleirsgoevy/ps4jb-payloads/tree/bd-jb/ps5-self-dumper\n   1) Download socat\n      https://github.com/tech128/socat-1.7.3.0-windows\n   2) Place ps5-self-dumper payload in socat folder\n      https://www.sendspace.com/file/k87zug\n   3) Open PS5 browser to Specter host\n   4) Open windows cmd in socat folder and type both commands\n      socat -u FILE:dumpgame.bin TCP:<ps5 ip>:9020\n      socat -u -d -d -d TCP:<ps5 ip>:9023,reuseaddr OPEN:game.tar,creat\n   5) Open game.tar and copy/replace files in PPSAXXXXX-app0\n \n \n \nTéléchargement : ps5-game-file-dumper\n \n \n",
        "images": {}
    },
    "news_12": {
        "title": "[Switch] Status Monitor Overlay v1.0.2 disponible",
        "content": "Le développeur masagrator a dévoilé une mise à jour de son outil Status Monitor Overlay pour la Nintendo Switch. Comme son nom l'indique il s'agit d'un overlay Tesla permettant sous Atmosphere de surveiller le statut et la charge des différents composants de la Switch.\n \nL'application permet de surveiller la console Switch pendant le jeu en cours en affichant la fréquence du CPU, du GPU et de la RAM, ainsi que la température et le niveau de rotation du ventilateur. L'outil propose à ce titre six modes (profils) différents à choisir dans le menu principal, Complet , Mini , Micro , Compteur FPS , Batterie et Divers.\n \nLa mise à jour qui débarque un mois après la précédente ajoute de nouvelles options sur la configuration, notamment grâce à l'arrivée de nouvelles options  \"battery_avg_iir_filter\" et \"battery_time_left_refreshrate\", mais aussi le déplacement du graphique et du compteur FPS. \n \n \n \n\n \n \n \nChangelog : \n \n- Ajout de nouvelles clés à la configuration : Battery_avg_iir_filter et Battery_time_left_refreshrate, plus dans CONFIG\n> La modification de battery_avg_iir_filter sur true entraîne le changement de la période de tension moyenne à 45 s et à 11,25 s pour l'ampérage.\n- Suppression de toute la logique derrière le PR #56 au lieu de s'appuyer désormais sur le registre TTE max17050\n- Modification du code de communication i2c pour éviter les problèmes de lectures erronées (merci à ~lineon)\n- Déplacement du graphique FPS et du compteur FPS vers une sous-catégorie \"FPS\"\n \n \nTéléchargement : Status Monitor Overlay v1.0.2 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183486/in-switch-status-monitor-overlay-v102-disponible-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS4] PS4-Fake-PKG-Tools-3.87 v6.0.0 disponible",
        "content": "Le développeur CyB1K propose la version 6.0.0 de l'outil PS4-Fake-PKG-Tools qui est proposé depuis un moment en version 3.87. \n \nComme vous le savez cet outil permet de compiler des fake PKG qui pourront tourner sur votre PS4. Cette nouvelle version V6 proposée par CyB1K a corrigé un bug lié à Keystone qui été supprimé lors d'une reconstruction ou après une erreur. \n \n \n\n \n \nV6 :\nKeystone ne sera plus supprimé du projet lorsque vous essayez de reconstruire un paquet de base après un paquet terminé ou après une erreur sur le même projet.\n \nV5 Suppression de la limite de PKG :\nMerci Illusion0002 pour ce patch sur cmd, je l'ai également porté sur pub-gen. Illusion l'a testé avec Red Dead Redemption 2 et il fonctionnait normalement avec un PKG de 120 Go. Je ne sais pas si cela pourrait causer des problèmes de montage, alors créez des PKG de plus de 100 Go à vos propres risques !\n \n \n \nTéléchargement : PS4-Fake-PKG-Tools-3.87 v6.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183467/in-ps4-ps4-fake-pkg-tools-387-v600-disponible-1.jpg"
        }
    },
    "news_14": {
        "title": "[Wii/GameCube] CleanRip 2.1.2 disponible",
        "content": "Le développeur Emukidid vient de mettre à jour CleanRip en version 2.1.2, cela faisait 4 ans que cet outil n'avait pas connu d'update. \n \nPour se souvenir, CleanRip est un outil de dumping de disque permettant de sauvegarder les jeux Wii et GameCube sous forme d'imagine 1:1 sur une carte SD ou un disque dur USB. \n \nEt les nouveautés sont plutôt appréciable puisque l'outil supporte désormais le loader M2 pour GameCube. \n \nLes disques Wii sans licence, par exemple le Freeloader de Datel, sont désormais pris en charge et les disques double couche sont automatiquement reconnus. De plus, la durée restante du dump est affichée en minutes et secondes au lieu de quelques secondes seulement.\n \nAutre nouveauté CleanRip utilise également le successeur non officiel de liboGC \" liboGC2 \".\n \n \n\n \n\n \n \n \nChangelog : \n \n- Ajout de la prise en charge du chargeur M.2 pour GameCube\n- Utilisation de libOGC2\n- Ajout de la prise en charge des disques sans licence Wii\n- Afficher la durée du dump en minutes et secondes au lieu de seulement quelques secondes\n- Implémentation de la détection automatique des disques double couche\n \n \nTéléchargement : CleanRip v2.1.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183466/in-wiigamecube-cleanrip-212-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1183466/in-wiigamecube-cleanrip-212-disponible-2.jpg"
        }
    },
    "news_15": {
        "title": "[PS4/PS5] Les firmware PS5 8.40 et PS4 11.02 disponibles",
        "content": "Sony vient à nouveau de se lâcher sur la disponibilité de mise à jour firmware en dévoilant l'update système 8.40 pour la PlayStation 5 et la 11.02 pour la PlayStation 4. \n \nSony informe que ces firmwares apportent des correctifs de sécurité. \n \n \n\n \n \nLes changelog officiels : \n \n \nPS5 – 23.02-08.40.00 : \n \n- Nous avons apporté quelques correctifs de sécurité au logiciel système .\n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et la convivialité sur certains écrans.\n \n \nPS4 – 11.02 : \n \n- Nous avons apporté quelques correctifs de sécurité au logiciel système .\n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et la convivialité sur certains écrans.\n \n \nBref, vous l'aurez compris ces deux firmwares viennent corriger des bugs qui peuvent être exploités si vous avez le firmware précédent, certainement après des rapports de développeurs. \n \n \nLe rapport PS5FwBot est disponible ici : FwPs5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183402/in-ps4ps5-les-firmware-ps5-840-et-ps4-1102-disponibles-1.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] switch_AIO_LS_pack 5.7.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.7.0 - Frisco.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.7.0:\nMise à jour du firmware inclue vers la version 17.0.1.\nMise à jour de Haku33, de DBI, de Status-monitor-overlay, de AIO-switch-updater et de NXMP vers la dernière version de ceux-ci.\nNote: Pour traiter les problèmes particuliers de lancement de la sysnand en firmware 17.0.0 c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_17": {
        "title": "[Switch] Nintendo dévoile le firmware officiel 17.0.1",
        "content": "Nintendo vient de dévoiler une nouvelle version de son firmware à destination de la Nintendo Switch. \n \nLe 11 Octobre 2023, Big N avait lancé le 17.0.0 sans trop de fanfare ni trompette, cette mise à jour vient corriger un souci en plus d'optimiser comme à chaque fois l'appareil, ce qui au final ne signifie pas grand chose. \n \n \n\n \n \n \nLe changelog : \n \n- Résolution d'un problème de communication locale pour certains logiciels.\n- Améliorations générales de la stabilité du système afin d'améliorer l'expérience de l'utilisateur.\n \n \n \nLe rapport Yellow's 8 se trouve ici : \n \nhttps://yls8.mtheall.com/ninupdates/reports.php?date=2023-12-05_00-03-36&sys=hac\n \nLa réponse de SciresM : \n \nhttps://twitter.com/SciresM/status/1731832747839173083\n \nAtmosphère 1.6.2 devrait fonctionner correctement avec le firmware 17.0.1 sans nécessité aucun changement.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183351/in-switch-nintendo-devoile-le-firmware-officiel-1701-1.png"
        }
    },
    "news_18": {
        "title": "[PS5/XBX] Le leak du trailer de GTA VI oblige Rockstar à le dévoiler à l'avance",
        "content": "A quelques heures de dévoiler le trailer tant attendu, puisque c'était prévu pour 15h00 aujourd'hui, il semblerait qu'un leak sur les réseaux sociaux a imposé Rockstar a publié à l'avance la fameuse vidéo promotionnelle de probablement ce qui sera le plus grand jeu jamais développé.\n \n \n \n\n \nDéjà 42 millions de vue\n \n \nQuoi dire, GTA VI va en époustoufler plus d'un, ça sort en 2025, probablement sur console PS5 et XBOX Series X en exclusivité pendant quelques mois, puis sur PC. Vendu à 185 millions d'exemplaires, GTA V a marqué l'histoire, reste à voir sir GTA VI saura en faire autant. Rappelez vous, GTA V c'était le 17 Septembre 2013, de là à ce que GTA VI soit lancé autour de Septembre 2025, initialement il devait sortir au printemps 2013.\n \n \n \n",
        "images": {}
    },
    "news_19": {
        "title": "[PS4/PS5] PS4PKG-Compiler 0.01 et PS22PS4-GUI Bêta 7.0 disponibles",
        "content": "Le développeur Nazky fait son comeback sur la scène PS4 et par ricochet PS5. Il dévoile en effet depuis quelques heures des nouvelles version de certains de ces outils PS4. \n \n \nLe premier outil est PS22PS4-GUI\n \n \n\n \n \nIl s'agit d'une interface qui facilite le portage de jeu PS2 en PKG PS4 vous pouvez donc jouer aux jeux iso ps2 sur votre ps4. Attention tous les jeux ne sont pas compatibles. \n \nComment l'utiliser ?\nIl suffit de glisser-déposer un ISO ou un BIN, une image de fond (un background), une couverture de jeu (un cover) et un dossier puis de cliquer sur \"Create PKG\" pour obtenir le PKG PS4.\n \nEt si je veux importer une configuration personnalisée ou un fichier LUA ?\nIl suffit de cliquer sur \"file\" puis \"import\".\n \nChangelog 0.7.0 : \n \n- Ajout du support PS5\n- Correction de la configuration qui n'est pas importée\n- Ajout d'une nouvelle option, \"Create new emu\" (BETA peut être buggée)\n- Ajout d'une option \"Update\" (BETA peut être buggée)\n- Beaucoup d'autres choses ont été corrigées\n- Encore une fois merci à Markus95 pour son aide dans l'ajout du support de la PS5.\n \nTout est là : PS22PS4-GUI 0.7.0\n \n \nLe second outil est PS4PKG-Compiler\n \n \n\n \n \n \nPS4PKG-Compiler est un logiciel pour compiler un dossier en fake pkg  pour PS4 (et aussi PS5, je suppose), certainement pas seulement orbis pub cmd et gengp4 GUI. Il s'agit donc là d'un outil très très très simple pour compiler un dossier en fake pkg ps4/ps5.\n \nTéléchargement : PS4PKG-Compiler v0.0.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183323/in-ps4ps5-ps4pkg-compiler-001-et-ps22ps4-gui-beta-70-disponibles-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1183323/in-ps4ps5-ps4pkg-compiler-001-et-ps22ps4-gui-beta-70-disponibles-2.jpg"
        }
    },
    "news_20": {
        "title": "[PS3] Apollo Save Tool v1.8.7 disponible",
        "content": "Le développeur Bucanero vient de dévoiler une nouvelle version d'Apollo Save Tool pour la PlayStation 3, comme vous le savez Apollo Save Tool est son superbe gestionnaire de sauvegardes qui devrait être livré par défaut avec toutes les consoles Sony tellement il est efficace et simple d'utilisation. Ce serait vraiment dommage de se priver de son utilisation si vous disposez d'une console récente Sony. \n \nCette nouvelle version 1.8.7 apporte de nouveaux cheats codes pour Assassin's Creed II, mais aussi la mise à jour de la page d'index des sauvegardes du serveur web.\n \nEnfin, cette mise à jour apporte une correction de la barre de progression du cryptage/décryptage des PS2 Classics.\n \n \n \n\n \n \n \nChangelog : \n \nAjout\n- Nouveaux codes de triche : Assassin's Creed II\n \nCorrigé\n- Correction de la barre de progression du cryptage/décryptage des PS2 Classics\n \nDivers\n- Mise à jour de la page d'index des sauvegardes du serveur web\n \n \nTéléchargement : Apollo PS3 1.8.7\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183322/in-ps3-apollo-save-tool-v187-disponible-1.png"
        }
    }
}