{
    "news_1": {
        "title": "[Switch 2] Le travail de documentation sur la Switch 2 commence",
        "content": "La Nintendo Switch 2 commence à intéresser pas mal de monde, les premiers pas d'un travail de documentation ont commencé, et il semblerait que Nintendo commence à annoncer des ruptures, au Japon elle s'est déjà vendu à plus de 2.2 millions d'exemplaires, imposant désormais la mise en place d'un tirage au sort. \n \nUn utilisateur de X, Kurnalsalts, vient de publier quelques images, en assez mauvaise qualité il faut bien le reconnaitre, du PCB de la nouvelle console de Nintendo. \n \n \n\n \n \nLe premier des éléments qui surprend est la taille du SoC ARM T239, qui porte la référence GMLX30-A1, il mesure 214.5 mm2, il faut dire que Nintendo a fait appel à nVidia pour ce SoC et que celui-ci utilise l'une des usines de Samsung en 8 nm, une processus de fabrication utilisé il y a 5 ans pour produire les GeForce RTX de la série 3000. \n \n \n\n \n \nComme l'avait annoncé les leaks des spécifications, nous sommes donc bel et bien en présence d'un SoC nVidia T239 gravé sur une architecture Ampère. Niveau architecture, nous sommes sur une technologie éprouvée, par contre si l'on compare à la Switch de première génération, c'est une puce assez différente, le T239 était une version allégée du T234, une puce lancée au premier trimestre 2022 pour la robotique et les systèmes embarqués de certains véhicules. \n \nAinsi le T239 s'appuie sur 8 cores ARM Cortex-A78c avec 1536 Cuda Cores, là où le X1 avait 4 Cortex-A57 + 4 Cortex-A53 avec 256 Cuda Cores. La RAM passe de 4 Go LPDDR4 à 12 Go LPDDR5X permettant une bande passante jusqu'à 102,4 Go/s en mode dockée, enfin le stockage est confié à SK Hynix avec 256 Go de UFS3.1, exit donc la mémoire eMMC. \n \n \n\n \n \nOn le voit, Nintendo a joué la prudence avec la Switch 2, en assemblant du matériel éprouvé et fiable, avec des marques et des technologies qui sont implantées depuis des années, la fiabilité avant tout, si l'on exclut le joy-con drift. \n \nPour information, le leaker informe qu'il publiera avec l'autorisation de sa source une vidéo dans 4 jours. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205770/in-switch-2-le-travail-de-documentation-sur-la-switch-2-commence-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205770/in-switch-2-le-travail-de-documentation-sur-la-switch-2-commence-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1205770/in-switch-2-le-travail-de-documentation-sur-la-switch-2-commence-1.png"
        }
    },
    "news_2": {
        "title": "[PS5] Sony dévoile son nouveau firmware pour la PS5",
        "content": "Sony, avec Shuzo Kikuchi, Vice-président de la gestion des produits, Sony Interactive Entertainment vient d'annoncer la mise en ligne d'un nouveau firmware pour la PS5 et son déploiement à partir de demain de façon progressive. La nouvelle mise à jour du logiciel système PS5 propose une mise au point audio et le retour des personnalisations classiques de l'interface utilisateur de la console.\n \n \n\n \n \nAvec ce firmware, Sony montre que les développeurs continuent de proposer de la nouveauté, avec notamment la fonction Audio Focus qui améliore l'immersion grâce à des préréglages amplifiant les sons faibles selon vos préférences auditives, garantissant une expérience audio plus claire avec un casque ou un micro-casque. Cette fonctionnalité favorise une plus grande accessibilité aux expériences audio.\n \n \n\n \n \nAvec cette nouvelle option, lorsqu'elle est activée, vous pouvez choisir parmi une gamme d'options prédéfinies qui facilitent la distinction des sons tels que les dialogues des personnages du jeu, les effets sonores subtils tels que les pas et le bruissement de l'herbe, ainsi que les voix dans les discussions de groupe pour une expérience de jeu plus immersive.\n \n \n\n \n\n \n \nAvec cette mise à jour, Sony propose aussi le retour des designs de consoles classiques pour l'interface utilisateur de la PS5, avec des personnalisations  PlayStation, PlayStation 2, PlayStation 3 et PlayStation 4 que nous avions découvert lors du 30e anniversaire.\n \nTout cela sera proposé à partir de demain, dommage que l'intro PS1 ne soit pas de la partie. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205750/in-ps5-sony-devoile-son-nouveau-firmware-pour-la-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205750/in-ps5-sony-devoile-son-nouveau-firmware-pour-la-ps5-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1205750/in-ps5-sony-devoile-son-nouveau-firmware-pour-la-ps5-3.png"
        }
    },
    "news_3": {
        "title": "[PS4] shadps4 v0.8.0 disponible",
        "content": " \nAprès une version 0.7.0 qui a été largement optimisée durant un gros mois avec de nombreuses mise à jour et corrections, le développeur George Moralis propose la version 0.8.0 de shadps4 le célèbre émulateur PS4 qui tire clairement le meilleur de la console. Ils sont très nombreux, les émulateurs PS4, mais aucun n'arrive à la cheville de shadPS4, tout simplement. \n \nUne nouvelle version qui a coup sûr marquera l'histoire de l'émulation de la console de Sony, elle est dédiée à l'un de nos derniers développeurs Uber, « Stephen ». De nombreux correctifs et fonctionnalités ont été ajoutés à cette version. \n \n \n\n \n \nChangelog : \n \nCore : \n- lseek : laisser le système d'exploitation hôte définir des erreurs lseek -\n- Nettoyage du code du système de fichiers\n- Émuler le mappage sceKernelInternalMemory\n- Correction de sceKernelAllocateDirectMemory et sceKernelAvailableDirectMemorySize\n \nBibliothèques :\n- sceDiscMap est maintenant HLE.\n- Travail initial ngs2 HLE.\n- Implémentation du passthrough libusb\n- Stubs ulobjmgr appropriés\n- Implémentation initiale d'Audio3d\n- Stub de bibliothèque NpAuth\n \nGPU :\n- Réinitialiser l'étiquette de tampon précédente au lieu de l'étiquette actuelle\n- Gérer les paquets de calcul qui sont divisés entre les extrémités de deux tampons de commande\n- Implémenter DmaDataSrc::MemoryUsingL2 et DmaDataDst::MemoryUsingL2\n- renderer_vulkan : utiliser un état dynamique de pochoir de profondeur plus important.\n- renderer_vulkan : mettre à jour l'état dynamique uniquement lorsqu'il est modifié.\n- renderer_vulkan : rendre certains états primitifs dynamiques.\n- Implémenter sceVideoOutGetEventCount et sceVideoOutDeleteVblankEvent\n- vk_rasterizer : contrôler l'accès aux plages mappées avec un verrou partagé.\n- renderer_vulkan : améliorer la gestion des extensions obligatoires et facultatives.\n- vk_rasterizer : améliorer les calculs de profondeur de la fenêtre d'affichage.\n- texture_cache : assouplir le type d'image incompatible de l'assertion à l'échec de cache.\n- renderer_vulkan : prendre en charge le chargement des couches Vulkan sur la version SDL de macOS.\n \nRecompilateur de shaders :\n- Amélioration de la gestion des divergences et l'élimination des voies de lecture\n- Ajout  S_SETPRIO à EmitFlowControl\n- Utilise  VK_AMD_shader_trinary_minmax lorsqu'il est disponible\n- resource_tracking_pass : ajouter une heuristique pour détecter les tampons pointus mal suivis\n- Implémentation S_FLBIT_I32_B32 et V_MUL_HI_I32\n- Implémentation l'instruction S_SUBB_U32\n- Remplir les variantes IMAGE_GATHER4_* dans le tableau\n- Implémentation de DS_SUB_U32, DS_INC_U32, DS_DEC_U32.\n- Implémentation de l'instruction SET_PC_B64\n \nInterface graphique :\n- Ajout d'une option pour activer/désactiver les dossiers de jeu individuellement\n- Gérer \"-patch\" comme suffixe pour les dossiers de mise à jour du jeu\n- Visionneuse de trophées - Sélectionner un jeu\n- Suppression de la prise en charge de fpkg.\n- Correction de la prise en charge des chemins Unicode pour les répertoires d'installation du jeu\n- Comme d'habitude, beaucoup de nouvelles traductions\n \n \nTéléchargement : shadps4 v0.8.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205748/in-ps4-shadps4-v080-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[Switch 2] MigSwitch confirme la compatibilité du MigFlash avec la Switch 2",
        "content": "L'équipe en charge du développement du MigFlash, la team MigSwitch, vient d'annoncer au travers de leur profil X.com que leur solution de contournement est bien compatible avec la Switch 2. \n \nPour cela elle annonce que \"la compatibilité du Mig Flash avec les jeux Nintendo Switch 1 sur Nintendo Switch 2 est confirmée grâce à la rétrocompatibilité de la console.\" \n \n \n\n \n \n \nAutre information importante, elle annonce qu'un nouveau Mig Dumper (ou une mise à jour firmware, cela reste à préciser) est en cours de développement, afin de permettre potentiellement la sauvegarde des jeux Switch 2. \n \nBien entendu, tant que la console n'est pas officiellement entre les mains des utilisateurs et détenteurs du MigFlash, il est difficile d'affirmer que tout fonctionnera de la même manière, mais il est clair que cette information va probablement accélérer les ventes, vu le prix des jeux de la Switch 2, en plus en tenant compte de la particularité de la microSD Express. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205745/in-switch-2-migswitch-confirme-la-compatibilite-du-migflash-avec-la-switch-2-1.png"
        }
    },
    "news_5": {
        "title": "[Switch 2] Une Switch 2 volée sur la chaîne de fabrication en Chine",
        "content": "Le pire qui devait arriver pour Nintendo, une Nintendo Switch 2 a été volée sur l'une des chaines de fabrication de Nintendo. \n \nDans le cas de la Switch, une partie de la fabrication avant 2019 était uniquement basée en Chine, puis après 2019, la Switch (notamment la OLED) a été fabriquée en partie au Vietnam. \n \n \n\n \n \nComme nous l'avons vu précédemment, de nombreux leaks des usines chinoises ont eu lieu, mais là une console a été volée dans une des nombreuses usines mises à contribution en Chine. \n \n \n\n \n \nDans la vidéo, on peut voir le menu de contrôle qualité, la preuve que la console est tuout fraichement sortie de la chaine. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205743/in-switch-2-une-switch-2-volee-sur-la-chaine-de-fabrication-en-chine-1.png"
        }
    },
    "news_6": {
        "title": "[PS4/PS5] Save Transfer Wizard v2.0.0 disponible",
        "content": "Le développeur Rajesh dévoile une toute nouvelle version de Save Transfer Wizard, et pas des moindres, il s'agit de la version v2.0.0 qui apporte beaucoup de nouveautés, il faut dire que la dernière update daté de décembre 2024.\n \nSon outil qui se destine à l'utilisation sur PlayStation 5, est un utilitaire PC qui va vous permettre de transférer facilement les sauvegardes entre votre PS5 et votre PC. Livré avec une interface sobre, il en dispose néanmoins des fonctions avancées, il vous permet de copier, télécharger, supprimer des sauvegardes via la connexion FTP. \n \n \n \n\n \n \n \nChangelog v2.0.0 - 2025-04-22 \n \n- Console Directory Explorer : Nouveau navigateur de répertoire FTP basé sur l'arborescence ajouté avec des icônes de dossier et la navigation de sous-dossier extensible.\n- Fonctionnalité de téléchargement : Télécharger des fichiers ou des dossiers directement dans les répertoires sélectionnés de la console via le menu contextuel.\n- Option de suppression : Le menu contextuel du clic droit comprend désormais une option de suppression avec une demande de confirmation pour éviter les suppressions accidentelles.\nLogique de rafraîchissement de l'interface utilisateur : Les actions post-chargement et post-suppression rafraîchissent désormais automatiquement l'arborescence.\n- Persistance des nœuds : Après le rafraîchissement, l'arborescence conserve le focus sur le nœud précédemment sélectionné.\n- Détection intelligente des dossiers : Seuls les dossiers apparaissent comme extensibles dans l'arborescence ; les fichiers sont correctement affichés sans icône de dossier.\nAmélioration de\n- Interface utilisateur plus propre : Suppression des boutons de téléchargement en faveur d'une interface de menu contextuel simplifiée.\n- Gestion des erreurs : Amélioration du retour d'information pour les erreurs de connexion et d'opération de fichier.\n- Maintient l'utilisation de FluentFTP sans ajouter de DLL externes.\n \nTéléchargement : Save Transfer Wizard v2.0.0 \n \n \n \n",
        "images": {}
    },
    "news_7": {
        "title": "[PS4/PS5] Deux bugs pour le prix d'un, et un PoC de corruption",
        "content": "Le développeur Zecoxao dévoile une preuve de concept sur un bug \"double free\" de corruption de mémoire, mais ce sont pas moins de 2 bugs qui ont été dévoilés !\n \nZecoxao vient de dévoiler un Poc de corruption de mémoire pour la PS4, ce bug a été patché sur le firmware 12.50, ce qui semble signifier que cette faille est présente sur le firmware 12.02 et 12.00 mais aussi sur les firmwares en dessous, il reste à confirmer quels sont les firmwares inférieurs concernés. \n \nLe Poc est disponible ici : Double Free (PS4)\n \n \n \n\n \n \nAutre chose, ce bug serait corrigé sur le firmware 12.50 sur PS4 mais il est aussi présent sur PS5 jusqu'au firmware 11.00. Sur PS4, d'après les premiers fichiers qui circulent, les ELFs sont proposés sur les firmwares 11.02, 11.50, 11.52, 12.00 et 12.02.\n \nMais encore plus fort, il semblerait qu'un autre bug kernel aurait été découvert, il porte le nom d'UAF est serait présent jusqu'au firmware 10.40 sur PS5. Nous ne savons pas si cet exploit est en lien avec celui dévoilé par TheFlow, peut être n'a-t-il rien à voir, ce qui potentiellement pourrait donc porter à 3 le nombre de bugs utilisables. \n \nReste à confirmer que tout ces bugs soient réellement exploitables. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205696/in-ps4ps5-deux-bugs-pour-le-prix-dun-et-un-poc-de-corruption-1.png"
        }
    },
    "news_8": {
        "title": "[PS4] OrbisPro Beta 0.4.1 disponible",
        "content": " \nLe développeur SvenGDK propose une nouvelle version d'OrbisPro Beta qui est désormais estampillée 0.4.1. Après une v0.4, le développeur a rapidement proposée la v0.4.1 qui vient corriger la navigation, des crashs et utiliser la nouvelle URL pour les nouvelles mises à jour. \n \nLe changelog est tout simplement stratosphérique, OrbisPro est une plateforme en développement visant à centraliser et optimiser la gestion des jeux et applications sur PC, avec une interface intuitive et des fonctionnalités avancées.\n \n \n\n \n \n \nChangelog v0.4.1 :\n \n- Sera installé lors de la première exécution si vous avez déjà la version v0.4.0 - Les fichiers de la version actuelle ont déjà été mis à jour vers la version v0.4.1\n- Corrige la navigation à la manette lors de la sélection du contenu d'un dossier\n- Corrige un plantage dans le menu d'accueil lors de la sélection d'un dossier contenant une application système\n- Utiliser la nouvelle URL de mise à jour pour les nouvelles mises à jour\n- Mise à jour de l'OrbisProUpdater\n \nChangelog 0.4.0 : \n \nMises à jour des fonctionnalités\n- La configuration permet désormais de choisir davantage de lecteurs à analyser pour les jeux et les applications\n- Ajout de l'émulateur PS4 depuis shadPS4\n- Le menu Accueil charge désormais également les jeux PS4 enregistrés\n- Nouveau menu d'options pour l'écran d'accueil\n- Ajouter l'application ou le jeu sélectionné à un dossier\n- Supprimer un dossier sélectionné\n- Les applications, jeux et dossiers enregistrés sont désormais stockés dans un fichier au format JSON\n- Nouveaux paramètres de manette de jeu\n- Ajustez le taux d'interrogation des manettes 1 à 4 (une seule fonctionne actuellement)\n- Option « Tester l'entrée de la manette »\n- Définir la disposition des boutons de la manette de jeu\n- L'explorateur de fichiers marque désormais les sauvegardes PS4 avec un logo shadPS4\n- L'explorateur de fichiers peut désormais ouvrir des images avec le nouveau visualiseur d'images système\n- La visionneuse d'images système ne peut actuellement que faire pivoter l'image et la mettre en plein écran (et inversement)\n- L'explorateur de fichiers permet désormais d'exécuter des sauvegardes avec un émulateur spécifique lors de l'ouverture du menu OPTIONS\n- L'explorateur de fichiers dispose désormais d'une option permettant d'installer les fichiers PKG PS4 dans le répertoire shadps4\\games\n- Le répertoire d'installation ne peut pas encore être modifié et est corrigé dans OrbisPro\n- OrbisPro charge désormais les dossiers enregistrés sur l'écran d'accueil\n- Un dossier peut être créé/supprimé de la même manière que sur la console PS4\n- Ajout des touches de clavier manquantes lors de l'utilisation d'un clavier uniquement\n- Nouveau programme d'installation PKG pour les jeux PS4\n- L'installateur PKG vérifie la compatibilité du jeu et renvoie l'état de fonctionnement actuel du jeu dans une boîte de dialogue\n- Vous pouvez accepter le message et installer le PKG ou annuler l'action\n- Nouveau testeur d'entrée de manette de jeu\n- Affiche le bouton enfoncé, les valeurs Y/X du pouce gauche/droit, les valeurs du déclencheur gauche/droit\n \nAjouts :\n- Ajout de 12 nouvelles icônes de jeu et de 12 nouveaux arrière-plans de jeu\n- Ajout de 2 nouveaux arrière-plans animés pour OrbisPro (Blue Bokeh Dust et Golden Dust)\n- Ajout de nouvelles dispositions de boutons\n-> PS3\n-> PS4\n-> PS5\n-> PS Vita\n-> Steam (style Xbox plus récent)\n-> Pont à vapeur\n-> Xbox 360\n- Ajout d'une disposition de clavier noire\n \nCorrections :\n- Les touches du clavier étaient toujours acceptées dans certaines fenêtres lorsque la saisie était suspendue\n- Les manettes de jeu n'avaient pas ce problème\n- Boutons de manette manquants dans certaines fenêtres\n- OrbisPro acceptait toujours tous les types d'entrées lorsqu'un jeu/une application était démarré à partir de l'explorateur de fichiers ou de la bibliothèque de jeux.\n- ReduceUsage() manquait également et a été ajouté maintenant\n- Le retour à l'accueil depuis la bibliothèque de jeux peut interrompre le focus sur la fenêtre principale.\n- La bibliothèque a instantanément supprimé un jeu/une application sans confirmation\n- Une nouvelle boîte de dialogue de confirmation apparaît maintenant pour confirmer la suppression\n- Son de déplacement manquant dans la bibliothèque\n- L'entrée n'a pas été interrompue lorsqu'un message d'exception a été généré\n- Le retour à l'accueil à partir du navigateur Web peut interrompre le focus sur la fenêtre principale\n- Aucune saisie supplémentaire n'est possible lorsque ReloadHome() a été utilisé\n- Les paramètres avec des cases à cocher étaient enregistrés avant la vérification/décochage visuelle, ce qui entraînait l'enregistrement de l'état précédent\n- Correction d'un crash qui bloquait l'Explorateur de fichiers lors de la tentative d'ouverture du premier dossier sélectionné\n- Correction de la fin de la configuration lors de l'appui sur une touche spécifique\n \nChangements internes :\n- Nouvelle classe « DirveListViewItem » utilisée pour la liste des lecteurs\n- Nouvelles classes « ExistingFolderListViewItem », « FolderContentListViewItem » et « FolderContentSelectionListViewItem » utilisées pour les dossiers\n- Nouvelles classes « OrbisAppList » et « OrbisGamesList » pour gérer les nouveaux fichiers au format JSON\n- Nouvelle classe « OrbisFolders » pour gérer les dossiers\n- Fonctions « CreateNewFolder », « RemoveFolder », « ChangeFolderNameOfAppGame » et « GetFolderContentNames »\n- Vérifiez les extensions de fichiers avec « .ToLower() »\n- GameStarter -> Démarrer le jeu\n- Ajout d'une option pour démarrer le jeu avec un émulateur sélectionné\n- Ajout d'une propriété Platform pour démarrer les fichiers « .bin », « .elf » et « .iso » avec l'émulateur correct\n- Ajout de la possibilité de démarrer les fichiers .bin et .elf avec l'émulateur sélectionné\n- Nouvelle classe « OrbisPS4 » qui gère actuellement la compatibilité ShadPS4\n- Remplacement de « AppPath » par « AppExecutableFilePath » dans « OrbisStructures.AppDetails »\n- Certaines fonctions ont été déplacées vers « OrbisUtils »\n- Modifications de la classe « OrbisUtils » :\n- Nouvelle fonction « CreateFolderImage » qui crée des icônes de dossier\n- Sélectionne les 4 premières icônes de jeu/application disponibles dans un groupe\n- Nouvelle fonction « GetFolderItemsCount » pour obtenir le nombre d'éléments du dossier\n- Nouvelle fonction « GetFolderItems » qui renvoie les éléments d'un dossier donné\n- Nouvelles fenêtres « CreateNewFolderDialog », « ExistingFolders » et « SelectFolderContentDialog »\n- La fenêtre « ExistingFolders » répertorie les options permettant de créer un nouveau dossier et des dossiers déjà existants\n- « CreateNewFolderDialog » affiche un aperçu du dossier, ici vous pouvez définir le nom du dossier et son contenu\n- « SelectFolderContentDialog » permet de sélectionner le contenu d'un dossier et renvoie la valeur à « CreateNewFolderDialog »\n- « SystemDialog » ajusté pour afficher des messages et demander une confirmation pour des actions spécifiques\n- L'explorateur de fichiers utilise désormais un cache d'icônes pour charger les icônes d'extension de fichier\n- Le « FileExplorer » vérifie désormais les extensions de fichiers avec « .ToLower() »\n- Le « FileExplorer » peut désormais ouvrir les fichiers « .jpg », « .jpeg », « .png », « .webp », « .bmp », « .tif », « .tiff », « .gif », « .apng », « .heif » avec le nouveau « SystemImageViewer »\n- Le « FileExplorer » utilise désormais une nouvelle fonction ShowSideSettingButtons pour afficher la quantité requise de boutons de menu d'options\n- Le menu d'options de « FileExplorer » permet désormais d'exécuter des fichiers « .bin », « .elf », « .iso » avec différents émulateurs\n- Nouvelles icônes d'extension de fichier « FileExplorer »\n- La « MainWindow » possède désormais l'ombre/la boîte noire manquante sous l'icône du jeu/de l'application (« StartRect »)\n- Ajout des variables « HomeGroupAppsCount » et « GroupAppsOnHome » pour suivre les éléments du dossier\n- \"HomeAnimation\" ajusté pour permettre le chargement de Home sans effet sonore (actuellement utilisé uniquement lors du rechargement de Home)\n- Un « RightMenu » (menu d'options) a été ajouté à la « MainWindow »\n- Fonction « AddNewApp » ajustée pour permettre l'ajout de dossiers sur l'écran d'accueil\n- « ReloadHome() » recharge désormais la page d'accueil sans effet sonore et supprime également les éléments de dossier visibles\n- Nouvelles fonctions « ShowGroupAppsOnHome » et « RemoveGroupAppsOnHome » pour afficher ou masquer des applications ou des jeux dans un dossier\n- Le déplacement vers le bas sur un dossier déplacera les principales icônes d'accueil vers le haut et permettra de parcourir les éléments du dossier.\n- Pour revenir aux icônes principales de la page d'accueil, le focus doit être sur le PREMIER élément\n- Le déplacement vers le haut sur le PREMIER élément du dossier restaurera les principales icônes d'accueil\n- Fonctions « MoveAppsLeft » et « MoveAppsRight » ajustées pour afficher les éléments du dossier lors du déplacement vers un dossier\n- Les deux fonctions permettent désormais également de parcourir les éléments du dossier\n- La « MainWindow » utilise désormais également une nouvelle fonction « ShowSideSettingButtons » pour afficher la quantité requise de boutons de menu d'options\n- La « MainWindow » dispose désormais d'une nouvelle fonction « EnsureHighestZIndex » pour garantir que le menu d'options et les boutons requis sont toujours au-dessus des autres éléments.\n- La « MainWindow » vérifie désormais directement si une batterie ou un réseau Wi-Fi est disponible et l'enregistre dans « IsBatteryPresent » et « IsWiFiAvailable ».\n- Le « SystemTimer » qui surveille l'état de la batterie/du Wi-Fi ne démarrera pas si « IsBatteryPresent » et « IsWiFiAvailable » sont définis sur « False ».\n- La fonction « ChangeBackgroundImage » de « MainWindow » permet désormais de charger une image d'arrière-plan à partir de la propriété JSON « BackgroundPath » d'un jeu/d'une application\n- Le nom de « SystemGallery » a été modifié en « SystemImageViewer » pour la nouvelle visionneuse d'images.\n- Ne définissez pas « PauseInput=False » deux fois lorsque vous revenez à une fenêtre, car « Activate() » le fera dans la fenêtre de retour.\n- « Gestion des comptes » a été renommé en « Gestion des utilisateurs » dans « Paramètres généraux ».\n- « Paramètres généraux » charge désormais les nouveaux paramètres de la manette de jeu et de l'émulateur PS4\n- Nouvelles fonctions « ChangePS4ConfigValue » et « GetTOMLValue » pour lire/modifier le fichier de configuration de l'émulateur PS4\n- Fenêtres « SetupApps » et « SetupGames », « GameLibrary » et « FileExplorer » ajustées pour enregistrer les informations de jeu/application avec le nouveau format JSON\n- Nouvelle fenêtre « SetupDrives » qui répertorie les lecteurs connectés qui peuvent être sélectionnés pour être traités dans le prochain processus des fenêtres « SetupGames » et « SetupApps »\n- \"WelcomeToSetup\" -> Suppression de la configuration \"supplémentaire\" pour l'Asus ROG Ally et du message de bienvenue lors du premier démarrage d'OrbisPro\n- « GameLibrary » charge désormais également les jeux PS4 enregistrés\n- Fonction « PauseProcessThreads » ajustée dans « ProcessUtils » pour suspendre désormais tous les threads de chaque processus en cours d'exécution avec le nom du processus en cours d'exécution actif\n- Ne quittez pas non plus la boucle si « OpenProcessThread = IntPtr.Zero » mais continuez\n- Nouvelle fenêtre « PKGInstaller » qui gère les installations de packages PS4\n- Actuellement sans réelle progression du fichier mais une barre de progression indéterminée jusqu'à la fin\n- Récupère l'état de compatibilité de ShadPS4 à l'aide de la fonction « FetchShadPS4Compatibility »\n- Les PKG installés avec succès seront ajoutés à GamesList.json\n- Un rechargement de Home est nécessaire pour afficher le package nouvellement installé\n- Déplacement de « SystemDialog » vers le nouveau dossier « Dialogs » -> « Dialogs\\SystemDialog »\n \nMises à jour des packages et des bibliothèques : \n- LibVLCSharp v3.9.2 -> v3.9.3\n- LibVLCSharp.WPF v3.9.2 -> v3.9.3\n- Wifi natif géré v2.7.0 -> v2.7.1\n- Microsoft.Web.WebView2 v1.0.3124.44 -> v1.0.3179.45\n- Gestion du système v9.0.3 -> v9.0.4\n- Ajout de Tomlyn v0.19.0\n- Ajout de SharedMemory v2.3.2\n- Ajout de SharpZipLib v1.4.2\n- Ajout de GameArchives v0.1.138\n- Ajout de HtmlAgilityPack v1.8.10\n- Ajout de PARAM.SFO v1.0.0\n- Ajout de PS4_Tools v1.0.0\n \nRappels de combinaison de boutons/touches :\n- Pour recharger l'écran d'accueil, appuyez simplement simultanément sur les boutons L + R d'une manette ou sur la touche F1 d'un clavier.\n- Pour revenir à l'écran d'accueil après une partie en cours, appuyez simplement simultanément sur les boutons START + SELECT sur une manette ou sur la touche HOME sur un clavier.\n- Pour revenir au jeu en cours, appuyez simplement simultanément sur les boutons START+SELECT ou à nouveau sur la touche HOME\n- Pour ouvrir les options/menu latéral sur l'écran d'accueil, appuyez simplement sur DÉMARRER sur une manette de jeu ou sur la touche F2 d'un clavier tout en vous concentrant sur un jeu/une application\n \nModifications d'installation/d'archivage :\n- Passé d'une archive .7z à une archive .exe auto-extractible de 7Z (SFX - parties de 1,25 Go) en raison de la limitation de la taille de téléchargement de GitHub (2 Go)\n- Pour installer/extraire, téléchargez simplement les 3 fichiers requis et exécutez « OrbisPro Beta v0.4.exe » une fois téléchargé :\n- OrbisPro Beta v0.4.exe\n- OrbisPro Beta v0.4.7z.001\n- OrbisPro Beta v0.4.7z.002\n \n \n \nTéléchargement : OrbisPro Bêta 0.4.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205676/in-ps4-orbispro-beta-041-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[PS4-PS5] Retroarch en un clic sur vos PS4 et PS5",
        "content": "Petite mise à jour de mon outil  de création d'émulateur en un clic, fonctionne sur toutes les PS5 et PS4 jailbreakés.\n \n\n \nGrâce à ce petit GUI (toujours en batch) il vous sera très très simple de créer un FPKG d'émulateur rétro pour vos PS5 4.xx, 6.xx  et 7.xx , et PS4, un simple clic sur l'émulateur voulu et tous se fera automatiquement, juste à patienter... Je ne peux pas faire plus simple ^^...\n \nIl utilise retroarch PS2, ce sont donc des versions PS2 que vous allez lancer sur vos PS4 et PS5...\nCertains me diront c est pas du natif et c est de la ps2 blablabla, le plus important est que cela fait le taf et permet de jouer à nos vieux jeux retro, non ?!\n \nVous pourrez donc en un clic créer un FPKG comprenant un émulateur GameBoy - Color, Nes, Snes, GameGear, Master System, Megadrive, Atari 800, Lynx, WonderSwam ou NeoGeo Pocket.\n \nUne seule chose à faire copier/coller vos roms dans le dossier Games, puis cliquer sur l' émulateur voulu, rien d'autre...\n \nAttention !!! Avant le premier lancement du .bat il vous faudra régler imgburn afin qu il crée l' ISO ps2, sans ce réglage, l' émulateur ne trouvera pas vos roms une fois lancé sur vos PS5 et PS4...Cette manip n' est à faire qu' une fois avant le premier lancement du .bat...\n \n\n- Lancer imgburn.exe  dans le dossier tools/\n- Sélectionner Create image file from files/folders\n- Puis l'onglet Advanced\n- Puis l' onglet Restrictions\n- Et sélectionner bien Level 2 - 31 characters\n- Fermer imgburn\n- Voilà il est bien configuré...\n \n\n \n \n\n \n \n \nTuto:\n \n\n- Copier/coller vos roms dans le dossier Games/\n- Cliquer sur l' émulateur de vos roms\n- Patienter\n- Installer le pkg sur votre PS5\n- Lancer l app une fois sur le menu appuyer O\n- Selectionner CDFS:/ puis core\n- Lancer le .elf\n- Une fois le menu vert ouvert séléctionner load content\n- Lancer la rom voulue\n- Jouer\n\n \nTélécharger PS4-PS5 retroarch.rar\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205645/in-ps4-ps5-retroarch-en-un-clic-sur-vos-ps4-et-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175709/in-ps4-creer-un-fpkg-demulateur-en-un-clic-2.png"
        }
    },
    "news_10": {
        "title": "[PS5] etaHEN 2.1B détaillé par LightningMods",
        "content": "Le développeur LightningMods continue de détailler les options qui seront rajoutées dans le prochain etaHEN 2.1B. En plus des nouveautés dont il a déjà parlé précédemment, le développeur rajoute que la v2.1B va donc intégrer une nouveauté très intéressante. \n \n \n\n \n \netaHEN 2.1B va disposer en effet d'une nouvelle option qui permettra de mettre en pause et de reprendre kstuff à tout moment, ci-dessous une vidéo qui montre cette fonctionnalité en action avec un test de performance dans itemzflow montrant l'énorme différence entre la pause et la reprise.\n \n \n\n \n \nVous allez donc pouvoir désactiver automatiquement kstuff quelques secondes après le chargement du jeu, puis l'activer à la fermeture du jeu. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205613/in-ps5-etahen-21b-detaille-par-lightningmods-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] Kstuff désormais compatible avec les firmwares 7.00 à 7.61",
        "content": "Le développeur EchoStretch a mis à jour Kstuff, cette nouvelle version apporte le support de l'ensemble des firmwares compris entre le 7.00 et 7.61.\n \n \n \n\n \n \nKstuff supporte donc désormais tous les firmwares 7.xx : \n \nfirmware 7.00\nfirmware 7.01\nfirmware 7.01.01\nfirmware 7.20\nfirmware 7.40\nfirmware 7.60\nfirmware 7.61\n \nL'intégralité des firmwares compris entre 3.00 et 7.61 sont désormais officiellement supporté par kstuff. \n \nComment cela se caractérise, par l'arrivée d'une nouvelle version de PS5 Kstuff qui est maintenant proposé en version 1.4 : kstuff 1.4\n \nBien entendu, l'exploit webkit n'ayant pas été trouvé au delà du firmware 6.50, il faut passer par l'exploit BD-J ou lua. \n \n \n\n \n \n\nLe développeur tient à remercier sleirsgoevy pour avoir créé ce projet ! Il rappelle que ce projet n'aurait pas pu avec lieu sans l'aide de Zecoxao et de ces amis qui ont donné des clés. Un grand merci également à buzzer-re , BestPig , idlesauce , Al-Azif et à tous ceux qui ont contribué, sans compter le soutien de nombreux. \n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205612/in-ps5-kstuff-desormais-compatible-avec-les-firmwares-700-a-761-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205612/in-ps5-kstuff-desormais-compatible-avec-les-firmwares-700-a-761-2.png"
        }
    },
    "news_12": {
        "title": "[PS5] Backporter vos dumps PS5 vous même en un clic",
        "content": "Voici quelques jours que les backports PS5 pululent sur internet grâce au script python de Idlesauce disponible ici\n\nJe m en suis moi même servis pour backporter plusieurs jeux PS5 comme DBZ Kakarot ou Atomic Heart qui fonctionnent maintenant en 4.03.\n\n\n\n\nVoici un petit batch qui automatise toute la procédure du backport...\n\nCe bat vas donc vous permettre de backporter vos jeux PS5 vers 4.03 en 1 seul clic... Attention à savoir que tous les jeux ne sont pas backportables, si vous obtenez un écran noir cela signifie que le jeu en question ne peut être backporté (en tous cas avec cette méthode).\n\nIl vous faudra aussi bien respecter la procédure suivante\n \n- Créer un dossier Backport\n- Décompresser l' archive auto_backport dedans\n- Récupérer le fichier eboot.bin.esbak, TOUS  les *.prx.esbak présent en général dans (sce_module et parfois prx) et parfois ailleurs de vos dumps PS5 (sans les fichiers .esbak le backport n est pas possible)                                                                                                                                                                              - Copier ces fichiers .esbak dans votre dossier backport (vous pouvez copiez directement les dossiers sce_module et prx comprenant les .prx.esbak)\n- Lancer auto_backport.bat\n- Patientez\n- Si tout s est bien passé vous aurez alors un fichier eboot.bin et des .prx en plus des fichiers .esbak\n- Copier/coller ensuite ses nouveaux fichiers dans votre dump PS5 en respectant bien l arborescence de base.\n- Lancer votre jeu...\n \n\nSi vous obtenez un écran noir c est que votre jeu ne peut être backporté... De plus les jeux 6.XX ET 7.XX ne peuvent être backportés. Il leur faut en plus un patch pour le GPU qui n est pas présent dans le script d origine.\n\n\nTélécharger  Auto_Backport\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205609/in-ps5-backporter-vos-dumps-ps5-vous-meme-en-un-clic-1.png"
        }
    },
    "news_13": {
        "title": "[Switch] La nouvelle version de Sphaira est disponible (maj)",
        "content": " \nLa nouvelle version de Sphaira vient d'être mise en ligne, rappelons que c'est le développeur TotalJustice qui propose sa solution de remplacement du hbmenu intégrant des fonctionnalités inédites, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \nLes changements dans cette version sont nombreux, et certains d'entre eux nous les devons à shadow256 que nous tenons encore à remercier pour tout le travail qu'il accomplie. \n \nCette nouvelle révision vise à introduire plusieurs nouvelles fonctionnalités, des correctifs et des améliorations, sur les fonctionnalités mais aussi sur la localisation et les traductions. Les changements se trouvent dans le changelog ci-dessous. \n \n \n\n \n\n \n\n \n \nChangelog : \n \n- Ajout d'une nouvelle chaîne par Yorunokyujitsudans  \n- Mise à jour de se.json avec la dernière chaîne ajoutée par HenryBabydans  \n- [Thème] icônes alt + thème par spkats1 \n- README édité, traductions italiennes mises à jour par LNLenost \n- Mise à jour de la traduction française par shadow256\n- Mise à jour de pt.json par ninstar\n- Mise à jour de zh.json par BIGBIGSUI\n- Ajout d'une horloge de 12 heures au menu principal par therealbungus\n- Ajout 12 dans notre chaîne de temps dans les fichiers de traduction et traduction en français par shadow256 \n- Réparation de themezer\n \n \nEdit 21.04.2025 : \n \nTéléchargement : Sphaira 0.7.0\n \n \n \n  \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205596/in-switch-la-nouvelle-version-de-sphaira-est-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205596/in-switch-la-nouvelle-version-de-sphaira-est-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1205596/in-switch-la-nouvelle-version-de-sphaira-est-disponible-3.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] Un exploit kernel de TheFlow dévoilé via le syscall sys_fsc2h_ctrl",
        "content": "Le 15 décembre 2024 TheFlow, l'expert en sécurité avait déposé un rapport au programme bounty rapporté par hackerone.com sous le numéro 2900606 procurant une nouvelle prime de 10 000 $ au développeur. \n \nComme vous le savez, ces rapports sont soumis à des conditions de divulgation très stricte, mais d'un autre côté lorsqu'ils sont déposés, il suffit d'attendre quelques mois avant d'en découvrir le contenu. \n \nC'est donc quelques 5 mois après son dépôt que ce rapport est dévoilé, le 18 avril 2025, et il est très croustillant.\n \n \n\n \n\n \n \n \nL'exploit kernel, qui permet d'obtenir les privilèges, se base sur un débordement de le syscall sys_fsc2h_ctrl, qui est une composante de la table de la console, reste à savoir de laquelle car nous retrouvons ce syscall sys_fsc2h_ctrl notamment dans mast1c0re ici.\n \nAinsi l'exploit kernel permet d'obtenir les privilèges au travers d'un syscall sys_fsc2h_ctrl qui est cassé avec 4 threads et divers commandes, et une allocation de mémoire spécifique sur malloc(). \n \nIl est fort probablement que cet exploit soit sur PS5 (et seulement sur PS5) mais cela reste à confirmer. \nIl se murmure que cela serait corrigé autour du firmware 10.40, mais attendons d'en savoir plus. \n \nLe rapport est disponible ici : https://hackerone.com/reports/2900606\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205555/in-ps4ps5-un-exploit-kernel-de-theflow-devoile-via-le-syscall-sys-fsc2h-ctrl-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205555/in-ps4ps5-un-exploit-kernel-de-theflow-devoile-via-le-syscall-sys-fsc2h-ctrl-2.png"
        }
    },
    "news_15": {
        "title": "[GBA/NDS/DSi] No$gba mis à jour en 2025",
        "content": "Voilà que le développeur nocash123 propose une nouvelle version de son émulateur No$gba, pour rappel no$gba est un excellent émulateur Game Boy Advance / Nintendo DS / DSi et Pocket Station.\n \nNo$GBA, diminutif de No Cash GBA est un émulateur Nintendo DS / DSi / DS Lite et GameBoy Advance, supporte le multijoueur et il est envisageable de charger plusieurs roms NDS pour jouer en réseau, un peu comme si vous étiez sur un réseau de Gameboy.\n \nCette mise à jour arrive après quasiment 4 ans d'absence, c'est donc largement un évènement car No$gba n'avait pas été mis à jour depuis Août 2021.\n \n \n\n \n \n \nChangelog 3.06\n \nGBA/BIOS/clone : \n- Ignore CpuFastSet dans la zone BIOS en lecture seule (merci à Denim).\n \nIOMAP : \n- Correction de l'affichage des arrière-plans BG0-3 en mode GBA (sans ext_pal, contrairement à NDS/DSi).\n \nInterface graphique : \n- Correction de la fenêtre d'aide sur la version du jeu (affichée au-dessus de la fenêtre du jeu).\n \nContrôles/Écran tactile : \n- Détection des deuxièmes clics de souris (via WM_LBUTTONDBLCLK).\n \nConfiguration des contrôles : \n- Option pour interroger les sticks analogiques à chaque frame (lent sur les ports de jeu).\n \nVisionneuse de fichiers :\n- Prévisualisation des icônes/textures NDS/DSi/3DS.\n- Prévisualisation des dumps HEX, texte ASCII, et images (GIF/JPG/BMP/TGA/PNG).\n- Prise en charge des archives GFC/GOB et des arborescences Dict dans les fichiers vidéo 3D NDS.\n- Tri plus rapide des dossiers volumineux (via TVI_FIRST + TVM_SORT).\n \nRaw-DOS : \n- Active A20 une seule fois au démarrage (pour éviter les conflits avec les claviers USB).\n \nDSi/Aide : \n- Ajout de détails sur certains registres BPTWL.\n \nCPU/Aide : \n- Nouveau chapitre sur la syntaxe UAL pour le code ARM/THUMB.\n \nNDS/Aide :\n- Meilleures spécifications pour les formats de fichiers vidéo 3D .nsbxx (merci à Scurest).\n- Spécifications pour les fichiers son HWAS (Multiblock Sound Wave Data).\n- Spécifications pour les archives GFC/GOB (compression zlib).\n- Accès aux EEPROM GBA depuis la NDS (voir GBA EEPROM Timings, merci à pk11).\n \nCGB/Aide : \n- Notes sur le mode CGB en compatibilité GBA.\n \n3DS/Aide :\n- Formats de texture GPU 3DS (ordre des bits et format ETC1).\n- Spécifications incomplètes sur les exports DSiWare et la réinitialisation parentale.\n- Spécifications HWCAL (valeurs de vieillissement, checksums XOR, CRC16, clé SHA256HMAC).\n- Format d'icône 3DS rétro-conçu (ordre des pixels/tuiles).\n- CODEC_SNDEXCNT.bit30 doit être activé en mode GBA (sinon son dissonant).\n- Le biais en GBA (port 4000088h) n'a pas d'effet sur la 3DS en mode GBA.\n- Avertissement sur les valeurs TSC inversées dans HWCAL/config.\n- Bits MCU[3Fh] non réinitialisés au redémarrage/extinction.\n- Correction du symbole du transistor BC547 dans le flasheur MCU (CBE au lieu de BCE).\n \nDSi/Aide :\n- Ajout d'un chapitre sur les signaux/testpoints AUX DSi.\n- Brochages des connecteurs DSi XL P16/P24 (merci à Poro).\n \nDSi/Disass/A22i/Aide :\n- Assembleur/désassembleur 78k0 pour les opcodes/SFR (puce BPTWL).\n- Mise à jour de la carte annotée de la carte mère DSi : http://problemkaputt.de/twl-core.jpg.\n \nA22i :\n- Prise en charge des noms de fichiers entre guillemets dans .include et .import.\n- Directives .ual et .pre_ual pour forcer la syntaxe UAL ou ancienne.\n- Prise en charge de la syntaxe UAL avec condition en fin (ex. ldrh{cond}).\n- Alias neg pour rsb,0 (style THUMB/UAL).\n- Autorise ldm/stm sans {amod} (style UAL par défaut).\n- Vérification des registres pairs pour ldrd/strd (UAL).\n- Suffixe {S} obligatoire pour les opcodes THUMB modifiant les flags.\n- Variantes UAL pour MOV/ADD/SUB THUMB (avec/sans modification des flags).\n- Correction : espace obligatoire après ldrex/strex.\n- label equ xx ne supprime pas les labels locaux (contrairement à label:).\n- Ajout de descriptions pour .macro, .rept, .endm, .undef.\n \nDSi/Disass : \n- Désassemblage BPTWL : http://problemkaputt.de/disass_dsi_bptwl.txt.\n \n \n \nTéléchargement : No$gba v3.06\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205550/in-gbandsdsi-nogba-mis-a-jour-en-2025-1.jpg"
        }
    },
    "news_16": {
        "title": "[XB] La mise à jour firmware d'Avril d'Xbox",
        "content": "Microsoft vient de proposer la mise à jour d'Avril pour les consoles Xbox, cette mise à jour vise à améliorer l'expérience utilisateur tout en optimisant l'offre et l'accès au contenu. \n \nAu delà de ces mots qui ne veulent finalement pas dire grand chose, l'une des nouveautés attendues est la possibilité d'acheter des jeux et du contenu supplémentaire directement depuis l'application Xbox sur les appareils iOS et Android. \n \n \n\n \n \n \nMise à jour Xbox d'avril :\n \n- Diffusez votre propre jeu – maintenant sur les consoles Xbox\n- Achetez des jeux, rejoignez Game Pass et utilisez des avantages directement depuis l'application mobile Xbox\n- Les joueurs peuvent désormais jouer à n'importe quel jeu installé sur leur console en visitant http://xbox.com/remoteplay sur n'importe quel appareil doté d'un navigateur Web pris en charge \n- Présentation d'une nouvelle méthode améliorée pour libérer de l'espace de stockage sur les consoles Xbox\n- Nouveaux hubs de jeux sur les consoles Xbox\n \n \n\n \n \nL'idée est que les utilisateurs pourront précommander des jeux, souscrire à un abonnement Game Pass et échanger des avantages pour les membres Ultimate. \n \nCes fonctionnalités seront étendues au Google Play Store et Apple Store afin que les processus achats soient implémentés, et des extensions aux Xbox Series X et S, et Xbox One sont rajoutées pour les membres Ultimate du Game Pass. \n \nDes évolutions sur le cloud gaming et le rétro gaming sont aussi opérées, de quoi contenter tout le monde. \n \n \nTout est là : news.xbox.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205547/in-xb-la-mise-a-jour-firmware-davril-dxbox-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205547/in-xb-la-mise-a-jour-firmware-davril-dxbox-1.png"
        }
    },
    "news_17": {
        "title": "[PS5] OpenBOR adapté pour PS5 (version PS4)",
        "content": "Voici une adaptation d OpenBOR version PS4 pour PS5. A la base developpé par Znull, j' ai adapté cette version PS4 pour qu' elle fonctionne sur PS5.  Pour rappel, OpenBOR est un moteur de jeu personnalisable, permettant de créer de nouveaux jeux. Les jeux développés pour le moteur Beats of Rage sont communément appelés «mods», les créateurs \"moddeurs\", et le moteur lui-même est communément désigné comme \"modifiable\". Beats of Rage est devenu si populaire en raison de la capacité de personnalisation du moteur qu'il est devenu le modèle des moteurs de personnalisation pour les consoles de jeux vidéo. Par contre cet homebrew ne fonctionne que sur PS5 4.03 et non sur sur 5.xx et 6.xx due à un bug sur le montage de la sandbox (PS5/data/) qui devrait être fixé dans la prochaine version d' EtaHEN de LM.  Tuto: - décompresser l' archive OpenBOR.rar- Copier/coller par FTP ou PS5 Explorer le dossier openbor dans data/... sur votre PS5- Installer le Fpkg OpenBOR.pkg- Lancer l' application depuis votre menu PS5- Séléctionner le mod voulu- Jouer... Attention vérifier bien que mount data soit activé dans Etahen (onglet utilites). Télécharger OpenBOR_PS5",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205533/in-ps5-openbor-adapte-pour-ps5-version-ps4-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205533/in-ps5-openbor-adapte-pour-ps5-version-ps4-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS5] Les jeux et DLC 7.xx backportés sur 4.xx et 5.xx",
        "content": "Il semblerait que nous sommes en train de vivre l'une des évolutions les plus importantes de ces dernières semaines sur la scène PS5, la première étape de cette évolution est le fait que le DLC de Hogwarts Legacy a été débloqué par la team Duplex sur PS5. \n \nDans cette release a été intégré le jeu, avec son DLC et surtout le backport 4.xx, sous entendu l'eboot permettant de lancer le DLC et le jeu sur les firmwares 4.xx. \n \nUn \" développeur \", répondant au nom de baderlink, s'est alors empressé de trouver la solution pour certains jeux du firmware 7.xx pour tenter de les backporter sur les firmwares 4.xx et 5.xx, et cela semble fonctionner, certains titres commencent à sortir comme fonctionnels !\n \n \n \n\n \n \nListe des jeux qui sont désormais backportés du firmware 7.xx au 4.xx / 5.xx:\n \n- The Chant\n- Lies of P\n- The Eternal Cylinder\n- Police Simulator Patrol Officers\n- WWE 2K23\n- Shadow Warrior Définitive Edition\n \nIl semblerait que ce soit les toutes dernières releases de Duplex qui soient donc en train d'être backportées. Il prend comme référence WWE 2K23 qui a été release il y a quelques jours, et qui fonctionne donc parfaitement sur 5.50 et etaHEN Beta 2.0.\n \n \n\n \n \n \n \n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205476/in-ps5-les-jeux-et-dlc-7xx-backportes-sur-4xx-et-5xx-1.jpg"
        }
    },
    "news_19": {
        "title": "[3DS] Mise à jour importante de l'émulateur Azahar 3DS",
        "content": "L'émulateur Azahar vient de recevoir une mise à jour importante, ce projet, issu d'un fork de Citra développé par PabloMK7 et Lime3DS, avait été annoncé pour la première fois en novembre 2024. Azahar représente une évolution prometteuse dans le monde de l'émulation, surtout après l'arrêt du développement de Citra en mars 2024. Cet arrêt faisait suite à un accord juridique entre les développeurs de Citra (également responsables de l'émulateur Switch Yuzu) et Nintendo. Contrairement à Yuzu, qui a été frappé d'une injonction, Citra n'a pas été directement affecté par des restrictions légales, permettant ainsi à des projets comme Azahar de voir le jour.\n \nQuoiqu'il en soit, la mise à jour 2120.3 apporte davantage de stabilité, elle vise à résoudre certains problèmes issus de la version initiale, et se permet également d'améliorer la convivialité de certains menus. Il semblerait que cette version soit la dernière avant la prochaine version majeure qui appartiendra à la branche 2121 (annoncée ici) \n \n \n\n \n\n \n\n \n \n \nChangelog \n \nAndroid : \n- Ajout d'une nouvelle invite pour les utilisateurs qui auraient pu sélectionner par inadvertance un répertoire utilisateur différent après la mise à niveau depuis Lime3DS, ce qui donne l'impression que des données telles que des sauvegardes ont pu être perdues. \n- Cette nouvelle invite permet aux utilisateurs de choisir entre continuer à utiliser leur nouveau répertoire utilisateur ou restaurer leur ancien.\n- La nécessité de resélectionner le répertoire utilisateur après la mise à niveau n'était pas intentionnelle et était le résultat d'un bug.\n- Nous nous excusons si vous avez été affecté par ce problème et que vous pensiez avoir perdu des données.\n \nToutes les versions : \n- Correction d'un problème où les systèmes 3DS coréens, chinois et taïwanais ne pouvaient pas démarrer une application utilisant la police système en raison du remplacement de police open source manquant (cela incluait l'outil de configuration du système). \n- Pour l'instant, la police EUR/USA/JPN sera utilisée, mais la plupart des glyphes seront remplacés par des points d'interrogation.\n- Cela permet de terminer le processus de configuration, même sans pouvoir lire le texte.\n- Une police avec les glyphes manquants pourra être ajoutée ultérieurement.\n- Correction d'un problème où les consoles dont les régions avaient été modifiées via un micrologiciel personnalisé ne pouvaient pas démarrer le processus de configuration du système via l'outil de configuration Azahar Artic.  \n \nDesktop : \n- Version SDL2 groupée mise à jour pour résoudre un problème où les contrôleurs Xbox devaient être réappairés à chaque fois qu'ils étaient éteints.  \n- L'application Azahar définit désormais explicitement sa propre icône de Windows  \n- Pour la plupart des plateformes, cela ne devrait rien changer, mais sous Linux, cela est connu pour résoudre certains problèmes d'icônes d'application.\n \nTechnique :\n- Correction de l'échec de compilation lors de la tentative de construction à l'aide de Qt 6.9.0 ou version ultérieure.  \n- Correction de l'échec de compilation lors de la tentative de création pour le bureau avec la prise en charge de Discord activée lors de l'utilisation de CMake 4.0 ou version ultérieure. \n- Les avertissements MSVC C4711 et C5045 ont été désactivés pour rendre les journaux de compilation moins désagréables à consulter. \n- Aucun de ces avertissements n’est important.\n- La version de NSIS que nous utilisons pour créer nos installateurs Windows est passée de 3.10 à 3.11.\n \n \n \nTéléchargement : Azahar 3DS 2120.3\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205466/in-3ds-mise-a-jour-importante-de-lemulateur-azahar-3ds-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205466/in-3ds-mise-a-jour-importante-de-lemulateur-azahar-3ds-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1205466/in-3ds-mise-a-jour-importante-de-lemulateur-azahar-3ds-3.jpg"
        }
    },
    "news_20": {
        "title": "[Switch 2] Sera-t-elle crackée plus rapidement que la Switch ?",
        "content": "Si nous revenons un peu en arrière la Switch de première génération a été rapidement hackée du fait de la présence de la puce nVidia qui a été utilisée. \n \nA l'origine la Switch de première génération était censé disposer de commandes au travers de l'USB, permettant ainsi une ouverture de la mémoire tampon, puis Fusée-Gelée a été découvert, il s'est avéré que cette commande tampon ne vérifiait pas la taille, et donc le hack de cette mémoire a pu être mis en place, puis l'utilisation de l'eMMC a pu être accessible, permettant de souder des puces directement dans les consoles, des opérations rendues plus difficile avec les modèles OLED et Lite. \n \nSur la Switch 2, il est certain que Nintendo va avoir appris de ces erreurs,  on se souviendra tous que la Switch a été hacké grâce à un trombone moins d'un an après sa sortie ! Notamment avec le mode RCM, un Tegra X1 peu sécurisé, et un exploit fail0verflow.\n \nLancée en Mars 2017, la Switch a été intégralement hackée en pas moins de 8 mois, et tout a été dévoilé en Avril 2018. \n \n \n\n \n\n \n\n \n \n \nSur la Switch 2, on imagine que Nintendo va apprendre, et masquera les connexions les plus courantes de DAT0, RST, CPU, CMD à CLK... pour perturber les fabricants de puces mod. Ils pourraient facilement cacher les lignes cmd, clk et dat0 dans une troisième couche d'une carte à 4 ou 5 couches. Ils pourraient laisser des traces juste en dessous, sur une autre couche. \n \nLa sortie de la MIG Switch les a effrayés et les a poussés à retarder la sortie de cette console pour des raisons de sécurité. Ils feront tout leur possible pour empêcher les puces de mods de fonctionner. \n \n \n\n \n \n \nDes rumeurs suggèrent également que des parties du bootroom ont été réécrites. On trouve des traces d'instructions de verrouillage. Ils utilisent également quatre BCT plus petits au lieu d'un seul comme sur la Switch.\n \nQue dire des exploits Nereba et Caffeine qui ont enchanté les pocesseurs de la première heure, du firmware 1.0.0 au 4.0.0, dès lors faut-il acheter ou précommander une Switch 2 dès maintenant pour bénéficier du firmware le plus bas, probablement, mais cela signifiera une console hors-ligne, et donc très partiellement utilisable. \n \n \n\n \n \n \nLe problème est toujours le même, comme Sony sur la PS5, Nintendo a besoin de menu debug, debug settings ou autre service de maintenance, mais il est vrai que le hack Nintendo se base davantage sur les bootrooms ou les procédures de démarrages. \n \nL'espoir réside dans le fait que Nintendo a du faire évoluer sa console que ce soit en terme d'ouverture, notamment avec l'arrivée du port USB, de caméra, et de toute la nouvelle architecture, qui en conséquence amèneraient de nouvelles possibilités. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-1.jpg"
        }
    }
}