{
    "news_1": {
        "title": "[Switch] FPSLocker v1.1.4 disponible",
        "content": "Le développeur Masagrator propose une nouvelle version de FPSLocker, sous ce nom se cache un programme qui va vous permettre de profiter de plus de 30 images par seconde dans les jeux qui sont verrouillés. \n \nSon application homebrew qui fonctionne comme une superposition pour la Nintendo Switch permet aux utilisateurs de définir des FPS personnalisés pour les jeux Switch. Pour fonctionner, cette application nécessite NX-FPS et SaltyNX, à noter que certains fichiers YAML utilisés par FPSLocker, et des correctifs spécifiques sont aussi disponibles dans un entrepôt de données qui se trouve ici. \n \n \n\n \n \n \nChangelog : \n \n- FPSLocker peut désormais afficher le nombre de framebuffers utilisés par NVN en les affichant dans les paramètres avancés.\n- “Buffered frame: 2” = Le jeu utilise un vrai double buffer. Comme ce numéro ne peut pas être modifié à la volée, il s'agit uniquement d'une mise à jour d'informations.\n \nTéléchargement : FPSLocker v1.1.4\n \n",
        "images": {}
    },
    "news_2": {
        "title": "[PS4] Hogwarts Legacy en cours de backport par Cyb1K",
        "content": "Il n'aura fallu que quelques heures à Cyb1K pour backporter Hogwarts Legacy sur PlayStation 4 et PlayStation 4 Pro. Le jeu est sorti officiellement ce matin à minuit, mais il n'a été accessible dans sa version physique qu'aujourd'hui. \n \nComme la plupart des backports il faut plusieurs versions avant que parfois Cyb1K ne trouve une version stable, ainsi pour Cyberpunk 2077 il avait créé plus d'une centaine de releases avant de parvenir à proposer la version compatible avec le firmware 5.05.\n \n \n\n \n \nDans ce premier backport, il n'est pas possible de changer la langue, ce n'est pas un problème lié à l'audio, mais un problème de librairie. Il est certain qu'il ne faudra que très peu de temps pour corriger le problème.\n \nMerci de ne diffuser aucun lien sous peine de retrait de votre commentaire, et d'un éventuel ban. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173271/in-ps4-hogwarts-legacy-deja-backporte-par-cyb1k-1.jpg"
        }
    },
    "news_3": {
        "title": "[Switch] Nx-ovlloader et Tesla-Menu ont été mis à jour",
        "content": "Le développeur WerWolv propose une mise à jour de Nx-ovlloader et Tesla-Menu, il avait déjà proposé le 16 Mars dernier une mise à jour afin de supporter le firmware 16.0.0, mais ces nouvelles versions viennent apporter un réel support des firmwares 16.0.0+ plus propres.\n \n \n\n \n \n \nNx-ovlloader comme vous le savez est un fork de nx-hbloader, il s'agit d'un processus hôte pour le chargement des OVL (NRO), en fait il s'agit du service de chargement de l'écosystème Tesla. Lorsqu'il est lancé, ce service essaie automatiquement de chainloader /switch/.overlays/ovlmenu.ovl, le menu Tesla. A partir de là, il chargera et basculera entre différents overlays sur demande.\n \nTesla-Menu quand à lui est un menu de superposition qui sera chargé par nx-ovlloader. Son but principal est de permettre à l'utilisateur de sélectionner d'autres overlays à charger. Le répertoire par défaut pour les overlays est /switch/.overlays où seuls les fichiers .ovl (les anciens fichiers .nro renommés en .ovl pour les différencier des homebrew normaux) sont chargés.\n \n \nTéléchargement : Nx-ovlloader 1.0.7 / Tesla-Menu 1.2.2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173262/in-switch-nx-ovlloader-et-tesla-menu-ont-ete-mis-a-jour-1.png"
        }
    },
    "news_4": {
        "title": "[Switch] emuiibo v1.0.0 disponible",
        "content": "Le développeur XorTroll est de retour sur la scène Nintendo Switch et propose une nouvelle version de son outil Emuiibo, cela n'avait pas été le cas depuis plus de 15 mois, donc les changements sont importants et nombreux.\n \nComme vous le savez, emuiibo est un module qui permet de profiter de l'émulation d'amiibo au moyen de fichiers \"Bin\" présent sur la carte SD, Emuiibo utilise ce format de stockage de données sur la carte microSD.\n \n \n\n \n \nChangelog\n \nL'étape majeure de cette mise à jour (parmi d'autres) est de finalement intercepter le service nfp:sys, AKA interceptant les paramètres du système/le support amiibo de l'applet - par conséquent, beaucoup de changements ici sont dus à cela.\n \nemuiibo n'est plus une pré-version\n \nNOTE : n'oubliez pas de mettre à jour la dernière version de nx-ovlloader/Tesla menu !\n \nLe format amiibo virtuel a subi quelques changements majeurs, le support des paramètres système étant nécessaire :\n \n- Les informations sur les zones sont désormais enregistrées dans <amiibo>/areas.json, qui contient des paires de valeurs access_id et program_id. La prise en charge des paramètres du système nécessite également de connaître l'ID du programme du titre qui utilise la zone, c'est pourquoi les informations relatives à la zone sont désormais sauvegardées ici.\n \n- Ce JSON contient également un champ current_area_access_id : l'option des paramètres du système pour supprimer les données de sauvegarde d'un amiibo est en conflit avec l'implémentation de la sauvegarde d'emuiibo (les amiibos réels ont une seule sauvegarde de jeu alors qu'emuiibo en permet plusieurs), donc ce champ contient la zone actuellement \"sélectionnée\", qui consiste en la zone que les paramètres du système vont voir et afficher des informations sur/supprimer.\n\n \nAfin de convertir les anciens formats à ces nouveaux changements, le fichier areas.json sera créé automatiquement, mais comme il n'y a aucun moyen pour emuiibo de dire l'ID du programme des zones amiibo ordinaires, il mettra un certain ID par défaut (pour être distingué du reste, j'ai opté pour celui de \"Retain Interactive Display Menu\", qui est un programme de débogage), et pour que l'ID correct soit mis sur l'info de la zone, l'utilisateur doit utiliser l'amiibo avec le jeu en question. Je sais que cela peut être un peu fastidieux, mais c'est la meilleure façon de procéder\n \n- Désormais, les amiibos virtuels dont le nom comporte plus de 10 caractères sont ignorés et considérés comme invalides. Pour des raisons techniques (et parce que Nintendo est trop incohérent avec ses formats), je pensais à l'origine que la limite était de 40 caractères, mais dans certains contextes (comme les paramètres système) où la limite de 10 caractères est imposée, les amiibos virtuels existants avec des noms plus longs ont tendance à provoquer des comportements bizarres/imprévus.\n \n- L'option de formatage des paramètres système supprimera toutes les zones d'amiibos virtuels (sans les désenregistrer comme pour les vrais amiibos, car les amiibos virtuels n'ont pas la notion d'être (dés)enregistrés).\n \n- L'option system-settings game-save-deleting supprimera la zone amiibo sélectionnée, qui peut être changée depuis l'overlay. Cette zone sélectionnée sera également celle que les réglages du système afficheront toujours.\n\n\n \n- L'option random-UUID a maintenant son propre champ dans le fichier amiibo.json (use_random_uuid), de sorte que les amiibos auront leur propre UUID qui ne sera pas effacé lorsque random-UUID sera activé (voir les changements liés à l'overlay).\n \n- Les anciens formats supportés dans les anciennes versions d'emuiibo (raw bin dumps et anciens amiibos virtuels) sont maintenant entièrement supportés ! La rétrocompatibilité a été réimplémentée afin que ces formats obsolètes soient automatiquement convertis au format moderne au démarrage (pour les bin dumps, le fichier binaire de dump est déplacé mais pas supprimé).\n \n- La cryptographie est maintenant supportée, de sorte que si /switch/key_retail.bin est présent, les sections cryptées des bin dumps seront accessibles par emuiibo, de sorte que les amiibos convertis qui en résultent contiendront toutes les données amiibo présentes (cela inclut les zones de données d'applications de jeu, AKA amiibo game save-data).\nemuiibo\n \n- Compilé avec les dernières bibliothèques\n \nTous les changements de format ci-dessus ont entraîné des changements de code pour les prendre en charge, bien sûr :\n \n- Le service emuiibo IPC (utilisé par la surcouche et d'autres homebrew pour contrôler emuiibo) a quelques nouvelles commandes reflétant les changements de format. Comme toujours, l'overlay est le meilleur exemple d'un homebrew utilisant ce service pour contrôler l'émulation amiibo.\n \n- Certains bugs internes de l'amiibo ID ont été corrigés (encore une fois, un grand coup de chapeau à Nintendo pour avoir été inutilement et lourdement incohérent avec leurs formats amiibo à travers les plateformes), ce qui aurait causé des problèmes avec certains jeux (comme Monster Hunter Rise, Splatoon, etc.).\n \nOverlay\n \n- Compilé avec la dernière version de libtesla/libnx\n \n- Un bug de nettoyage de l'interface utilisateur de libtesla a été corrigé, ce qui pouvait parfois causer des plantages.\n \n- L'interface utilisateur a été étendue (suite aux changements de format) pour afficher/changer la zone sélectionnée de l'amiibo virtuel actif, ainsi que pour changer l'option UUID aléatoire de l'amiibo.\n \n- Les entrées du répertoire amiibo/plain sont désormais classées par ordre alphabétique.\n \n- Si le titre est installé, son nom sera affiché ; sinon, l'ID du programme sera affiché.\n \n- La version d'emuiibo est maintenant vérifiée, de sorte qu'une superposition refusera de fonctionner avec des versions anciennes ou nouvelles d'emuiibo et ne fonctionnera qu'avec la même version.\n \n- Le support de la langue française a été ajouté\n \nemutool\n \n- La version du framework .NET a été abaissée à v4.5.2, dans l'espoir d'améliorer la compatibilité avec certains systèmes.\n \n- Les Amiibos dont le nom par défaut contient \"/\" sont remplacés par \"_\", et les caractères spéciaux sont également remplacés par leurs équivalents ASCII (comme E à partir de È) pour éviter les problèmes avec les chemins d'accès du système lors de la création d'amiibos virtuels.\n \n\n \nTéléchargement : emuiibo 1.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-761668142.png"
        }
    },
    "news_5": {
        "title": "[Switch] switch_AIO_LS_pack 4.11.2",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 4.11.2.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\nMise à jour de SimpleModManager, de TeslaMenu et de Ovlsysmodule vers la dernière version de ceux-ci, pour l'instant les anciens overlays de SimpleModManager sont conservé.\nMise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 4.11.0:\nAjout d'un choix permettant de supprimer les modules d'Atmosphere avant l'installation du pack, ceci supprimera tous les modules existants, pratique si vous venez d'un autre pack ou lors d'une mise à jour du firmware histoire de ne pas avoir une erreur au lancement d'Atmosphere à cause des modules se qui est plutôt fréquent.\nAjout d'un contrôle du téléchargement du pack et de l'application via un contrôle SHA256, ceci permet de s'assurer que le fichier téléchargé est bien celui attendu.\n\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\nN'hésitez pas à faire vos retours, ils seront les bienvenues.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-4.jpg"
        }
    },
    "news_6": {
        "title": "Nintendo engage des demandes de retraits de projets à Github, notamment pour l'outil Lockpick",
        "content": "A la veille de la sortie du très attendu (mais déjà disponible) The Legend of Zelda: Tears Of the Kingdom, Nintendo suscite encore le débat, en soumettant plusieurs demandes de retrait au titre du Digital Millennium Copyright Act (DMCA, protégeant les données numériques sous licence)  à la plateforme de développement GitHub. \n \nLockpick, un outil open source créé par le développeur shchmue permettant aux utilisateurs de la console Nintendo Switch de récupérer les clés de chiffrement de leur propre console, est notamment dans la ligne de mire de ces demandes de retrait. En effet, les clés récupérées par Lockpick sont nécessaires pour déchiffrer les fichiers système de la console et sont essentielles pour effectuer des tâches telles que la création de sauvegardes de jeux et l'installation de homebrews.\n \nL'outil Lockpick, et sa version en payload Lockpick-RCM, a été largement utilisé par la communauté homebrew de la Nintendo Switch depuis sa création en 2018, car il permet aux utilisateurs de contrôler leur propre matériel et d'effectuer des tâches qui ne sont pas prises en charge par la console de manière native. En outre, il convient de préciser que les clefs sont générées à partir de la carte mère de la console de l'utilisateurs, qui, de facto, est la propriété unique de celui-ci et ne revient plus à Nintendo. \n \n\n \nVoici un extrait du document relatant la demande effectuée par Nintendo of America Inc., dont certains éléments sensibles ont été retirés (coordonnées, méthodes de sécurité etc.) :\n \n \n\nÊtes-vous le titulaire des droits d'auteur ou autorisé à agir au nom du titulaire des droits d'auteur ?\n \nOui, je suis autorisé à agir au nom du titulaire des droits d'auteur.\n \nSoumettez-vous une notification DMCA révisée après que GitHub Trust & Safety vous a demandé de modifier votre notification originale ?\n \nNon.\n \nVotre réclamation concerne-t-elle du contenu sur GitHub ou npm.js ?\n \nGitHub.\n \nVeuillez décrire la nature de votre propriété intellectuelle ou de votre autorisation d'agir au nom du propriétaire.\n \nPour le propriétaire des droits d'auteur, Nintendo of America Inc.\n \nVeuillez fournir une description détaillée de l'œuvre protégée par le droit d'auteur originale qui aurait été violée. Si possible, incluez une URL où elle est publiée en ligne.\n \nLa console Nintendo Switch et les jeux vidéo contiennent plusieurs mesures techniques de protection (\"Mesures Techniques\") qui permettent à la console Nintendo Switch d'interagir uniquement avec des fichiers de jeux vidéo légitimes de Nintendo. Ce processus protège les jeux vidéo de Nintendo protégés par le droit d'auteur, y compris, mais sans s'y limiter, ceux couverts par les numéros d'enregistrement de copyright américain PA0002213509 (Super Mario Maker 2) ; PA0002233840 (Animal Crossing: New Horizons) ; PA0002213908 (Luigi's Mansion 3) ; et PA0002028142 (The Legend of Zelda: Breath of the Wild), en empêchant les utilisateurs de jouer à des copies piratées de jeux vidéo de Nintendo sur la console Nintendo Switch et en empêchant les utilisateurs de copier et de jouer à des jeux vidéo de Nintendo de manière illégale sur des appareils non autorisés.\n \nQuels fichiers doivent être retirés ? Veuillez fournir des URL pour chaque fichier ou, si le dépôt entier, l'URL du dépôt.\n \nhttps://github.com/shchmue/Lockpick_RCMhttps://github.com/shchmue/Lockpick\n \nRevendiquez-vous la mise en place de mesures techniques pour contrôler l'accès à votre contenu protégé par le droit d'auteur ? Veuillez consulter nos [documents] \"Plaintes concernant la technologie de contournement\" si vous n'êtes pas sûr.\n \nOui.\n \nQuelles sont les mesures techniques que vous avez mises en place et comment contrôlent-elles efficacement l'accès à votre contenu protégé par le droit d'auteur ?\n \n[Privé]\n \nComment le projet incriminé est-il conçu pour contourner vos mesures de protection technologique ?\n \nLe dépôt signalé offre et fournit un logiciel de contournement qui viole les droits de propriété intellectuelle de Nintendo. Plus précisément, le dépôt signalé fournit Lockpick aux utilisateurs. L'utilisation de Lockpick avec une console Nintendo Switch modifiée permet aux utilisateurs de contourner les mesures technologiques de Nintendo pour les jeux vidéo; en particulier, Lockpick contourne les TPM de la console pour permettre un accès non autorisé, l'extraction et le décryptage de toutes les clés cryptographiques, y compris les clés de produit, contenues dans la Nintendo Switch. Les clés décryptées facilitent la violation du droit d'auteur en permettant aux utilisateurs de jouer à des versions piratées de logiciels de jeux protégés par le droit d'auteur de Nintendo sur des systèmes sans TPM de console Nintendo ou sur des systèmes sur lesquels les TPM de console Nintendo ont été désactivés. Le trafic de logiciels de contournement, tels que Lockpick, viole la loi américaine sur le droit d'auteur du millénaire numérique (plus précisément, 17 U.S.C. §1201) et viole les droits d'auteur détenus par Nintendo.\n \nLe travail est-il sous licence open source ?\n \nNon.\n \nQuelle serait la meilleure solution pour l'infraction présumée ?\n \nLe contenu signalé doit être supprimé.\n \nAvez-vous les coordonnées de la personne présumée responsable de l'infraction ? Si oui, veuillez les fournir.\n \nNon, nous n'avons pas les coordonnées.\nJ'ai une bonne foi en croyant que l'utilisation des matériaux protégés par le droit d'auteur décrits ci-dessus sur les pages Web contrefaisantes n'est pas autorisée par le propriétaire du droit d'auteur, ou son agent, ou la loi.\nJ'ai pris en considération le fair use.\nJe jure, sous peine de parjure, que les informations de cette notification sont exactes et que je suis le propriétaire du droit d'auteur ou que je suis autorisé à agir au nom du propriétaire d'un droit exclusif qui est présumé avoir été enfreint.\nJ'ai lu et compris le Guide de soumission d'un avis de retrait DMCA de GitHub.\n \n\n \n \nL'extrait complet est disponible sur le compte Twitter de Simon Aarons.\n \n\n\n\n\n\n\nDans l'univers des smartphones comme dans celui des consoles de jeux, les projets de hackers se multiplient tels des hydres, une tête coupée en engendrant dix autres. Il est donc peu probable que l'outil Lockpick disparaisse dans les limbes, mais il est regrettable de voir que schmue, défenseur du logiciel libre et contributeur majeur à la scène Switch, se retrouve aujourd'hui dans une situation inconfortable. Cette affaire mérite d'être suivie de près... \n \n\n\n\n\n\n \n\n\n\n\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173239/in-nintendo-engage-des-demandes-de-retraits-de-projets-a-github-notamment-pour-loutil-lockpick-1.jpeg"
        }
    },
    "news_7": {
        "title": "[Switch] Les vendeurs chinois vendent des HWfly équipées de RP2040",
        "content": "Certains vendeurs chinois font preuve d'originalité, voilà qu'après les clones, nous retrouvons désormais plusieurs vendeurs qui ont répertoriés des puces HWfly alimentées par des RP2040. \n \n \n\n \n \nCes nouvelles puces sont vendues une dizaine d'euros, ce qui reste accessible, bien plus qu'une HWfly, et elles sont compatibles avec les Switch Erista et Mariko, Lite et OLED. Elles sont livrées avec le câble flex pour souder le Soc Tegra de la console comme cela est possible avec l'ancien câble flex de la HWfly. \n \n \n\n \n \nDu reste, cela est intéressant de pouvoir tester ces nouvelles puces, pour voir si elles peuvent être une nouvelle alternative, entre les RP2040 un peu trop nus, et les HWfly un peu trop chères. \n \n \n\n \n \n \nIl semblerait que Nintendo lâche un peu du leste aux revendeurs chinois avec moins de suivis judiciaires. \n \nEdit 05.05.2023\n \nMerci de ne pas mettre de lien en commentaire sous peine de ban par un modérateur, merci de ne pas renvoyer vers des techniciens non plus. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173154/in-switch-les-vendeurs-chinois-vendent-des-hwfly-equipes-de-rp2040-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173154/in-switch-les-vendeurs-chinois-vendent-des-hwfly-equipes-de-rp2040-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1173154/in-switch-les-vendeurs-chinois-vendent-des-hwfly-equipes-de-rp2040-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS4] PlayStation Network Checker 1.0 disponible",
        "content": "Le développeur Amethxst propose depuis quelques minutes Psnchecker, et très clairement la nouveauté est là.\n \nPlayStation Network Checker, aussi appelé PSN CHECKER, est utile si vous utilisez les sauvegardes JB de la PS4 (Apollo Save de Damian Parrino). \n \nLa première version était un peu basique, voici donc ce que le développeur a ajouté :\n \n- Prise en charge de macOS\n- 4 langues (italien, anglais, français et espagnol)*.\n- Système d'authentification amélioré\n- Nouvelle reconnaissance de l'identité en ligne (écrire l'ancienne identité -> imprimer la nouvelle)\n- Impression : ID de compte & HEX & Endian (pour les utilisateurs JB)\n \n*(lmk si certaines traductions doivent être corrigées)\n \n \n \n\n \n \n \nFuturs ajouts :\n- imprimer l'avatar (img, pas lien)\n- imprimer la section \"à propos de moi\" complète\n- afficher le statut de tous les trophées\n- imprimer le statut du compte (en ligne/hors ligne etc..)\n- peut-être une interface graphique avec/tkinter ou quelque chose de décent \n \nLe remerciement qu'Amethxst souhaite faire est à \"isFakeAccount\" sur github.\n \nComment s'authentifier :\n \n- Connectez-vous au site web de PlayStation\n- Allez sur ce lien et copiez le code entre les \" \".\n- Lancez le programme et suivez les instructions\n \n \nTéléchargement : PlayStation Network Checker 1.0\n \n",
        "images": {}
    },
    "news_9": {
        "title": "[Switch] AIO-Switch updater v2.21.4 disponible",
        "content": "Le développeur français HamletDuFromage propose une mise à jour de son outil Aio Switch Updater. Pour rappel, cet outil permet de profiter d'options très utiles comme mettre des DNS Lan Play, de mettre à jour Atmosphere ou les sigpatches, ou encore de gérer des cheats codes (via CheatSlips.com).\n \nLa dernière mise à jour remonte à Décembre dernier, soit il y a quasiment 6 mois, cette nouvelle version améliore la localisation et apporte quelques corrections pour Hekate. \n \n \n\n \n \nChangelog :\n \n- Amélioration de la localisation et des corrections \n- Correction de l'invite demandant de copier la charge utile hekate dans reboot_payload.bin qui ne s'affiche pas.\n- Amélioration de la localisation en allemand (github.com/TTghostsemir).\n- Amélioration de la localisation en japonais (github.com/reindex-ot).\n \n \nTéléchargement : AIO-Switch updater 2.21.4\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173141/in-switch-aio-switch-updater-v2214-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[XBS/XBX/XBO] Le circuit intégré ESD Booster U21 pour Xbox One X, Xbox Series X et S",
        "content": "De nombreux circuits intégrés sont proposés par quelques sites internet, et l'un d'entre eux peut être une solution à de nombreux problèmes rencontrés par des utilisateurs de Xbox One X, Xbox Series S et Xbox Series X. \n \n \n\n \n \nLe circuit intégré ESB Booster U21 est un circuit très fragile, sur les consoles Xbox One X, Xbox Series X & Series S, ce circuit est connu pour être défaillant lorsque le port HDMI est endommagé ou qu'il y a un pic d'alimentation. Ce circuit d'origine est un petit circuit BGA en verre de 3x3mm qui est très fragile et sensible à la chaleur et aux mouvements.\n \n \n\n \n\n \n\n \n \nAinsi le site Ubermicro.co.uk propose une solution de remplacement de ce circuit intégré par un circuit beaucoup plus robuste, et facile à installer. Il faut cependant avoir à l'esprit que bien qu'il s'agisse d'un circuit de remplacement, certaines caractéristiques techniques peuvent manquer ou ne pas fonctionner.\n \nJusqu'à présent :\n4kUHD @ 60hz = Fonctionne (120hz TBC)\n1440p @ 60 / 120hz = Fonctionne\n1080p @ 60 / 120hz = Fonctionne\n720p @ 60hz = Fonctionne\nCEC (mise sous/hors tension/sélection d'entrée) = Fonctionne\n \nVoici quelques caractéristiques : \n- HDMI 1.4, 2.0 & 2.1\n- Protection ESD par contact de 8 kV\n- Protection du lien DC (I2C), circuit de conditionnement du signal bidirectionnel et pull-up dynamique\n- Protection du bus CEC\n- HPD pulls down, conditionnement du signal avec décalage de niveau et protection contre le backdrive\n- Protection contre les courts-circuits sur la sortie 5V\n- Réveil à partir de l'état de veille via le bus CEC\n- Support de câble long et/ou de mauvaise qualité avec pull-up dynamique sur le bus DDC\n- A noter que le retrait de l'ancien circuit imprimé BGA en verre U21 est nécessaire avant l'installation. \n- Permet de tester les ports HDMI / diodes TVS HDMI et les drivers HDMI\n \n \n\n \n \n \nCette solution constitue également un excellent outil de diagnostic. Si vous avez l'habitude de reconstruire des pads pour des HDMI abimés, des ports USB-C, avec \"seulement\" 14 fils de liaison à passer, une fois installé, les tests peuvent être lancés en moins de 45 minutes (si vous prenez votre temps).\n \n \nLien source : xbox-esd-hdmi-booster-u21-alternative-for-series-x-series-s-and-one-x\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-782596504.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173092/in-xbsxbxxbo-le-circuit-integre-esd-booster-u21-pour-xbox-one-x-xbox-series-x-et-s-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1173092/in-xbsxbxxbo-le-circuit-integre-esd-booster-u21-pour-xbox-one-x-xbox-series-x-et-s-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1173092/in-xbsxbxxbo-le-circuit-integre-esd-booster-u21-pour-xbox-one-x-xbox-series-x-et-s-3.png"
        }
    },
    "news_11": {
        "title": "[Switch] Une carte d'extension Picofly RP2040-Zero pour faciliter son installation",
        "content": "Le développeur Helder Silva, connu sous le pseudo AngryHelder, propose de découvrir la v1.0 de sa carte d'extension PicoFly destiné à réaliser une installation plus facile et plus propre d'un RP2040-Zero. \n \n \n\n \n\n \n \nUne carte d'extension pour quoi faire ?\n \nCette carte d'extension est une bonne idée, elle intègre par exemple directement les 3 petites résistances pour le DAT0, le CMD et le CLK qui sont nécessaires pour glitcher et dumper/flasher la Nand de la console. Les pads sont aussi beaucoup plus larges que ceux présent sur le RP2040-Zero, et ils sont directement identifiés sur la carte d'extension. \n \n \n\n \n \nTout cela permet de faciliter l'installation, à 3 $ l'unité, ou bien à 2.4 $ par 5 ou 10 unités, ça vaut peut être le coup pour se faciliter le boulot. Pour le RP2040-Zero, il est peut être plus intéressant de passer en direct sur un site spécialisé comme Aliexpress pour limiter l'intermédiaire. Il faut garder à l'esprit que cette carte d'extension n'est en rien obligatoire, surtout si vous êtes à l'aise sur la soudure. \n \nTout est là : heldergametech.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173083/in-switch-une-carte-dextension-picofly-rp2040-zero-pour-faciliter-son-installation-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1173083/in-switch-une-carte-dextension-picofly-rp2040-zero-pour-faciliter-son-installation-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1173083/in-switch-une-carte-dextension-picofly-rp2040-zero-pour-faciliter-son-installation-3.jpg"
        }
    },
    "news_12": {
        "title": "[Vita] Hyperfight Vita v1.0 disponible",
        "content": "Le développeur Anas Halideen propose un nouvel homebrew pour la PlayStation Vita qui continue de vivre son petit bonhomme de chemin, il s'agit d'un portage d'Hyperfight un jeu de combat où chaque coup est mortel et où chaque victoire compte. Vous devrez risquer vos points pour accéder aux coups spéciaux et super coups de votre personnage, qui peuvent faire basculer la partie en un clin d'oeil. Conçu pour être facile à prendre en main et difficile à maîtriser, Hyperfight saura vous mettre au défi. \n \nVous l'aurez compris, il s'agit d'un jeu de combat à un coup en 2D.\n \n \n\n \n\n \n\n \n\n \n \nChangelog (v.1.0) :\n \n- Première version.\n- Basé sur Godot Engine\n- Portage basé sur la version 3.1.1\n \nA noter que certaines polices ne sont pas intégrés, il faudra les télécharger et les installer manuellement dans le répertoire /resources/font/\n \nCommandes :\n \nDéplacer à gauche/droite : Joystick gauche (gauche/droite)\nSauter : Joystick gauche (haut)\nCourse au sol : (si vous n'êtes pas déjà en train de courir) : Joystick gauche/Dpad (double tap à gauche ou à droite)\nCourse aérienne : (si vous n'êtes pas déjà en train de courir) : Joystick gauche/Dpad (double tap à gauche ou à droite en l'air)\nAttaque normale/Sélection de menu : Croix (PS)\nAttaque spéciale : Cercle (PS)\nSuper attaque : Carré (PS)\nDémarrage : Start\n \n \nNotes :\n \nIl faudra un peu de temps pour que l'écran démarre, mais une fois qu'il démarre, le jeu devrait fonctionner parfaitement.\n \nL'option locale 2 joueurs ne fonctionnera évidemment pas (car il faudrait fonctionner Godot Vita avec le jeu ad-hoc sur vita, pour l'heure c'est difficile à réaliser).\n \nMerci à SonicMastr pour avoir créé la compatibilité de Godot 3.5 avec la PS Vita.\n \n \nTéléchargement : Hyperfight Vita v1.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173079/in-vita-hyperfight-vita-v10-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173079/in-vita-hyperfight-vita-v10-disponible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1173079/in-vita-hyperfight-vita-v10-disponible-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1173079/in-vita-hyperfight-vita-v10-disponible-4.png"
        }
    },
    "news_13": {
        "title": "[Switch] The Legend of Zelda: Tears of the Kingdom a été leaké",
        "content": "Cela a commencé par quelques screens dévoilés, puis des vidéos qui ont dévoilés pas mal de contenus, et donc qui ont spoilé pas mals de futurs acheteurs, et désormais nous pouvons l'affirmer,  The Legend of Zelda: Tears of the Kingdom a été leaké.\n \nThe Legend of Zelda: Tears of the Kingdom (aussi appelé Totk) est très attendu, pas moins de 6 années séparent son précédesseur Breath of the Wild.\n \nUn temps il s'agissait d'un fake, avec la disponibilité d'un NSP, mais le XCI lui est bel et bien le leak du titre. De nombreuses personnes se sont empressées de le tester sur Ryujinx et Yuzu, et il fonctionne plutôt correctement. Il y a toujours de baisses de framerates à certains endroits chargés, tout comme dans Breath of the Wild.\n \n \n\n \n \n \nMerci de ne donner aucun lien en commentaire, nous ne sommes là que pour en parler pas pour diffuser, ce qui est différent. \n \nLes vidéos se multiplient sur les réseaux sociaux, cela va être difficile d'éviter les spoils pour ceux qui l'ont précommandé.\n \n \n \n\n \n \n \nLe NSP de The Legend of Zelda: Tears of the Kingdom pèse un peu plus de 16 Go, il fonctionne à partir du firmware 15.0.0. \n \n \n\n \n \nA noter que Shigeru Miyamoto a laissé pensé qu'une adaptation de The Legend of Zelda serait possible au cinéma suite au succès planétaire de Super Mario Bros, le film, produit par le studio Illumination. Là aussi, une version pirate du film circule et elle a déjà été vue par 10 millions de personnes. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173047/in-switch-the-legend-of-zelda-tears-of-the-kingdom-a-ete-leake-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1173047/in-switch-the-legend-of-zelda-tears-of-the-kingdom-a-ete-leake-2.jpg"
        }
    },
    "news_14": {
        "title": "[XBX/XBS/XBO] La nouvelle interface utilisateur Xbox arrive",
        "content": "Un peu de vert dans le champs de blé, Microsoft va très bientôt inaugurer sa nouvelle interface pour ses Xbox Series S et X, mais aussi pour la Xbox One.\n \nElle se voudra beaucoup plus sobre afin d'améliorer la lisibilité, pour l'heure, elle n'est accessible qu'à certains membres insiders, elle sera sans doute déployée auprès de tous d'ici l'été. Cette nouvelle interface simplifiera la navigation, on y trouvera plus de place pour le background, qui pourra être dynamique en fonction du jeu sélectionné. \n \n \n\n \nLa nouvelle interface\n \n \n \n\n \nL'ancienne interface (l'actuelle)\n \n \nCette nouvelle version de Home : \n \n- Fournit une navigation facile vers votre bibliothèque, le Microsoft Store, le Xbox Game Pass, la recherche et les paramètres tout en haut de votre Accueil en introduisant un nouveau menu d'accès rapide.\n- Simplifie la mise en page et vous donne plus d'espace pour voir votre arrière-plan en réduisant la taille de certaines tuiles et en les déplaçant vers le bas de l'écran.\n- Ajoute une fonctionnalité d'art de jeu réactif pour mettre à jour l'arrière-plan par défaut et montrer le magnifique art associé à chaque titre lorsque vous survolez les tuiles.\n \nTout est là : news.xbox.com\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1108708967.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1581543737.jpg"
        }
    },
    "news_15": {
        "title": "[PS4] BwE PS4 NOR Validator 2.2.0 disponible",
        "content": "Le développeur en charge de BwE PS4 Nor Validator propose une nouvelle de son logiciel et nous fait à cette occasion un petit historique.\n \nBwE PS4 NOR Validator c'est pas moins de 2500 dumps validés par mois, mais pas que ça ! \n \n \n\n \n \nBwE PS4 NOR Validator :\n \n- 24 835 lignes de code\n- 929 KB de code\n- 3230 offsets lus\n- 3301 résultats/sorties possibles\n- Presque 5 ans de développement \n- Ecrit en Perl, par moi, en utilisant Notepad++\n \n \nChangelog : \n \n2.2.0 (1/5/23) Correcticon du versionnage, correction de la licence USB, autres petits changements\n2.1.9 (30/4/23) Ajout de la prise en charge de la licence USB, corrections de bogues, correction de l'erreur SB Patch, meilleure gestion du journal UART, ajout de validations non listées/nouvelles, amélioration de la validation UNK (détection de la corruption de bloc)\n2.1.8 (28/3/23) Corrections de bugs, mises à jour des processus de validation, meilleure prise en charge de Windows 11\n \n \nTéléchargement : BwE PS4 NOR Validator 2.2.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173024/in-ps4-bwe-ps4-nor-validator-220-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[PSP] Apollo Save Tool v1.0.0 disponible pour la PSP",
        "content": "Le développeur Bucanero a travaillé sur la version PSP de son outil Apollo Save Tool et offre désormais la version 1.0 de son logiciel pour la PSP. Le logiciel évolue une nouvelle fois avec désormais l'ajout d'un editeur hexadécimal et d'un serveur web pour éditer et sauvegarder les sauvegardes. Pour rappel, il s'agit d'une application qui vous permet de gérer les fichiers de sauvegarde de jeu sur PlayStation Vita et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur la PSP.\n \n \n\n \n \nChangelog : \n \n- Ajout d'un éditeur hexadécimal pour les fichiers de sauvegarde\n- Amélioration du serveur Web de sauvegarde (gestion des sauvegardes en masse)\n- Sauvegarde et téléchargement des sauvegardes au format .Zip\n \nOutils réseau\n- Serveur Web local simple (accès complet à la clé USB de la console)\n- Nouveaux codes de triche PSP et Prise en charge de la somme de contrôle personnalisée pour BlazBlue : Continuum Shift II\n \n \nTéléchargement : Apollo Save Tool 1.0.0 (PSP)\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173023/in-psp-apollo-save-tool-v100-disponible-pour-la-psp-1.png"
        }
    },
    "news_17": {
        "title": "[PSP] PPSSPP 1.15.2 disponible",
        "content": "Voilà 5 mois que nous n'avions pas eu la joie de voir débarquer de la nouveauté du côté de l'émulateur PPSSPP, et bien voilà la version 1.15 qui est arrivée hier sur les serveurs de l'équipe en charge de son développement. \n \n \n\n \n \nHenrik Rydgård, fondateur du PPSSPP vient de l'annoncer, cette version sera déployée sur GooglePlay dans quelques jours, sachant qu'il y a désormais une version Mac. \n \n \n \n\n \n \n \nNouveautés de la version 1.15 :  \n \n- Le ralentissement causé par la compilation des shaders a été réduit de façon drastique ([#16873])\n- Parallélisation : ([#16802], [#16804], [#16809], [#16812])\n- Réduction des variantes de shaders : ([#16773], [#16778], [#16770], [#16763])\n \nPerformances de rendu et corrections :\n \n- Mise à l'échelle des nombres entiers ajoutée ([#17224])\n- Corrections du post-traitement ([#17262])\n- Suppression du problème de superposition SOCOM, correction de la vision nocturne ([#17297], [#17317])\n- Corrections de la compatibilité PowerVR ([#17232])\n- Correction de CLUT ([#17212])\n- ToP - Narikiri Dungeon X : évitement du readback GPU ([#17181], [#17191], [#17192])\n- DTM / Toca : Éviter la lecture par le GPU ([#16715])\n- Correction de la régression des performances de Dante's Inferno ([#17032], [#17035])\n- Correction d'une mauvaise sélection d'appareil sur les téléphones Poco C40, causant une interface utilisateur cassée ([#17027], [#17022])\n- Correction des performances du GPU de Rainbow Six ([#16971])\n- Correction des sous-titres dans Le Parrain ([#17298], [#17314])\n \nAmélioration du remplacement des textures :\n \n- Moins d'E/S sur le thread principal, conduisant à des taux d'images plus fluides ([#17078], [#17091], [#17120], [#17134])\n- Prise en charge des fichiers KTX2 avec des textures compressées UASTC ajoutée ([#17111][#17104])\n- Ajout du support des fichiers DDS avec les textures BC1-7 ([#17083], [#17103], [#17097], [#17096], [#17095])\n- Amélioration de l'ini par défaut ([#17146])\n- Les Mipmaps sont maintenant toujours utilisées si elles sont fournies ([#17144])\n- Optimisations supplémentaires ([#17139], [#17088])\n \nOptimisations :\n \n- Corrections et performances du moteur de rendu logiciel ([#17295], [#17214], [#17028], [#16753], [#16706], [#16690])\n- Optimisations du téléchargement de textures Vulkan ([#17052], [#17122], [#17121], [#17114], [#17011])\n- Ajout de la lecture en profondeur, corrigeant les éclats de lentilles dans Syphon Filter (au prix de performances..) ([#16907], [#16905])\n- Async readback supporté dans Vulkan - actuellement seulement activé dans Dangan Ronpa ([#16910], [#16916])\n- Optimisations du shader d'éclairage ([#16791], [#16787])\n \nContrôles :\n \n- Le contrôle de l'inclinaison sur Android a été revu et corrigé ([#16889], [#16896])\n- Vous pouvez désormais associer des combinaisons de boutons à des fonctions uniques ([#17210], [#17215], [#17228], etc)\n- Les boutons personnalisés prennent désormais en charge les entrées analogiques ([#16855])\n \nFonctionnalités VR :\n \n- Caméra de haut en bas : ([#17098])\n- Contrôle de la rotation de la tête : ([#16857])\n- Plus de support stéréo : ([#16952], [#16953])\n- Autres : ([#16826], [#16821])\n \nAutres :  \n \n- Prise en charge du dark mode de Windows ([#16704])\n- Corrections de la compatibilité des shaders GLSL ([#16710], [#16709])\n- Correction du problème mathématique de GTA sur macOS/iOS, jouable à nouveau ([#16928])\n- Une émulation VFPU plus précise a été ajoutée, bien qu'elle ne soit pas encore entièrement activée ([#16984])\n- Fonctionnalités et corrections du débogueur ([#17270], [#17269], [#17263], [#17260], [#17203], [#17190], [#17042], [#16994], [#16988], [#16818] etc)\n- Le rembobinage des sauvegardes ne ralentit plus beaucoup les choses ([#17291])\n- Correction des bugs de la fenêtre de chat ([#17241])\n- Corrections IR Jit - aide iOS quand le jit natif n'est pas disponible ([#17129])\n- Corrections du rendu lié à la profondeur ([#17055], [#16880])\n- Plus de travail sur le support RISCV ([#16976], [#16957], [#16962], [#16832], [#16829])\n- Barre de menu native pour macOS ([#16922])\n- Corrections de polices ([#16859])\n- Correction du problème audio de Rockman 2 ([#16810], [#16798])\n- Corrections de l'interface utilisateur : Utilisation verticale de l'espace ([#16795]), barres de défilement ([#16785]), défilement au pavé tactile sous Windows ([#16699])\n \n \nTéléchargement : PPSSPP 1.15\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173022/in-psp-ppsspp-115-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[PS4/PS5/Switch] DS4Windows 3.2.10 disponible",
        "content": "Le développeur Travis Nickles connu sous le pseudonyme de Ryochan propose une nouvelle version de DS4Windows qui est livré désormais en v3.2.10. Comme vous le savez DS4Windows est une interface efficace pour paramétrer une manette sur PC, il est basé sur un fork de Jays2Kings. Pour en profiter cela passe par un câble micro-USB, mais il est aussi possible de s'en servir sans fils avec quelques adaptateurs Bluetooth 2.1 (ou supérieur). \n \n \n \n\n \n \n \nChangelog : \n \n- Ajout d'une routine de compensation de l'instabilité pour la souris gyroscopique\n- Déplacement des appels d'initialisation et de déconnexion du gestionnaire de sortie vers les routines de démarrage et d'arrêt de ControlService\n- Modification des routines de suspension et de reprise\n- Ajout d'une gestion d'exception supplémentaire en cas d'échec de la notification de la barre d'état.\n- Utilisation de DetermineConnectionType dans PostInit de DS3Device. Contribution de SunnyQeen\n- Correction d'un crash lors de l'ouverture des options du périphérique avec l'option null. Contribution de SunnyQeen\n- Ajout de l'option InterpretingOscMonitoring. Contribution de xAdler\n- Ajout de quelques chaînes de traduction OSC. Contribution de xAdler\n- Ajout de l'interprétation du message de surveillance OSC. Contribution de xAdler\n- Ajout du contrôle des déclencheurs OSC. Contribution de xAdler\n- Ajout de vérifications supplémentaires dans la routine ProfileDTO MapFrom.\n- Modification de la façon dont les macros sont sauvegardées à partir de la fenêtre de liaison. Ne pas réinitialiser le déclencheur shift\n- Prise en charge du Horipad 4 FPS. Contribution de markguleno\n- Correction du mode custom led. Contribution de MatrixDJ96\n \n \nTéléchargement : DS4Windows 3.2.10\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173019/in-ps4ps5switch-ds4windows-3210-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[Switch] SimpleModManager 2.1.0 disponible",
        "content": "Le développeur Nadrino vient de mettre en ligne une toute nouvelle version de SimpleModManager qui est désormais proposé en version 2.1.0. \n \nSimpleModManager est une application homebrew qui va vous permettre de gérer des mods, via LayeredFS, dans Atmosphère. SimpleModManager facilite la gestion des mods à partir de LayeredFS en redirigeant l'accès des fichiers romfs de la carte SD. Lorsque l'application accède à un fichier romfs, elle vérifie l'existence de ce même fichier dans la carte SD. Si le fichier sur la carte SD existe, l'accès au fichier romfs sera redirigé vers celui-ci.\n \n \n\n \n\n \n\n \n\n \n\n \n\n \n \n \nChangelog :\n \n- Refonte du moteur de base et du code de nettoyage. Devrait être beaucoup plus stable. Pour cette version, le développeur a abandonné le module de superposition car il plante instantanément même avec l'inclusion la plus simple.\n \n- La version console est maintenant expédiée à part car les codes d'échappement (couleurs par exemple) ne s'affichent pas correctement lorsqu'ils sont compilés avec borealis.\n \n \nTéléchargement : SimpleModManager 2.1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173009/in-switch-simplemodmanager-210-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1173009/in-switch-simplemodmanager-210-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1173009/in-switch-simplemodmanager-210-disponible-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1173009/in-switch-simplemodmanager-210-disponible-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1173009/in-switch-simplemodmanager-210-disponible-5.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1173009/in-switch-simplemodmanager-210-disponible-6.jpg"
        }
    },
    "news_20": {
        "title": "[Multi] EasyRPG Player 0.8 disponible",
        "content": "EasyRPG Player est de retour et maintient presque toutes les fonctionnalités de la conception originale RPG Maker 2000 et RPG Maker 2003.\n \nComme toutes les plates-formes sont concernées, notamment PC et Linux, il est bon de rappeler que pour nos consoles ce programme concerne les Nintendo Switch, la Nintendo 3DS et ses dérivées, la Nintendo Wii, et la PlayStation Vita.\n \n \n\n \n \nCette nouvelle version 0.8 affublée du nom de code \"Paralyze\" arrive 18 mois sans nouvelle version, mais le projet n'est pas mort ! A l'origine une nouvelle version intermédiaire était prévue début 2022, mais l'équipe était épuisée. Cependant, cette nouvelle version compensera cette longue attente.\n \nCette version marque un changement dans l'équipe de développement : Après 12 ans, l'un de nos développeurs principaux (Ghabry) va faire une pause dans le développement d'EasyRPG Player pour se concentrer sur l'EasyRPG Editor (enfin !) et d'autres projets annexes non liés à EasyRPG. \n \nComme il est l'un des contributeurs les plus actifs le développement du Player va ralentir encore plus. Ne vous attendez pas à des mises à jour gigantesques dans les années à venir. EasyRPG Player est un projet open source, cette nouvelle version corrige de nombreux bugs. \n \nUn nouveau logo a été introduit, des paramètres vidéos plus importants, des modifications d'audio encore plus poussées, et de nombreuses maintenances pour chaque plate-forme spécifique. \n \nSur 3DS, le système audio a été réécrit de fond en comble pour corriger de nombreux glitchs. En outre, l'écran inférieur affiche désormais l'état actuel de la batterie.\n \nSur la Switch, le docking/déstockage de la console et l'appel du menu HOME sont désormais correctement gérés.\n \nSur la Wii, le chargement des sauvegardes a été corrigé.\n \nBref, vous l'aurez compris, cette version sera probablement l'une des dernières avant un bon moment !\n \n \nTéléchargement : EasyRPG Player 0.8\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173008/in-multi-easyrpg-player-08-disponible-1.png"
        }
    }
}