{
    "news_1": {
        "title": "[3DS/2DS] Red Viper v0.9.8 disponible",
        "content": "Le développeur skyfloogle de Red Viper, un émulateur dédié à la console Virtual Boy de Nintendo, a annoncé une série d'améliorations et de corrections de bugs dans sa dernière version 0.9.8. Selon lui, ces mises à jour font de Red Viper l'émulateur Virtual Boy le plus précis à ce jour.\n \n \n\n \n \n \nVoici les principales améliorations apportées :\n \n- Amélioration de l'émulation des timers : Cette correction permet de résoudre les problèmes de lecture des échantillons sonores dans les jeux Galactic Pinball et Teleroboxer.\n \n- Ajout de l'émulation du temps d'accès à la mémoire : Cette nouveauté corrige de nombreux jeux, notamment :\n \n- La lecture des échantillons dans Virtual Bowling et Niko-Chan Battle, en plus d'améliorer l'émulation des timers.\n \n- Une meilleure performance d'émulation dans 3D Tetris.\n \n- Une vitesse de jeu correctement émulée dans Golf.\n \n- La résolution d'un problème où l'intro de Blox 2 se coupait prématurément.\n \n- Correction des bugs graphiques et de l'intro sonore : Les problèmes visuels et le son de l'intro dans Waterworld ont été résolus.\n \n- Amélioration de l'émulation audio : Ces corrections permettent de mieux prendre en charge certains homebrews, notamment les jeux Blox et la démo Formula V.\n \n- Compatibilité avec les sauvegardes des anciennes versions : Il est désormais possible de charger des sauvegardes provenant de versions antérieures de l'émulateur.\n \nAvec ces avancées de développement et d'améliorations, Red Viper se positionne comme la référence pour les fans de la console Virtual Boy sur 2DS et 3DS, offrant une expérience de jeu plus fidèle et plus stable. Red Viper est l'une des meilleures solutions de restitution actuelle, devançant même celle de RetroArch en s'appuyant sur les capacités 3D de la 3DS. \n \n \nTéléchargement : Red Viper v0.9.8\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204303/in-3ds2ds-red-viper-v098-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[XB360] Le payload FreeMyXe après l'exploit Bad Update",
        "content": "L'exploit Bad Update vient de donner naissance à un payload nommé FreeMyXe, développé par InvoxiPlaysGames et emma, ce payload permet d'ajouter certaines fonctionnalités avancées à l'hyperviseur et au kernel de la console XBox 360, lui permettant ainsi d'exécuter du code non signé.\n \n \n\n \n \nFreeMyXe améliore l'exploit Bad Update en vous facilitant :\n \n- Le déblocage de certaines fonctions telles que la suppression de certaines vérifications (par exemple XEX ou encore la signature en direct). \n- Le retrait de la clé du processeur de la console.\n- Le dump de la mémoire Nand de votre Xbox360, très utile pour la sauvegarde et la restauration.\n- L'utilisation des émulateurs, des jeux et des dashboards alternatifs comme Aurora, XEX Menu, ou encore Simple 360 Nand Flasher. \n \nTemporairement la console permet donc d'exécuter pas mal de chose, comme la possibilité de lancer du code non signé, mais la grosse limite réside dans le fait que tout disparaisse une fois la console éteinte, et surtout qu'il faut le jeu \"Tony Hawk's American Wasteland\" d'installé sur le disque dur interne de la console. \n \n \nTout est là : FreeMyXe\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204294/in-xb360-le-payload-freemyxe-apres-lexploit-bad-update-1.png"
        }
    },
    "news_3": {
        "title": "[PS3] PS3HEN 3.4.0, HFW 4.92, Dualboot 4.92 Littlebalup",
        "content": " \nLa scène PS3 est en effervescence, voilà qu'elle a largement bougé depuis la sortie du firmware officiel 4.92. Voilà que débarque PS3HEN 3.4.0 sur PSX-Place.com . \n \n \n \n\n \n \n \nNotes de version v3.4.0\n \nModifications globales de HEN :\nAjout de la prise en charge du firmware 4.92 CEX (HFW) (merci @Joonie )\n \nModifications du plugin HEN :\nAjout de la fonctionnalité de restauration HEN pour le nouveau package qui prend en charge la survie de HEN après un reformatage du disque dur (merci @LuanTeles )\nAjout de la fonction create_default_dirs pour créer des dossiers standards s'ils manquent sur dev_hdd0 (merci @LuanTeles )\nAjout de la fonction DLOG pour la sortie vers usb000 (développeurs uniquement)\nAjout du nettoyage des fichiers PSN (merci @LuanTeles )\nFonction clear_web_cache_check nettoyée (navigateur et fichiers PSN)\nFonctions mises à jour pour les préréglages LED\nFonction set_build_type mise à jour pour vérifier les ports USB 000 - 007 (pour le mode développeur)\nProgramme d'installation d'urgence mis à jour pour vérifier les ports USB 000 - 007 (HEN_UPD.pkg depuis USB)\n \nModifications du payload :\nLes fichiers du plug-in de démarrage sont désormais renommés temporairement, au lieu de les supprimer si WMM est détecté lors de l'installation\nMise à jour des décalages cellFsMkdir_symbol\nAjout de cellFsRename_symbol\nPrise en charge ajoutée pour rap.bin. Il recherche /dev_hdd0/game/PS3XPLOIT/USRDIR/rap.bin lorsque la fonction make_rif s'exécute. Prend également en charge les chemins COBRA par défaut\nModifications apportées à la fonctionnalité make_rif pour de meilleures performances (merci @aldostools )\nMise en œuvre d'une fonctionnalité de lecture optimisée de rap.bin (merci @Evilnat )\n \nModifications des ressources :\nAjout de nouveaux fichiers RAF de démarrage à froid personnalisés pour la publication, le débogage, l'USB et DEX (merci @Charles_n_town )\nUtilisation du répertoire de jeu PS3XPLOIT pour ajouter l'état d'installation de HEN à la base de données GAMEDATA, pour survivre au format HDD (masqué dans XMB) (merci @LuanTeles )\nEntrée seg_mcutility corrigée dans category_game.xml (répare le problème avec l'élément de menu de la carte mémoire virtuelle PS1/PS2 (merci @LuanTeles )\nAjout du lien d'installation/lanceur PS Home sous la catégorie PSN (merci @DeViL303 )\n \n \n \nL'hybrid firmware HFW 4.92.1 est là : HFW_4.92.1_PS3UPDAT.PUP\n \n \nLe code source : PS3HEN 3.4.0 (4.92)\n \n \nLittlebalup Firmware DualBoot 4.92\n \nLa version Dual Boot se voit désactivé des contrôles ECDSA  qui signifie « Elliptic Curve Digital Signature Algorithm » où il est utilisé pour créer une signature numérique des données (un fichier par exemple) afin de vous permettre de vérifier son authenticité, sans compromettre la sécurité .\n \n \n \n\n \n \nLe lien vers le Dualboot 4.92 Littlebalup : 4-92 Littlebalup dualboot\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204285/in-ps3-ps3hen-340-hfw-492-dualboot-492-littlebalup-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1204285/in-ps3-ps3hen-340-hfw-492-dualboot-492-littlebalup-2.png"
        }
    },
    "news_4": {
        "title": "[Multi] mGBA v0.10.5 disponible",
        "content": "Le développeur endrift vient de publier une nouvelle version de son émulateur multiplateforme mBGA, la grande bibliothèque de la GameBoy Advance, mGBA permet pour rappel d'émuler une Game Boy, Game Boy Advance ou Game Boy Color sous PC, 3DS, Nintendo Wii, PlayStation Vita, et Nintendo Switch. \n \nLancée en Avril 2013, il y a bientôt 12 ans, mGBA est l'un des meilleurs émulateurs de Game Boy Advance, et il évolue une nouvelle fois avec de nouvelles corrections de bugs, dont l'un d'entre eux est sur le lancement de la version Wii, ainsi la version Wii ne plante plus lors du chargement de fichiers ZIP volumineux et un problème de chargement des états de sauvegarde a été corrigé.\n \n \n\n \n \n \nCorrections :\n- ARM Debugger : Correction du désassemblage du décalage du barillet ror r0 (corrections #3412)\n- FFmpeg : correction de l'échec d'enregistrement de vidéos avec la vidéo CRF (correctifs #3368)\n- GB Core : correction du clonage des données sauvegardées lorsque le fichier de sauvegarde est obsolète (correctifs #3388)\n- Astuces GBA : laissez les codes de style VBA patcher la ROM (correctifs #3423)\n- GBA Core : correction du démarrage dans le BIOS lorsque l'option Ignorer le BIOS est activée\n- Matériel GBA : correction des états de chargement écrasant inconditionnellement la mémoire GPIO\n- Mise à jour : correction de la réécriture des dossiers et des fichiers sous Windows (correctifs #3384)\n- Wii : correction d'un crash lors du chargement de fichiers ZIP volumineux (correctifs n° 3404)\n \nDivers :\n- GB : Autoriser l'utilisation des versions BIOS CGB-E et AGB-0 (ferme le n° 3427)\n \nA noter que déjà la 0.10.4 devait être la dernière avant la 0.11, cette v0.10.5 vient un peu comme une intermédiaire. \n \n \nTéléchargement : mGBA v0.10.5  \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204277/in-multi-mgba-v0105-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS3] Nathan Martin propose son CFW 4.92 Evilnat",
        "content": "Comme prévu il n'aura pas fallu attendre bien longtemps après la sortie du firmware officiel 4.92, voilà que Nathan Martin après quelques jours de teasing dévoile la version officielle de son Custom Fimrware Evilnat 4.92 via PSX-Place.com.\n \nBasé sur le firmware officiel 4.92 de la PS3, son CFW intègre les fonctions Cobra 8.5, il est proposé en version PEX, D-PEX, CEX et DEX. \n \n \n \n\n \n \n \nFonctionnalités :\n \n\n- Basé sur la version 4.92 OFW (CEX)\n- Noyau et certains modules portés depuis la version 4.84 DEX\n- Réalisé manuellement sans outils automatiques\n- PSN/SEN activé\n- Dispositions fixes 272/480 de la version 4.92 OFW\n- Désactivation de la suppression des fichiers act.dat et .rif non signés\n- Autorisation des fichiers act.dat et .rif non signés\n- Autorisation d'exécuter des applications non signées\n- Compatibilité avec FSELF\n- Déverrouilleur de démos C00\n- Vérification de licence LIC.EDAT désactivée\n- Peut être installé sur une version 3.55 OFW\n- Peut être installé sur une version +3.56 OFW (avec l'outil bguerville Toolset)\n- Peut être installé sur n'importe quel CFW CEX\n- Cobra 8.5 ajouté et activé par défaut\n- Compatibilité complète avec les jeux PS2\n- Possibilité de rétrograder depuis n'importe quel CFW avec les drapeaux QA activés\n- Flags QA activés si préalablement activés\n- Message d'épilepsie désactivé au démarrage\n- Compatibilité avec les jeux PSX/PSP/PS2 au format ISO\n- Compatibilité avec les jeux PS3 au format ISO/dossier JB\n- Compatibilité avec ReactPSN\n- Affichage des températures dans le XMB en jeu pour les jeux PS2\n- Contournement de l'écran RSOD\n- Contournement de l'écran BSOD\n- PS3_GAME/app_home\n- Capture d'écran dans le XMB en jeu\n- Gestionnaire de paquets ajouté\n- Kernel DEX patché pour éviter le brick \"ambulance\" (kernel DEX chargé avec CEX TargetID)\n- Vérification de hachage CoreOS patchée pour éviter le brick sur les consoles non déhashées lors d'un downgrade\n- Les PS2CLASSICs fonctionnent sur CEX et DEX\n- Patché pour supprimer la protection LV2\n- Peek et Poke (LV2)\n- Peek et Poke (LV1)\n- Protection CINAVIA désactivée\n- Option pour trier les jeux par nom et date\n- Autorisation d'utiliser des contrôleurs tiers dans le menu de récupération\n- Compatibilité avec OtherOS\n- Mise à jour désactivée à partir des fichiers OFW PUP en mode de récupération\n- Compatible avec le dualboot\n- Autorisation d'installer des PKG retail sur DEX\n- Autorisation d'installer des PKG pseudo-retail\n- Options [★Déverrouiller], [★Verrouiller] et [★Supprimer] activées dans les trophées\n- Compatibilité avec le Remote Play\n- Ajout de gameboot_multi.ac3\n- Suppression de gameboot_stereo.ac3 et coldboot_stereo.ac3\n- Remplacement de \"Dissocier\" par \"Supprimer le dossier\" dans le XMB\n- Contournement de l'erreur de diffusion PAL sur les films BD/DVD\n- Contournement de tous les codes d'erreur sur les films BD/DVD\n- Menu Debug Settings activé dans les jeux PS2 (ps2_netemu.self)\n- Problème CBOMB patché\n- Gestionnaire de cible patché pour afficher la version 4.9.2\n \n \n \n\nCobra 8.5\n \n\n- Failsafe Cobra stage2 (par bguerville/aldo)\n- Restauration des system calls (syscalls) CFW sans redémarrage, simplement en accédant à \"Paramètres > Mise à jour du système\" dans le XMB (par aldo)\n- Intégration du contrôle dynamique du ventilateur (pour contrôler le ventilateur lorsque webMAN est déchargé) (par aldo/Evilnat)\n- Support de l'introduction de l'interface graphique Photo avec webMAN MOD (montage des jeux depuis la colonne \"Photo\") (par aldo/DeViL303)\n- Obtenir/Définir la vitesse du ventilateur (par aldo)\n- Activer/Désactiver les fonctionnalités : Interface graphique Photo, Restauration des appels système (par aldo)\n- Opcode pour créer des appels système CFW (6, 7, 8, 9, 10, 11, 15, 35) (par aldo)\n- Opcode pour créer une licence (RIF) (par Evilnat)\n- Mise à jour de ps3mapi_load_process_modules pour charger des modules personnalisés et des modules système (par haxxxen)\n- Ajout de ps3mapi_get_process_module_info\n- Augmentation du nombre maximal de chemins de mappage de 24 à 32 (par aldo)\n- Ajout du correctif sm_get_temperature dans le noyau (par Evilnat)\n- Ajout du correctif sm_get_fan_policy dans le noyau (par Evilnat)\n- Ajout du correctif sm_set_fan_policy dans le noyau (par Evilnat)\n- Ajout du support pour le décryptage à la volée des ISO REDUMP (par Evilnat)\n- Opcode pour activer/désactiver l'animation de démarrage à froid (coldboot) (par Evilnat)\n- Opcode pour activer/désactiver l'avertissement d'épilepsie (par Evilnat)\n- Opcode pour activer/désactiver l'animation et le son du gameboot (par Evilnat)\n- Opcode pour activer/désactiver les informations cachées des trophées (par Evilnat)\n- Correction du gestionnaire de cible (Target Manager) pour DEX (par haxxxen)\n- Correction du payload de contrôle du ventilateur, évitant le chargement du mode précédent (par Evilnat)\n- Désactivation de stage2.bin pendant le chargement du menu de récupération (par haxxxen)\n- Correction de la vitesse maximale du ventilateur après l'arrêt (par Evilnat)\n- Correction de l'écran noir dans les jeux convertis CFW2OFW (par Evilnat)\n- Ajout de sm_ring_buzzer avec single_beep, double_beep et triple_beep (par Evilnat)\n- Ignorer la création de licence (rif) si elle existe déjà (par aldo)\n- Opcode pour activer/désactiver l'icône PS2 (ISOs/BIN.ENC) dans le XMB (par Evilnat)\n- Ajout du symbole cellFsMkdir (par Evilnat)\n- Ajout d'une vitesse constante du ventilateur lors du lancement d'une ISO PS2 (par Evilnat)\n- Création d'un faux act.dat lors du lancement d'un jeu PSN (par Evilnat)\n- Blocage de la connexion à PSN/SEN lorsque les appels système CFW sont activés (par DeViL303)\n- Activation/Désactivation du mode OFW au démarrage (par aldostools et Evilnat)\n- Blocage des lanceurs PSP si une PSPISO n'a pas été montée (par aldostools)\n- Petites optimisations (par aldostools)\n- Suppression de code \"inutile\" (par aldostools)\n- Opcode pour activer/désactiver le gameboot (par Evilnat)\n- Opcode pour activer/désactiver le coldboot et le son (par Evilnat)\n- Opcode pour activer/désactiver l'avertissement d'épilepsie (par Evilnat)\n- Ajout du symbole cellUsb000_mount_symbol (par haxxxen)\n- Ajout des flags usb_flag et no_cobra (par aldostools et Evilnat)\n\n \n \nTéléchargement : CFW 4.92 Evilnat (lien Mediafire / lien Mega)\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204266/in-ps3-nathan-martin-propose-son-cfw-492-evilnat-1.png"
        }
    },
    "news_6": {
        "title": "[PS3] L'Alpha 3 de RPCS3 pour Android est là",
        "content": "Le développeur DH ne fait pas que s'intéresser à la version Android de RPCS3, il la développe réellement, et propose déjà la build Alpha 3 de l'émulateur.\n \nCette version vise à améliorer la prise en charge des compilations, et à rajouter la gestion des manettes PS3 et PS4 avec notamment le support des Dual Shock 3 et des Dual Shock 4. Il avait d'ailleurs commencé ce support avec la version Alpha 2 il y a quelques jours avec celui des périphériques USB. \n \n \n\n \n\n \n \nChangelog :\n \n- Pré-compilation initiale lors de l'installation\n- Implémentation initiale de l'overlay du pad virtuel\n- Correction des manettes de jeu Dual Shock 4 et Dual Shock 3\n \n \nTéléchargement : RPCS3 Alpha 3\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204247/in-ps3-lalpha-3-de-rpcs3-pour-android-est-la-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1204247/in-ps3-lalpha-3-de-rpcs3-pour-android-est-la-2.png"
        }
    },
    "news_7": {
        "title": "[PS5] PS5 ezRemote Client v1.03 disponible",
        "content": "Le développeur cy33hc semble vouloir faire évoluer la version PS5 de son outil ezRemote Client puisqu'il propose la v1.03 spécialement taillée pour la dernière console de salon de Sony. \n \n \n\n \n \n \nChangelog v1.03 : \n \n- Correction de l'extraction de fichiers compressés créant des dossiers vides inconnus\n- Correction de la création de fichiers ZIP\n- Ajout de la possibilité d'afficher les fichiers PNG, JPG, BMP et WEBP. Mettez simplement en surbrillance le fichier image et sélectionnez-le avec le bouton X. Appuyez sur O pour fermer la fenêtre contextuelle.\n- Ajout de la possibilité de prévisualiser les informations PKG. Mettez simplement en surbrillance le fichier PKG et sélectionnez-le avec le bouton X. Appuyez sur O pour fermer la fenêtre contextuelle.\n \n \nTéléchargement : PS5 ezRemote Client v1.03\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204240/in-ps5-ps5-ezremote-client-v103-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[PS3] webMAN Mod v1.47.48 supporte le firmware 4.92",
        "content": "Le développeur Aldostools dévoile une nouvelle version de webMAN MOD, il s'agit de la version v1.47.48 et petite nouveauté bien sympathique pour l'avenir, elle intègre le support des CFW 4.92. \n \nAldoTools prépare l'avenir, il faut dire que Nathan Martin prépare son Evilnat 4.92, il montre d'ailleurs quelques screens qui sont fort intéressants. \n \n \n\n \n\n \n \nRecentrons le sujet, la dernière version de webMAN Mod ajoute le support du nouveau firmware 4.92, mais ce n'est pas tout, il permet de cumuler pas moins de 18 nouvelles modifications appliquées à l'ensemble de la suite d'outils depuis la v1.47.47.\n \n \nTéléchargement : webMAN Mod v1.47.48\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204238/in-ps3-webman-mod-v14748-supporte-le-firmware-492-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1204238/in-ps3-webman-mod-v14748-supporte-le-firmware-492-2.png"
        }
    },
    "news_9": {
        "title": "[PS5] AirPSX v0.10 disponible",
        "content": "Une mise à jour du plugin AirPSX vient d'être dévoilée, comme vous le savez certainement il s'agit d'un payload ELF développé par barisyild pour PS5 et qui est un peu similaire à webMAN sur PS3 et qui permet de prendre en charge les jeux PS4.\n \nAprès une version 0.08 qui met à jour le package avec le SDK 0.27, tandis que la version 0.09 qui vient d'être mise en ligne vient corriger un bug dans l'app, et permet l'exécution payload dans la gestionnaire de fichiers. \n \n \n\n \n \nChangelog 0.09 : \n \n- Correction d'un bug dans l'application « Applications » qui affichait de manière incorrecte le lancement de l'application.\n- Ajout de « Exécuter le payload » au gestionnaire de fichiers.\n \nEdit 08.03.2025\n \nTéléchargement : AirPSX v0.10\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204237/in-ps5-airpsx-v009-disponible-1.png"
        }
    },
    "news_10": {
        "title": "[PS5] ps5-payload-sdk v0.27 disponible",
        "content": "John Tornblom dévoile une nouvelle version de PS5 Payload SDK qui est proposé en v0.27 désormais, la toolbox évolue donc une nouvelle fois sous les traits du développeur.\n \nComme vous le savez, ce SDK a pour ambition de faciliter le portage et le développement de payloads qui pourront s'exécuter sur les consoles bénéficiant du loader ISO BD-JB ELF, mais aussi sur celles utilisant l'exploit \"ipv6 uaf\" basé sur le webkit. Les corrections en question portent sur les offsets et certaines erreurs spécifiques.\n \n \n\n \n \n \nChangelog v0.27 : \n \n- crt : correction des offsets affectant les firmwares 1.xx, 4.02, 5.xx, 6.xx\n- crt : activation uniquement de la pile par défaut pour les signaux sans gestionnaires\n- libc : définition d'un numéro d'erreur si kernel_mprotect échoue dans mmap ou mprotect\n \n \nTéléchargement : ps5-payload-sdk v0.27\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204207/in-ps5-ps5-payload-sdk-v027-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] PS5 Jar Loader v4.1.1 disponible",
        "content": "Le développeur Hammer-83 propose une mise à jour intéressante de PS5 Jar Loader, et les nouveautés sont très intéressantes !\n \nComme vous le savez, l'utilisation de l'exploit BD-J permet d'accéder à des possibilités qui ne sont pas directement accessible à l'exploit webkit, du fait de sa sécurité accrue. \n \n \n\n \n \nChangelog 4.1.1 : \n \nNouvelles fonctionnalités notables :\n- Ajout d'utilitaires de redirection stdio. Inspiré du travail de John Törnblom, iakdev et CryoNumb.\n- Ajout de mappages SDK supplémentaires.\n \nCorrections notables :\n- Corrections des offset pour 5.xx+.\n- Correction de quelques bugs dans le SDK.\n- Correction du problème de serveur FTP qui ne lit pas les fichiers de l'appareil. Un grand merci à CryoNumb pour le correctif.\n \nRemarques :\n- Consultez les journaux de validation pour obtenir la liste complète des modifications.\n- Les payloads sont compatibles avec la version 4.1.0. Cependant, le nouveau UMTX doit être exécuté à l'aide du chargeur distant et non à l'aide de celui du disque complet pour obtenir la lecture/écriture du noyau.\n- L'ISO complet inclut un menu et tous les fichiers JAR de cette version. L'ISO réduit inclut uniquement le chargeur JAR distant, les payloads doivent être envoyées via le réseau.\n \n \nTéléchargement : PS5 Jar Loader v4.1.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204198/in-ps5-ps5-jar-loader-v411-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[Multi] Zentool la suite d'outils pour modifier les Zen 1 à Zen 4",
        "content": "Notre ami sunriseur rim-k06 nous rappelle que l'équipe Google Security Research s'était engagée à publier des détails et des outils le 05 mars 2025 sur les failles de sécurité découvertes sur les CPU Zen 1 à Zen 4. \n \nCette information vous avez été publié dans une news du 04 février 2025, mais désormais l'équipe a dévoilé son outil Zentool.\n \nSous ce nom se cache une nouvelle suite d'outils qui vient de faire son apparition dans le paysage de la sécurité et de l'optimisation matérielle. Conçue pour les processeurs AMD Zen, cette suite d'outils permet d'analyser, de manipuler et de générer des patches firmware, offrant ainsi aux utilisateurs avancés un contrôle sans précédent sur le comportement de leurs processeurs.\n \n \n\n \n \n \nZentool est une interface utilisateur qui regroupe plusieurs utilitaires spécialisés dans la manipulation de firmware des processeurs AMD Zen. Parmi ces outils, on trouve mcas, un assembleur simple, et mcop, un désassembleur tout aussi accessible. Ces outils permettent aux utilisateurs de modifier le firmware, de vérifier les signatures, et même de charger des patches directement sur le processeur, grâce à des exemples richement documentés. \n \n \n \nAnalyse du firmware : Zentool permet d'examiner en détail les fichiers de mise à jour du frimware, en affichant des informations telles que la date, la révision, les checksums, et bien plus encore.\n \nModification du firmware : Grâce à la commande edit, les utilisateurs peuvent modifier des éléments spécifiques du microcode, comme le numéro de révision, et sauvegarder ces modifications dans un nouveau fichier.\n \nVérification et Signature : Après modification, Zentool peut vérifier l'intégrité du microcode et le resigner pour garantir sa validité.\n \nChargement du firmware : Les utilisateurs peuvent charger directement les patches de microcode sur leur processeur, bien que cela nécessite des privilèges root.\n \nZentool est le fruit du travail de membres de l'équipe de sécurité matérielle de Google, notamment Josh Eads, Matteo Rizzo, Kristoffer Janke, Eduardo Vela Nava, Tavis Ormandy, Sophie Schmieg, et d'autres. Leur travail s'est inspiré de recherches académiques, notamment celles de l'Université de la Ruhr à Bochum, ainsi que du livre \"Anatomy of a High Performance Microprocessor\".\n \nEn conclusion, nous pourrions dire que Zentool représente une avancée significative pour les professionnels de la sécurité et les passionnés de matériel, offrant des outils puissants pour manipuler et optimiser le firmware des processeurs AMD Zen. Cependant, son utilisation requiert une compréhension approfondie des architectures matérielles et des risques potentiels associés à la modification.\n \nTéléchargement : Zentool\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204191/in-multi-zentool-la-suite-doutils-pour-modifier-les-zen-1-a-zen-4-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS3] Sony sort le firmware 4.92 pour la PS3 !",
        "content": "Le 27 février 2023, Sony dévoilait le firmware 4.90 pour la PS3, le 28 février 2024, la firme japonaise lançait le firmware 4.91, et bien hier, Sony a lancé le firmware 4.92 sans réelle surprise. Nous pourrions même anticiper que l'année prochaine à la même époque soit lancé le firmware 4.93 ? \n \nLe changelog officiel ne fait état d'aucune modification, mais il semblerait que ce soit les clés blu-ray qui ont été mises à jour, rien de très transcendant mais assez pour nécessité une mise à jour. \n \nRappelons au passage que Sony a annoncé l'arrêt de la production de blu-ray enregistrable, lancé aux débuts des années 2000 comme le successeur du DVD, le blu-ray bénéficiant initialement d'une capacité de 25 Go est extensible à 50 Go sur les versions double couche. C'est quoi la suite, la fin du support physique, un nouveau support de 10 Go commence à sortir du lot. \n \n \n\n \n \nPour le firmware 4.92, cela s'organise déjà, notamment sur Psx-Place.com où la plupart des développeurs se mettent au travail pour proposer leur solution. \n \nC'est le cas de esc0rtd3w qui montre déjà quelques screens de son travail ici : psx-place.com\n \n \n\n \n \nLes structures sécuritaires n'ayant pas réellement évolués, il y a fort à parier que les HFW, CFW et autres HEN arriveront rapidement. \n \n \nMerci à notre ami sunriseur littlebalup pour l'information. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204187/in-ps3-sony-sort-le-firmware-492-pour-la-ps3-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1204187/in-ps3-sony-sort-le-firmware-492-pour-la-ps3-2.png"
        }
    },
    "news_14": {
        "title": "[PS4] Un portage de ShadPS4 sur Android démarre",
        "content": "Le développeur Tersonous se donne environ 15 jours pour tenter de porter l'émulateur ShadPS4 sur Android. \n \nL'émulation sur Android risque une nouvelle fois d'avancer avec la réalisation d'un compilateur Just-In-Time (JIT) capable de traduire du code arm64 en amd64. Ce projet, baptisé ShandroidPS4, vise à permettre l'exécution d'applications .apk conçues pour l'architecture aarch64 sur des systèmes x86_64, ouvrant ainsi de nouvelles perspectives pour les développeurs et les utilisateurs de ShadPS4.\n \n \n\n \n \nUne partie importante du travail actuel consiste à affiner les calls de bibliothèque pour garantir une compatibilité maximale. Le développeur se concentre sur l'adaptation des fonctions système et des bibliothèques partagées pour qu'elles fonctionnent de manière transparente entre les deux architectures. Cela inclut la gestion des différences dans les conventions d'appel, les alignements mémoire et les instructions spécifiques à chaque architecture.\n \nTersonous commence à réfléchir à la conception d'API de haut et de bas niveau. Ces API permettront aux développeurs d'applications d'interagir avec l'émulateur de manière plus flexible, tout en offrant un contrôle précis sur les ressources système. L'objectif est de fournir une plateforme polyvalente qui puisse être utilisée aussi bien pour le développement que pour le test d'applications Android.\n \nLe projet se trouve ici : shandroidPS4\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204148/in-ps4-un-portage-de-shadps4-sur-android-demarre-1.png"
        }
    },
    "news_15": {
        "title": "[XB360] La partie 2 de l'exploit &#34;Bad Update&#34; est là",
        "content": " \nAu delà de la disponibilité de l'exploit dont nous vous avons donné l'information lors d'une news précédente, son développeur, Ryan Miceli, nous explique en nous dévoilant la seconde partie de son article, comment il a réussi à pirater l'hyperviseur de la Xbox 360. Dans cette seconde partie, il explique comment il a trouvé et exploité des bugs dans l'hyperviseur Xbox 360 pour obtenir une exécution complète du code et créer l'exploit « Bad Update ». Si vous ne l'avez pas déjà fait, il vous conseille de lire (ou au moins de parcourir) la première partie , car ce second article fera référence à une grande partie du contenu qui y est abordé.\n \n \n \n \n\n \n \n \n \nComme il l'a mentionné dans la première partie, il considère l'hyperviseur de la Xbox 360 comme l'un des éléments de code les plus sécurisés que Microsoft ait jamais écrit, avec un seul bug logiciel à ce jour qui était probablement le résultat d'un problème de compilateur.\n \nIl dit avoir passé beaucoup de temps dans le passé à rechercher des vulnérabilités dans l'hyperviseur, mais il n'a jamais rien trouvé d'important. Depuis lors, il a passé 7 ans à travailler en tant qu'ingénieur en sécurité professionnelle et il a développé un tout nouvel état d'esprit pour analyser les cibles et trouver les bugs. \n \nIl a été très motivé à mettre ses nouvelles compétences à l'épreuve et à voir s'il pouvait enfin pirater l'hyperviseur de la Xbox 360. C'est ce qu'il considère comme « le boss final » de son parcours en tant que hacker de console de jeu.\n \n \n\n \n \nIl a fallu environ deux mois et demi pour rechercher, développer et terminer cet exploit, mais ça lui a semblé une éternité. À de nombreuses reprises, il se pensait dans une impasse, la découverte et le développement de cet exploit ont mis à profit ses capacités de chercheur en sécurité, de la compréhension du fonctionnement de la console à la recherche de moyens de créer une surface d'attaque.\n \n\n \n \n \nMaintenant qu'il a terminé cet exploit, il a décidé de se retirer du piratage de consoles de jeu (du moins dans un avenir proche). Pour tous ceux qui souhaitent en savoir plus sur le fonctionnement interne de la Xbox 360, il prévoit d'écrire une troisième partie dans laquelle il couvrira (brièvement) certaines de ses tentatives ratées d'exploitation de la console, ainsi que d'autres comportements/techniques intéressants, cependant cette partie ne sera pas écrite avant plusieurs mois, alors ne comptez pas dessus de sitôt.\n \n \nL'article (seconde partie) est disponible ici : https://icode4.coffee/?p=1081\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204147/in-xb360-la-partie-2-de-lexploit-bad-update-est-la-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1204147/in-xb360-la-partie-2-de-lexploit-bad-update-est-la-2.png"
        }
    },
    "news_16": {
        "title": "[3DS] Luma3DS v13.3.1 la mise à jour",
        "content": "Luma3DS, le Custom Firmware (CFW) le plus populaire pour la Nintendo 3DS, vient de recevoir une nouvelle mise à jour : la version v13.3.1. Cette version apporte des améliorations notables, notamment en ce qui concerne la gestion des sauvegardes automatiques.\n \nL'une des fonctionnalités clés de cette mise à jour est la modification du système de sauvegarde automatique. Désormais, les sauvegardes des fichiers essentiels, qui sont créées à chaque démarrage d'une nouvelle version de Luma3DS, sont stockées dans un dossier spécifique à chaque console. Ces sauvegardes sont enregistrées dans le répertoire suivant :\n/luma/backups/<8-chiffres-hexadécimaux-DeviceId>\n \n \n\n \n \nCette modification permet d'éviter que les sauvegardes ne soient écrasées lorsque la carte SD est utilisée sur une autre console Nintendo 3DS. Ainsi, les utilisateurs qui échangent régulièrement leurs cartes SD entre plusieurs appareils peuvent désormais profiter d'une gestion plus sécurisée de leurs données.\n \nLa gestion des sauvegardes est un aspect crucial pour les utilisateurs de Custom Firmware, car elle permet de prévenir la perte de données en cas de problème lors de la mise à jour ou de l'utilisation du système. Avec cette nouvelle version, Luma3DS renforce la sécurité des données et offre une expérience utilisateur plus fluide.\n \nL'on doit ce travail au développeur TuxSH qui continue de maintenir Luma3DS, même en 2025. \n \n \nTéléchargement : Luma3DS v13.3.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204144/in-3ds-luma3ds-v1331-la-mise-a-jour-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] PSsocat v2.0 proposé par Master-S",
        "content": "Le développeur Master-s a compris que l'arrivée potentielle du hack complet sur le firmware 6.50 allait se jouer avec Socat. \n \nSocat est un outil en ligne de commande qui permet de rediriger des flux de données entre deux points, souvent utilises pour le transfert de données entre des sockets, des fichiers, des processus, etc. Sur une PS4 et PS5, Socat est parfois utilise par les développeurs ou les passionnes de homebrew pour faciliter des opérations comme le débogage, le transfert de données entre la console et un PC, ou pour des manipulations liées au jailbreak.\n \n \n \n\n \n \n \nUtilisations courantes de Socat sur PS4 :\n \nDébogage : Rediriger les flux de données pour analyser les communications réseau ou les erreurs système.\n \nTransfert de fichiers : Faciliter le transfert de fichiers entre la PS4 et un ordinateur via le réseau.\n \nJailbreak et homebrew : Aider a exploiter des vulnérabilités ou a exécuter des logiciels non officiels.\n \n \nAinsi Master-S a proposé plusieurs version de PS socat, la dernière étant le 2.0, dans cette dernière version il est possible d'envoyer des payloads à partir du navigteur. \n \n \nTéléchargement : PSsocat v2.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204104/in-ps4-pssocat-v20-propose-par-master-s-1.png"
        }
    },
    "news_18": {
        "title": "[PS4] Avatar Changer v1.02 pour PS4 de Lapy disponible",
        "content": "Le développeur Lapy propose déjà la v1.02 de son outil Avatar Changer pour les PS4 et PS4 Pro disposant d'un jailbreak. \n \n \n\n \n\n \n \nChangelog 1.01 : \n \n- Correction pour les personnes dont la version 1.00 ne fonctionnait pas, merci à AlhyanyA91108 et à Wr0zen pour l'avoir testé\n \n- Quelques corrections graphiques mineures détectées par Anubis_Qz\n \n- Prise en charge du chargement de xavatars depuis une clé USB (créez un dossier AVATARS sur votre clé USB)\n \n \nChangelog 1.02 : \n \n-Correction d'un bug qui ne permettait pas de supprimer les avatars de certains utilisateurs, rapporté par PajiloeT\n \n-Ajout d'une option permettant de passer plus rapidement d'une page à l'autre en maintenant L2 enfoncé testé par DouglasSampaioz\n \n \n \nTéléchargement : Avatar Changer v1.02\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204103/in-ps4-avatar-changer-v102-pour-ps4-de-lapy-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1204103/in-ps4-avatar-changer-v102-pour-ps4-de-lapy-disponible-2.jpg"
        }
    },
    "news_19": {
        "title": "[Wii/GC] Swiss v0.6r1823 disponible",
        "content": " \nLe développeur Extrems vient de mettre en ligne une version importante de son outil Swiss, et il faut avouer qu'il n'a pas fait semblant, les nouveautés sont très nombreuses. \n \nLa dernière version a été proposée comme un cadeau le 24 décembre 2024, et déjà les améliorations et optimisations étaient nombreuses, mais voici encore de nombreuses corrections. \n \n \n\n \n \n \nChangelog v0.6r1823 :\n \n- Ajout des signatures VI pour le programme de mise à jour Berry.\n- Mise à jour de XZ Embedded.\n- L'année est 2025.\n- Activer LTO dans l'empaqueteur exécutable.\n- Lecture des attributs FAT à partir de FlippyDrive.\n- Ajout d'une option pour désactiver l'hyperviseur.\n- Correction de l'installation sur FlippyDrive.\n- Permettre le montage d'une image disque avec un exécutable.\n- Définir un type de fichier inconnu et gérer les conséquences.\n- Transmettre le chemin d'accès à l'image disque pour une utilisation ultérieure.\n- Analyse de l'enregistrement de démarrage El Torito.\n- Emuler vaguement statFile sur FlippyDrive.\n- Commencer à utiliser statFile plus largement.\n- Correction de la régression 2c2d27d.\n- Correction du redémarrage sur FlippyDrive avec des périphériques non-DI.\n- Utilisation de data.iso pour les applications.\n- Correction du retour au chargeur sur GC Loader avec data.iso présent.\n- Afficher le mode de vitesse du bus.\n- Rendre « compatible avec GC Loader » plus évident.\n- Ajout de mram.bin et mram_cached.bin.\n- Détecter la configuration MRAM définie par BS1.\n- Transmettre la configuration aux applications.\n- Remplir le type de console et le code du périphérique.\n- Ne pas demander la mise à jour de FlippyDrive sur le matériel de développement.\n- Détecter WODE en utilisant l'ID du disque ExtCFG.\n- Mettre à jour la base de données Redump.\n- Ajustement pour les changements de libogc2.\n- Détecter le lecteur de disque plus rapidement à partir d'un coldboot. \n- Sauvegarde du code de l'appareil dans la SRAM.\n- Signaler le type de lecteur de disque.\n- Conserver le code de périphérique précédent avec FlippyDrive.\n- Signaler le type de lecteur de disque sous FlippyDrive.\n- Sonder le dispositif DI lorsque la dernière tentative a échoué.\n- Interrompre un transfert en cours au moment du démarrage.\n \nTéléchargement : Swiss v0.6r1823\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204087/in-wiigc-swiss-v06r1823-disponible-1.jpg"
        }
    },
    "news_20": {
        "title": "[XB360] L'exploit Hyperviseur Xbox 360 est là !",
        "content": " \nLe nouveau logiciel de déblocage pour Xbox 360 est là ! En utilisant une vulnérabilité dans l'hyperviseur, dans la version 17559 du dashboard, il est possible de déverrouiller la console, pour cela le jeu Tony Hawk's American Wasteland (NTSC) est utilisé.\n \nLe déverrouillage n'est pas persistant, c'est-à-dire que si vous éteignez la console, il sera annulé. \n \n \nComme prévu, le développeur Grimdoomer vient de publier son exploit hyperviseur, nommé Bad Update ! \n \nBad Update est un programme d'exploitation non persistant pour l'hyperviseur de la Xbox 360 qui fonctionne sur la dernière version du logiciel (17559). Ce dépôt contient les fichiers d'exploitation qui peuvent être utilisés sur une console Xbox 360 pour exécuter du code non signé. Cet exploit peut être déclenché en utilisant l'un des jeux suivants :\n \n \nTony Hawk's American Wasteland (NTSC)\n \n\n \n \nVotre console ne sera piratée (capable d'exécuter du code homebrew/non signé) que tant qu'elle restera allumée. Une fois que vous aurez redémarré ou éteint votre console, vous devrez relancer l'exploit. L'exploit ne peut pas être rendu persistant, du moins pas en l'état. \n \nBien que l'exploit puisse être porté sur n'importe quelle version du logiciel système, il n'a été construit que pour la version 17559 du dashboard.\n \nComme nous vous l'avons déjà dit l'exploit a un taux de réussite faible, de l'ordre de 30 %, et il peut prendre jusqu'à 20 minutes.\n \nProcédure : \n \n- Téléchargez le fichier Xbox360BadUpdate-Retail-USB.zip depuis la section releases et extrayez les fichiers.\n- Formatez une clé USB en FAT32.\n- Copiez le contenu du dossier correspondant au jeu que vous voulez utiliser pour l'exploit à la racine de la clé USB. Ex : si vous utilisez Tony Hawk's American Wasteland, copiez le contenu du dossier Tony Hawk's American Wasteland à la racine de la clé USB. La racine de la clé USB doit contenir les fichiers/dossiers suivants : BadUpdatePayload, Content, name.txt.\n- Placez l'exécutable non signé que vous souhaitez exécuter lorsque l'exploit se déclenche dans le dossier BadUpdatePayload de la clé USB et nommez-le « default.xex » (remplacez tout fichier existant dans le dossier). Ce fichier xex doit être au format retail et toutes les restrictions doivent être supprimées (voir le wiki pour savoir comment faire).\n- Insérez la clé USB dans votre console Xbox 360 et allumez-la.\n- Connectez-vous au profil du joueur 1 et lancez le jeu que vous utilisez pour déclencher l'exploit.\n- Suivez les instructions du jeu que vous avez choisi pour charger le fichier de sauvegarde du jeu piraté et commencer le processus d'exploitation.\n- L'anneau lumineux de la console clignotera de différentes couleurs/segments au cours du processus d'exploitation pour indiquer la progression. Pour plus d'informations sur la signification des différentes valeurs, voir la section « LED Patterns and Meanings » du wiki.\n- Une fois que l'exploit s'est déclenché avec succès, l'anneau lumineux devrait être entièrement allumé en vert. L'hyperviseur a maintenant été corrigé pour exécuter des exécutables non signés et votre fichier default.xex non signé sera exécuté.\n- L'exploit a un taux de réussite de 30 % et peut prendre jusqu'à 20 minutes pour se déclencher avec succès. Si, au bout de 20 minutes, l'exploit ne s'est pas déclenché, vous devrez éteindre votre console Xbox 360 et répéter le processus à partir de l'étape 5.\n \n \n \n\n \n \n \nQ : Pourquoi dois-je réexécuter l'exploit à chaque fois que j'allume ma console ?\nR : L'exploit n'est pas persistant, il ne fonctionne que tant que la console reste allumée. Une fois la console éteinte ou redémarrée, vous devrez à nouveau exécuter l'exploit.\n \nQ : Qu'est-ce que cet exploit apporte de plus que le RGH Hack / devrais-je l'utiliser à la place du RGH ?\nR : Il s'agit d'un exploit logiciel qui ne nécessite pas d'ouvrir la console ou de faire des soudures pour l'utiliser. En dehors de cela, il est inférieur à l'exploit du RGH à tous points de vue et doit être considéré comme une « preuve de concept » et non comme quelque chose à utiliser à la place du RGH.\n \nQ : Est-ce que cela peut être transformé en softmod ?\nR : Non, la chaîne de démarrage de la Xbox 360 est très sûre et ne présente aucune surface d'attaque. Il n'existera jamais d'exploit de type « softmod » permettant de passer d'un état de démarrage à un état de piratage par le biais d'un logiciel uniquement.\n \nQ : Cela fonctionne-t-il sur les consoles Winchester ?\nR : Je ne l'ai pas testé personnellement, mais je ne vois aucune raison pour qu'il ne fonctionne pas. Rien dans l'exploit n'est spécifique au matériel.\n \nQ : J'ai lancé l'exploit et rien ne s'est passé ?\nR : L'exploit a un taux de réussite de 30 %. Si, après 20 minutes d'exécution, l'exploit ne s'est pas déclenché, vous devrez redémarrer votre console et réessayer.\n \nQ : Pourquoi l'exploit n'exécute-t-il qu'un seul xex non signé ?\nR : Mon but était de pirater l'hyperviseur, pas de développer une solution robuste tout-en-un. Quelqu'un d'autre devra développer un exécutable post-exploit qui corrige toutes les choses de qualité de vie que vous obtiendriez avec quelque chose comme l'exploit RGH.\n \nQ : Pourquoi l'exploit met-il autant de temps à se déclencher et pourquoi son taux de réussite est-il si élevé ?\nR : L'exploit est une condition de course qui nécessite un timing précis et plusieurs autres conditions pour qu'il se déclenche avec succès. Cela peut donc prendre un certain temps avant que cela ne se produise.\n \n \n \nTout est là : Xbox360BadUpdate\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-778542166.png"
        }
    }
}