{
    "news_1": {
        "title": "[PS5] bd-j pv6 Hen, PS5kstuff et etaHEN mis à jour",
        "content": "John Tornblom continue de mettre à jour ses outils, il vient de proposer une update de BDJ-IPv6-HEN, avec notamment des modifications apportées au payload elfldr.elf et aussi à kstuff.\n \nPour rappel, ce payload charge les fPKG sans avoir besoin de modifier l'hyperviseur, il fonctionne sur les firmwares 3.00 à 4.51, et ne permet de lancer que les jeux PS4 et quelques vieux jeux PS5, mais c'est déjà bien pour ceux qui disposent de tels firmwares. \n \n \n\n \n \nAu passage, etaHEN 2.0 a été mis à jour  par LightningMods. \n \n \nTéléchargement : bdj-ipv6-hen v0.3 / kstuff / etaHEN\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203057/in-ps5-bd-j-pv6-hen-ps5kstuff-et-etahen-mis-a-jour-1.png"
        }
    },
    "news_2": {
        "title": "[Xbox] Phil Spencer partage les ambitions de Xbox sur l'avenir",
        "content": "Répondant à des questions de deux spécialistes du jeu vidéo, dont le célèbre podcaster Danny Peña, Phil Spencer, PDG de Microsoft Gaming, discute de son héritage, de l'importance de l'engagement communautaire et de l'avenir des jeux multiplateformes tout en mettant l'accent sur l'innovation matérielle et logicielle.\n \nPhil exprime sa gratitude pour la communauté et l'importance des voix équilibrées dans l'industrie du jeu vidéo, il a aussi conscience que la Xbox 360 va fêter ses 20 ans, et rajoute qu'il faut savoir tirer les leçons apprises du passé et leur impact sur les consoles actuelles.\n \n \n\n \n \n \nIl ne s'en cache plus, l'avenir de Xbox se passera ailleurs que sur Xbox, il parle d'importance de déployer l'avenir de l'expérience utilisateur sur plusieurs appareils, et de souligner l'importance de reproduire l'expérience Xbox sur divers dispositifs pour garantir une expérience utilisateur cohérente.\n \nNe plus faire du hardware et faire du software, un peu à la Sega ? \n \nPhil exprime son enthousiasme pour les présentations récentes des développeurs, soulignant l'attrait des nouveaux jeux à venir, mais il réfléchit aussi à l'évolution de l'entreprise. \n \nIl insiste sur la nécessité de rendre les jeux accessibles sur plusieurs plateformes, permettant aux joueurs de choisir où ils souhaitent jouer. Spencer exprime sa conviction que les jeux vidéo sont une forme de divertissement supérieure, favorisant la communauté et la créativité, mais cette plateforme physique pour lui est désormais moins importante que d'avoir la console la plus puissante du monde. \n \nD'ailleurs nous sommes en droit de nous questionner sur l'étagère d'en haut, on y retrouve deux consoles qui sont inconnues, probablement des projets abandonnés, comme la Xbox Cloud Gaming de 2022, ou encore une Switch 2 ou une Xbox portable, ce n'est pas une Steamdeck.\n \n \n \n\n \n \n \nIl confirme aussi \" Cela signifie que davantage de nos jeux seront commercialisés sur davantage de plateformes, pas seulement sur PlayStation. Nous aimons le travail que nous faisons avec Nintendo, nous aimons ce que nous faisons avec Valve sur Steam. Nos jeux apparaîtront dans de plus en plus d'endroits \". \n \nAu delà du micro-partenariat avec Sony, il semblerait que Microsoft se tourne désormais vers Nintendo et Valve, reste à voir si cela servira le géant américain. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203026/in-xbox-phil-spencer-partage-les-ambitions-de-xbox-sur-lavenir-1.png"
        }
    },
    "news_3": {
        "title": "[PS5] Le firmware 25.01-10.60.00 déployé par Sony sur PS5",
        "content": "La firme japonaise vient de diffuser un nouveau firmware à destination de la PlayStation. \n \nDécouvrez la toute nouvelle mise à jour 25.01-10.60.00 pour votre PlayStation 5 ! Sony continue d'améliorer l'expérience utilisateur avec des optimisations de performance et de stabilité. \n \n \n\n \n \nChangelog 25.01-10.60.00 :\n \n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et l'ergonomie de certains écrans.\n \n \nCe firmware 10.60 ajoute probablement des corrections sur des failles sécuritaires, Sony précisant qu'il améliore la stabilité du logiciel système, cela semble signifier que Sony a corrigé une faille exploitable.\n \n \n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203014/in-ps5-le-firmware-2501-106000-deploye-par-sony-sur-ps5-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] PS5 Offline PS5 Code Parser 1.0.0 et  PS4 NOR Validator 1.0.9",
        "content": "La société Better Way Electronics a mis à jour en ce début d'année 2025 quelqu'un de ces logiciels afin de proposer les dernières innovations en la matière. \n \n \n\n \n \n \nAinsi BwE PS4 NOR Validator a été mis à jour en v1.0.9 (v2.6.4), qui comme le savez probablement est un logiciel d'analyse de NOR. Si, pour une raison quelconque, la console PS4 est allumée, le 'BLOD' (lumière bleue de la mort) et un écran noir apparaissent, la console n'est pas morte mais peut être \"réparée\". Pour rappel, ce programme vous permettra de valider littéralement chaque octet du NOR (plus de 2100 zones spécifiques), vous permettant ainsi de voir où il a été corrompu. Les zones faciles à réparer sont étiquetées comme identiques sur toutes les consoles. Les zones dynamiques sont interchangeables avec chaque révision de microprogramme, la console elle-même ou le modèle de console. Les zones pour console (comme la plupart des CID) ne peuvent pas être modifiées donc, fondamentalement, ce programme est destiné aux réparateurs de consoles.\n \n \n\n \n \nChangelog \n \n- Correction de bugs dans le menu\n- Mise à jour de la gestion des fichiers (pour la version ci-dessous)\n- Possibilité d'uploader deux NOR (prochaine version)\n \n \nTéléchargement : BwE_PS4_NOR_Validator\n \n \nLe développeur propose aussi un nouveau logiciel nommé BwE Offline PS5 Code Parser en v1.0.0. \n \n \n\n \nChangelog\n \n- Lit l'intégralité des codes d'erreur PS5\n- Entièrement hors ligne (adapté aux environnements d'entreprise)\n- Licence DRM uniquement\n- Base de données hors ligne limitée mais éprouvée\n- Axé sur les entreprises (des licences de volume sont proposées)\n \n \nTout est là : ps5parser\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202983/in-ps5-ps5-offline-ps5-code-parser-100-et-ps4-nor-validator-109-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202983/in-ps5-ps5-offline-ps5-code-parser-100-et-ps4-nor-validator-109-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1202983/in-ps5-ps5-offline-ps5-code-parser-100-et-ps4-nor-validator-109-2.png"
        }
    },
    "news_5": {
        "title": "[Switch] Android 14 et Android 15 s'invitent sur la Switch",
        "content": "Les portages d'Android 14 et surtout d'Android 15 à destination de la Nintendo Switch sont désormais une réalité. Selon les premiers retours Android 15 apporte de meilleures performances, une meilleure prise en main des joy-cons, mais ce n'est pas tout. \n \nUne nouvelle interface utilisateur, de nouvelles fonctions, et bien entendu les émulateurs et des applications Android. \n \n \n \n\n \n \nSwitchroot Android 14 (Q) et 15 (V) sont des versions LineageOS 21 et 22.1 entièrement prenant en charge tous les SKU ( odin/v1, modin/v2, vali/Lite, fric/OLED). Pour l'instant, seul l'overclocking de la RAM est pris en charge. Les futurs modules complémentaires offriront un overclocking complet.\n \n \nTout est là : \n \nhttps://wiki.switchroot.org/wiki/android/android-14-15\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202971/in-switch-android-14-et-android-15-sinvite-sur-la-switch-1.png"
        }
    },
    "news_6": {
        "title": "[PS4] Icon Mask 1.16 disponible",
        "content": "Le développeur Lapy propose une mise à jour d'Icon Mask, cela n'avait pas été le cas depuis Juin 2024, Icon Mask est une application Homebrew pour la PlayStation 4 qui vous permet de modifier l’apparence de vos icônes en leur appliquant un simple masque PNG. Vous pouvez ainsi ajuster la transparence, ajouter des bordures et afficher vos icônes dans une icône officielle “PS4 box”.\n \nLe développeur a ajouté le paramétrage de 6 nouveaux masques proposés par Anubis_Qz, et un nouveau paramétrage qui permet de tourner l'affichage des icônes comme le montre l'image. \n \n \n\n \n \nChangelog :\n \n- 6 nouveaux masques du grand @Anubis_Qz\n- nouvelle fonctionnalité : icônes rotatives \n \n \nTéléchargement : Icon Mask v1.16\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202948/in-ps4-icon-mask-116-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[PS4/PS5/Switch] Chiaki-ng v1.9.5 disponible",
        "content": "Après une rapide version Canary, qui a été testée durant quelques jours, le développeur streetpea dévoile la version 1.9.5 de Chiaki-ng qui comme le savez probablement a pris la suite de Chiaki4deck. Il s'agit d'un fork de Chiaki qui est optimisé pour le Steam Deck, et qui permet de proposer une solution beaucoup plus solide, plus fluide, meilleure même au niveau sonore, affichage et restitution graphique que le PlayStation Portal. Chiaki est le premier client Remote Play à destination des PlayStation 4 / PlayStation 5 et Switch qui soit Open Source, totalement gratuit, et qui supporte Linux, MacOS, Windows et Android. Cette nouvelle version vient surtout corrigé des bugs comme en atteste le changelog.  \n \n \n \n\n \n \n \nChangelog 1.9.5 : \n \n- S'assure que les boîtes de dialogue contextuelles n'apparaissent pas pendant la connexion automatique\n- Utilisation des identifiants d'application existants à partir des raccourcis Steam pour éviter de perdre des images et des préfixes de protons lors de la création d'un nouveau raccourci\n- Amélioration de la détection de réinitialisation du contrôleur de mouvement\n- Ajout de la création de raccourcis Steam à la version Windows msvc\n- Autorise le réglage du volume dans l'application\n- Redimensionnement de l'interface graphique à la dernière taille définie lors de l'ouverture + ajouter une option de flux pour une fenêtre de flux réglable\n- Modification du débit binaire par défaut de 30 000 à 15 000 pour correspondre à la valeur par défaut de l'application de lecture à distance officielle\n \n \nTéléchargement : Chiaki-ng v1.9.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202946/in-ps4ps5switch-chiaki-ng-v195-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[WiiU] ISFShax v5.0, minute v1.0 et stroopwafel v1.0",
        "content": " \nLes nouveautés sur la Nintendo Wii U sont nombreuses, l'exploit Coldboot boot1 pour la Wii U, ISFShax, a connu une mise à jour importante qui apporte une protection avancée contre les bricks et des correctifs système supplémentaires.\n \nIl s'agit de la v5.0 qui apporte des correctifs dans le code et un changelog intéressant. \n \n \n\n \n \nChangelog v5.0 : \n \n- Modification de la priorité de démarrage.\n- Maintenant, il essaie de charger d'abord la minute à partir de la carte SD, puis essaie SLC.\n- Maintenant, il recherche d'abord un minute.img avant d'essayer fw.img\n- Modifications mineures au code SD\n- Si vous avez déjà installé ISFShax, il n'est pas nécessaire de le mettre à jour \n \nTéléchargement : ISFShax v5.0\n \n \nLe développeur Jan Hofmeier propose la mise à jour de minute minute en v1.0 avec notamment des optimisations sur les vérifications sur la mémoire MLC et une correction sur le chargement à partir de PRSHhax. \n \nTéléchargement : minute_minute 1.0\n \n \nEnfin sachez que le développeur a déplacé Stroopwafel dans un nouvel espace Github et il en a profité pour le mettre à jour en renommer 00core.ipx et 5debug.ipx.\n \n \nTéléchargement : Stroopwafel v1.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202935/in-wiiu-isfshax-v50-minute-v10-et-stroopwafel-v10-1.jpg"
        }
    },
    "news_9": {
        "title": "[Switch] Citron continue de mettre la pression à Nintendo",
        "content": "Développé par Zephyron, Citron reprend les bases de Yuzu, et continue de presser Nintendo en tirant le meilleur de l'émulation sous Windows, Android ou Linux. \n \nBien entendu, ce projet est une alternative à usage éducatif, le développeur tente de se prémunir de l'avenir en mettant en garde dès le téléchargement et l'installation du logiciel qu'il ne cautionne pas le piratage. \n \n \n\n \n \nIl y a quelques jours il publiait la version Canary 0.3 de l'émulateur, cette version se concentre sur l'amélioration de la stabilité et la compatibilité entre les plateformes. De nombreuses modifications apportées à la compilation des shaders, au système de build et notamment pour la plateforme Android. \n \nLe changelog intégral se trouve ici et il vaut le détour :  v0.3-canary-refresh\n \nTéléchargement : Citron 0.3 Canary\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202927/in-switch-citron-continue-de-mettre-la-pression-a-nintendo-1.png"
        }
    },
    "news_10": {
        "title": "[Switch] NxFileViewer v3.0.2 disponible",
        "content": "Le développeur Myster-Tee revient pour une proposer une mise à jour de NxFileViewer, comme vous le savez\n \nLa mise à jour vient corriger le numéro de version affiché dans la barre de titre, et vient apporter la prise en charge du latino-américain. Pour rappel, NxFileViewer est un logiciel PC qui vous permet de parcourir les fichiers NSP, NSZ, XCI et XCZ et ainsi afficher tout un tas d'informations et de vérifier s'ils disposent de signatures, et d'afficher les hashs.\n \n \n\n \n \n \nCaractéristiques : \n \n- Basé sur LibHac\n- Fichiers pris en charge : NSP, NSZ, XCI, XCZ\n- Prend en charge Super NSP/XCI\n- Parcourir la structure du contenu des fichiers\n- Exporter des fichiers\n- Enregistrer ou copier les images de titre\n- Spécifiez l'emplacement de vos propres clés\n- Recherche des clés dans les emplacements fréquemment utilisés\n- Télécharger automatiquement les clés à partir d'une URL définie dans les paramètres\n- Prend en charge le glisser-déposer\n- Vérifie le type de fichiers réels (XCI ou NSP)\n- Journal détaillé\n- Interface conviviale et réactive\n- Fichier exécutable unique\n- N'écrivez rien en dehors du répertoire du programme\n- Vérifier le hachage et la signature\n- Affiche les clés manquantes\n- Ouvre l'URL du titre\n- Plusieurs langues \n- Renommage avancé des fichiers\n \n \nChangelog 3.0.2 :\n \n- Version corrigée affichée dans la barre de titre\n- Ajout de la langue espagnole latam (merci à Impeeza)\n \n \nTéléchargement : NxFileViewer v3.0.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202925/in-switch-nxfileviewer-v302-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] Sudachi mis à jour en 1.0.13",
        "content": "Le développeur Jarrod Norwell propose une mise à jour de Sudachi en version 1.0.13. On vous a déjà parlé, et c'est une première malgré les injonctions de Nintendo, le développeur continue le développement de l'émulateur. \n \nSudachi est un émulateur Nintendo Switch pour Android, Linux, macOS et Windows écrit en C++ et basé sur Yuzu, Sudachi est proposé pour Windows, MacOS et Android.\n \n \n\n \n \n \nLes modifications portent sur la version Android et la version Windows, sur lesquelles les modifications de formulaire sont plus précises par rapport à la documentation. \n \nDans cette version, le développeur semble tout de même se conforter davantage avec le droit puisqu'il a supprimé la possibilité d'installer des jeux sur Nand. \n \nLe projet désormais se présente désormais comme un modèle de développement appelé \"Modèle d'extrait de Mantine + Vite + Vanille\", son objectif est de limité les capacités des moteurs en publiant le changelog sur un site externe. \n \n \nAndroid :\n- Modification de mm:u pour être plus précis par rapport à la documentation\n- Suppression de la possibilité d'installer des jeux sur la NAND\n \nWindows\n- Ajout de la prise en charge du démarrage sur QLaunch via -qlaunch\n- Modification de mm:u pour être plus précis par rapport à la documentation\n- Suppression de la possibilité d'installer des jeux sur la NAND\n \nTéléchargement : Sudachi 1.0.13\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202907/in-switch-sudachi-mis-a-jour-en-1013-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] Un homme de 58 ans arrêté au Japon, il vendait des Switch modifiées",
        "content": "Au Japon, on ne rigole pas avec le hack et la revente de consoles moddées, un homme de 58 ans vient d'être arrêtés car il revendait des consoles modifiées en ligne, mais il ne faut pas résumer cette arrestation en quelques mots. \n \nFumihiro Otobe a été accusé d'avoir volé des unités Switch, d'y avoir soudé des puces modifiées et de les avoir revendues pour environ 28 000 ¥ (180 USD). Le prix proposée à lui seul permet d'identifier qu'il s'agissait de recel. En plus déjà de revendre du matériel volé, il y installé des copies pirates de jeux (jusqu'à 27 jeux), en option, qu'il faisait payer en plus. \n \n \n\n \n \nVu les injonctions contre lui, Fumihiro Otobe a plaidé coupable, il a même ironisé lors de son audition \" J'étais curieux de savoir si les gens penseraient que j'étais incroyable si je vendais des consoles modifiées \" . \n \nIl est clair que la justice, au travers de la police japonaise, est probablement plus sévère que dans le reste du monde, car par nature elle est plus sensibilisée, il faut dire qu'au Japon les vols et les recels sont très mal perçus. \n \nSur le même exemple, un homme l'année dernière avait été arrêté pour avoir juste modifié des fichiers de sauvegarde de Pokemon Violet, il avait lui aussi commercialisé cette prestation en ligne. \n \nSource : News.ntv.co.jp\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202875/in-switch-un-homme-de-58-ans-arrete-au-japon-il-vendait-des-switch-modifiees-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS5] FetchPKG v0.3.1 disponible",
        "content": "Le développeur John Tornblom continue de proposer de la nouveauté en ce début d'année avec non seulement des nouveaux payloads pour l'exploit BD-J, mais aussi au niveau des logiciels avec la mise à jour de FetchPKG, un outil qui permet de manipuler les PKG à destination de la PS5 mais aussi de la PS4. \n \nAvec cette nouvelle version 0.3.1, les mises à jour de jeu qui sont divisées seront automatiquement fusionnées lors du téléchargement, il est possible de les télécharger derrière un proxy, utile pour une PS4 qui dispose d'un firmware inférieur au dernier original en date. \n \n \n \n\n \n \nPour exploiter au mieux le logiciel, il est utile de le paramétrer derrière un proxy pour protéger votre console de toute mise à jour. Cette correction vise aussi à corriger un problème avec les fichiers de plus de 2 Go.\n \nPour exécuter Fetchpkg sur PS5, vous devez le charger avec un loader ELF qui fournit une interface de ligne de commande, par exemple, shsrv, et les moyens de transférer l'ELF vers la ps5, par exemple, ftpsrv. Il vous faudra lancer les commandes qui téléchargeront le fichier ELF dans /data, qui se connecteront à shsrv et qui téléchargeront un fichier pkg dans /mnt/usb0 via un serveur proxy.\n \n \nTéléchargement : FetchPKG v0.3.1\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202874/in-ps5-fetchpkg-v031-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[PS5] PS5 Homebrew Apps 1.3 disponible",
        "content": "Le développeur Master-s propose de découvrir une nouvelle version de son outils PS5 Homebrew Apps qui est maintenant estampillé 1.3.\n \nDans cette nouvelle version le développeur a ajouté etaHEN 2.0, comme vous le savez, PS5 Homebrew Apps est un ensemble d'homebrews qui fonctionne avec websrv. websrv est un serveur Web simple qui peut être exécuté sur une Playstation 5 jailbreakée via les points d'entrée BD-J ou Webkit . Il peut être utilisé pour lancer des homebrews via le navigateur Webkit intégré à la PS5, ou à distance depuis votre PC, téléphone, etc.\n \n \n\n \n \nAvec cette modernisation avec etaHEN 2.0, l'outil intègre les toutes dernières avancées sur PS5.\n \n \n\n \n \nTéléchargement : PS5 Homebrew Apps 1.3\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202868/in-ps5-ps5-homebrew-apps-13-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202868/in-ps5-ps5-homebrew-apps-13-disponible-2.png"
        }
    },
    "news_15": {
        "title": "[PS3] Nathan Martin propose la deuxième Bêta de son CFW Evilnat 4.91.3",
        "content": "Le développeur Nathan Martin offre sur PS3 une nouvelle version de son custom firmware CFW Evilnat 4.91.3, il s'agit de la deuxième Bêta de cette série.\n \nLa disponibilité se limite pour l'heure à la version PEX, incluant les modules et kernel DEX à partir du DEX 4.84, bien qu'il utilise le CEX par défaut bien entendu.\n \n \n \n\n \n \nL'update permet notamment l'introduction de nouvelles fonctionnalités comme la prise en charge du CFW 4.84 DECR. Certaines options ont été reclassées afin de les rendre plus faciles à utliser, et les fonctionnalités liées au licences ont été améliorées.\n \nCela passe par exemple par l'ajout des mises à jour des options d'importations, et d'exportation de licence au format rap.bin, qui est plus simple à exploiter. \n \n \n\n \n \nPour ceux qui ont une ancienne version du CFW, installez le CFW complet 4.91.3 [BETA 2], pour les autres qui ont une version plus récente vous pouvez simplement mettre à jour xai_plugin mais uniquement pour PEX. \n \nTéléchargement : CFW 4.91.3 Evilnat Cobra 8.5 [PEX] [BETA 2].rar (202.4 Mo)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202859/in-ps3-nathan-martin-propose-la-deuxieme-beta-de-son-cfw-evilnat-4913-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202859/in-ps3-nathan-martin-propose-la-deuxieme-beta-de-son-cfw-evilnat-4913-1.png"
        }
    },
    "news_16": {
        "title": "[PS4/SP5] LightningMods commence les tests d'etaHEN 2.0 Bêta",
        "content": "Le développeur LightningMods fait savoir qu'il teste actuellement le prochain etaHEN 2.0B, et bonne nouvelle il lance un test public de cette nouvelle version. Ainsi si vous souhaitez y participer il faut accéder au serveur discord PKG-Zone.\n \nDans cette nouvelle version d'etaHEN 2.0B (pour Bêta) il a introduit des nouvelles fonctionnalités liés aux code des triches, un nouveau système est en effet pris en charge, avec notamment la gestion des formats MC4, JSON et SHN. Il en a profité aussi pour mettre à jour la toolbox, l'objectif étant de limiter les problèmes de freezes. \n \n \n\n \n \nSi cela vous intéresse c'est par ici : Discord.com\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202849/in-ps4sp5-lightningmods-commence-les-tests-detahen-20-beta-1.png"
        }
    },
    "news_17": {
        "title": "[PS4/PS5] theflow0 récompensé une nouvelle fois avec 10 000 $",
        "content": "Nous venons d'apprendre que theflow0 a une nouvelle fois signalé un bug sur hackerone. L'information jusqu'alors l'information était restée secrète, ce qui nous met la puce à l'oreille, car le dépôt de cette faille remonte à environ 5 mois, et n'avait pas été divulguée. \n \nPlus besoin de rappeler qui est theflow0, mais si cette remontée de faille remonte à 5 mois, il se pourrait qu'il s'agisse du firmware 12.00 de la PS4 ou bien du firmware 24.06-10.00.00 de la PS5, les firmwares récents.\n \n \n\n \n \nCe bug a permis à theflow0 d'obtenir une récompense de 10 000 $, probablement un exploit kernel. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202793/in-ps4ps5-theflow0-recompense-une-nouvelle-fois-avec-10-000-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] MigFlash et UnlockSwitch vous souhaitent une bonne année",
        "content": "Depuis quelques mois nous n'avons que très peu de nouvelles des teams MigFlash (ex Mig Switch) et UnlockSwitch, cependant les équipes sont toujours là et vous souhaitent une agréable année 2025. \n \nLa team MigFlash vient de proposer un nouveau post sur son site, tout d'abord elle souhaite une bonne année à toutes et tous, même si elle ne parle pas beaucoup elle travaille et elle annonce déjà des mises à jour pour 2025.\n \nElle annonce par ailleurs recevoir des centaines de demandes par e-mail pour convertir la MigCard v1 (le modèle sans commutateur) pour la passer en MigCard v2, celle qui dipose de l'interrupteur qui permet de passer d'un jeu à un autre. \n \nBien qu'elle dit ne pas recommander la modification, elle donne tout de même le lien vers le guide qui permet de le faire, et ainsi modifier la MigCard. Malheureusement ce lien ne semble pas accessible, ou bloquer derrière un proxy russe. \n \n \n\n \n \nDe son côté la team UnlockSwitch elle aussi vous souhaite une excellente année 2025, elle informe qu'elle n'a rien publié, ce qui est il faut le reconnaitre assez étrange, mais elle a dévoilé une vidéo de packaging. \n \n \n\n \n \nMaintenant que la Switch 2 est annoncée avec la rétrocompatibilité avec la Switch première version, il est possible que ce genre de solution soit fonctionnelle sur la Switch 2, reste à voir si les jeux Switch 2 auront le même format que ceux de la Switch 1, il y a fort à parier que Nintendo ait revu sa copie niveau sécurité de la console. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202787/in-switch-migflash-et-unlockswitch-vous-souhaitent-une-bonne-annee-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202787/in-switch-migflash-et-unlockswitch-vous-souhaitent-une-bonne-annee-2.png"
        }
    },
    "news_19": {
        "title": "[Switch] Sphaira v0.6.1 disponible",
        "content": "Le développeur TotalJustice propose déjà sa seconde mise à jour de 2025 de Sphaira, la solution de remplacement du hbmenu proposant des fonctionnalités inédites, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \nLes changements dans cette version sont là encore assez nombreux, cela passe par l'optimisation du mode dock suite au correctif apporté par deko3d, par des correctifs sur des crashs et des leaks de mémoire, sur des bugs et autres petites mises à jour. \n \n \n\n \n \nChangelog : \n \n- Correction d'un leak de mémoire deko3d lors de l'utilisation du mode ancré.\n- Correction du crash du mode applet s'il est lancé avec un jeu qui utilise plusieurs services Audren. L'audio est actuellement désactivé en mode applet jusqu'à ce que j'écrive un pilote audio pour libpulsar.\n- Correction d'un crash dans l'option « restaurer hbmenu » où l'option ne se déclenchait pas si /hbmenu.nroelle n'existait pas.\n- ftpsrv mis à jour de 1.2.1 à 1.2.2\n- Correction d'un bug avec l'Appstore où si un champ n'était pas trouvé dans le repo.json, il était défini sur une valeur indésirable. Cela n'affectait que le tri via les téléchargements.\n- Ajout de nouvelles chaînes et mettre à jour ko.json, ja.json \n- Mise à jour es.json \n- Mise à jour pt.json \n- Mise à jour de la langue française\n- Correction de la faute de frappe \"descendant\"\n- Mise à jour du « de.json » avec les traductions manquantes\n \n \nTéléchargement : Sphaira v0.6.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202754/in-switch-sphaira-v061-disponible-1.jpg"
        }
    },
    "news_20": {
        "title": "[PS4/PS5] PS Remote Lua Loader v3.3 disponible",
        "content": "Le développeur Master-S propose une nouvelle version de PS Remote Lua Loader, qui désormais est estampillé 3.3. Comme vous le savez Remote Lua Loader est un script python déployé pour la PS4 et PS5 (et leur versions pro), permettant de charger des fichiers via l'utilisation de Lua dans les jeux construits autour du moteur Artemis. \n \nLe point d'entrée étant un jeu, ce loader ne dépend pas de la version du firmware installée, et fonctionne donc sur tous les firmwares, il a ainsi été testé avec succès sur le dernier firmware de la PS5 et de la PS5 Pro, pareil pour la PS4 et PS4 Pro. \n \n \n\n \n \nDans cette version 3.3, le développeur a apporté une correction et a permet de dump la libkernel de base. \n \n \nTéléchargement : PS Remote Lua Loader v3.3\n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202735/in-ps4ps5-ps-remote-lua-loader-v33-disponible-1.jpg"
        }
    }
}