{
    "news_1": {
        "title": "[PS3] CFW Evilnat 4.91.2 Beta 17 disponible",
        "content": "Le développeur Nathan Martin, plus connu sous le nom d'Evilnat, propose la Bêta 17 de son custom firmware à destination de la PS3. \n \nAvec cette nouvelle version du CFW Evilnat 4.91.2 Beta 17, le développeur a souhaité apporter un énorme patch pour éviter le brick sur CEX TargetID avec le kernel DEX chargé.\n \n\n \n \nAinsi voici le changelog :\n \n- kernel DEX patché pour contourner le brick de bip d'ambulance (Kernel DEX chargé avec CEX TargetID)\n- Seules les variantes PEX et D-PEX sont disponibles pour le moment (par manque de temps pour tester toutes les variantes).\n- Tous les tests concernant le contournement du « bip d'ambulance » lorsque le kernel DEX est chargé avec le CEX TargetID ont été effectués avec succès et fonctionnent correctement, merci à @Pusch3l pour l'avoir testé ! \n \nPour le patcher, vous devez décrypter 4.84 DEX lv2_kernel.self et patcher ce qui suit :\n \noffset : 0x283A7C\nValeur originale : 0xE86219787C0802A6\nRemplacer par : 0x386000004E800020 (retour 0)\n \nCeci remplacera la fonction entière pour retourner 0 au lieu de faire biper la PS3 et de l'éteindre, ce qui la rendra inutilisable lors de la conversion en CEX sans changer le Kernel.\n \nCette fonction n'est présente que sur les kernel DEX.\n \n \nTéléchargement : CFW Evilnat 4.91.2 Beta 17\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201838/in-ps3-cfw-evilnat-4912-beta-17-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PS3] Movian M7 7.0.110 pour Android et PS3 par DeanK",
        "content": " \nLe développeur DeanK a mis à jour son célèbre lecteur multimédia Movian, connu anciennement sous le nom de ShowTime.\n \nSi vous vous souvenez bien Movian est une version modifiée du media center original qui avait été lancé sur la PS3, et qui fonctionne aussi sur Android, Amazon Fire Stick, MacOS, Windows, Linux et Raspberry pi. Le media center s'appelait à l'origine \"Showtime\" sur la PS3 mais a été renommé \"Movian\" par le développeur original Andreas Oman.\n \nDeank a continué à supporter le logiciel, et il a même fait évoluer le fonds puisqu'avec cette nouvelle version il a supprimé l'ancien décodeur/parseur vidéo \"libav\" à l'actuel \"ffmpeg\", mais aussi apporter de nombreuses corrections depuis des années. \n \n \n\n \n \n=== 7.0.110 (2024-12-19)\nAmélioré : BT Priorité aux morceaux critiques nécessaires au décodage vidéo par rapport aux morceaux en lecture anticipée\nCorrigé : BT Crash lors du suivi d'URLs encodées en base64\nAjouté : Option BT 'Injecter des trackers supplémentaires' (utilise trackerslist/ngosang et newtrackon)\nMise à jour : PS3, Linux et Chrome NaCl vers la version 7.0.110\n \n=== 7.0.108 (2024-12-15)\nCorrigé : Problème critique avec la détection de la mémoire libre (important !)\nCorrigé : Conserver ~48-64MB de mémoire système libre (important !) avec des paramètres de mémoire tampon/torrent élevés (en particulier pour les systèmes avec 1GB RAM)\nCorrigé : Détection correcte des codecs audio pour les titres uniquement audio (PCM/DTS dans un conteneur WAV)\nAjouté : Taille actuelle du cache du torrent dans MediaInfo\nModifié : Nouvelle limite par défaut du cache BT par torrent, nouvelle magie de cache pour nettoyer les anciens fichiers de cache.\n \n=== 7.0.107 (2024-12-13)\nCorrigé : Calculs corrects de la mémoire tampon vidéo (important !), maintenant M7 peut mettre en mémoire tampon jusqu'à la taille de la mémoire tampon vidéo correctement.\nAjouté : Support client/protocole FTP pour les commandes STOR et DELE (ftp_unlink, ftp_write) - le copier/coller vers un serveur FTP distant fonctionne maintenant\nCorrigé : Nettoyage du cache BT\n \n=== 7.0.105 (2024-12-11)\nAjouté : Option pour définir la mémoire maximale de BT pour les transferts actifs (96 - 384 MB)\nAdded : Option to set BT Max cache size per torrent (160 - 2000 MB)\nChanged : BitTorrent section is now in main Settings page\nChanged : MediaInfo affiche désormais des informations supplémentaires sur les données mises en mémoire tampon en Mo et en kbit/s.\nAmélioré : Nouvelle logique de lecture BitTorrent, sonde et timeouts, meilleures performances sur les connexions lentes.\n \n=== 7.0.103 (2024-12-07)\nBT : Changement des valeurs par défaut pour les pairs, la vitesse, les délais ; Délais de téléchargement des pièces de processus (débloquer l'interface utilisateur/navigateur).\nNotification pop-up et arrêt de la lecture lorsque la lecture réseau ne démarre pas en raison d'un manque de données ou d'un dépassement de délai pour les pairs.\nCorrection des délais d'attente pour les morceaux et les liens magnétiques\nLa mémoire dans MediaInfo est maintenant en Mo, System Free montre la mémoire disponible/en cache et la mémoire libre.\nPrise en charge de listes de lecture HLS plus volumineuses (jusqu'à 1 Mo - contre 100 Ko auparavant)\nMise à jour de la traduction de BG\n \n=== 7.0.102 (2024-12-01)\nAmélioré : Performance BitTorrent (mémoire, read-ahead, vitesse)\nAjouté : Support pour les boutons personnalisés de la télécommande TCL Android TV\nCorrigé : Logique de transfert audio pour l'option [Source ou DD/DD+/DTS] (nécessite que les modes de transfert corrects soient activés)\n \n \n \nTéléchargement : Movian M7 7.0.110 (lien direct PKG) sinon c'est ici : movian.eu\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201817/in-ps3-movian-m7-70110-pour-android-et-ps3-par-deank-1.png"
        }
    },
    "news_3": {
        "title": "[PS4/PS5] Entretien avec le hacker SpecterDev",
        "content": "Le hacker SpecterDev est l'un des plus connus de la scène PlayStation, récemment il a réussi à cracker les consoles PS5 en trouvant des vulnérabilités dans le système. Le site heise.de a pu lui parler de la conférence hardwear.io à Amsterdam, et nous livre cet entretien.\n \n \n\n \n \nVous vous êtes fait un nom en piratant les consoles Playstation. Comment tout a commencé ?\n \nSpecterDev : J'ai commencé avec la PS4 en 2018, peut-être fin 2017. À l'époque, je ne connaissais pas vraiment grand chose à l'exploitation des vulnérabilités ou à la sécurité. J'avais une formation en programmation, mais pas en sécurité. Je cherchais juste un projet intéressant qui me motiverait à apprendre et je me suis dit \"Hé, ce serait vraiment cool !\"\n \nJ'ai toujours trouvé le jailbreak intéressant, notamment avec les anciens iPod Touch et iPhone des années 2000. Je me demandais déjà comment ça fonctionnait. Je pensais que c'était magique. L'argent, en revanche, n'a jamais été ma motivation, car on ne gagne pas grand-chose grâce à la recherche en matière de sécurité dans le secteur des consoles. Je considère toutes les connaissances que j'ai acquises au cours des dernières années en travaillant avec des gens formidables de la communauté comme ma récompense.\n \nComment avez-vous pris conscience de la scène pour la première fois ?\n \nÀ l'époque, le développeur Fire30 avait publié un exploit WebKit qui fonctionnait sur ma OLD PS4. Je voulais l'essayer et en savoir plus sur la région. Heureusement, j'ai trouvé un groupe de personnes très expérimentées qui m'ont pris sous leur aile et m'ont appris les choses les plus importantes. Je suis encore en contact avec certains d'entre eux à ce jour.\n \nTravaillez-vous encore avec eux aujourd’hui ?\n \nCompte tenu de la complexité des systèmes et des nombreux niveaux de sécurité qu’il faut franchir, il est très difficile de tout faire soi-même en tant qu’armée composée d’un seul homme. Mon travail s'appuie sur le travail des autres et nous nous entraidons. D’un côté, il y a Flatz, qui travaille sur consoles depuis longtemps et qui est vraiment un expert. Presque chaque fois que je me demande si quelque chose fonctionnerait et que je le contacte, il s'avère qu'il y réfléchit depuis longtemps. Sinon, je travaille toujours en étroite collaboration avec ChendoChap, qui est aussi un pseudonyme. Nous échangeons toujours du code et essayons de résoudre les problèmes de chacun. Il y a quelques personnes supplémentaires, mais certaines ne veulent pas être nommées ou n'ont pas travaillé sur consoles depuis un moment.\n \nÊtes-vous également intéressé par d’autres consoles ?\n \nJusqu'à présent, je n'ai regardé que les consoles Playstation. J'ai l'intention d'examiner la Switch et quelques autres appareils, mais je n'y suis pas encore parvenu. Je veux essayer la Xbox car je pense que son modèle de sécurité est un peu plus avancé que celui de la Playstation. Microsoft a beaucoup plus d'expérience avec son cloud Azure et sa virtualisation. Ils existent depuis longtemps, alors que Sony est plutôt un nouvel acteur à cet égard. Par exemple, j'ai pu jailbreaker ma PS3 sans trop de problèmes, je n'ai rien fait de fou, je jouais juste.\n \nJe comprends d'où vient l'attrait d'un jailbreak. Par exemple, nous avons jailbreaké une calculatrice pour y jouer à Doom . Mais pourquoi les gens piratent-ils une PS5 ?\n \nCertaines personnes souhaitent y exécuter Linux. Cela ne m'intéresse pas beaucoup car les consoles, surtout les plus modernes, utilisent malheureusement des CPU très simples. Donc, à certains égards, ils sont pires que les PC bon marché. J'aime juste le défi, la conception et les sous-systèmes uniques dans lesquels ils ont été intégrés. J'aime étudier les pilotes personnalisés et les solutions de sécurité, les rétro-ingénierie pour découvrir à quoi les développeurs ont prêté attention. Vous voyez du code sur les consoles que vous ne voyez nulle part ailleurs.\n \nAvez-vous déjà écrit du code pour les consoles ?\n \nJ'ai déployé beaucoup d'efforts pour faire fonctionner les homebrews sur PS4. Cela vous permet d'exécuter votre propre logiciel sur une PS4, tout comme je l'ai montré dans ma présentation - à ne pas confondre avec l'homebrew de macOS. J'ai maintenu une chaîne d'outils pour créer un homebrew PS4 avec un code source entièrement open source qui n'utilise pas les outils Sony, vous n'avez donc pas à vous soucier de la violation du droit d'auteur. Cela s'est avéré génial.\n \nVous venez de mentionner votre présentation . Vous y avez montré deux nouvelles vulnérabilités qui peuvent être utilisées pour pirater la PS5. Qu'est-ce qui est possible avec eux ?\n \nPour faire simple, les deux vulnérabilités permettent de désactiver l’hyperviseur. Celui-ci gère les machines virtuelles et protège le noyau. Avec les autorisations d'écriture et de lecture du noyau obtenues par la suite, vous pouvez faire ce que vous voulez sur la puce principale ou sur les principaux cœurs x86. Les deux vulnérabilités que j'ai présentées étaient des problèmes de niveau logique, donc pas des problèmes classiques de corruption de mémoire en cas de débordement de tampon ou quelque chose du genre. Il s’agit plutôt de défauts de conception. Par exemple, l'hyperviseur et l'invité peuvent partager de manière inappropriée des données qu'ils ne devraient pas partager, ou les données peuvent ne pas être correctement isolées. C'est sur cela que reposent ces deux erreurs qui, lorsqu'elles sont exploitées, désactivent toutes les mesures de sécurité de l'hyperviseur .\n \nQue pouvez-vous faire avec la PS5 alors ?\n \nCertaines choses, avec un accès sans entrave au matériel, vous pouvez, comme mentionné précédemment, démarrer Linux dessus. Ou, comme moi, vous pouvez patcher le noyau pour exécuter du code arbitraire. Cela ouvre beaucoup de potentiel de recherche pour beaucoup d'autres puces et autres éléments du système, et c'est mon principal intérêt et la raison pour laquelle je l'ai fait.\n \nMais les vulnérabilités ne peuvent pas être exploitées avec la nouvelle version du logiciel, n’est-ce pas ?\n \nJustement, les lacunes ne fonctionnent qu'avec les versions 2.50 ou inférieures, mais elles datent déjà de quelques années. Cependant, les lacunes restent intéressantes pour la recherche car une grande partie du code du kernel reste la même d’une version à l’autre.\n \nEt quelles sont les prochaines étapes pour vous maintenant ? Essayez-vous de pirater la nouvelle version de l'hyperviseur ?\n \nJe suis encore un peu indécis. Certaines des personnes avec qui je travaille souhaitent trouver des attaques pour les versions supérieures. En fait, je veux les rejoindre, mais j'aimerais aussi essayer d'attaquer certains des autres jetons du plateau. Par exemple, le contrôleur SSD, des attaques contre celui-ci ont été récemment présentées lors du Security Analyst Summit. Je pense donc qu’avant de m’inquiéter des versions supérieures du firmware, je souhaite avoir une meilleure compréhension de l’ensemble du système.\n \nAvez-vous reçu des réactions de Sony à votre travail ?\n \nRien d'officiel, certainement. Parfois, les gens de l'équipe de sécurité de Playstation aiment mes tweets et je les vois aussi rôder dans la communauté (rires). J'ai également parlé personnellement à certaines personnes chez Sony. Mon impression de toutes mes interactions avec eux est qu’ils voient cela comme une sorte de compétition amicale. Surtout parce que nous - moi et les personnes avec qui je travaille - ne sommes pas intéressés par le piratage ou par les tentatives de nuire à Sony. Nous voulons juste casser le système et voir ce que nous pouvons faire.\n \nCela sonne certainement mieux que certaines autres entreprises hostiles aux jailbreakers ou aux pirates ?\n \nCertainement. Au début de la PS4, Sony ne disposait que d’un seul e-mail pour les contacter. Sony dispose désormais également d'un programme de bug bounty grâce auquel ils récompensent les chercheurs. Il s’agit d’une évolution positive. Sony essaie vraiment de travailler de bonne foi avec les responsables de la sécurité. C’est formidable, car malheureusement ce n’est pas le cas partout. J'ai l'impression que nous avons de la chance, du moins dans l'espace Playstation, que Sony ne soit pas aussi hostile que d'autres sociétés dont je préfère ne pas mentionner les noms pour le moment. Je ne peux donc que m'en féliciter.  \n \n \n \nTout est là : heise.de\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201816/in-ps4ps5-entretien-avec-le-hacker-specterdev-1.png"
        }
    },
    "news_4": {
        "title": "[PS3] webMAN MOD v1.47.47i disponible",
        "content": "Le développeur Aldostools, Aldo Vargas, vient de publier une nouvelle version de son plugin webMAN MOD. Il porpose en effet la version 1.47.47i de son plugin PS3.\n \nwebMAN est un plugin développé par Deank qui permet de lancer des backups de jeux PS3, PS2, PS1, PSP ainsi que des Blu-ray ou des DVD, stocké sur disque dur (y compris en NTFS) ou sur le réseau local, au format JB ou ISO. M@tsumot0 et Aldostools ont proposé une version MOD de webMan, apportant notamment le support de 21 langages utilisant des fichiers externes, un installer/updater pour CFW Cobra et NonCobra, le spoof IDPS/PSID, la désactivation des syscalls du cfw, et de nombreuses autres évolutions qui se sont succédées.\n \n \n \n \n\n \n\n \n \nChangelog v1.47.47i : \n \n- Ajout d'une option de menu pour basculer entre l'édition Lite et le XMB\n- Les répertoires par défaut sont désormais créés en fonction du type de contenu sélectionné dans /setup.ps3\n- Divers correctifs implémentés par Sunnyqeen\n \n \nTéléchargement : webMAN MOD v147.47i\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201811/in-ps3-webman-mod-v14747i-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201811/in-ps3-webman-mod-v14747i-disponible-2.png"
        }
    },
    "news_5": {
        "title": "[PS5] websrv 0.16 intègre RetroArch",
        "content": "Chaque sortie d'une nouvelle version de websrv apporte son lot de nouveautés, et pas des moindres ! \n \nLe développeur John Tornblom propose une nouvelle version de son payload websrv pour la PS5, comme vous le savez, ce payload lorsqu'il est injecté permet d'exécuter un simple serveur web, cependant il permet beaucoup de choses, puisqu'il permet de lancer des homebrews via le webkit ou bien à distance via un PC, smartphone ou des appareils compatibles.\n \n \n\n \n \nDans cette nouvelle version 0.16, le développeur a fait évoluer quelques scripts pour améliorer certains aspects de sa proposition. \n \nAu programme, une correction de rendu sur les firmwares PS5 inférieurs, l'ajout d'une première version pour YQuake2, RetroArch, LinkDev, la mise à jour de la version de Offact, et des textures et de l'audio en hautes résolutions pour eduke32. \n \nTéléchargement : websrv 0.16\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201807/in-ps5-websrv-016-integre-retroarch-1.png"
        }
    },
    "news_6": {
        "title": "[PS5Pro] Mark Cerny détaille les différences des GPU PS5 et PS5 Pro",
        "content": "Lors d'un nouveau séminaire technique sur la PS5 Pro, Mark Cerny, architecte principal de la PS5 Pro (mais aussi de la PS5, de la PS4 et de la PS4 Pro), partage des détails approfondis sur la console et révèle une collaboration plus approfondie avec AMD pour stimuler l'innovation dans les graphismes et le gameplay grâce à l'apprentissage automatique. \n \n \n\n \n\n \n \nCette conférence technique c'est un peu celle que l'on attendait lors de la sortie de la PS5, un peu comme il avait pu le faire lors de la sortie de la PS4, et ne pas attendre la version Pro, mais en 2020, il est probable que Mark Cerny s'est dit que le public n'était pas prêt à entendre ce genre de détails techniques, le crossgen étant bien trop présent, il fallait assurer la transition. \n \n \n \n \n\n \n \n \n \nDans la vidéo nous apprenons que le GPU de la PS5 Pro est plus puissant grâce à une collaboration poussée avec AMD permettant de profiter d'une technologie hybride entre la seconde et la troisième génération RDNA, mais aussi grâce à une mémoire vidéo GDDR6  plus importante. \n \n \n\n \n\n \n\n \n \nIl explique qu'ils auraient pu créer une nouvelle révision de console en RDNA3, mais que les jeux ne pourraient alors pas tourner sur PS5 Pro et sur PS5 car ils seraient différents, pour cela ils ont créé avec AMD un RDNA2.x permettant aux fichiers binaires de tourner sur PS5 Pro avec un patch RDNA2.\n \n \n \n\n \n\n \n\n \n\n \n\n \n \nCe qu'explique Mark Cerny pèse dans la balance, son discours est comme le plus souvent assez clair, et documenté, il est dommage de ne pas avoir ce genre de présentation avant le lancement de la console, mais cela ne justifie en rien le prix exorbitant de la PS5 Pro. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-5.png",
            "image_6": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-6.png",
            "image_7": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-7.png",
            "image_8": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-8.png",
            "image_9": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-9.png",
            "image_10": "https://www.logic-sunrise.com/images/news/1201786/in-ps5pro-mark-cerny-detaille-les-differences-des-gpu-ps5-et-ps5-pro-10.png"
        }
    },
    "news_7": {
        "title": "[3DS/2DS] Red Viper v0.9.7 disponible",
        "content": "Sous le nom de Red Viper se cache un émulateur de Virtual Boy, le Virtual Boy est une console de jeux vidéo créée par Nintendo en 1995 au Japon et aux États-Unis, se présentant sous la forme d'un visiocasque 3D. Tentant l'innovation avec un affichage stéréoscopique, la console est finalement un échec commercial. Malgré plusieurs baisses de prix, les ventes ne décollent pas et la commercialisation de la console en Europe sera annulée. \n \nRed Viper est l'une des meilleures solution de restitution actuelle, devançant même celle de RetroArch en s'appuyant sur les capacités 3D de la 3DS. \n \n \n\n \n \nAvec la nouvelle version 0.9.7, un mode anaglyphe avec des couleurs configurables pour chaque oeil a été ajouté. Une autre nouveauté est ce qu'on appelle l'émulation du temps de rendu , qui permet aux jeux de fonctionner à la même vitesse que Virtual Boy. Certains bugs ont été corrigés, la compatibilité a été améliorée et les correctifs de jeu sont désormais appliqués en fonction de l'ID du jeu, améliorant ainsi la compatibilité avec les hacks ROM.\n \n \nChangelog 0.9.7 : \n \n- Ajout du mode anaglyphe, avec des couleurs configurables pour chaque oeil\n- Les utilisateurs de 2DS peuvent configurer un décalage de profondeur en mode anaglyphe, car ils n'ont pas de curseur de profondeur\n- Ajout de l'émulation du temps de rendu, y compris une bascule pour la désactiver\n- Correction d'un bug audio dans l'intro de Colony dans Galactic Pinball\n- Résoud divers problèmes dans l'émulateur Game Boy\n- Correction du dessin graphique filaire de l'alarme rouge au-dessus de l'interface utilisateur\n- Ajout du hack pour Jack Bros. pour que le carillon d'intro soit joué à peu près à la bonne vitesse\n- Application des correctifs de jeu en fonction de l'ID du jeu plutôt que de la somme de contrôle, pour une meilleure compatibilité avec les hacks ROM\n- Augmentation de l'agressivité du saut d'image pour améliorer les performances en vitesse élevée\n- Mise à jour du framebuffer logiciel de manière plus conservatrice pour améliorer les performances dans Waterworld et Tetris 3D\n- Correction gamma ajustée pour une meilleure visibilité\n- Correction de la mise en miroir ABXY du D-Pad ayant une entrée droite incorrecte\n \n \nTéléchargement : Red Viper v0.9.7\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201785/in-3ds2ds-red-viper-v097-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[PS5] PS5-UMTX-Jailbreak encore amélioré avec psfree-150b et les derniers payloads",
        "content": "Le développeur idlesauce vient de mettre en ligne une nouvelle version de PS5-UMTX-Jailbreak dans laquelle il a intégré quelques correctifs lié à ps5-remoteplay-get-pin, mais aussi il a amélioré la stabilité de l'exploit lié à PSFree de abc. \n \nIl faut avouer que cela bouge pas mal de ce côté là puisque c'est désormais ps-free-150b qui a été intégré dans cette version personnalisée de idlesauce, mais ce n'est pas tout il a aussi intégré les dernières versions des payloads de John Tornblom. \n \nIl s'agit donc d'une version modifiée de PS5 UMTX Jailbreak proposé à l'origine par Specter, et qui accueille donc les dernières nouveautés et évolutions offertes par la scène PlayStation. \n \n \n\n \n \n \nComme vous le savez PSFree est un exploit webkit basée sur la faille CVE-2022-22620 et qui permet d'obtenir la lecture et l'ecriture sur les firmwares 6.00 à 9.60 sur la PS4, et sur les firmwares 1.00 à 5.50 sur la PS5. Il s'avère indispensable pour les firmwares jusqu'au 5.50 sur la PS5.\n \nL'intégration des payloads va faciliter là aussi le lancement de certains modules. \n \n \nTéléchargement : PS5-UMTX-Jailbreak personnalisé par idlesauce\n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201784/in-ps5-ps5-umtx-jailbreak-encore-ameliore-avec-psfree-150b-et-les-derniers-payloads-1.jpg"
        }
    },
    "news_9": {
        "title": "[PSP/Vita] PSP ARK-4 r151 Edition 20eme Anniversaire",
        "content": "A l'occasion du 20ème anniverssaire du lancement de la console, qui a eu lieu le 11 décembre 2004, les développeurs de la console PSP se sont mis en tête de déployer une nouvelle version de ARK-4. \n \nAvec la PSP, Sony s'est engouffré sur le marché des consoles portables, la \"PlayStation Portable\" lancée au Japon le 11 décembre 2004 aura eu un succès énorme, déferlant ensuite en Amérique du Nord à partir du 24 mars 2005, puis en Europe le 01 septembre 2005. \n \nA l'occasion des 20 ans de la console, voilà que débarque PSP ARK-4 r151 Edition 20eme Anniverssaire, comme vous le savez la principale différence entre ARK et Adrenaline sur les consoles PlayStation Vita et PlayStation TV est qu'il ne nécessite pas l'exécution de l'exploit HENkaku. ARK est un portage du PRO CFW, il s'agit plutôt d'un eCFW (Custom Firmware de la PSP sur Playstation Vita), tout comme TN-C il peut démarrer les homebrews et les jeux de la première PSP et PSX, mais il ne peut faire tourner d'homebrews sur Vita, il faudra obligatoirement passer pour cela par HENkaku.\n \n \n\n \n \n \nCette nouvelle version est très intéressante, déjà elle vient fêter cet anniversaire, mais elle vient aussi corriger la stabilité des thèmes PS1 et PS2. \n \n« Placez simplement le dossier des thèmes n'importe où sur votre PSP et utilisez le navigateur de fichiers dans le lanceur personnalisé pour sélectionner le thème (THEME.ARK) que vous souhaitez installer. En le sélectionnant, un sous-menu apparaîtra vous demandant de l'installer. »\n \n \n \n \n\n \n \n \nC'est toujours le développeur JoseAaronLopezGarcia qui est à la manoeuvre, il a également corrigé un problème sur l'affiche des noms au format utf-8 dans le navigateur.\n \nVoilà ce qu'il dit ici au sujet de cette version  : \n \nSony m'a volé mon idée de créer un tas de thèmes et de les publier en édition anniversaire exclusive, mais d'une manière ou d'une autre, ils ont complètement oublié que la PSP et la PS Vita sont en fait des consoles PlayStation.\n \nNous voici donc en train de fêter les 20 ans d'une console qui a permis aux hackers de faire tout et n'importe quoi, en publiant un logiciel qui est en grande partie le résultat de ces hackers. C'est assez drôle, cela fait 20 ans seulement pour le public japonais, pour le reste du monde (comme moi) la PSP est encore à peine légale.\n \nParce que Sony a volé mon idée, nous sommes devenus encore plus paresseux qu'eux, il n'y a qu'un thème PS1 et PS2, pas de PS4 ou PS5, pas de thème PS3 non plus car c'est juste le thème XMB et nous avions déjà trop copié-collé et nous étions fatigués.\n \nIl y a eu beaucoup de correctifs et d'améliorations depuis la dernière version « stable », mais nous ne les listerons pas tous comme nous le faisons habituellement, nous allons plutôt copier le style de Sony : \n \n- La stabilité du système a été améliorée ! \n- Mise à jour du numéro de révision de r150 à r151\n \n \n \nTéléchargement : PSP ARK-4 r151 Edition 20eme Anniversaire\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201759/in-pspvita-psp-ark-4-r151-edition-20eme-anniversaire-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201759/in-pspvita-psp-ark-4-r151-edition-20eme-anniversaire-2.png"
        }
    },
    "news_10": {
        "title": "[PS5] PS5 Homebrew Apps v1.0 disponible",
        "content": "Master-S propose PS5 Homebrew Apps v1.0, il s'agit là d'un ensemble d'homebrews qui fonctionne avec websrv. websrv est un serveur Web simple qui peut être exécuté sur une Playstation 5 jailbreakée via les points d'entrée BD-J ou Webkit . Il peut être utilisé pour lancer des homebrews via le navigateur Webkit intégré à la PS5, ou à distance depuis votre PC, téléphone, etc.\n \n \n \n\n \n \n \nwebsrv\n-FBNeo\n-FFplay\n-LakeSnes\n-Mednafen\n-OffAct\n-Payload\n-RetroArch\n-ScummVM\n-SverigesRadio\n-SVTplay\n-TVHeadend\n-DevilutionX\n-EDuke32\n \n \nTéléchargement : PS5 Homebrew Apps v1.0\n \n \n \n",
        "images": {}
    },
    "news_11": {
        "title": "[PS5] Le SDK PS5 a fuité après le leak chez Red Barrels",
        "content": "Red Barrels est un studio indépendant de Montréal, un studio indépendant à l'origine du génial Outlast, une série avec pas moins de 37 millions de joueurs, et bien sachez que ce soit a fait l'objet d'un leak assez important. \n \n \n \n\n \n \nCe leak de quelques gigaoctects intègre notamment le SDK PS5 dans sa version 4.00.07. Le leak du 14 novembre 2024 ne dévoile ces fichiers qu'aujourd'hui et il faut avouer qu'ils sont très intéressants.\n \nLe SDK intègre tous les outils Sony, comme GP5 Editor for PS5, PC PS5 SDK Manager, Target Manager for PS5, Map File System for PS5, Ironworks for PS5, Shader Compiler UI for PS5, Controller Capture and Playback for PS5 ou encore des outils de publication. \n \n \n\n \n \nCe leak s'est produit début Octobre 2024, plus de 1.8 de térabits de données avaient été leakées suite à une cyberattaque retardant le développement du jeu Outlast. \n \n \n\n \n \n\n \n \n \nDe nombreux fichiers du leak sortent, et sont disponibles, le SDK PS5 est en liberté, même si tel quel il n'est pas exploitable, c'est quand même intéressant de découvrir les fichiers qu'il contient. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201753/in-ps5-le-sdk-ps5-a-fuite-apres-le-leak-chez-red-barrels-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1201753/in-ps5-le-sdk-ps5-a-fuite-apres-le-leak-chez-red-barrels-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1201753/in-ps5-le-sdk-ps5-a-fuite-apres-le-leak-chez-red-barrels-2.png",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-384722930.png"
        }
    },
    "news_12": {
        "title": "[PS5] PS Remote Lua Loader v2.3 disponible",
        "content": "Le développeur Master-s propose une nouvelle version de PS Remote Lua Loader qui passe désormais en v2.3, les versions s'enchainent rapidement pour apporter quelques petites nouveautés de mouture en mouture. \n \nComme vous le savez Remote Lua Loader est un script python déployé pour la PS4 et PS5 (et leur versions pro), permettant de charger des fichiers via l'utilisation de Lua dans les jeux construits autour du moteur Artemis. \n \nLe point d'entrée étant un jeu, ce loader ne dépend pas de la version du firmware installée, et fonctionne donc sur tous les firmwares, il a ainsi été testé avec succès sur le dernier firmware de la PS5 et de la PS5 Pro.\n \n \n\n \n \nLes versions 2.1 et 2.2 ont apportés le serveur FTP et une fonction de contrôle, , la version 2.3 a rajouté la possibilité d'envoyer des notifications. \n \n \n \nTéléchargement : PS Remote Lua Loader v2.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201752/in-ps5-ps-remote-lua-loader-v23-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[Switch] Sphaira, une alternative au hbmenu sur Switch",
        "content": "Figure emblématique de la scène Nintendo depuis la Wii, le hbmenu s'est toujours présenté comme la solution la plus légère et rationnelle pour accéder aux homebrews installés sur nos consoles modifiées. Si sa teinte bleutée et ses vagues iconiques font l'unanimité auprès des utilisateurs, il est vrai que ses fonctionnalités restent toutefois assez limitées. Une offre suffisante ? Peut-être, mais une solution alternative est toujours la bienvenue, et c'est enfin le cas sur Switch ! Le développeur TotalJustice, bien connu sur la scène Nintendo et qui a récemment publié un client ftp ultra léger, a annoncé une nouvelle surprise pour la Nintendo Switch : Sphaira, une alternative au hbmenu proposant des fonctionnalités exclusives.\n \n\n \nSphaira propose actuellement les mêmes fonctionnalités que hbmenu (lancer des homebrews et utiliser nxlink) tout en ajoutant de nombreuses nouvelles fonctionnalités : \n \nL’onglet principal du menu affiche tous les fichiers .nro trouvés dans le dossier /switch/. Depuis cet onglet, vous pouvez lancer des homebrews, les trier, les supprimer, créer des raccourcis (forwarders), etc. Vous pouvez naviguer vers les autres onglets à l'aide des boutons L et R. \n \nL'explorateur de fichiers est accessible en appuyant sur L depuis le menu principal. Vous pouvez couper, copier, supprimer, renommer des fichiers, etc. Il est possible de sélectionner plusieurs fichiers/dossiers en utilisant le bouton ZR, puis d'appliquer ces actions sur le groupe sélectionné.\n \n\nSphaira inclut une boutique d'applications utilisant l'API du hbappstore. Vous pouvez y accéder en appuyant sur R depuis le menu principal : Cette boutique offre les mêmes fonctionnalités que l'application hb-appstore (installation, mise à jour, lecture des manifests).\n \n\n\nSphaira est livré avec trois thèmes : abyss (par défaut), noir, et blanc (inspirés des \"thèmes\" de la Switch). Vous pouvez ajouter des thèmes personnalisés dans le dossier /config/sphaira/themes/. Les musiques de fond sont aussi supportées si elles sont encodées au format bfstm. \n \n\n\nLes thèmes au format nxthemepeuvent être parcourus et téléchargés via le menu Options -> Divers -> Themezer. Ils seront enregistrés dans /themes/sphaira/Nom du thème - Par Auteur/. Pour les installer, il faudra tout de même passer par NXThemes Installer.\n \n\nLa création de forwarders (raccourics depuis le menu Switch) pour vos homebrews et roms (voir plus bas) est possible depuis le menu : Sphaira peut créer et installer des raccourcis pour n'importe quel fichier .nro. Il utilise l'icône du .nro ainsi que son nom et son auteur.\n \n\nLes associations de fichiers permettent de lier des extensions (.gba, .nro, etc.) à une application homebrew. Par exemple, en cliquant sur un fichier rom.gbc ayant une association, une liste des applications pouvant l’ouvrir s’affichera.\nCela peut être utilisé pour des émulateurs, lecteurs multimédias, éditeurs de texte, etc. Les associations personnalisées doivent être placées dans /config/sphaira/assoc/. Les ROMs doivent être placées dans /roms/nom_du_système/, où nom_du_système correspond à cette table. Ce format est similaire à celui utilisé par Emulation Station, afin d'éviter les conflits entre ROMs de différents systèmes partageant les mêmes extensions (par exemple, .bin ou .cue). Les sous-dossiers sont autorisés, par exemple : /roms/psx/scooby-doo/scooby-doo.bin. \nDes raccourcis peuvent également être créés pour des fichiers ayant une association de fichiers. Par exemple, si mgba est installé et qu'un jeu est situé dans /roms/gba/game.gba, l’option \"Installer un raccourci\" apparaîtra. Sphaira essaiera de récupérer l'icône du jeu ; sinon, il utilisera celle du .nro. Le nom sera une combinaison du nom du .nro et de celui du jeu.\n \n\nD'autres fonctionnalités sont intégrées : un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit, un raccourci vers le navigateur intégré, nxlink (activé par défaut) et la lecteur des audios de GmaeBoy au format gbs. \n\n \n\n \n\n \n\n \n\n \nSi vous souhaitez que Sphaira remplace hbmenu, activez l'option dans Options -> Remplacer hbmenu à la sortie. Une sauvegarde de hbmenu sera créée dans /switch/hbmenu.nro au cas où vous voudriez y revenir.\n \nSphaira est disponible en version beta sur le topic officiel du homebrew juste ici. \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201726/in-switch-sphaira-une-alternative-au-hbmenu-sur-switch-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1201726/in-switch-sphaira-une-alternative-au-hbmenu-sur-switch-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1201726/in-switch-sphaira-une-alternative-au-hbmenu-sur-switch-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1201726/in-switch-sphaira-une-alternative-au-hbmenu-sur-switch-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1201726/in-switch-sphaira-une-alternative-au-hbmenu-sur-switch-5.jpg"
        }
    },
    "news_14": {
        "title": "[PS3] CFW Evilnat 4.91.2 Bêta 16 disponible",
        "content": "Le développeur Nathan Martin, plus connu de la scène PlayStation sous le pseudonyme Evilnat, vient de mettre en ligne la version Bêta 16 de son CFW Evilnat 4.91.2. \n \n \n\n \n \nIl propose les version D-PEX et PEX, rappelons que la version PEX -> Console Retail, kernel CEX + DEX et la version D-PEX -> Console de débogage/convertie, kernel DEX + CEX.\n \n \nChangelog Bêta 16 :\n \n+ Variantes PEX et D-PEX uniquement disponibles pour le moment (par manque de temps pour tester toutes les variantes)\n+ Options [Convertir en CEX/DEX] améliorées avec plus de sécurité pour éviter les problèmes\n+ Options [Activer/Désactiver le support pour DEX OFW] améliorées avec plus de sécurité pour éviter les problèmes\n+ Ajout d'informations sur le mode Cobra externe actuel dans [Informations Cobra].\n \n \nTéléchargement : CFW Evilnat 4.91.2 Bêta 16\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201698/in-ps3-cfw-evilnat-4912-beta-16-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS5] John Tornblom dévoile une version de RetroArch !",
        "content": "Le développeur John Tornblom vient de dévoiler une version de RetroArch, il s'agit d'une version estampillée \"Beta 1\" et il semblerait qu'elle fonctionne correctement pour lancer la plupart des cores. \n \n \n\n \n \n \nLa démonstration vidéo présente le core Snes qui fait tourner une rom de Mario Bros 3, mais il a bel et bien rendu disponible cette version spécialement taillé pour la PS5. \n \n \n \n\n \n \n \nPour le moment peu de détails sur l'installation, ou plutôt la manière ou une procédure de lancement, probablement le tout doit se passer sur un bluray à graver. \n \n \nTéléchargement : RetroArch Test (Beta 1) de 16.37 Mb\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201697/in-ps5-john-tornblom-devoile-une-version-de-retroarch-1.png"
        }
    },
    "news_16": {
        "title": "[PS4/PS5] Remote Lua Loader permet de lancer le FTP sur PS5 et PS5 Pro",
        "content": "Comme vous le savez Remote Lua Loader est un script python déployé pour la PS4 et PS5 (et leur versions pro), permettant de charger des fichiers via l'utilisation de Lua dans les jeux construits autour du moteur Artemis. \n \nLe point d'entrée étant un jeu, ce loader ne dépend pas de la version du firmware installée, et fonctionne donc sur tous les firmwares, il a ainsi été testé avec succès sur le dernier firmware de la PS5 et de la PS5 Pro.\n \nLa nouvelle version du loader prend en charge plusieurs loaders, notamment les scripts pour générer des notifications, des outils pour rectifier certains crashs, mais surtout le nouveau serveur FTP qui permet de parcourir le système de fichiers de la console.\n \n \n \n\n \n \n \nPour l'heure, bien entendu il n'est actuellement pas possible de télécharger des fichiers, ni même d'en charger via le FTP, car toutes les protections de la PS5 ne le permettent pas. \n \n \n \n",
        "images": {}
    },
    "news_17": {
        "title": "[WiiU] Wii VC Launch 1.3 disponible",
        "content": "Le développeur Lynx64, Andrew Hawes, a mis à jour Wii VC Launch en version 1.3, il s'agit là d'un loader permet la forme d'un fichier wps qui permet le lancement de la Wii VC, c'est un plugin qui permet de lancer des titres Wii VC et du mode Wii sur Nintendo Wii U.\n \nDes options intéressantes sont proposées, comme la possibilité de lancer les titres WiiVC avec tous les contrôleurs, d'ignorer tous les dialogues, et de définir des résolutions spécifiques de l'écran (480p, 720p, 480i ou 576i, avec certaines variantes comme le 4:3). \n \n \n\n \n \n \nInstallation : \n \n- Téléchargez la dernière version à partir du site en cliquant sur WiiVCLaunch.wps\n- Copiez le fichier WiiVCLaunch.wps dans wiiu/environments/[ENVIRONMENT]/plugins\noù [ENVIRONNEMENT] est le nom de l'environnement (probablement 'aroma').\n \nChangelog 13 :\n \n- Corrections de bugs :\n-- Correction du correctif SYSCONF Preserver ne fonctionnant pas sur certaines configurations.\n-- Les boîtes de dialogue personnalisées n'apparaissaient pas/le lancement automatique ne se configurait pas correctement après :\n--- Ouverture de certaines applets du menu.\n--- Lancement d'un titre non-Wii qui a ensuite été annulé après un certain point.\n \n \nTéléchargement : Wii VC Launch 1.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201661/in-wiiu-wii-vc-launch-13-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] Le PS5 Payload SDK proposé en v0.22 par John Tornblom",
        "content": " \nLe développeur John Tornblom propose une nouvelle révision de son outil PS5 Payload SDK qui est maintenant téléchargeable avec l'estampille 0.22.\n \nComme vous le savez PS5 Payload SDK est une boite à outils qui permet de créer des payloads ELF pour les PlayStation 5, il comprend notamment plusieurs codes comme celui du PS5SDK permettant aux développeurs de tester leur projet avant leur diffusion. \n \nComme vous le savez, ce SDK a pour ambition de faciliter le portage et le développement de payloads qui pourront s'exécuter sur les consoles bénéficiant du loader ISO BD-JB ELF, mais aussi sur celles utilisant l'exploit \"ipv6 uaf\" basé sur le webkit.\n \n \n\n \n \nLe SDK offre ainsi un environnement de développement idéal pour des applications tiers ou des homebrews sous forme de payloads ELF. Avec cette mise à jour 0.22, le développeur a ajouté la prise en charge des payloads liés aux objets partagés .so, permettant ainsi le chargement via dlopen. Des exemples de code ont été introduit avec des paramètres pour Visual Studio Code dans Cmake, en plus de la prise en charge des hôtes LLVM 19.\n \nL'utilisation de Fedora, d'autres modifications du module intègrent la suppression libm, et la recommandation d'Openlibm, mais les nouveautés passent aussi par la mise à jour de nombreux fichiers .sprx au lieu de .so.\n \nLa bibliothèque libc a été améliorée, avec notamment l'ajout de fonctions telles que qsort_r, dirfd, strsignal et reallocarray. Mais il y a aussi d'autres évolutions comme l'activation de la prise en charges des threads dans libcxxabi, ce qui en théorie devrait améliorer l'environnement multithread. \n \n\n \nChangelog : \n \n- rtld: support payloads that are linked with .so shared objects, and loading them via dlopen\n- examples: add vscode settings to cmake example\n- add support for hosts using llvm-19\n- readme: add instructions for fedora\n- prospero-nid: link dynamically, some OSes don't have static libc installed by default\n- sce_stubs: remove libm as it lacks support complex numbers (users can install - openlibm instead)\n- sce_stubs: set soname to *.sprx instead of *.so\n- libc: decouple from crt\n- libc: add qsort_r, dirfd, strsignal and reallocarray\n- libc: add a couple of stubs for functions that currently does not work on ps5\n- libcxxabi: enable threads\n \n \n\n \n\n \nTout est là : PS5 Payloads SDK 0.22\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201659/in-ps5-le-ps5-payload-sdk-propose-en-v022-par-john-tornblom-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] La mise à jour 4.0.1 du PlayStation Portal disponible",
        "content": "Sony continue d'améliorer l'expérience utilisateur sur sa console PlayStation Portal, avec la mise à jour firmware 4.0.1 la marque a décidé d'améliorer la stabilité, les fonctionnalités Cloud Gaming et Remote Play, tout un programme !\n \nLa sortie du firmware 4.0.1 ne passera pas inaperçue, en effet le géant japonais a décidé d'apporter des correctifs assez importants notamment afin d'augmenter la stabilité et les performances de l'appareil.\n \nLa fonction Cloud a été améliorée, que ce soit en terme de stabilité que de fluidité, ainsi certains titres exigeants comme Watch Dogs Legion ou Final Fantasy 7 Remake sont désormais plus fluide. \n \nUne autre nouveauté est la possibilité d'utiliser le bouton Playstation pour ouvrir le menu pendant l'utilisation et la diffusion de jeux, et le bouton d'accueil pour revenir à l'écran d'accueil, cela permet d'amener de l'ergonomie lors des sessions.\n \n \n \n\n \n \n \nVersion 4.0.1 :\n \n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et la convivialité sur certains écrans.\n \nBien entendu nous ne savons pas si cette mise à jour vient apporter des corrections sécuritaires, probablement, mais le temps nous le dira. \n \nTout est là : playstation.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201657/in-ps5-la-mise-a-jour-401-du-playstation-portal-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] John Tornblom propose PS5 link device pour jouer sans PSN en local",
        "content": "Le développeur John Tornblom propose un nouvel homebrew pour les PS5 jailbreakées mais qui n'ont pas accès au PSN. Il propose en effet PS5 link device, un homebrew qui permet de jouer à distance en local sur des PS5 jailbreakées sans PSN. Il utilise la même approche que ps5-remoteplay-get-pin, mais avec une interface utilisateur graphique et ne repose pas sur le syscall ptrace.\n \n \n\n \n \nPrérequis :\n \n- Une PS5 jailbreakée qui exécute ps5-payload-websrv et a été redémarrée après avoir activé le compte utilisateur connecté à l'aide de OffAcct .\n \nDémarrage rapide :\n \n- Téléchargez LinkDev , décompressez le fichier zip et transférez son contenu sur votre PS5 à l'adresse /data/homebrew/LinkDev\n- Lancez-le selon les instructions de ps5-payload-websrv et associez votre appareil à l'aide des paramètres affichés à l'écran.\n \n \nTéléchargement : PS5 link device v0.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201611/in-ps5-john-tornblom-propose-ps5-link-device-pour-jouer-sans-psn-en-local-1.png"
        }
    }
}