{
    "news_1": {
        "title": "[PS5] PS5 Save Mounter supporte de nouveaux firmwares",
        "content": "PlayStation 5 Save Mounter vient d'être mis à jour par n0llptr, pour rappel, il s'agit d'un outil proposé à l'origine par ChendoChap, un utilitaire d'édition est un assistant d'enregistrement. Vous pouvez créer, modifier, déchiffrer des sauvegardes de votre PlayStation, exactement comme un éditeur, pour par exemple pour gagner plus d'argent, des munitions ou augmenter les statistiques de vos personnages. \n \n \n\n \n \n \nA la base, il n'était proposé que pour la PS4, puis en début d'année 2025, les développeurs l'ont porté sur PS5, la version 1.4.5 apporte le support de nouveaux firmwares. Le développeur a en effet ajouté le support des firmware 5.50 et 7.20.\n \n \nTéléchargement : PS5 Save Mounter v1.4.5\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208750/in-ps5-ps5-save-mounter-supporte-de-nouveaux-firmwares-1.png"
        }
    },
    "news_2": {
        "title": "[Wii/GC] Swiss v0.6r1889 disponible",
        "content": " \nLe développeur Extrems vient de mettre en ligne une version importante de son outil Swiss, et il faut avouer qu'il n'a pas fait semblant, les nouveautés sont très nombreuses, la version précédente ayant été proposée il y a un peu moins de 2 mois. \n \nSi vous possédez un GC Loader HW1, les versions Swiss v0.6r1695 à v0.6r1867 contiennent un bug qui peut bloquer votre appareil. Veuillez cesser immédiatement d'utiliser ces versions !\n \n \n\n \n \nChangelog : \n \n- Mise à jour de la base de données de la collection [T-En].\n- Correction du problème avec le statut DTV forcé.\n- Afficher le mode vidéo effectif dans les paramètres.\n- Premier passage au regroupement de licences.\n- Mettre à jour FatFs vers R0.15b.\n- Synchronisation des modifications FatFs.\n- Tentative futile de démonstration de la fausseté.\n- Mettre à jour README.md\n- Amélioration de la prise en charge des exécutables en mode réel.\n- Assurez-vous que le cache verrouillé est désactivé.\n- Mettre à jour la base de données Redump.\n- Ajout du serveur USB Gecko wiiload.\n- Ajout de l'option pour attendre USB Gecko.\n- Ignorer le changement de type de sortie pour AVE-RVL.\n- Supposons que TDEV ait AVE N-DOL.\n- Effacement du flag du mode 60 Hz pour les jeux NTSC.\n- Synchronisation des flags du mode 60 Hz et progressif sur Wii.\n- Ignore l'invite du mode progressif pour le mode automatique 480p/576p.\n- Ajout d'une info-bulle pour forcer le filtre vertical.\n- Clarification de la compatibilité entre GCDigital et RetroTINK-4K.\n- Supprimez le référentiel devkitPro Apt du conteneur.\n- Empêche le blocage du chargeur GC HW1 lors de la tentative de navigation sur les périphériques FlippyDrive.\n \n \nTéléchargement : Swiss v0.6r1889\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208748/in-wiigc-swiss-v06r1889-disponible-1.jpg"
        }
    },
    "news_3": {
        "title": "[Switch] MissionControl v0.13.3 disponible",
        "content": " \nLe développeur ndeadly propose la 29 ème version de MissionControl qui a été mise en ligne il y a quelques jours, un peu plus de deux mois après la version précédente. Cette version prend en charge le firmware 20.2.0 et corrige un problème lié aux correctifs exef Bluetooth sur les firmwares 20.xx. \n \n \n\n \n \nChangelog :\n \n- Ajout de la prise en charge du firmware 20.2.0\n- Correction des offsets incorrects dans les correctifs exefs pour 20.xx affectant l'appairage du contrôleur Xbox Elite v2\n \n \nTéléchargement : MissionControl v0.13.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208747/in-switch-missioncontrol-v0133-disponible-1.jpg"
        }
    },
    "news_4": {
        "title": "[Vita] Vita Moonlight 0.13.1 disponible",
        "content": "Déployé à l'origine par xyzz, Vita Moonlight continue d'évoluer sous le clavier AorsiniYT, mais la qualité de développement reste la même le soft continue de proposer de la nouveauté. Pour rappel, ce logiciel est basé sur nVidia Gamestreams s'agissant d'un homebrew vous aurez besoin d'une PlayStation Vita avec HENkaku et VitaShell d'installés, d'un client FTP et surtout votre ordinateur devra être sous Windows et être équipé d'une carte graphique nVidia (minimum GTX 650).\n \nIl a introduit il y a quelques jours la branche 0.13 de ce logiciel, avec des évolutions majeures notamment avec cette nouvelle version 0.13.1, l'interaction d'une Dual Shock 4, son émulation a été améliorée, ainsi que le réveil via le LAN (Wake-on-LAN). \n \n \n\n \n \n \nPrincipales caractéristiques\n \nModes d'écran tactile unifiés\n- Vous pouvez désormais choisir entre trois modes d'écran tactile : DS4 Touchpad, Absolute Mouse et Tablet (Sunshine) dans le menu des paramètres.\n \nÉmulation du pavé tactile DS4\n- L'écran Vita peut agir comme un pavé tactile multitouch de style DualShock 4, compatible avec les gestes et les commandes avancées dans les jeux et Steam Input.\n \nIntégration du Wake-on-LAN (WOL) :\n- le Wake-on-LAN est désormais entièrement intégré au menu de gestion de l'hôte, ce qui vous permet d'allumer votre PC distant depuis la Vita en utilisant l'adresse MAC enregistrée et l'adresse de diffusion calculée automatiquement. (N'oubliez pas de réappairer l'hôte pour qu'il enregistre l'adresse MAC, sinon il vous indiquera qu'elle n'est pas enregistrée.)\n \nRefonte des raccourcis\n- Tous les raccourcis ont été divisés en fichiers sources individuels pour une meilleure organisation du code et une meilleure maintenabilité.\n \nAméliorations de base\n- Sensibilité du pavé tactile DS4\nLe mode pavé tactile DS4 est désormais plus sensible et précis pour une expérience plus fluide.\n- Gestion de l'adresse MAC de l'hôte\nL'adresse MAC de l'hôte est désormais enregistrée et chargée correctement à partir du fichier device.ini.\n- Débogage des paquets WOL\nAjout d'un script Python (wol_sniffer.py) pour recevoir et vérifier les paquets Wake-on-LAN sur le réseau, utile pour tester sans éteindre le PC.\n- Interface utilisateur et retour visuel :\nCorrections mineures de l'interface utilisateur et amélioration du retour visuel dans le menu de gestion des hôtes. La navigation dans le menu de gestion des hôtes a été améliorée (retour à la case « O/annuler ») et l'affichage de l'état est unifié et plus clair.\n- Correction des pressions fantômes sur les boutons :\nCorrection d'un problème où des pressions fantômes sur les boutons pouvaient se produire lors de la gestion des superpositions et des raccourcis. L'état des boutons est désormais correctement réinitialisé et restauré.\n \nSous le capot\n- Les combos comme L1+L2 et R1+R2 fonctionnent désormais correctement même lorsqu'ils sont utilisés avec l'écran tactile ou le backtouch.\n- En mode tactile absolu, les superpositions de boutons spéciaux n'interfèrent plus avec la saisie tactile, permettant un véritable toucher absolu et rendant tous les coins de l'écran utilisables.\n- De nombreuses corrections de bugs, nettoyages de code et refactorisations internes pour la stabilité et la maintenabilité.\n \n \n \n \nTéléchargement : Vita Moonlight 0.13.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208738/in-vita-vita-moonlight-0131-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] ldn_mitm v1.19.0 disponible",
        "content": "Le développeur MasonT8198 vient de mettre en ligne une nouvelle version de ldn_mitm. Le module ldn_mitm, si votre console est bannie ou que vous souhaitez tout simplement vous protéger d'un éventuel ban, vous permet de prendre en charge presque tous les jeux supportant le réseau sans fil local. Ce fichier KIP, nommé Ldn_mitm, vient en complément de switch-lan-play. \n \nAu programme, la correction d'un bug dans le submodule lié à Atmosphere, et surtout le support du firmware 20.2.0 sur Switch 1 bien entendu. \n \n \n \n \n\n \n \n \n \nChangelog : \n \n- Sous-module : déplacement Atmosphere-libs de 0f72b2c à af10bca par@dependabot[bot] dans #207\n- Cette version prend en charge le firmware 20.2.0 sur Switch 1 \n \n \nTéléchargement : ldn_mitm v1.19.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208737/in-switch-ldn-mitm-v1190-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[PS4/PS5] TheFlow gagne 5 000 $",
        "content": "Le développeur TheFlow vient de gagner de nouveau 5 000 $ au bounty program, un rapport vient en effet d'être dévoilé via HackerOne.com. \n \n \n\n \n \n \n \nPour le moment nous ne savons à quoi correspond, si cela concerne la PS4 ou la PS5, ou bien même les deux consoles, mais TheFlow, sous son vrai nom Andy Nguyen, fait monter encore sa cagnotte, et pas qu'un peu puisque depuis 2019 TheFlow a gagné plus de 750 000 $. \n \n \n \n \n\n \n \n \n \nPour le moment, le bug rapporté n'est pas dévoilé, il le sera peut être d'ici quelques mois, ou peut être d'ici la fin de l'année, permettant de faire avancer encore un peu plus le hack de la console, mais surtout sa protection future via la disponibilité de mises à jour firmwares.\n \n \nTout est là : Hackerone.com/theflow0/\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208677/in-ps4ps5-theflow-gagne-5-000-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1208677/in-ps4ps5-theflow-gagne-5-000-2.png"
        }
    },
    "news_7": {
        "title": "[Switch] AtmoPack 3.0.4 disponible",
        "content": " \nLe développeur Zoria propose la mise à jour du AtmoPack qui est désormais proposé en version 3.0.4 comme nous l'a précisé Linkynimes. AtmoPack est un pack tout-en-un qui permet de proposer tout ce qu'il y a de plus intéressant pour une Switch hackable. LS tient à remercier la Team PoyoNX pour cette solution. \n \n \n\n \n \n \nInstructions :\n \n- Supprimez tous les dossiers et fichiers de votre carte microSD à l'exception des dossiers \"Nintendo\", \"emuMMC\", \"sxos\" et \"emutendo et switch\" s'ils existent.\n- Téléchargez le pack ci-dessous et extrayez-le à la racine de votre carte microSD.\n- Vous pouvez également mettre à jour le pack via le AtmoPack-Updater fourni depuis la version 2.1.9, il peut être lancé depuis le Homebrew Launcher via une connexion internet.\n \nSi vous souhaitez créer vous-même un pack, la Team PoyoNX a développé une petite application pour le faire : Atmosphere Vanilla Fetcher.\n \n \nChangelog : \n \n- AtmoPack-Vanilla 3.0.4\n- Sigpatch / Sys-Patch > All firmware\n- Atmosphère - 1.9.2\n- Haze - 1.0.0 - 1.9.2\n- Hekate - 6.3.1 / NYX 1.7.0\n- DayBreak - 1.4.0\n- Goldleaf - 0.10\n- JKSV - 02.23.2023\n- FTPD - 3.1.0\n- NXMTP - v0.1.5\n- TinWoo - 1.0.12 - custom\n- DBI - 658\n- 90DNS_Testeur - 1.0.4\n- PayloadReboot - 0.0.3\n- AtmoPack-Updater - 2.0.2\n- Simple-Mod-Downloader - 1.0.3\n- LS-News - 1.0.0\n- Sphaira - 0.13.3\n \nTéléchargement : AtmoPack 3.0.4\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208658/in-switch-atmopack-304-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[Switch] NeXT 3.36 disponible",
        "content": " \nLe développeur mistervampi (vampitech) vient de proposer la mise à jour de sa solution tout-en-un NeXT qui est maintenant estampillée v3.36. Pour rappel NeXT est un pack qui supporte les CFW que ce soit Atmosphere ou SX OS, de plus sa gestion des applications est largement simplifiée par une interface utilisateur très fonctionnelle. \n \nComme toujours, tous les correctifs, modules homebrew et modules système les plus importants ont été testés avant leur sortie publique afin de vérifier la compatibilité et le bon fonctionnement de cet AIO avec le dernier firmware système disponible, le firmware 20.2.0.\n \n \n \n\n \n \n \nChangelog : \n \n- Prise en charge de base d'Atmosphere 1.9.2 \n- Prise en charge du firmware 20.2.0\n- Correction USB 3.0\n- Sphaira 0.13.3\n \n \nGardez à l'esprit que l'utilisation de modules homebrew et modules système non mis à jour peut provoquer des blocages ou des plantages du système. \n \n \nTéléchargement : NeXT 3.36\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208656/in-switch-next-336-disponible-1.jpg"
        }
    },
    "news_9": {
        "title": "[PSP] Apollo Save Tool v2.0.0 disponible",
        "content": " \nLe développeur Damián Parrino, connu sous l'alias de Bucanero, propose une mise à jour de la version PSP d'Apollo Save Tool. Cela faisait un bon moment que cette version n'avait plus évoluée, la version précédente, la v1.3.2 avait été proposée il y a un an en juillet 2024.\n \nLe logiciel évolue une nouvelle fois avec de nombreuses nouveautés, et le changelog est impressionnant compte tenu de l'âge de la console. Pour rappel, il s'agit d'une application qui vous permet de gérer les fichiers de sauvegarde de jeu sur PlayStation Vita et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur la PSP.\n \nDans cette version 2.0.0 le développeur amène la prise en charge des serveurs FTP pour sauvegarder les saves PSP et PS1, mais ce n'est pas tout le changelog est impressionnant. \n \n \n \n\n \n \nChangelog 2.0.0 :\n \nAjouts :\n- Prise en charge du serveur FTP (enregistrement de la sauvegarde dans le cloud)\n- Compressez, téléchargez et sauvegardez les enregistrements sur un serveur FTP défini par l'utilisateur\n- Répertorier, télécharger et restaurer les sauvegardes à partir d'un serveur FTP défini par l'utilisateur\n- Sauvegarde des sauvegardes PSP et PS1\n- Supprimer les sauvegardes PSP\n- Détection automatique de la valeur de l'ID de compte système\n- Menu Paramètres :\n-- FTP Server URLOption ajoutée\n-- Debug logOption persistante\n \nCorrections : \n- Correction .PSVde l'en-tête lors de l'exportation des sauvegardes PS1\n- Correction d'un bug de dialogue réseau en cas d' NetconfInitStartéchec\n \nDivers :\n- Mise à jour du moteur de correctifs Apollo vers la version 1.3.0\n- Correction du bug de recherche de code SW\n- Ajout d'une fonction djb2une (hachage)\n- Ajout de la prise en charge des balises pour les options sélectionnées par l'utilisateur sur .savepatchles fichiers Par exemple,{ZZ}val=name;03E7=999 gold;...;270F=9999 gold{/ZZ}\n- Prise en charge de SaveWizard et des codes BSD avec plusieurs options\n \n \n \n \nTéléchargement : Apollo Save Tool v2.0.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208655/in-psp-apollo-save-tool-v200-disponible-1.png"
        }
    },
    "news_10": {
        "title": "[Switch] Atmosphere 1.9.2 disponible avec support du firmware 20.2.0",
        "content": " \nLe développeur SciresM propose la mise à jour d'Atmosphere en v1.9.2 et qui apporte notamment le support du firmware 20.2.0. Comme vous le savez Nintendo a publié un firmware 20.2.0 qui a bloqué Atmosphere, et il faut attendre qu'il puisse proposer les ajustements. \n \nC'est chose faite, il s'agit de la quatre-vingt-troisième version officielle d'Atmosphère, qui est fourni avec hbl 2.4.4 et hbmenu 3.6.0. Le développeur s'excuse, mais il était débordé ces derniers jours, le support de base du firmware 20.2.0 a été ajouté, et le support USB 3.0 a été corrigé pour la version 20.1.0+.\n \n \n\n \n \nChangelog :\n \n- Un support de base a été ajouté pour la version 20.2.0.\n- L'activation forcée de la prise en charge USB 3.0 a été corrigée pour la version 20.1.0+.\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \n \n \nTéléchargement :  Atmosphere 1.9.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208653/in-switch-atmosphere-192-disponible-avec-support-du-firmware-2020-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] NxNandManager v20.2.0 disponible",
        "content": "Notre ami sunriseur THZoria, développeur spécialisé dans le modding de consoles, propose la mise à jour de NxNandManager. Proposé à l'origine par Eliboa, NxNandManager est un utilitaire dont le but principal est de copier le contenu de la Nintendo Switch (NAND complète ou une partition spécifique) vers / depuis un fichier ou un lecteur physique, cependant il faut le mettre à jour à chaque arrivée de nouveau firmware. \n \nCette mise à jour 20.2.0 apporte le support du firmware 20.2.0 qui vient tout juste d'être imposé par Nintendo. THZoria en a profité pour corriger quelques bugs sur les icônes et les bibliothèques DLL. \n \n \n \n \n\n \n \n \nChangelog NXNandManager 20.2.0 : \n \n- NCA modifié pour refléter les changements du dernier firmware 20.2.0\n \nCorrection de bugs : \n \n- Les icônes s'affichent correctement\n- Les DLL sont intégrées dans le fichier exécutable\n \n \nTéléchargement : NxNandManager v20.2.0\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208625/in-switch-nxnandmanager-v2020-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[3DS] Luma3DS v13.3.3 disponible",
        "content": " \nLe développeur TuxSH vient de dévoiler une nouvelle version de Luma3DS, la version précédente, la v13.3.2 avait été livrée le 10 Mars 2025, il y a un peu plus de 4 mois, les nouveautés de cette version sont donc importantes. \n \nLuma3DS, le Custom Firmware (CFW) le plus populaire pour la Nintendo 3DS, vient de recevoir une nouvelle mise à jour, pour rappel Luma3DS  est un CFW permettant de corriger le logiciel système des consoles portables (New) Nintendo 2DS / 3DS  \"à la volée\", en ajoutant des fonctionnalités telles que les paramètres de langue par jeu, des capacités de débogage pour les développeurs et en supprimant les restrictions imposées par Nintendo telles que le verrouillage régional.\n \n \n \n\n \n \n \n \nChangelog : \n \n- Résolution des problèmes de scintillement (flickering) et de brûlure d'écran qui se produisent parfois sur les écrans IPS (généralement après avoir utilisé la fonction lié aux splash screens) : Ce problème était dû à un code très ancien que nous utilisions pour désactiver la modulation de largeur d'impulsion (PWM) et le signal lors de la désactivation de l'écran, mais qui oubliait de couper l'alimentation de l'écran LCD et du/des rétroéclairage(s), ce qui entraînait une mauvaise détection de l'état par le pilote officiel. Ce problème est désormais résolu.\n- Initialisation du contrôleur LCD améliorée. Bien que certaines difficultés techniques subsistent, ce correctif devrait résoudre la grande majorité des problèmes rencontrés.\n- Dans le sous-menu « Modifier la luminosité de l'écran », corrigez les erreurs de calcul de limite. De plus, comme le GSP sous-jacent le permet, autorisez une luminance légèrement supérieure à la valeur prédéfinie 5.\n- Cela est dû au fait que même si seul le modèle OG O3DS dispose d'une fonction où la luminance est augmentée lors du branchement de l'adaptateur, tous les modèles ont un niveau de luminosité supplémentaire (inutilisé) prévu à cet effet.\n- Correction d'un problème spécifique à la N3DS où l'utilisation de « DSi Autoboot » et du mode d'économie d'énergie tous deux activés entraînait les effets de « rave party » du logiciel DSi\n- Ce problème est résolu en mettant à zéro les registres de rétroéclairage adaptatif spécifiques à la N3DS, qui sont actifs même lorsque le SoC est en mode O3DS, contrairement à ce que prévoient les pilotes Nintendo (et en laissant donc les registres non initialisés dans TWL_ et AGB_FIRM). Ce bug ne peut se produire qu'avec la fonction « autoboot » de Luma3DS, car les registres sont initialisés par NATIVE_FIRM et survivent au redémarrage.\n- D'autres améliorations de la stabilité globale du système et d'autres ajustements mineurs ont été apportés pour améliorer l'expérience utilisateur.\n \n \nTéléchargement : Luma3DS v13.3.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208616/in-3ds-luma3ds-v1333-disponible-1.gif"
        }
    },
    "news_13": {
        "title": "[Multi] Nintendo continue sa lutte contre le piratage avec l'aide du FBI",
        "content": "Après les retraits des émulateurs Yuzu et Ryujinx, et tous leurs dérivés et autres forks, le géant japonais s'est attaqué au site d'hébergement 1fichier qui a été contraint de verser près de 450 000 euros à Nintendo en début d'année. \n \nNous l'avons vu récemment, Nintendo a clairement changé ses CLUFS, insistant sur l'intégration de mesures radicales, toute tentative de jouer à des jeux piratés entraînera un blocage de la console, qui ne sera alors plus en mesure de se connecter aux services en ligne.\n \nLe problème de ce genre de mesure, c'est que parfois certains utilisateurs ne souhaitant que jouer à des jeux Switch 1 se trouvent bannis sur Switch 2, sans raison, ou bien à tord. \n \n \n\n \n \nDans sa lutte perpétuelle contre le piratage, Nintendo s'est appuyé sur les autorités pour agir contre le site le site Nsw2u qui a été fermé le 10 juillet après une action menée par le FBI et le FIOD. Nintendo poursuit ainsi sa lutte contre le piratage de ses jeux et de ses consoles, le FBI a en effet saisi le site, qui était connu pour proposer des jeux piratés pour la Switch. \n \nL'information a été relayée par Kotaku, il est maintenant impossible d'accéder au site sans arriver sur le message \"Ce domaine a été saisi par le Bureau Fédéral d'Investigations (FBI) en accord avec a un mandat de saisie délivré en vertu de la loi 18 U.S.C. 2323.\" Cette action a été réalisée en partenariat avec le Service d'information et d'investigation fiscal (FIOD), un organisme néerlandais. \n \n \nTout est là : Kotaku.com\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208585/in-multi-nintendo-continue-sa-lutte-contre-le-piratage-avec-laide-du-fbi-1.png"
        }
    },
    "news_14": {
        "title": "[XBO/Serie] La mise à jour de XBSX2 corrige de nombreux bugs",
        "content": "Le développeur SternXD, qui a repris le travail de SirMangler, vient de publier une nouvelle version de XBSX2, l'émulateur de PlayStation 2 (le portage de PCSX2) pour les consoles Xbox One et Xbox Series X/S.\n \nIl s'agit là d'une mise à jour intéressante, dont la version précédente a été publiée en Mai dernier, pour rappel, l'émulateur XBSX2 vous permet non seulement de jouer à des titres PS2 avec toute la puissance native de l' émulateur PCSX2 , mais vous permet également de profiter des résolutions échelonnées (+4K) jamais vues sur une console Xbox.\n \n \n \n \n\n \n \n \n \nChangelog : \n \n- Synchronisé avec la branche principale de PCSX2 à compter du 12 juillet 2025 .\n- Problème d'exportation (de dump) de textures corrigé sur UWP (les dumps corrompus ou manquants devraient désormais fonctionner correctement).\n- Problèmes audio et d'entrée SDL corrigés.\n- La branche a été reconstruite en superposant les modifications UWP sur la dernière version majeure de PCSX2.\n- Restructuration de la solution/conception pour mieux l'aligner sur l'architecture PCSX2.\n- La fonctionnalité Enable CDVD Precaching a été réintroduite, mais peut entraîner des problèmes avec les limites de RAM, une protection a donc été ajoutée aux paramètres.\n- Correction du problème avec le logo trop petit et ajout d'un nouvel écran de démarrage.\n \nTéléchargement : XBSX2 2.0.8.4\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208580/in-xboserie-la-mise-a-jour-de-xbsx2-corrige-de-nombreux-bugs-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS5] Sony dévoile le firmware 25.05-11.60.00",
        "content": "La firme japonaise vient de dévoiler une nouvelle version de son firmware à destination de la PS5, bien entendu, ce sont tous les modèles qui sont concernés, qu'ils soient SLIM, FAT ou Pro. \n \n \n\n \n \n \nChangelog :\n \n- Amélioration des performances et de la stabilité du logiciel système.\n \n \nComme vous pouvez le découvrir, aucun changement digne de ce nom n'est rapporté par le changelog, ce qui laisse supposer que Sony a corrigé une ou des failles. Les mises à jour récentes ont surtout touchées à l'apparence de l'interface utilisateur, Sony étant toujours ravi de revenir à ses améliorations classiques en matière de stabilité. Il est peu probable que d'autres modifications soient apportées en coulisses avec cette mise à jour 25.05-11.60.00, mais n'en demeure pas moins suspecte. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208575/in-ps5-sony-devoile-le-firmware-2505-116000-1.png"
        }
    },
    "news_16": {
        "title": "[PSP] PPSSPP v1.19.3 disponible",
        "content": "Les développeurs en charge du meilleur émulation PSP, PPSSPP, viennent de dévoiler en cette mi-juillet une nouvelle version de leur solution. Entièrement écrit en C++, PPSSPP permet d'émuler des jeux  PSP pour les puces x86, x64 et ARM.\n \nL'émulateur PPSSPP multi-plateformes Android, Windows, iOS, Mac OSX, Blackberry, Maemo, Harmattan, Symbian, Pandora, Linux se met à jour en version V1.19.3. Premier émulateur de PSP pour Android, et d'autres plates-formes mobiles, qui fonctionne beaucoup plus rapidement que n'importe quel autre émulateur PSP sur Windows, Linux et MacOSX, PPSSPP vous permet d'exécuter en Full HD vos jeux PSP.\n \n \n \n\n \n \n \nCette nouvelle version 1.19.3 améliore la lecture audio des fichiers Atrac3+, l'un des formats les plus utilisés dans les jeux PSP, ce qui a conduit à un certain nombre de correctifs de compatibilité. Les fichiers audio Atrac3 (sans le « + ») générés par des applications externes aux jeux officiels n'étaient plus décodés correctement en raison d'un paquet initial défectueux qui n'était pas ignoré comme prévu.\n \nCe problème a eu un impact sur plusieurs modifications de jeux appréciées de la communauté, comme une version de Crazy Taxi avec la bande originale Dreamcast et certaines éditions modifiées de jeux de football qui avaient perdu la musique et les commentaires audio.\n \nLe bug a été corrigé et testé sur du matériel réel pour garantir son fonctionnement, mais d'autres bugs ont également été corrigés.\n \n \n \nTéléchargement : PPSSPP v1.19.3\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208569/in-psp-ppsspp-v1193-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[Switch/Switch2] Nintendo sort la mise à jour firmware 20.2.0",
        "content": "Nintendo a déployé la mise à jour 20.2.0 du système de la Switch. \n \n \n\n \n \nVoici les principaux changements :\n \nCorrections :\n \nRésolution d’un problème empêchant, dans certains cas, le transfert des paramètres de contrôle parental de la Nintendo Switch vers la Nintendo Switch 2 lors d’un transfert de console.\n \nAméliorations :\n \nAmélioration générale de la stabilité du système afin d’optimiser l’expérience utilisateur.\n \nClés et compatibilité :\n \nAucun nouveau jeu de clés (keys) n’a été généré jusqu’à présent. Les clés du firmware 20.0.0 permettent toujours de décompresser la version 20.2.0, et sont toujours les mêmes. \n \nPatches et homebrew :\n \nLes sigpatches sont quasiment inchangés, seul le composant NIM a été mis à jour et nécessite un ajustement des sigpatches. Le SYS-Patch fonctionne sans problème avec cette version.\n \nLa seule application affectée est NXThemeInstaller, qui nécessite de nouveaux correctifs. Les applications Bootlogos et PNGShot ne sont pas impactées.\n \nPour plus d’informations, vous pouvez consulter la page officielle de documentation :\n https://switchbrew.org/wiki/20.2.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208564/in-switch-nintendo-sort-la-mise-a-jour-firmware-2020-1.png"
        }
    },
    "news_18": {
        "title": "[Vita] Vita Moonlight v0.12.3 disponible (maj 15.07.25)",
        "content": "Les homebrews Vita sont de plus en plus mis à jour, il faut dire que les concours qui sont organisés incitent les développeurs a proposer de la nouveauté. C'est le cas de AorsiniYT qui vient de mettre à jour Vita Moonlight en version 0.12.1, et il n'a pas fait les choses à moitié, les changements sont assez conséquents et méritent qu'on s'attarde à cette version. \n \nIls ont été nombreux à travailler sur Vita Moonlight, xyzz & d3m3vilurr & ShadowPrince, mais c'est désormais AorsiniYT qui en assure le support permanent, et il le fait plutôt bien vu toutes les évolutions.\n \nLa semaine dernière, il avait proposé la v0.12.1 avec déjà de nombreux changements importants, et la version 0.12.2 améliore encore l'outil qui comme vous le savez permet de streamer votre pc sur l'écran de votre console. Pour rappel, ce logiciel est basé sur nVidia Gamestreams s'agissant d'un homebrew vous aurez besoin d'une PlayStation Vita avec HENkaku et VitaShell d'installés, d'un client FTP et surtout votre ordinateur devra être sous Windows et être équipé d'une carte graphique nVidia (minimum GTX 650).\n \n \n\n \n \n \nChangelog 0.12.2 : \n \nPrincipales caractéristiques :\n- Nouvelle option dans le menu des paramètres pour échanger les fonctions des boutons L1/R1 et L2/R2.\n- Sélection du type de manette de jeu : Choisissez entre la disposition du contrôleur Xbox ou PlayStation directement depuis le menu des paramètres.\n \nAméliorations de base :\n- La logique d’exclusivité d’échange et de mappage est désormais robuste et bidirectionnelle.\n- La sélection du type de contrôleur dans l'interface utilisateur enregistre, charge et met désormais à jour immédiatement.\n- Les boutons de la souris tactile et de l'écran tactile mettent à jour leur sous-nom dans le menu instantanément après le basculement.\n \nOptimisation du réseau :\n- Améliorations de l'interface utilisateur et de l'expérience utilisateur\n- Gestion robuste des champs hôtes manquants/vides\n- Journalisation de débogage et gestion des erreurs améliorées\n \nSous le capot :\n- Nombreuses corrections de bugs et améliorations de stabilité\n- Nettoyage et optimisation complets du code\n \nEdit 15.07.25\n \nTout est là : Vita Moonlight 0.12.3\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208492/in-vita-vita-moonlight-v0122-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] Al-Azif améliore encore et encore PS4HEN",
        "content": "\nLe développeur Al-Azif continue encore et toujours d'améliorer le support de PS4HEN qui, on peut le dire, est en constante évolution et développement. Il faut avouer que PS4HEN est clairement la solution ultime, et son support est clairement d'une importance capitale pour la scène PlayStation. \n \nAvec les récentes mises à jour et modifications proposées sur GitHub nous pouvons suivre les dernières évolutions qu'il a apporté, cela est passé par le support des firmwares 12.50 et 12.52 qui ont été ajoutés, mais désormais il a ajouté le support de firmwares plus anciens. \n \n \n\n \n \n \nIl vient en effet de rajouter le support des firmwares 4.74, 5.00, 5.01 et 5.03, ce qui est finalement assez original mais nécessaire pour ceux qui ne pourrait mettre à jour, jusqu'à récemment PS4HEN disposait d'un support du 5.05 au 12.02.\n \nA noter que pour l'heure les firmwares 12.50 et 12.52 ne disposent pas de kernel exploit, Lapse n'étant compatible que du firmware 1.01 au 12.02 sur PS4 et du firmware 1.00 au 10.01 sur PS5. \n \nComme d'habitude tout est là : PS4HEN\n \n \n \n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208491/in-ps4-al-azif-ameliore-encore-et-encore-ps4hen-1.jpg"
        }
    },
    "news_20": {
        "title": "[Vita] ReiHEN le concours Homebrews Vita offre 700 $ de prix",
        "content": " \nMoins de 2 années après le concours FuHEN, qui nous permis de découvrir VitaHot ou encore Purified, voilà qu'un nouveau concours Homebrew pour la PS Vita est organisé dans les prochains jours. \n \nCe concours, qui porte le nom de ReiHEN offrira jusqu'à 700 $ de prix, démarre le 21 Juillet 2025 et finira le 07 Octobre 2025 laissant le loisir de proposer les créations originales ou techniques. \n \nPlus précisément, ReiHEN, qui est porté par Zealous Chuck et 2Old4Gaming, deux vétérans de la scène homebrew sur Vita, propose 3 catégories avec des prix : jeu original, utilitaire et ports.\n \n \n\n \n \nReiHEN est synonyme de changement spirituel. La PS Vita de 2025 a atteint sa pleine maturité. Les outils utilisés pour le développement Homebrew sont à leur apogée. La PS Vita de 2025 n'a plus rien à prouver à personne. Elle l'a déjà fait. Elle est devenue un phénomène majeur sur console portable, et ce concours Homebrew est destiné à célébrer son caractère unique tout en offrant quelques récompenses aux développeurs qui travaillent dur. Vive la Vita !\n \n \n \n\n \n \n \nCatégories :\n \nJeu original – Créez un jeu original, soit à partir de zéro, soit avec un moteur de votre choix, par exemple GameMaker ou Unity…\nUtilitaire – Créez un utilitaire homebrew ou un plugin.\nPort – Portez une application ou un jeu depuis un autre système.\n \n \nTout est là et ça démarre dans 11 jours : ReiHEN\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208472/in-vita-reihen-le-concours-homebrews-vita-offre-700-de-prix-1.jpg"
        }
    }
}