{
    "news_1": {
        "title": "[Switch] NeXT v3.32 disponible",
        "content": "Le développeur Vampitech propose la version 3.32 de NeXT, pour rappel NeXT est un pack qui supporte les CFW que ce soit Atmosphere ou SX OS, de plus sa gestion des applications est largement simplifiée par une interface utilisateur très fonctionnelle. \n \nAvec la 3.32, Tesla Overlay a été retiré, et remplacé par la version améliorée d'UltraHand. Les sigpatches ont également été mis à jour pour améliorer la compatibilité et offrir une prise en charge élargie.\n \n \n\n \n \nUn bug empêchant les cheats de s'activer sur la console, et provoquant le redémarrage du système au début d'un jeu, a également été corrigé.\n \nVous pouvez appliquer la mise à jour en écrasant la version précédente de NeXT ou bien vous pouvez utiliser NeXT Updater. \n \nLe retrait de Tesla s'explique par le fat qu'il n'a pas été mis à jour depuis un moment. Ultrahand est super vitaminé et se spécialise dans l'overclocking sans laisser de côté les usages habituels, c'est du moins comme cela que justifie le développeur. \n \n \nTéléchargement : NeXT 3.32\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200880/in-switch-next-v332-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PS3] PS3HEN 3.3.1 Test build disponible",
        "content": "Le développeur esc0rtd3w propose à ceux qui disposent encore, et à très juste titre, d'une PlayStation 3, de tester une nouvelle build de PS3HEN proposé en 3.3.1. \n \n \n\n \n \nChangelog 3.3.1 :\n \nChangelog du plugin HEN :\n- Ajout d'une fonctionnalité de restauration HEN pour les nouveaux paquets qui supportent HEN après un reformatage du disque dur (merci @LuanTeles )\n- Renommage temporaire des fichiers du plugin d'amorçage, au lieu de les supprimer si un WMM est trouvé.\n- Ajout de la fonction create_default_dirs pour créer les dossiers standards s'ils manquent sur dev_hdd0 (merci @LuanTeles )\n- Ajout de la fonction DLOG pour la sortie vers usb000 (réservé aux développeurs)\n- Ajout du nettoyage des fichiers PSN (merci @LuanTeles )\n- Nettoyage de la fonction clear_web_cache_check\n- Mise à jour des fonctions pour les presets LED\n- Ajout de la fonction sysLv2FsRename\n- Mise à jour de la fonction set_build_type pour vérifier les ports USB 000 - 007 (pour le mode développeur)\n- Mise à jour de l'installateur d'urgence pour vérifier les ports USB 000 - 007 (HEN_UPD.pkg à partir de l'USB)\n \nChangelog dans le payload :\n- Mise à jour des décalages de cellFsMkdir_symbol\n- Ajout du symbole cellFsRename_symbol\n \nChangelog dans les ressources :\n- Ajout de nouveaux fichiers RAF de coldboot personnalisés pour release, debug, usb, et DEX (merci @Charles_n_town )\n- Utilisation du répertoire de jeu PS3XPLOIT pour ajouter le statut d'installation HEN à la base de données GAMEDATA, pour le format de disque dur survivant (caché du XMB) (merci @LuanTeles )\n- Correction de l'entrée seg_mcutility dans category_game.xml (Corrige un problème avec l'élément de menu carte mémoire virtuelle PS1/PS2 (merci @LuanTeles )\n \n \nTéléchargement : PS3HEN 3.3.1 Test build\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200854/in-ps3-ps3hen-331-test-build-disponible-1.png"
        }
    },
    "news_3": {
        "title": "[PS5] Le PlayStation Portal va bénéficier du cloud gaming (via une update)",
        "content": "Lancé il y a un peu plus d'un an, le PlayStation Portal a su convaincre, contrairement au PSVR2, et Sony souhaite le supporter, un produit ambitieux pour la marque, avec de nombreux retours positifs, et une communauté qui ne cesse de s'étendre, notamment aussi avec la version anniversaire.\n \n \n\n \n \nSony a dévoilé hier un tout nouveau firmware qui permet d'ajouter de nouvelles fonctionnalités au périphérique de la PS5 : \n \n- Réglage de la sortie audio du haut-parleur pour réduire le volume lorsque le niveau audio est réglé au minimum\n- Vous pourrez désormais régler les paramètres de votre appareil PlayStation Link à partir du menu Paramètres du portail PS, ce qui vous permettra d'optimiser le volume et le volume de l'effet local.\n \nDe plus, cette mise à jour inclue également une version bêta d'une nouvelle fonctionnalité demandée par de nombreux fans : la prise en charge du streaming cloud sur PS Portal. Une fois la mise à jour disponible, les membres PlayStation Plus Premium pourront participer à une version bêta du streaming cloud sur PS Portal, permettant de diffuser certains jeux PS5 du catalogue de jeux PlayStation Plus directement depuis les serveurs Sony, même sans console PS5. Bien entendu tout cela peut évoluer d'ici la version finale de cette Bêta. \n \n \n\n \nFonctionnalités disponibles pendant la bêta : \n \n- Diffusez certains jeux PS5 dans le catalogue de jeux PlayStation Plus\n-- Plus de 120 jeux PS5 du catalogue de jeux PS Plus, dont Dave the Diver, Ghost of Tsushima, Marvel's Spider-Man: Miles Morales, Monster Hunter Rise et Ratchet & Clank: Rift Apart, seront accessibles sur le PS Portal via le streaming cloud\n- Streaming jusqu'à 1080p/60fps\n- Fonctionnalités du contrôleur sans fil DualSense, notamment le retour haptique, les déclencheurs adaptatifs, les haut-parleurs, le pavé tactile (émulé sur l'écran tactile pour PS Portal) et le capteur de mouvement\n- Stockage cloud PlayStation Plus\n- Les données de sauvegarde et la progression du jeu peuvent être stockées jusqu'à 100 Go et seront automatiquement synchronisées avec votre console PS5, ce qui facilite le basculement entre le jeu local et le streaming, et entre plusieurs appareils.\n \nConcernant le hack du PlayStation Portal, tout s'est arrêté au firmware 2.06, mais en se dotant de fonctions de cloud gaming, la console est beaucoup plus intéressante. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200853/in-ps5-le-playstation-portal-beneficie-va-beneficier-du-cloud-gaming-via-une-update-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1200853/in-ps5-le-playstation-portal-beneficie-va-beneficier-du-cloud-gaming-via-une-update-1.png"
        }
    },
    "news_4": {
        "title": "[PS3] Evilnat 4.91.2 Beta 14 disponible avec ou sans réinstallation",
        "content": " \nLe développeur Aldostools propose à la scène PS3 un patch qui permet de passer de la version Beta 10 à Beta 13 du CFW Evilnat 4.91.2 directement en Beta 14 sans avoir à réinstaller le firmware. \n \nCela nécessite d'avoir activé /dev_blind sur votre PS3, mais cela permet de profiter des derniers avantages de la toute dernière Bêta du CFW Evilnat 4.91.2. Ce patch fonctionne avec la Bêta 10, Bêta 12, et Bêta 13.\n \n \n\n \n \n \nChangelog :\n \n- Téléchargement réduit (seulement 11.3MB)\n- Plus rapide à installer. Même résultat. \n- Plus sécurisé car le temps de réécriture dans dev_flash est réduit. \n \nTéléchargement : Patch Evilnat 4.91.2 Beta 14 (conversion de la Bêta 10, 12 ou 13) \n \n \nSi vous souhaitez repartir d'une installation complète, c'est tout à fait possible, Nathan Martin, plus connu sous le nom d'Evilnat propose son CFW complet. \n \nLa Bêta 14 du CFW Evilnat 4.91.2 est proposé en CEX, D-PEX, DEX et PEX comme d'habitude. Avec cette nouvelle Bêta 14, il a mis à jour quelques options. \n \nChangelog : \n \n - Mise à jour des options « Enable FTP » et « Disable FTP » de xai_plugin avec un serveur FTP plus récent\n- Ajout de l'option « Show BD Drive Information » dans [Basic Tools] dans xai_plugin (demandé par LuanTeles).\n \nTéléchargement : CFW Evilnat 4.91.2 Bêta 14\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200818/in-ps3-evilnat-4912-beta-14-disponible-avec-ou-sans-reinstallation-1.png"
        }
    },
    "news_5": {
        "title": "[PS4] Le chapitre 2 et 3 d'Hellblade 2 sont là",
        "content": "Le développeur Lapy vient d'annoncer sur X l'arrivée des chapitre 2 et chapitre 3 de son \" adaptation \" de Senua's Saga : Hellblade II sur la PS4.\n \nComme vous le savez désormais il ne s'agit pas directement du jeu 3D, sorti uniquement sur Xbox Series X, mais plutôt de vidéos interactives. Ce sont des images filmées de gameplay prenant forme de QTE. \n \n \n\n \n \nAvec ces deux nouveaux chapitres, Lapy a introduit de nouvelles fonctionnalités :\n \nChapitre 2 : Ajout de nouvelles mécaniques de combat, comme l'utilisation du miroir, qui enrichit l'expérience.\n \nChapitre 3 : Introduction de mécaniques exploratoires, comme l'utilisation du bouton rond permettant plus d'interactions. \n \n \n\n \n \nLa résolution est désormais de 2K, améliorant l'expérience utilisateur et l'immersion. A noter qu'avec cette nouvelle version les sauvegardes ne sont pas compatibles avec l'ancienne version. Pour pouvoir intégrer les nouvelles fonctionnalités, les vidéos ont été entièrement remises en ligne. Il semblerait qu'une solution de contournement pour PS5 a été trouvé par le développeur mais c'est une autre histoire. \n \nPour cette occasion le développeur dévoile la version 1.01 de HB2 qui intègre donc les chapitres 2 et 3. \n \n \n \nTout est là : HB 2 1.01\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200815/in-ps4-le-chapitre-2-et-3-dhellblade-2-sont-la-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1200815/in-ps4-le-chapitre-2-et-3-dhellblade-2-sont-la-2.jpg"
        }
    },
    "news_6": {
        "title": "[PS5] L'émulation PS5 toujours sur les rails",
        "content": "Le développeur DH continue de proposer des commits sur le développement initial de ce qui serait le premier émulateur PS5. Nous sommes encore à plusieurs années de pouvoir profiter d'une telle émulation, ne serait que par la nécessité de disposer d'une configuration PC puissante pour pouvoir faire tourner les jeux. \n \nMais le code continue d'évoluer et DH ne cache pas son travail, il a effet annoncé que quelques parties du code de l'émulateur fonctionnent, mais pour les premiers samples graphiques et le mode sans échec ce n'est pas encore le cas. \n \nIl informe que printf fonctionne comme attendu, que la libkernel également, et que le chargement des librairies de sysmodules importés tout autant. \n \n \n\n \n \n \nDepuis quelques jours, le développeur a fait pas mal évoluer son émulateur RPCSX en y rajoutant de nombreux supports, mais qui pour pour la plupart n'arrive pas à tourner correctement (et débouche sur une erreur), mais nous pouvons voir les efforts que DH effectue ici. \n \n \n \n\n \n \n \nA noter que de nombreux sites tentent de faire croire que des émulateurs PS5 sont fonctionnels, mais à date aucun d'entre eux ne l'est, et pour la plupart ils ne sont mêmes pas légitimes. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200789/in-ps5-lemulation-ps5-toujours-sur-les-rails-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1200789/in-ps5-lemulation-ps5-toujours-sur-les-rails-2.png"
        }
    },
    "news_7": {
        "title": "[DS/2DS/3DS] TWiLight Menu++, nds-bootstrap et GodMode9i sont mis à jour",
        "content": "Quelques mises à jour bien utiles pour la Nintendo 3DS et Nintendo DS, TWiLight Menu++, nds-bootstrap et GodMode9i ont été mis à jour par RocketRobz. \n \nAu programme, la version v27.12.0 de TWiLight Menu++ ainsi que la version 2.2.0 de nds-bootstrap, et au passage la version 3.7.0 de GodMode9i. \n \n \n \n\n \n \n \n \nChangelog TWiLight Menu++ 27.12.0 : \n \n- La N-Card est désormais prise en charge par la Slot-1 microSD accessfonctionnalité !\n- Solution de contournement ajoutée pour que homebrew ne prenne en charge que les pilotes DLDI jusqu'à 16 Ko, fonctionnant désormais avec les pilotes DLDI 32 Ko ! Attention cela n'a pas été testé avec de l'homebrew buildé avec libnds v2.\n- Thème DSi : le lancement d’un jeu lancera désormais immédiatement l’animation de lancement comme dans le menu DSi d’origine !\n- Obtenu en exécutant la vérification des binaires DSi et la vérification AP-fix après l'apparition ou la modification du texte de la bannière.\n- Ajout de la version de FastVideoDSPlayer qui prend en charge les pilotes DLDI 32 Ko.\n- Ajout d'écrans de classification ESRB pour Honeycomb Beat et Puppy Palace .\n \nCorrection de bug :\nMoi et@lifehackerhansol: Drivers DLDI corrigés créés avec THUMB (ainsi que les pilotes décompressés à partir de LZ77) empêchant TWLMenu++ de passer main.srldr(écrans de démarrage DS(i) et/ou TWLMenu++).\n \n \nTéléchargement : TWiLight Menu++ v27.12.0\n \n \n \nChangelog 2.2.0 : \n \n- Les correctifs/patchs AP sont maintenant inclus au lieu d'avoir à compter sur un AP-fixe externe de TWLMenu++ !\n- Les patchs AP fournis par l'utilisateur sont maintenant lus depuis sd:/_nds/nds-bootstrap/apFix/.\n- Les pilotes DLDI de 32Ko (comme pour les cartes N) sont maintenant utilisables en dehors du mode B4DS !\n- Les jeux DSi-Enhanced/Exclusive/Ware ne fonctionnent pas (encore) en mode DSi (même chose pour les pilotes 16KB). Pour jouer à certains jeux DSiWare, vous devez activer le mode B4DS.\n- Mode B4DS : Pour éviter d'avoir à rétrécir le tas pour Sonic Classic Collection (et pour éviter que le rétrécissement du tas ne cause des problèmes pour ce jeu), le pilote DLDI a été déplacé vers ITCM, ceci s'applique aux pilotes DLDI <= 16KB.\n \nCorrections de bugs :\n- Correction de Puppy Palace qui ne démarrait pas sans réinitialiser le jeu !\n- Correction d'un bug qui provoquait un crash lors du préchargement de ROMs DSi-Enhanced de 28MB (ex. Bejeweled Twist) dans la RAM sur les consoles 3DS en mode DS.\n- Mode B4DS : Correction de Koukou Eitango : Kiho 400 Go Master ne démarrant pas.\n- Mode B4DS : Le cache des données/instructions est maintenant vidé après chaque lecture de carte pour Pokemon HGSS.\n- Puisque cela a déjà été essayé (iirc), cela peut ou non corriger les crashs aléatoires dans ces jeux.\n \nTéléchargement : nds-bootstrap 2.2.0\n \n \n \n\n \n \n \nChangelog 3.7.0 : \n \n- Extension de l'espace du pilote DLDI à 32KB en utilisant libnds32 (par @lifehackerhansol) !\n@ApacheThunder : Ajout d'un support pour le montage de la N-Card et des pilotes DLDI R4 originaux lorsqu'ils sont lancés depuis la DSi/3DS NAND ou la carte SD !\n- Ajout d'une solution pour que le homebrew ne prenne en charge que les pilotes DLDI de 16 Ko, il fonctionne maintenant avec les pilotes DLDI de 32 Ko ! Attention cela n'a pas été testé avec les homebrew buildés avec libnds v2.\n \nTéléchargement : GodMode9i 3.7.0\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200766/in-ds2ds3ds-twilight-menu-nds-bootstrap-et-godmode9i-sont-mis-a-jour-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1200766/in-ds2ds3ds-twilight-menu-nds-bootstrap-et-godmode9i-sont-mis-a-jour-2.png"
        }
    },
    "news_8": {
        "title": "[Switch] Nintendo traque les publications Reddit",
        "content": " \nLe site gamefile.news rapporte que Nintendo a retrouvé un pirate de Switch via des publications sur Reddit, et aussi parce qu'il proposait des prestations de réparations. \n \nC'est au tour de James \"Archbox\" Williams, un américain résidant en Arizona, d'être poursuivi par les avocats de Nintendo, pour avoir vendu des copies pirates de jeux Switch, pour avoir violé des droits d'auteur et de licences, et pour avoir proposer certains services de réparations contre rémunération. \n \nLa plainte fait état que l'enquête sur les magasins piratent les droits d'auteur, proposent des jeux vidéos pirates en ligne, et ainsi l'un des protagonistes en question, Archbox, qui apparait également comme un modérateur de r/SwitchPirates, a créé plusieurs sites, et comptes Nintendo associés à des adresses email liés à des prestations de réparation. \n \n \n\n \n \nDe plus, il profitait du service SAV de Nintendo pour faire réparer quelques Switchs, comme on pouvait s'y attendre, des mises en demeure ont suivi, dont une deux jours seulement après que Nintendo lui ait envoyé l'un de ses articles réparés. Les boutiques pirates avec lesquelles Archbox aurait été impliqué incluent Jack-in-the-Shop, Turtle in the Shop et NekoDrive, qui ont toutes fermé à la suite d'une mise en demeure envoyée par Nintendo en mars dernier. \n \nNintendo explique qu'Archbox a contribué à faire grandir une communauté de pas moins de 190 000 membres sur Reddit, et bien entendu le défendeur a publié des milliers de commentaires et de messages encourageant le piratage depuis plus de 5 ans. \n \n \n\n \n \nComme souvent, le défendeur ne s'est pas bien défendu, Nintendo dispose désormais d'un jugement par défaut en sa faveur après que Williams n'a pas réussi à plaider sa cause devant le tribunal à temps.\n \n \nTout est là : gamefile.news\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200744/in-switch-nintendo-traque-les-publications-reddit-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1200744/in-switch-nintendo-traque-les-publications-reddit-2.png"
        }
    },
    "news_9": {
        "title": "[PS4] Apollo Save Tool PS4 v1.7.0 disponible",
        "content": " \nLe développeur Damian Parrino propose une nouvelle version de son outil Apollo Save Tool pour la PS4, il s'agit de la version v1.7.0 qui intègre désormais pleinement la prise en charge de la gestion de la carte mémoire virtuelle PS1, y compris les fonctionnalités de liste de sauvegarde, d'importation, d'exportation et de suppression des sauvegardes des jeux PS1. Comme vous le savez Apollo Save Tool est un superbe gestionnaire de sauvegardes qui devrait être livré par défaut avec toutes les consoles Sony tellement il est efficace et simple d'utilisation. Ce serait vraiment dommage de se priver de son utilisation si vous disposez d'une console récente Sony. \n \n \n\n \n \nAu programme de cette nouvelle version PS4, le support de nombreux formats d'extension VMC et une correction sur le moteur de patch d'Apollo. \n \n \nChangelog :\n \nAjout :\n- Gestion des images de la carte mémoire virtuelle PS1 (VMC)\n- Prend en charge les formats .VM1 et les formats externes (.MCR, .VMP, .BIN, .VMC, .GME, .VGS, .SRM, .MCD)\n- Liste, importation, exportation et suppression des sauvegardes PS1 à l'intérieur des images VMC\n- Importation - Formats pris en charge : .MCS, .PSV, .PSX, .PS1, .MCB, .PDA\n- Exportation - Formats pris en charge : .MCS, .PSV, .PSX\n- Online DB : ajout d'une liste de sauvegardes PS1\n \nCorrection :\n- Mise à jour du moteur de patch Apollo vers la version 1.1.2\n- Correction du bug de recherche du code SW lorsque les octets ne sont pas trouvés\n \n \n \nTéléchargement : Apollo Save Tool v1.7.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200743/in-ps4-apollo-save-tool-ps4-v170-disponible-1.png"
        }
    },
    "news_10": {
        "title": "[Vita] VitaDock Plus v2.6 disponible",
        "content": "Voilà une mise à jour de VitaDock Plus qui porte la numérotation 2.6, VitaDock Plus n'avait pas été mis à jour depuis Juin 2023 donc cet update est plutôt bienvenue. \n \nPetit retour en arrière, VitaDock Plus est un dock créé sous forme de distribution Linux pour Raspberry Pi utilisé pour la création d'un dock PlayStation Vita pour par exemple s'en servir comme output d'une TV.\n \n \n\n \n\n \n \n \nCaractéristiques : \n \n- Accélération matérielle sur tout le matériel pris en charge\n- Faible latence d'entrée et couleurs précises\n- Mise à l'échelle de Lanczos jusqu'à la résolution de sortie souhaitée\n- Afficher le contrôle de la puissance sur tous les modèles\n- Menu pour basculer entre les modes 960x544 à 30 FPS, 864x488 à 60 FPS et contrôlé par plug-in\n- Thème VitaDock+ avec écran de démarrage fantaisie et notifications pour un retour visuel lors de la modification des paramètres\n- Fonctionne sur la plupart des modèles Raspberry Pi avec une seule image\n- S'adapte aux cartes SD de 4 Go\n- Injection RCM de Nintendo Switch\n- Audio via Bluetooth ou câble AUX\n- Configuration sans tête à l'aide de broches GPIO\n- Fonctionnalités expérimentales intéressantes (voir ci-dessous)\n \n \nChangelog : \n \n- Stabilité/latence du Bluetooth améliorée par l'optimisation des scripts python en arrière-plan avec une utilisation élevée du CPU\n- Le Pi fonctionne désormais plus froidement lorsqu'il est en veille\n- Correction de l'outil de configuration AUX qui ne veut pas se lancer parfois\n- Correction des erreurs SAP Bluetooth\n- Le lecteur n'est plus toujours en haut de l'écran, ce qui permet d'interagir plus facilement avec les autres menus lorsque le flux est en cours d'exécution.\n \n \nTéléchargement : VitaDock Plus v2.6\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200285/in-vita-vitadock-plus-v26-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1200285/in-vita-vitadock-plus-v26-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[XB/XB360] Disponibilité de FATXplorer v3.0 Beta 33",
        "content": "Une mise à jour de FATXplorer vient de paraitre, il s'agit de la version 3.0 Beta 33, pour rappel, il s'agit d'un outil qui permet d'étendre la capacité de stockage sur la console Xbox originale, et sur la Xbox 360, notamment par la prise en charge de disques durs internes jusqu'à 16 To. Développé il y a plus de 10 ans, il est devenu plus difficile à utiliser en raison de problèmes de compatibilité avec les chipsets modernes. Les disques durs OEM pour Xbox 360 ne sont également plus en production. Comme ces disques OEM commencent à tomber en panne, le besoin d'un outil pour rendre les disques compatibles s'est accru.\n \n \n\n \n \n \nChangelog v3.0.0.25946 (Beta 33)\n \nPublié le : 13 novembre 2024\n- Créateur de disque dur Xbox 360 : Correction d'un bug où le numéro de série était affiché de manière incorrecte dans certains cas (un caractère inattendu à la fin).\n- Amélioration du message concernant les noms de fichiers invalides afin de préciser qu'il ne s'agit pas d'un bug et que la seule solution consiste à renommer.\n- Correction d'un problème rare où la détection de l'appareil se terminait prématurément sur certains systèmes.\n- Un nouveau menu « Options spéciales » est disponible lors du chargement des appareils :\n- Mode de récupération : Il ne s'agit pas d'une nouvelle fonctionnalité, mais d'une partie cachée du service de récupération du disque dur de la Xbox 360. Ce service a été interrompu en raison d'une baisse de la demande et la fonction est désormais disponible en libre-service pour tous les utilisateurs sous licence. Ce qu'elle fait : Lorsque votre disque commence à tomber en panne et ne peut plus être chargé, le mode de récupération peut tenter de contourner les dommages afin que vous puissiez récupérer vos fichiers.\n- Priorité à F-takes-all : Développé en réponse aux demandes d'assistance concernant le fait que FATXplorer n'affichait pas les fichiers de la partition F. Certains BIOS de Xbox d'origine sont configurés pour utiliser l'espace disque supplémentaire restant pour une partition F. Dans certains cas, la table de partition n'est pas écrite. FATXplorer ne peut pas détecter cette condition. Activez donc cette option si votre Xbox affiche des fichiers dans la partition F, mais que FATXplorer ne le fait pas.\n- Désactiver le cache du disque : Indique au disque de désactiver ses systèmes de cache en lecture et en écriture.\n- La date d'expiration est désormais fixée au 12 mai 2025.\n \n \nTéléchargement : FATXplorer v3.0 Beta 33\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200282/in-xbxb360-disponibilite-de-fatxplorer-v30-beta-33-1.png"
        }
    },
    "news_12": {
        "title": "[PS4/PS5] Le développeur Zecoxao en difficulté",
        "content": "Le développeur Zecoxao ne cache plus être dans la tourmente, il vient de laisser sur Twitter quelques messages qui ne laisse plus d'ombre sur les difficultés qu'il traverse. Ainsi il précise qu'il envisage de quitter la scène. \n \nActuellement au chômage, il a dépensé ses économies pour tenter d'aider au développement des scènes PS4 et PS5, la preuve en est les kits de test livrés à flat_z, SpecterDev, et LightningMods.\n \nIl annonce vouloir rester jusqu'à ce qu'il ne puisse plus subvenir à ses besoins en aidant d'autres personnes. Cela pourrait prendre des jours, des mois ou des années, il pourrait même rester indéfiniment, mais il s'occupe actuellement de ses proches, notamment de sa mère jusqu'à ce que son père prenne sa retraite, ce qui devrait se produire dans deux ans. Une fois que cela se produira, il prendra une décision définitive. \n \n\n \n \n \n \nBref on le voit la situation est délicate, les dons se multiplient depuis ses 3 messages qui marqueront l'histoire, Zecoxao est un excellent développeur, nous lui apportons tout notre soutien. \n \nUn petit ko-fi est possible ici pour le soutenir : https://ko-fi.com/zecoxao\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200248/in-ps4ps5-le-developpeur-zecoxao-en-difficulte-1.png"
        }
    },
    "news_13": {
        "title": "[WiiU] Cemu 2.4 Pre-release disponible",
        "content": "Le développement de Cemu, le meilleur émulateur de Wii U, continue, voici que débarque la version 2.4 Pre-release, elle apporte pas mal de nouveautés comme l'ajout de l'émulation des Toypad de Lego Dimensions, la correction d'un bug lors de la lecture des titres .app/.wud/.wux, l'enregistrement des erreurs dans le fichier log.txt, la révision du dialogue d'erreur de la Wii U ou encore la correction d'un bug dans HLE. Tout en détail dans le changelog ci-dessous. \n \n \n \n\n \n \nChangelog :\n \n- Ajout du Toypad Dimensions émulé\n- Correction d'un bug de corruption pouvant survenir lors de la lecture de titres au format .app/.wud/.wux dans de rares circonstances.\n- Cemu validera désormais toutes les lectures de titres au format .app/.wud/.wux et enregistrera toutes les erreurs détectées dans le fichier log.txt. À l'avenir, nous afficherons également ces erreurs à l'écran.\n- Nous avons retravaillé l'implémentation du dialogue d'erreur de la Wii U (ErrEula) pour une meilleure précision. Cela devrait permettre de corriger le bug qui faisait que le dialogue d'erreur était parfois ininterrompu dans certains jeux.\n- Correction d'un bug dans l'implémentation HLE de proc_ui.ProcUIRegisterCallback/ProcUIRegisterBackgroundCallback.\n \n \nTéléchargement : Cemu 2.4 Pre-release\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200247/in-wiiu-cemu-24-pre-release-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[3DS] Universal Updater v3.2.7 disponible",
        "content": "Le développeur lifehackerhansol dévoile une nouvelle version d'Universal Updater qui est proposé en v3.2.7, le logiciel n'avait pas été mis à jour depuis plus de 2 ans. Universal Updater est l'équivalent en beaucoup plus simple à utiliser de MultiUpdater, il en reprend d'ailleurs les bases de fonctionnement, mais en plus accessible. Contrairement à ce dernier, vous n'avez pas à créer votre propre configuration, de simples scripts peuvent être téléchargés avec lesquels Luma3DS ou NTR peuvent être mis à jour en appuyant sur un bouton.\n \nL'objectif de cette version 3.2.7 proposée par lifehackerhansol, et non pas Epicpkmn11, est de corriger un crash lors de l'installation d'une CIA sans qu'une base de données de titres ne soit générée au préalable.\n \n \n\n \n \n \nCela fait 2 ans qu'il n'y avait pas de modification du code, il n'y a pas eu beaucoup de changements nécessaires depuis, mais la correction d'un bug était suffisamment importante pour faire une autre version, tout en intégrant les modifications de la toolchain. \n \n \nTéléchargement : Universal Updater v3.2.7\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200218/in-3ds-universal-updater-v327-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[3DS/Switch/NDS] ftpd pro v3.2.0 disponible",
        "content": "Le développeur mtheall propose une nouvelle version de ftpd pro qui passe en v3.2.0, il y avait plus de 3 ans que le programme n'avait pas été mis à jour !\n \nPour rappel, Ftpd est disponible en NDS (pour la DS), CIA et 3DSX (pour la 3DS), et en NRO (pour la Switch). L'application peut être utile pour transférer des fichiers de votre PC ou de votre smartphone sur la carte SD et aussi inversement. \n \n \n\n \n \n \nChangelog 3.2.0 : \n \n- Prise en charge du wifi de la DSi avec la mise à jour vers libnds-2.0.0\n- support mDNS\n- Prise en charge de glob\n- Effet stéréoscopique ImGui sur 3DS\n- Suppression de la version de la CIA pour la 3DS\n- Compilation avec CMake\n- Mise à jour vers Dear ImGui v1.91.4  ( https://github.com/ocornut/imgui/releases/tag/v1.91.4 ) \n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur\n \n \nTéléchargement : ftpd pro v3.2.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200208/in-3dsswitchnds-ftpd-pro-v320-disponible-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS4/PS5] PS Multi Tools v14.5.5 disponible",
        "content": "Le développeur SvenGDK propose une nouvelle version de son outil multifonction PS Multi Tools qui est désormais affublé de la numérotation 14.5.5. \n \nComme vous le savez probablement cet utilitaire s'adresse à tout ceux qui dispose d'une console Sony, de la PSP à la PS5 en passant par toutes les générations. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \nComme pour la version précédente, la 14.5.5 n'a pas été compilée, vous allez devoir le faire vous même, sachant que les modifications portent sur la PS4 et la PS5 avec des changements nombreux pour cette dernière. \n \n \n\n \n \n \nChangelog PS4 :\n \n- Ajout de l'exploit PPPwn manquant dans le menu 'Exploits'.\n- Mise à jour du téléchargement : Apollo Save Tool v1.4.0 -> v1.6.0\n- Mise à jour du téléchargement : GoldHEN v2.3 -> v2.4b18\n \nChangelog PS5 :\n \n- Mise à jour du téléchargement : BD-JB JAR Loader v2.0.0 -> v2.1.0\n- Téléchargement mis à jour : ELFLdr par john-tornblom v0.15 -> v0.16\n- Téléchargement mis à jour : FTPSrv par john-tornblom v0.10.2 -> v0.11\n- Téléchargement mis à jour : KLogSrv de john-tornblom v0.4.1 -> v0.5\n- Mise à jour du téléchargement : SHSrv de john-tornblom v0.10.1 -> v0.12\n- Mise à jour du téléchargement : WebSrv par john-tornblom v0.11 -> v0.14\n- Ajout d'un nouveau téléchargement : Byepervisor JAR payload v1.0\n- Ajout d'un nouveau téléchargement : Kerneldump JAR payload v1.0\n- Correction d'un problème dans l'outil 'Simple Shortcut PKG Creator' qui empêchait de définir la version requise du système\n- Correction d'un problème dans l'outil 'Simple Shortcut PKG Creator' qui empêchait de définir 'Enable HTTP cache' & 'TwinTurbo' dans certains scénarios\n- Correction d'un crash possible dans le « PKG Reader » lors de l'ouverture d'un fichier .pkg\n \n \n \nTout est là sachant que la version 14.5 (la dernière build compilée) se mettra à jour si vous demandez une update :  PS-Multi-Tools 14.5.5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200206/in-ps4ps5-ps-multi-tools-v1455-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[Switch] Nintendo poursuit un streamer plutôt provoquant",
        "content": " \nNous apprenons via le site 404media.co que Nintendo vient d'entamer des poursuites contre un streamer pour diffusion et exploitation de logiciels piratés. \n \nNintendo a intenté une action en justice contre un streamer appelé EveryGameGuru, qu'elle accuse d'avoir diffusé des gameplays de jeux piratés avant même leur sortie et d'avoir fourni un accès à des copies de ROM illégales et à des outils de piratage. \n \nNintendo explique dans sa plainte que le stremer jouait à des jeux en direct sur YouTube, Discord, Twitch, TikTok, Trovo, Kick, Vaughn, Dlive, Picarto, Nimo, Facebook et Loco, avec très peu de commentaires à la clé, mais big N a identifié qu'au moins 10 jeux ont été montré et diffusé avant leur date de sortie officielle. \n \n \n \n\n \n \nLorsque cela a touché Mario & Luigi: Brothership en Octobre dernier, s'en était trop pour Nintendo puisque le jeu sortait officiellement le 07 novembre 2024. Bien entendu, Nintendo a d'abord demandé le retrait des vidéos, mais le streamer a continué a diffusé, narguant même Nintendo en disant qu'il avait « un millier de chaînes jetables » et qu'il « pouvait faire ça toute la journée ».\n \nL'entreprise réclame 150 000 dollars de dommages et intérêts pour chaque violation de ses droits d'auteur. Cela pourrait se chiffrer en millions, puisque Nintendo accuse le défendeur d'avoir diffusé illégalement au moins 10 jeux à au moins 50 reprises.\n \n \nTout est là : 404media.co\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200090/in-switch-nintendo-poursuit-un-streamer-plutot-provoquant-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] PS5 PKG Reader v1 de SvenGDK disponible",
        "content": "Le développeur SvenGDK propose un nouvel utilitaire sous forme d'homebrew à destination de la PS5.\n \nIl s'agit de PS5 PKG Reader qui est libéré en v1 et qui permet de lire les fichiers PKG PS5 provenant des PS5 retail ou debug. \n \n \n\n \n \nCe logiciel permet également d'extraire un certain nombre de fichiers (icon0.png, pic0.png, param.json, package-configuration.xml s'ils existent). \n \n \n \nTéléchargement : PS5PKGReader v1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200030/in-ps5-ps5-pkg-reader-v1-de-svengdk-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS3] Evilnat 4.91.2 Beta 13 disponible",
        "content": "Le développeur Nathan Martin, connu sous le pseudo d'Evilnat, propose une nouvelle version de son CFW, l'Evilnat 4.91.2 dans sa version Beta 13.\n \n \n\n \n\n \n \nDans cette nouvelle version le développeur nous informe qu'il a mis en place quelques changements. \n \n- Mise à jour des émulateurs PS1 et PS2\n- Ajout de l'option « Afficher les informations PS3 » (demandée par Luanteles)\n- L'option « Cobra Information » affiche désormais le stage2 actuelle et le syscall 8 (demandé par aldostools)\n \n \n \nTéléchargement : Evilnat 4.91.2 [BETA 13]\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200021/in-ps3-evilnat-4912-beta-13-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1200021/in-ps3-evilnat-4912-beta-13-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS4] Senua's Saga Hellblade II proposé par Lapy sur PS4 en homebrew",
        "content": "Le développeur Lapy propose une sorte de démo assez spéciale, il s'agit du portage d'une vidéo de gameplay de Senua's Saga Hellblade II tournant sur PS4. Il ne s'agit pas réellement d'un jeu, ni même d'une démo, mais plutot d'une séquence de gameplay filmée entrelacée de QTE. \n \nLes séquences de QTE, où le joueur doit appuyer sur certaines touches dans un temps limité implique une sorte d'interaction, assez limité mais qui permet l'immersion. \n \n \n\n \n\n \n\n \nIl a rajouté quelques défis et un menu pour donner l'impression d'être dans un jeu. \n \n \n \nTout est là : Twitter.com /  LAPY10025\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1199978/in-ps4-senuas-saga-hellblade-ii-propose-par-lapy-sur-ps4-en-homebrew-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1199978/in-ps4-senuas-saga-hellblade-ii-propose-par-lapy-sur-ps4-en-homebrew-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1199978/in-ps4-senuas-saga-hellblade-ii-propose-par-lapy-sur-ps4-en-homebrew-3.jpg"
        }
    }
}