{
    "news_1": {
        "title": "[Multi] RetroArch v1.17.0 disponible",
        "content": "La Team LibRetro dévoile enfin une nouvelle version de RetroArch, les nouveautés sont nombreuses, il faut dire que les nouvelles versions sont de plus en plus espacées dans le temps. \n \nLa version précédente, la v1.16.0, a été proposée en Septembre dernier. \n \n \n\n \n \nIl y a plus de changements que ceux mentionnés ici, mais par souci de concision, voici les changements depuis la 1.16.0.\n \n \nACCESSIBILITÉ/TTS : correction de la langue cible et gestion manquante du langage espeak sous Linux\nIA : service d'IA retravaillé : augmentation des performances, traduction automatique, placement des sous-titres configurable, etc.\nAPPLE : Correction d'un crash de WebDAV avec l'authentification Digest (Cloud Sync)\nAPPLE : correctifs de synchronisation dans le cloud – ignorez les fichiers .DS_Store et resynchronisez au premier plan de l'application\nAPPLE : Ne recréez pas les répertoires par défaut\nAPPLE : Afficher correctement les informations Git\nAUDIO/SYNC : gérez mieux le réglage de l'inclinaison Hz pour des taux de rafraîchissement élevés (BFI, intervalle d'échange)\nAUDIO/MIXER : conditions séparées pour ffmpeg/mpv et audiomixer\nAUDIO/WASAPI : fonctionnement du tampon partagé retravaillé pour plus de flexibilité, correction de la boucle du dernier tampon en mode exclusif lors de l'entrée dans le menu\nCONFIG/OVERRIDES : correction du paramètre savefile_directory dans le fichier de remplacement\nCONFIG : forcer les paramètres régionaux fixes pour les nombres\nCHEEVOS : Mise à niveau vers rcheevos 11.0\nCHEEVOS : utilisez rc_client pour la gestion de l'état\nCHEEVOS : ne suivez pas les modifications du disque lorsque les succès sont désactivés\nCHEEVOS : réinitialiser le tampon de rembobinage après le chargement du jeu avec les succès\nCHEEVOS : informer l'utilisateur lorsque le serveur est inaccessible\nCHEEVOS : Correction d'un crash lors du premier chargement du jeu avec des succès avec une vidéo en fil de discussion\nEMSCRIPTEN : Augmenter la taille des fragments pour les lectures/écritures\nEMSCRIPTEN : modularisez le JavaScript et nettoyez la version Web\nEMSCRIPTEN : préfixez le nom du noyau avec libretro_ pour les exportations\nEMSCRIPTEN : remplacez les tirets par des traits de soulignement dans les noms de noyau (correctif pour les noyaux Vitaquake)\nEMSCRIPTEN : Utiliser ZipFS pour le bundle d'actifs du lecteur Web\nEMSCRIPTEN : modifiez le débit audio par défaut à 44 100\nIOS : Correction du widget sur IOS17\nIOS : Quitter au lieu de planter sur certaines erreurs\nIOS : correction de ios-vulkan-ppsspp\nIOS : activer la prise en charge HDR sur IOS\nIOS : Ajout d'une option pour désactiver le respect du mode silencieux\nIOS : autoriser l'ignorance de la zone de sécurité (plein écran sur encoche)\nIOS : par défaut, la manette de jeu n'est pas activée\nIOS : correction de XRGB8888 dans le pilote GL\nIOS : autoriser la modification de l'icône de l'application\nIOS : ajouter HAVE_ACCESSIBILITY aux versions iOS\nIOS/TVOS : créer un contexte GL en tant que GLES3 pour résoudre certains problèmes de performances de rendu\nINPUT : correction de l'entrée fantôme lors de la configuration de RETROK_UNKNOWN\nINPUT : 'Bind Hold' par défaut sur 0 pour éviter les problèmes avec les contrôleurs qui ne reposent pas à l'état nul\nENTRÉE : Ajouter un paramètre pour autoriser les directions du turbo D-Pad\nINPUT : Ne pas enregistrer les boutons de la souris dans la configuration automatique\nINPUT/MENU : ajout d'une option pour fusionner les types de périphériques « Hotkey Enable »\nINPUT/mFI : désactivez secondaire_joypad pour éviter les problèmes avec les contrôleurs détectés à la fois comme HID et mFI\nINPUT/UDEV : remplacez la détection d'événements par une interrogation dans udev_joypad\nINPUT/WAYLAND : utilisez un mouvement non accéléré du pointeur pour éviter la zone morte de la souris\nLAKKA : Ajouter de nouvelles options de menu pour Switch (overclock, CEC, BT ERTM)\nLIBRETRO : Ajouter une commande d'environnement pour obtenir le chemin de la playlist\nLIBRETRO/NETPACKET : changer le numéro d'appel de l'environnement de 76 à 78 (retirer le 76 car il n'a jamais été utilisé par aucun noyau). Simplifiez les diffusions en supprimant l'option d'envoi à tous les clients sauf un, utilisez plutôt une constante RETRO_NETPACKET_BROADCAST explicite. Séparez le vidage explicite et l’interrogation du paquet entrant en deux opérations. Activez un noyau pour spécifier une chaîne de version de protocole qui peut être utilisée à la place de la version du noyau pour déterminer la compatibilité entre deux lecteurs. Enregistrez et notifiez un message séparé en cas de non-concordance de contenu CRC lors de l'utilisation de cette interface pour indiquer qu'elle est moins grave.\nMENU : Correction de la navigation dans le menu avec le stick analogique (1.16.0.1)\nMENU : Ajouter une option pour rechercher des images miniatures par nom de fichier rom de playlist (1.16.0.2)\nMENU : ne traite pas les événements de menu pendant le vidage de l'entrée (1.16.0.2)\nMENU : Empêcher de passer à la liaison suivante en cas de liaison simple (1.16.0.3)\nMENU : Correction des faux positifs dans le menu de l'écran tactile en cas de chevauchement\nMENU : Trier les playlists en ignorant l'extension (La Playstation 2 devrait venir après la Playstation)\nMENU : Traiter le dossier Informations sur le volume système comme étant masqué sur toutes les plates-formes\nMENU : Ajouter une option de langue biélorusse\nMENU : correction du comportement des miniatures de l'état de sauvegarde lors du retour à la liste de lecture alors que le contenu est toujours en cours d'exécution\nMENU : Correction de la longueur du widget renvoyé à la ligne\nMENU : Ajouter un texte d'aide aux pilotes du contrôleur\nMENU : Correction de l'option Quitter lors de la fermeture du contenu\nMENU : correction des vignettes dans l'historique pour le contenu chargé via Charger le contenu\nMENU : correspondance flexible des vignettes (nom de la ROM – nom de la base de données – nom court)\nMENU : Supprimer le téléchargeur de pack de vignettes hérité\nMENU/GLUI : Corrections des icônes\nMENU/OZONE : correctifs liés aux vignettes (barre de vignettes manquante, vignette en plein écran clignotante, focus de la barre latérale)\nMENU/RGUI : Correction de la mise à l'échelle du texte en 16:9\nMENU/XMB : les images d'arrière-plan ont priorité sur les thèmes de couleurs, l'opacité de l'image par défaut est la même que celle du thème de couleurs.\nMENU/XMB : Correction d'un défaut de segmentation lorsque l'image de fond est manquante\nMENU/XMB : Plusieurs corrections et nettoyages\nMENU/XMB : corrections de mise en page/vignettes – Ajustements de la mise en page des vignettes, améliorations du titre d'en-tête, ajustements de la mise en page de l'ordinateur de poche\nRÉSEAU/NETPLAY : ajout de la prise en charge pour rejoindre les serveurs MITM à partir de la ligne de commande\nRÉSEAU/NETPACKET : améliorations du flux de connexion de l'interface\nOSX : correction de la prise en charge de la souris pour MelonDS DS sur OSX\nOSX : option pour créer une version portable\nPATCHES : ajout de la prise en charge des correctifs au format XDelta.\nPATCHS : correction des correctifs pour les cœurs prenant en charge le mode sans contenu\nPS2 : Correction de l'absence de son\nPS2 : corrigez les journaux de 0 octet et ajoutez des statistiques de mémoire\nPSP : Correction d'une fuite de mémoire dans le pilote audio\nRUNLOOP : Frame Rest, fonctionnalité de veille expérimentale visant à réduire l'utilisation et la température du processeur lors de l'utilisation de certains modes vsync gourmands en processeur\nRPI : Correction de l'échec de compilation de videocore + switchres\nSCAN : effectuez une vérification CRC sur le contenu PSP/PSP(PSN)\nTVOS : activer la prise en charge de la superposition\nVIDÉO/BFI : Insertion de cadre noir ajoutée à DirectX10/11/12. La gamme BFI Hz couvre désormais tous les multiples de 60 Hz inférieurs à 1 000 Hz. Longueur du stroboscope variable via la nouvelle option « Dark Frames », algorithme pour sélectionner automatiquement le choix « décent » des Dark Frames.\nVIDEO/GLSL : ajouter la prise en charge de FinalViewportSize à GLSL\nVIDEO/GLSL : changez le type de rotation en int pour maximiser la compatibilité\nVIDÉO : utilisez le taux de rafraîchissement vidéo au lieu du taux de rafraîchissement principal pour limiter les images du menu\nVIDÉO : limiter le taux de rafraîchissement des vidéos en pause\nVIDÉO : Appliquer l'intervalle d'échange 1 dans le menu si vsync est activé\nWII : Activer Cheevos pour les versions Wii\nWIIU : Correction du fichier de configuration et de la lecture des informations de base\nWIIU : correction des entrées directionnelles « Haut » et « Gauche » pour les deux sticks analogiques pour l'adaptateur GC\nWIIU : Correction de 3 contrôleurs USB (NES/SNES/Retrode)\nWIIU : Correction d'une fuite de descripteur de fichier\nWIN32 : préférez D3D11 et WASAPI comme pilotes vidéo et audio par défaut\nWIN32 : correction de la taille de la fenêtre lorsque le rapport hauteur/largeur est < 0\nWIN32 : correction de la résolution de l'écran toujours liée au moniteur principal\nWAYLAND : activer le repli pour l'inhibition de l'économiseur d'écran via D-Bus\nWAYLAND : introduisez le protocole wp_fractional_scale_v1 pour une mise à l'échelle fractionnaire appropriée\nWAYLAND : mettre à jour la version des protocoles Wayland vers la version 1.31\n \n \nTout est là : RetroArch 1.7.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186380/in-multi-retroarch-v1170-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[3DS/Switch] The Guardian a rédigé un article sur Gary Bowser",
        "content": "Le célèbre journal The Guardian a dévoilé un article intéressant sur Gary Bowser, bien que l'article contienne une petit erreur puisque Gary Bowser a passé 30 mois derrière les barreaux et non 14, l'ex pirate le met en avant sur son profil Twitter (X). \n \nIl rajoute The Guardian a enfin publié un bel article sur moi, l'histoire de ma vie, les problèmes juridiques, le redémarrage de ma vie. Il est tiré d'une série d'interviews que j'ai réalisées il y a quelque temps avec eux. C'est bon de le voir imprimé. Jetez-y un coup d'oeil, et je répondrai à toutes vos questions.\n \nDans l'article, Gary Bowser confirme qu'il a réalisé l'entièreté de sa détention sans avoir été libéré sous caution, une première détention de 14 mois, puis de 16 mois entre les prisons fédérales de Seatax, ICE en attente d'expulsion vers le Canada. \n \nDans l'ICE, il n'était pas dans une cellule mais plutôt dans un dortoir, il avait la possibilité de sortir dans une cour une heure par jour, et disposait d'une Xbox 360 ! \n \nEn 2010, il s'implique avec la Team Xecuter dans le piratage de console Nintendo, en 2020 il est arrêté, et les ennuis de santé l'ont épuisé, notamment parce qu'il a eu un coronavirus assez fort.\n \n \n\n \n \nSon avenir il le voit dans le matériel rétro, avec du soutien reçu d'une page GoFundMe, mais sa passion pour ce type de matériel l'amènera certainement quelque part. \n \nL'article de TheGuardian est ici : L'homme qui doit 14 millions de dollars à Nintendo : Gary Bowser et l'affaire de piratage la plus célèbre du monde du jeu vidéo\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186373/in-3dsswitch-the-guardian-a-redige-un-article-sur-gary-bowser-1.png"
        }
    },
    "news_3": {
        "title": "[PS4/PS5] TheFlow présentera sa vulnérabilité le 31 Mai 2024",
        "content": "Excellente nouvelle, nous venons d'apprendre que TheFlow présentera sa vulnérabilité RCE permettant d'obtenir les privilèges kernel sur PlayStation 4 lors de l'événement TyphoonCon24 qui se tiendra du 27 au 31 Mai 2024 à Séoul en Corée du Sud.\n \nSon exploit kernel basé sur certaines vulnérabilités dans les protocoles réseau permet avec un RCE (Remote Code Execution) d'accéder au kernel exploit sur la console PS4. \n \nIl sera intéressant de voir si l'on parle d'un exploit uniquement accessible sur PS4, et sur quel firmware car il se murmure le firmware 11.0, ce qui débloquerait enfin la console du firmware 9.00. L'autre point à surveiller est le côté PS5. \n \n \n \n\n \n\n \n \nCet exposé portera sur l'exploitation réussie de vulnérabilités du kernel dans un protocole réseau sur la PlayStation 4 qui est basée sur FreeBSD. Je montrerai comment les éléments internes du protocole IPv6 peuvent être exploités pour obtenir une fuite d'information et pour rediriger le flux de contrôle afin d'obtenir un RCE avec les privilèges du kernel sur la console. Les stratégies d'exploitation peuvent également s'appliquer à XNU car ils partagent un code très similaire. De plus, cet exploit permet un jailbreak sans nécessiter de point d'entrée utilisateur tel qu'un exploit webKit.\n \nLa dernière phrase laisse rêveur, on est sur un exploit kernel directement accessible, sans exploit webkit, une première sur PS4, laissant entrevoir une nouvelle fois le spectre des CFW ? \n \nTout est là: typhooncon.com\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186369/in-ps4ps5-theflow-presentera-sa-vulnerabilite-le-31-mai-2024-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1186369/in-ps4ps5-theflow-presentera-sa-vulnerabilite-le-31-mai-2024-1.png"
        }
    },
    "news_4": {
        "title": "[Switch] L4T Fedora 39 v5.1.2 disponible",
        "content": "Azkali, le développeur de L4T Fedora, est fier de présenter une nouvelle version conçue pour la Nintendo Switch, L4T Fedora 39 5.1.2. Comme vous le savez cette version de Linux est conç pourle compte de Switchroot permettant de profiter des dernières innovations en la matière. \n \n \n\n \n \n \nPrincipaux points forts :\n \n- Désormais basé sur KDE spin\n- Avec BSP 32.7.4 par défaut\n- Nombreuses corrections de bugs et améliorations comme une plus grande stabilité\n \n \nCette mise à jour apporte aussi le passage de Pulseaudio à pipewire pour le système audio, permettant d'offrir un support plus large et plus complet. \n \nL'arrivée de BSP 32.7.4 a Vulkan 1.2 permet là aussi des performances optimales dans les jeux et application, tout comme la correction de certains bugs. \n \nLa mise à jour de FFmeg en 6.0.1, d'un pipeline CUDA, ou encore l'ajout du référentiel d'application facile l'installation de nouvelles applications. \n \n\n \nChangelog 5.1.2 :\n \nUse pipewire instead of Pulseaudio and add full support for it\nAdd 32.7.4 BSP for vulkan 1.2 and set it by default\nReverted to fedora's Glibc as widevine patches are not needed anymore\nUpdate FFmpeg to 6.0.1\nAdd Apps repo by default\nPR fix for hangover compilation\nFix Vita3k build in apps repo\nComplete cleanup of OBS repos\nAdd KDE spin and use it by default\nCreated pipeline for CUDA\nAdded CUDA 10.2\nAdd GCC-7 for CUDA\nFixed BSP override bug\nImprove dock-hotplug to use most common DM greeters when available\nFix kernel src symlink for kmod\nUse nvidia container toolkit from new nvidia repo\nEnable USB_SERIAL_CH341 module\nFix and use onboard\nShow onboard in sddm and initial-setup\nFix nvpmodel fan_available_profile sysfs node check (credits )\nDecrease time spent in initramfs by uncluterring it\nChromium is now weekly updated (credits )\n \nKnown bugs\nOnboard (the visual keyboard) can crash sometimes (recovered automatically by a service)\nOnboard layout except Compact bug on special characters such as ,.?!\nOnboard can crash in sddm (quick fix: reboot or enable autologin)\nUSB serial doesn't work (uart_port=4 in ini)\n \n\n \n\n \n \nTéléchargement : \n \nhttps://wiki.switchroot.org/wiki/linux/linux-changelog\n \nhttps://twitter.com/AzkaliManad/status/1753311074735067381\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186350/in-switch-l4t-fedora-39-v512-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS4] Gran Turismo Sport enfin patché pour les sauvegardes",
        "content": "Alors que depuis des années les développeurs cherchent à faire fonctionner les sauvegardes de progression hors ligne sur Gran Turismo Sport, cette possibilité vient d'arriver sans que personne ne s'y attende, un peu comme le transfert d'Hamilton en 2025 de Mercedes vers Ferrari.\n \nGran Turismo Sport a été l'un des premiers jeux à \"profiter\" des sauvegardes en ligne sur les serveurs de Polyphony Digital, les sauvegardes de progression étant lié à des fichiers obligatoirement hébergés sur ce serveur. \n \n \n\n \n \n \nC'est certainement pour des raisons de coûts d'entretiens de ces serveurs que le studio a décidé de proposer un patch pour Gran Turismo Sport, supprimant au passage toutes les possibilités en ligne du jeu, mettant fin aux services, Open Lobby ou en encore Sport Mode seront inaccessibles, mais grâce au patch vous aurez vos progressions. \n \n\"Nous souhaitons remercier les nombreux utilisateurs du service en ligne Gran Turismo Sport depuis son premier lancement en 2017\", a déclaré Polyphony Digital. \"À partir d'aujourd'hui, nous continuerons à améliorer les services en ligne pour le titre Gran Turismo 7 actuellement disponible.\"\n \nIl aura fallu attendre 7 ans pour que nous puissions enfin librement disposer des sauvegardes en ligne avec cette mise à jour 1.69 de Gran Turismo Sport, rendez-vous en 2029 pour Gran Turismo 7.\n \n \nMerci Lestat___ pour l'information.\n \n \nTout est là : gran-turismo.com\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186349/in-ps4-gran-turismo-sport-enfin-patche-pour-les-sauvegardes-1.jpg"
        }
    },
    "news_6": {
        "title": "[PS4] PS2 2 PS4 V1.2: Convertir vos jeux ps2 pour PS4",
        "content": "Il aura mis du temps mais le voici enfin, PS2 2 PS4 v1.2, un petit utilitaire vous permettant de convertir vos jeux PS2 au format FPKG et donc jouable sur PS4.\n \nEn effet, annoncé depuis un petit moment sur mon tweeter, je publie enfin une version publique avec de gros changements. A la base programmé en batch pour la v1.0 et V1.1, j' ai revu le code entièrement qui passe maintenant en Python afin d' y ajouter une interface graphique bien plus convivial que de simple lignes d'instructions.\n \n\n \nSon fonctionnement en rien inchangé, sélectionner votre iso PS2, vos covers, background, ajouter si besoin vos fichiers de configurations (.lua et .conf) pour améliorer l'émulation puis lancer la création de FPKG.\n \nPetite précision importante, il vous faudra installer (si ce n est pas déjà fait) Python 3, version 3.12.1 au mieux, mais aussi les dépendances (je vous fournir un fichier .bat qui automatise l' installation de ces dernières)\nVous retrouverez toute la manip, installation et utilisation dans ma vidéo tuto ci dessous, cette dernière concerne la PS5 mais cela fonctionne exactement pareil pour PS4 seul l'interface graphique change...\n \nAutre petite chose à savoir, les 2 images (PS2 cover, Background) sont OBLIGATOIRES, sans l 'une des 2 le programme vous donnera un message d'erreur...\n \nDe plus ce programme ne règle pas les soucis rencontrés en jeu (lags, black screen, lignes vertes, etc...) pour réparer ceci vous devrez intégrer à votre FPKG des fichiers .lua et .config qui EUX règlent les soucis rencontrés. Vous les trouvez sur le PS DEV wiki ici\n \nBeaucoup de tests ont été fait, le programme fonctionne parfaitement, donc si vous rencontrez des erreurs ou autre avec, cela viendra de vos configs ou d' une mauvaise manip de votre part (je reste bien sur à votre disposition ici ou sur mon tweeter pour toute questions ou aide...)\nJe remercie donc les testeurs Hyndrid, Arksama et Mega Gonzales pour leur nombreux tests qui m' ont grandement aidé...\n \nInstallation et utilisation:\n \n\n- Installer Python3\n- Installer les dépendances en lançant le .bat fourni (Install_pillow.bat)\n- Lancer le .py (PS2_2_PS5.py)\n- Suivre les instructions\n- Lancer la création du FPKG\n \n\n \n\n \nPour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:\nhttps://www.paypal.com/paypalme/markus00095\n \nTélécharger: PS2 2 PS4 V1.2\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186299/in-ps4-ps2-2-ps4-v12-convertir-vos-jeux-ps2-pour-ps4-1.png"
        }
    },
    "news_7": {
        "title": "[PS5] PS2 2 PS5 V1.1: Convertir vos jeux ps2 pour PS5",
        "content": "Il aura mis du temps mais le voici enfin, PS2 2 PS5 v1.1, un petit utilitaire vous permettant de convertir vos jeux PS2 au format FPKG et donc jouable sur PS5.\n \nEn effet, annoncé depuis un petit moment sur mon tweeter, je publie enfin une version publique avec de gros changements. A la base programmé en batch pour la v1.0, j' ai revu le code entièrement qui passe maintenant en Python afin d' y ajouter une interface graphique bien plus convivial que de simple lignes d'instructions.\n \n\n \nSon fonctionnement rien inchangé, sélectionner votre iso PS2, vos covers, background et BG menu, ajouter si besoin vos fichiers de configurations (.lua et .conf) pour améliorer l'émulation puis lancer la création de FPKG.\n \nPetite précision importante, il vous faudra installer (si ce n est pas déjà fait) Python 3, version 3.12.1 au mieux, mais aussi les dépendances (je vous fournir un fichier .bat qui automatise l' installation de ces dernières)\nVous retrouverez toute la manip, installation et utilisation dans ma vidéo tuto ci dessous...\n \n\n \nAutre petite chose à savoir, les 3 images (PS2 cover, Background et BG Menu) sont OBLIGATOIRES, sans l 'une des 3 le programme vous donnera un message d'erreur...\n \nDe plus ce programme ne règle pas les soucis rencontrés en jeu (lags, black screen, lignes vertes, etc...) pour réparer ceci vous devrez intégrer à votre FPKG des fichiers .lua et .config qui EUX règlent les soucis rencontrés. Vous les trouvez sur le PS DEV wiki ici\n \nBeaucoup de tests ont été fait, le programme fonctionne parfaitement, donc si vous rencontrez des erreurs ou autre avec, cela viendra de vos configs ou d' une mauvaise manip de votre part (je reste bien sur à votre disposition ici ou sur mon tweeter pour toute questions ou aide...)\nJe remercie donc les testeurs Hyndrid, Arksama et Mega Gonzales pour leur nombreux tests qui m' ont grandement aidé...\n \nUne version pour la PS4 arrive très très prochainement...\n \nInstallation et utilisation:\n \n\n- Installer Python3\n- Installer les dépendances en lançant le .bat fourni (Install_pillow.bat)\n- Lancer le .py (PS2_2_PS5.py)\n- Suivre les instructions\n- Lancer la création du FPKG\n\n \nVideo tuto:\n \n\n \n \nPour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:\nhttps://www.paypal.com/paypalme/markus00095\n \nTélécharger PS2 2 PS5 V1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186291/in-ps5-ps2-2-ps5-v11-convertir-vos-jeux-ps2-pour-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1186291/in-ps5-ps2-2-ps5-v11-convertir-vos-jeux-ps2-pour-ps5-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS4/PS5] Le PoC sur la faille à 50 000 $ dévoilé ?",
        "content": "Le POC \"Proof of Concept\" CVE-2006-4304 pour PS4/PS5 fait sensation, le flux étant censé être secret via la notion de non divulgation lié à HackerOne. Cette découverte mérite l'attention de la communauté, car elle pourrait ouvrir la porte à d'éventuels jailbreaks dans le futur.\n \nEn fait l'exploit aurait leaké ou du moins il aurait été publié, ce supposé POC du flux a été divulgué sur plusieurs serveurs Discord. C'était à l'origine un POC incomplet mais le développeur Robbedcolek l'a complété.\n \n \n\n \n \n \nCe n'est toujours pas un exploit du kernel, mais il peut peut-être être utilisé pour écrire un exploit kernel, notamment parce qu'il permettrait d'être accessible sur le firmware 11.00 et inférieur sur PlayStation 4, et sur firmware 8.20 et inférieur sur PlayStation 5. \n \n \nTout est là : RobbedColek\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186244/in-ps4ps5-le-poc-sur-la-faille-a-50-000-devoilee-1.png"
        }
    },
    "news_9": {
        "title": "[PS4] Le payload GoldHEN mis à jour par SiSTRo en v2.4b16",
        "content": "Le développeur SiSTRo dévoile la toute première mise à jour de l'année 2024 de son payload GoldHEN.\n \nTaillé pour la plupart des firmwares sensibles de la PS4, le payload a été particulièrement mis à jour pour les 5.05, 6.72 et 9.00, comme vous le savez il s'agit de la solution ultime pour PS4 et bientôt pour la PS5. \n \nAvec cette mise à jour, le développeur a mis l'accent sur le chargement de plugin avec une amélioration du loader, et sur une meilleure prise en charge du FTP. De plus, il a ajouté un plugin de patch de jeu et une surcouche d'informations système pour le jeu. Une section \"A propos\" a été également rajouté avant de mettre en avant ceux qui participent aux développements de GoldHEN.\n \n \n \n\n \n \n \nPour ce qui est d'obtenir cette nouvelle version, nous ne pouvons que vous conseillez de supporter le développeur en lui offrant un café. \n \nAprès avoir sorti la 2.4v15, un petit bug a été trouvé, de fait la version 2.4b16 corrige ce problème. \n \n",
        "images": {}
    },
    "news_10": {
        "title": "[PS4] L'exploit 9.00 mis à jour pour intégrer PSFree",
        "content": "Bonne nouvelle, l'exploit 9.00 vient d'être mis à jour pour intégrer directement l'exploit PSFree, et c'est une bonne nouvelle car cela permet un lancement plus rapide et plus stable de l'exploit kernel sur ce firmware tant spécifique. \n \nNous devons cela au développeur Kamelon qui propose depuis quelques heures la mise à jour de l'implémentation de pOOBs4 9.00 à l'exploit PSFree (en version 1.4.0), pour un utilisateur lambda cela ne change pas grand chose, seulement que l'exploit est plus stable et plus rapide. \n \nPour tester cette nouvelle version, rendez-vous sur https://kmeps4.site/psfree_900/ avec le navigateur de votre PS4 (en utilisant la redirection DNS via le guide de l'utilisateur). Si vous obtenez avec succès \"r/w arbitraire archivé\", cela signifie que l'exploit du webkit a été exécuté avec succès... après, il demandera le message d'insertion USB habituel.\n \nKameleon vient également de libérer, il y a une heure, le code source de cette implémentation PSFree dans la chaine Kexploit pOOBs4 9.00 : https://github.com/kmeps4/PSFree900\n \n \n\n \n \nIl faut environ 5 secondes pour lancer le kernel exploit avec cette solution tout en un sur PS4. Bien entendu Kameleon a réuni les deux mondes en réalisant l'implémentation, mais la paternité de l'exploit webkit PSFree revient à ABC et le Kexploit et la chaîne ROP nous les devons à ChendoChap. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186196/in-ps4-lexploit-900-mis-a-jour-pour-integrer-psfree-1.jpg"
        }
    },
    "news_11": {
        "title": "[Switch] Android 13 bientôt porté sur la Switch",
        "content": "La Team Switchroot est de retour, elle informe via son profil Twitter (X) qu'elle est toujours présente en 2024. Elle dévoile en effet deux photos et un slogan \" nous ne sont pas encore mort, A13 est en travaux\". \n \nIl faut comprendre par là qu'Android 13 est en cours de portage sur la Nintendo Switch, tout simplement. \n \n \n \n\n \n\n \n \nC'est une bonne nouvelle, nous n'avions plus trop de nouvelles de la Team Switchroot depuis Aout 2023, voir que ce nouveau projet arrive est une bonne nouvelle, Android 13 permet aux développeurs de créer des icônes qui changent de couleurs, en fonction du thème de l'utilisateur. Android 13 propose un widget « en lecture » qui reprend les couleurs de la pochette de l'album en cours de lecture et permet de changer la langue d'une application et de profiter de l'écran partagé, bien entendu tout ceci doit être adapté à la Switch. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186191/in-switch-android-13-bientot-porte-sur-la-switch-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1186191/in-switch-android-13-bientot-porte-sur-la-switch-2.png"
        }
    },
    "news_12": {
        "title": "[PS3/PS4/PS5/Switch] Console Service Tool (C.S.T) v1.0.2.0 - Beta",
        "content": "Le développeur amoamare propose Console Service Tool (C.S.T) depuis quelques jours, il s'agit d'un nouvel outil qui est ultra complet mais encore en work in progress. \n \nConsole Service Tool (C.S.T) a été conçu pour aider les utilisateurs à diagnostiquer et à entretenir leurs consoles de jeu. Axé sur la PlayStation (PS3, PS4, PS5) et la Nintendo Switch, C.S.T. vise à consolider les différents outils de diagnostic et d'entretien en une seule plateforme conviviale.\n \n \n\n \n\n \n \n \nChangelog 1.0.2.0 Bêta :\n \n-Correction de quelques problèmes de codage, résolution d'une possible condition de course.\n- Ajout de la recherche de code - pour l'utiliser, il suffit de sélectionner la recherche de code, d'entrer le code dans la zone de texte et d'appuyer sur Entrée.\n- Ajout de la recherche par date et heure - ne connaît pas la date et l'heure réelles, utilise l'horloge de votre système actuel et supprime les secondes pour vous donner une idée de l'heure à laquelle le code a été lancé.\n- Ajout de niveaux de priorité : faible, moyen, élevé, grave. - Lorsqu'ils seront imprimés, ils apparaîtront en couleur pour aider à identifier rapidement les zones problématiques.\n- Ajout et formatage de la réponse des codes. Elle s'affiche sous la forme d'un créneau, d'une date, d'un code d'erreur, d'une priorité et d'un message d'erreur.\n- Possibilité d'afficher la réponse de la ligne d'origine à partir de la console.\n- Possibilité de mettre en évidence les lignes graves.\n- Lit tous les codes d'erreur jusqu'à ce que la console signale qu'il n'y a plus d'erreurs trouvées. Je trouve que c'est mieux que de ne lire que 10 codes d'erreur ou de les lire tous, qu'il y ait un code d'erreur ou non.\n- Correction du problème si le code d'erreur n'est pas trouvé. - Maintenant, il vous dira qu'il n'a pas été trouvé et vous demandera de le signaler si vous le souhaitez.\n- L'outil UART ajouté à ce programme les maintiendra ensemble. N'oubliez pas que l'outil NOR ne doit être utilisé que par ceux qui en ont une certaine compréhension. Encore expérimental\n \n \nTéléchargement : Console Service Tool (C.S.T)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186188/in-ps3ps4ps5switch-console-service-tool-cst-v1020-beta-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1186188/in-ps3ps4ps5switch-console-service-tool-cst-v1020-beta-2.png"
        }
    },
    "news_13": {
        "title": "[PS5] PCXSense Beta v0.6 disponible",
        "content": "Le développeur Denellyne vient de mettre en ligne un nouvel utilitaire nommé PCXSense et il est distribué en Beta 0.6.\n \nPCXSense vous permet d'utiliser votre propre Dualsense sur votre ordinateur sans tracas sur n'importe quel jeu de votre choix, mais il y a quelques fonctionnalités intéressantes que vous pourriez également apprécier, sur des émulateurs comme Yuzu et Cemu, les gâchettes adaptatives deviennent plus dures et plus courtes et sur Dolphin, cela fonctionne du gamecube. \n \n \n\n \n\n \n \nVous avez également la possibilité de créer votre propre profil, et ainsi d'adapter vos envies de configuration. A noter que vous aurez probablement une alerte de faux positif, le programme est encore distribué en version Bêta, il est possible d'avoir un message de mise à jour. \n \n \nTéléchargement : PCXSense Beta 0.6\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186177/in-ps5-pcxsense-beta-v06-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1186177/in-ps5-pcxsense-beta-v06-disponible-1.gif"
        }
    },
    "news_14": {
        "title": "[PS5] BedroZen n'a aucun lien avec Duplex qui dumpe ses propres jeux",
        "content": "Le développeur BredoZen a déclaré sur Twitter, nouvellement X, au sujet de la Team Duplex de petites phrases qui laissent penser que des tensions commencent à naitre. Il a en effet déclarer qu'il n'y a « pas d'honneur parmi les voleurs », ou encore \"Je n'ai pas accès aux versions européennes mais Duplex semble remplir cette partie\".\n \nSelon lui, les sorties entre ses dumps et ceux sont la Team Duplex sont trop similaires pour qu'il n'y ait pas de coïncidences. \n \nAfin de répondre à cela, la Team Duplex désormais a rajouté dans son NFO \" Nous dumpons nos propres disques... donc plz stfu \".\n \nLa problématique vient aussi du fait que la diffusion de dumps n'est pas réglementée, le fichier a livré ne couvre pas le Game File Dump...ACT, espérons que cela soit le cas lorsque des PKG seront proposés. \n \nIl n'est de fait pas certain que BredoZen accepte cela bien longtemps, mais ce qui est certain c'est que Duplex semble davantage suivre les publications de BredoZen que l'inverse, peut être en se procurant les jeux une fois que cela est certain. \n \n \n\n \n \nPour prouver leur dire, Duplex a dévoilé deux photos des jeux qui viennent d'être dumpés dans leur version européenne. \n \n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186146/in-ps5-bedrozen-na-aucun-lien-avec-duplex-qui-dumpe-ses-propres-jeux-1.jpeg",
            "image_2": "https://www.logic-sunrise.com/images/news/1186146/in-ps5-bedrozen-na-aucun-lien-avec-duplex-qui-dumpe-ses-propres-jeux-2.jpeg"
        }
    },
    "news_15": {
        "title": "[PS5] PS5 Payload ELF Loader v0.6 et ps5-payload-shsrv",
        "content": "Le développeur john-tornblom a retravaillé quelques propositions pour la PS5, à commencer par PS5 Payload Elf Loader qui passe en version 0.6. \n \nCette version 0.6 vient apporter des corrections mineures et cosmétiques selon le développeur. \n \n \n\n \n \nAu delà de ça, il propose aussi la version PS5 de son payload shsrv, il s'agit là de l'adaptation PS4. ps5-payload-shsrv est un simple serveur Telnet qui peut être exécuté sur une Playstation 5 qui a été jailbreakée via les points d'entrée BD-J ou webkit. Le serveur fournit aux clients connectés quelques commandes de base de type UNIX, telles que cd, mkdir, stat, etc.\n \n \nTéléchargement : ps5-payload-elfldr 0.6 / ps5-payload-shsrv\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186117/in-ps5-ps5-payload-elf-loader-v06-et-ps5-payload-shsrv-1.png"
        }
    },
    "news_16": {
        "title": "[PS4] Le site Orbispatches.com est en vente",
        "content": "Le développeur 0x199 vient de créer une nouvelle page sur son site internet Orbispatches.com, une page informant que sin site est en vente !\n \n \n\n \n \n \n \nAdieu à un projet passionné\n \nChère communauté,\nC'est avec des émotions mitigées que je partage la nouvelle qu'ORBISPatches.com recherche un nouveau propriétaire. Cette décision n’a pas été facile, car ce site Web a été pour moi un travail d’amour. Cependant, en raison de défis financiers imprévus, je me retrouve face au choix difficile de me séparer d’un projet qui me tenait beaucoup à cœur.\n \nLe voyage jusqu'à présent\nAu fil des années, ORBISPatches.com est devenu la plateforme ultime pour les correctifs de jeux PlayStation 4. Je suis immensément fier de la communauté qui s’est développée autour d’elle. Votre soutien et votre engagement ont été la force motrice du succès de cette entreprise.\n \nUne décision douce-amère\nLa décision de vendre ORBISPatches.com n’a pas été prise à la légère. C’est navrant d’abandonner quelque chose qui a représenté une partie importante de ma vie, et je peux dire que c’est l’un de mes plus grands projets réussis à ce jour. Cependant, comme la vie présente parfois des défis inattendus, je suis confronté à la responsabilité de faire face aux obligations financières qui surviennent.\n \nCe qui rend ORBISPatches.com spécial\nAvant de nous séparer, il est important de souligner les qualités uniques qui font d'ORBISPatches.com un atout précieux :\n \nUne base de données précieuse : jusqu'à présent, la base de données a atteint plus de 75 000 mises à jour de jeux uniques archivées.\n \nUne communauté engagée\nChaque année, nous sommes fiers de servir 300 000 visiteurs uniques.\n \nPotentiel de croissance : avec la bonne vision et la bonne stratégie, ORBISPatches.com recèle un immense potentiel de croissance et d'expansion, à la fois pour PlayStation 4 et 5.\n \nÀ la recherche du bon dépositaire\nJe recherche activement une personne passionnée pour prendre les rênes d'ORBISPatches.com. Si vous partagez le même dévouement à ce que les correctifs de jeu soient archivés et rendus publics à tous, je pense que vous pouvez diriger ce vaisseau vers des sommets encore plus élevés.\n \nComment faire partie du voyage\nSi vous souhaitez devenir le nouveau propriétaire d'ORBISPatches.com, je vous invite à me contacter sur Discord : 0x199. Discutons de la manière dont votre vision s'aligne sur l'héritage d'ORBISPatches.com et de la manière dont, ensemble, nous pouvons assurer une transition en douceur pour la communauté.\n \nUn adieu reconnaissant\nAlors que je fais mes adieux à ORBISPatches.com, je tiens à exprimer ma plus profonde gratitude à chacun d'entre vous qui a fait partie de cet incroyable voyage. Votre soutien compte pour moi et je suis convaincu qu'ORBISPatches.com continuera à prospérer entre les mains de son prochain propriétaire.\n \nMerci de faire partie de cette aventure.\n \nCordialement, 0x199\n \n \nTout es là : Orbispatches.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186097/in-ps4-le-site-orbispatchescom-est-en-vente-1.jpg"
        }
    },
    "news_17": {
        "title": "[PSP] PPSSPP v1.17 disponible",
        "content": "Après l'ouverture du programme Bêta de la version Android il y a quelques jours, voilà que débarque la version 1.17 de PPSSPP, le meilleur émulateur PSP jamais créé. \n \nAu programme, des corrections et des améliorations de performances, des améliorations de l'interface, du chargement des ISO, mais aussi dans la gestion de l'écran tactile ou encore des contrôleurs. \n \n \n\n \n \n \nRendering performance and fixes\n- Fix for very old rendering issue in Tokimeki Memorial 4 (#18650)\n- Performance improvement in Tactics Ogre by avoiding a readback (#18599)\n- Cull small draws that are quick to check that they are offscreen (#18446)\n- Assorted optimizations (#18586, #18573, #18476, #18413, #18416, #18219)\n- Fix HUD in Tiger Woods 06 (#18554)\n- AdrenoTools support added - you can now load custom Vulkan drivers on Adreno (#18532, #18548, #18699)\n- Disabled in the Google Play builds for now\n- Fix rendering with bad Z parameters, fixes homebrew Zig example (#18535)\n- Fix Z problem in Hayate no Gotoku!! Nightmare Paradise #18478\n- Fix frozen pitch meters in MLB games (#18484)\n- Enable MSAA on modern mobile devices (Vulkan-only) (#18472)\n- Fix video flicker in Naruto: Ultimate Ninja Heroes 2 (#18454)\n \nUI\n- Track total time played per game (#18442)\n- When opening the pause menu, there's now an option to keep the game running behind the menu. This is enforced in multiplayer to avoid inadvertent desyncs (#18517, #18515)\n \nISO loading improvements\n- The CHD file format is now fully supported, including with Remote ISO and Retroachievements\n- Improvements to remote ISO: optional tab on home screen, can now share whole folders (#18627, #18639, #18640, #18631, #18632, #18633,)\n \nController and touchscreen fixes\n- More control bindings, organize into categories (#18635, #18589)\n- Fix inverse deadzone (low end) for joystick input\n- Fix analog deadzones for XInput controllers (#18407)\n- Improved tilt control further (#18533)\n- Mouse input supported on Android (#18551, #18473)\n- Customizable threshold for analog-trigger to button-press mapping, customizable delay for mouse-scroll key-up (#18621, #18585)\n- Make it work better to bind an analog stick to four buttons, useful for camera control in some games\n- Can now unpause with the key you bound to pause (#18591)\n \nOther fixes and updates\n- More work on the IR JITs (#18234, #18235, #18228, #18227, #18226, many more)\n- Moving the memstick directory on Android is now faster and safer #18744\n- Workaround problems in Add Doko Demo Issho, Driver 76, Harukanaru Toki no Naka, Ace Combat by slowing down the emulated UMD drive to match reality better (#18436, #18445)\n- VR: Quest 3 rendering issues fixed (#18677)\n- Various bugfixes in texture replacement (#18638, #18610, #18519, #18466, #18747)\n- RetroAchievements: Rich presence, renamed Challenge Mode back to the recommended Hardcore Mode, various error handling improvements, configure per game (#18468, #18651, #18488, #18428, #18425)\n- HLE: Slice large-and-slow memcpy/memset operations, can help with some stalls. (#18560)\n- Other various minor fixes and optimizations (#18558, #18555, #18538, #18529, #18450, #18314, #18233, #18678, #18749, #18736, #18704)\n- SoftGPU fixes (#18362)\n- Fixed international fonts on Steam Deck (#18732, #18734)\n- GoExplore (GPS app) now starts up and allows navigation (#18665, #18666, #18668, #18669)\n- SDL: Improve input latency in Vulkan mode by running rendering on a separate thread (#18268)\n- Assorted multiplayer fixes (#18435)\n- Support for emulating the infrared port of the original PSP through sceSircs (#18684)\n \n \nTéléchargement : ppsspp v1.17\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186095/in-psp-ppsspp-v117-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] Le prochain etaHEN aura une option pour monter des données en sandbox",
        "content": "Le développeur LighningMods tease une nouvelle version d'etaHEN, il nous informe que cette version en développement a été mise à jour par Lapy et implémentée par illusion, de quoi nous faire saliver. \n \n \n\n \n \nSelon LightningMods, cette version intégrera une option permettant de monter /data dans une sandbox d'applications (qui sera activée par défaut).\n \n \n \n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186093/in-ps5-le-prochain-etahen-aura-une-option-pour-monter-des-donnees-en-sandbox-1.png"
        }
    },
    "news_19": {
        "title": "[Switch] Mike Heskin (Hexkyz) donne son avis sur le Mig Switch",
        "content": "Le développeur Mike Heskin connu de la scène 3DS, Wii et Switch sous le pseudonyme Hexkyz a écrit de longs billets sur le Mig Switch, informant ou donnant son avis sur ce nouveau linker. \n \n \n\n \n \nLa première des choses qu'il dit autour de ce linker est qu'il subsiste beaucoup de confusions autour de lui, \" ce qui est compréhensible étant donné à quel point (probablement délibérément) ils sont vagues sur ce qu'il peut ou ne peut pas faire. Ainsi il a essayé de couvrir ici quelques faits connus sur la Gamecard, l’écosystème en général qui peut apporter des réponses. \n \nTout d’abord, il n’est pas possible de modifier de quelque manière que ce soit une image Gamecard (XCI) légitime. Les XCI utilisent un système de fichiers basés sur le hachage dans lequel le contenu de chaque fichier est haché et un hachage de tous leurs hachages est stocké dans l'en-tête de la partition.\n \nPar conséquent, une modification du contenu d'une image nécessite le recalcul des hachages pertinents, ce qui semble assez simple, sauf qu'un hachage de l'en-tête de la partition (qui contient un hachage des hachages de tous les fichiers) est inclus dans la région CardHeader (les 0x200 premiers octets). \n \nCette région est signée (RSA-2048) et sa signature est vérifiée par Lotus ASIC. À moins que vous ne disposiez de la clé privée nécessaire pour re-signer cette région CardHeader, la partie est terminée ici.  \n \nCela va probablement sans dire, mais toutes les clés privées RSA de niveau production ne sont connues que par Nintendo. Vous ne pouvez pas les \"calculer\", ils n'ont pas été divulgués à quelque titre que ce soit et si, d'une manière ou d'une autre, le linker avait réellement la clé, il n'aurait pas du tout besoin de la région InitialData.\n \nCela signifie que la prise en charge du contenu DLC et des mises à jour (sauf si le jeu est légitime) ou des homebrews n'est tout simplement pas possible.\n \n \n\n \n \n \nL’autre grand sujet semble être la détection. Comme prévu, les testeurs ont déjà compris que vous pouvez utiliser le même certificat pour n'importe quelle image XCI, ce qui est clairement le principal argument de vente de ce linker, même si ses créateurs ont pris soin de ne pas le déclarer ouvertement pour éviter les réactions négatives. \n \nNotez que toutes les copies d'un même jeu partagent les mêmes régions CardHeader et InitialData, mais différentes copies du même jeu ont des régions CertArea différentes et, dans l'état actuel des choses, rien ne semble vérifier si un certificat appartient au jeu pour lequel il a été émis. \n \nEn ligne, Nintendo dispose de l'infrastructure nécessaire pour détecter si un certificat donné est utilisé plusieurs fois en même temps. Ils peuvent également détecter si un certificat appartient à une carte de jeu physique à partir du firmware 9.0.0 (ajouté en réponse à l'émulation SX du Lotus ASIC). \n \nQuant à l'utilisation d'un certificat qui ne correspond pas au jeu pour lequel il a été émis, le réseau demande d'authentifier le certificat de la carte de jeu en s'assurant d'inclure l'ID de l'application en cours de lecture afin qu'il soit facilement visible par Nintendo.\n \nIl y a aussi quelques détails supplémentaires dont je n'ai pas encore vu parler. Par exemple, le système d'exploitation enregistre le nombre de fois que vous insérez et retirez une carte de jeu, ce qui pose clairement un problème, car le flashcart vous oblige à l'insérer et à la retirer pour parcourir les jeux. \n \nAvec un CFW, vous avez un certain contrôle sur les données de télémétrie, mais avec un OFW, vous n'en avez aucun. Même si vous bloquez les domaines pour les rapports d'erreurs (qui sont les plus détaillés), vous ne pouvez tout simplement rien faire concernant les rapports système (\"srepo\") qui incluent des informations sur les cartes de jeu.\n \nCela nous amène au dernier point qui concerne le type de détection et de prévention existant *hors ligne*, ce qui est également la raison pour laquelle les créateurs du flashcart sont si prudents avec leur formulation. \n \nPar exemple, seuls 16 des 208 octets de la région cryptée d'un certificat de carte de jeu sont actuellement utilisés (pour dériver la clé de communication). Personne ne sait vraiment si les octets restants ont une corrélation avec les régions InitialData ou CardHeader.\n \nS'il s'avère qu'il existe effectivement une corrélation, alors le scénario actuel consistant à utiliser le même certificat pour différentes images XCI devient patchable hors ligne. Il existe de nombreuses autres façons de détecter et de bloquer ce problème, soit au niveau du système d'exploitation, soit au niveau de Lotus. \n \nIroniquement, le seul cas où le flashcart pourrait ne pas pouvoir être corrigé ou détecté est si vous l'utilisez uniquement pour conserver des copies de jeux légitimes (certificat correspondant au jeu et tout ça) et ne les parcourez pas.\n \nUn sujet supplémentaire que j'ai observé concerne la façon dont cela pourrait affecter la rétrocompatibilité dans une future console. Comme je l'ai mentionné précédemment, il y a toujours eu un deuxième système de sécurité en attente, précisément parce que Nintendo était conscient des faiblesses de la partie gamecart du jeu. \n \nCela signifie que les *futures* cartes de jeu seraient sûres, mais que celles actuelles auront toujours leur système de cryptage matériel brisé. Personnellement, je pense que la rétrocompatibilité sera assurée même au niveau des cartes de jeu (c'est-à-dire le futur matériel capable de lire les cartes de jeu Switch).\n \nIl y a quelques changements récents dans l'écosystème Gamecard/Lotus qui suggèrent que le même matériel allait être utilisé dans une nouvelle console et il semble peu probable que cela change (surtout compte tenu de l'existence d'un deuxième système de sécurité) . \n \nCependant, il est tout à fait possible que le futur matériel vous oblige désormais à vérifier les anciennes cartes de jeu en ligne pour affirmer sa légitimité, par exemple. \" \n \n \nComme vous pouvez le lire c'est un très long billet, presque un writeup sur ce qu'est le Mig Switch à ses yeux, et les notions de sécurité abordées sont intéressantes à plusieurs titres. A suivre. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185999/in-switch-mike-heskin-hexkyz-donne-son-avis-sur-le-mig-switch-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1185999/in-switch-mike-heskin-hexkyz-donne-son-avis-sur-le-mig-switch-2.jpg"
        }
    },
    "news_20": {
        "title": "[PS4/PS5] PS4 Exploit psfree 1.4.0 Bêta disponible",
        "content": "L'exploit PS4 psfree vient d'être mis à jour en version 1.4.0 bêta, et bonne nouvelle cette nouvelle version fait bouger les choses. \n \n \n\n \n \n \n\n \n \n \nChangelog 1.4.0 :\n \n- Ajout d'un payload de correction du kernel pour les firmwares 8.0x\n \nRéparations :\n \n- Suppression du risque de crash lors de l'utilisation des classes string\n- Suppression du risque de crash lors de l'utilisation de make_buffer()\n \nIl semble que les debug settings ne soient plus très loin, au delà du 9.00, mais en dessous du 9.60, et côté PS5 en dessous du firmware 5.50. \n \nNiveau PS4, il semble que le firmware 9.03 et 9.51 sont exploitables, mais que pour le 9.60 ce n'est pas encore le cas. Des tests sont en cours sur le firmware 10.50, même si nous savons que ce sera plus difficile sur ce firmware vu qu'il n'est pas supporté. \n \n \n\n \n \n \nL'un des hosts qui permet de tester en ce moment PS4 Exploit psfree 1.4.0 Bêta : \n \nhttps://nightkinghost.com/psfree/index.html\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-507091331.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1185985/in-ps4ps5-ps4-exploit-psfree-140-beta-disponible-1.jpg"
        }
    }
}