{
    "news_1": {
        "title": "[PS3] CFW 4.91 Evilnat Cobra 8.4 disponible",
        "content": " \nLe développeur Nathan Martin, connu sous le pseudonyme d'Evilnat, propose le tout premier custom firmware basé sur le firmware officiel 4.91 dévoilé il y a quelques jours par Sony pour la PlayStation 3. \n \nSon CFW nommé CFW 4.91 Evilnat intègre les fonctions Cobra 8.4 sachant que d'autres versions du CFW seront proposés par la suite, notamment des versions Overclocking, noBT, noBD, mais les fonctions Cobra sont déjà très utiles, puisqu'elles permettent par exemple de charger des plugins en arrière-plan, la prise en charge des ISO, entre autres fonctionnalités que l'on ne trouve pas directement sur un CFW standard.\n \n \n \n\n \n \n \n \n \nTesté sur les modèles suivants : \n \nCECH-2000A\nCECH-2000B\nCECH-2001A\nCECH-2002B\nCECH-2003A\nCECH-2004A\nCECH-2004B\nCECH-2012A\nCECH-2104B\nCECH-2500A\nCECH-2501A\nCECH-2504A\nCECH-2511A\nCECH-2511B\nCECH-L04\nCECHA01\nCECHE01\nCECHB01\nCECHC04\nCECHG01\nCECHP01\nCECHM\n \nCaractéristiques :\nConstruit à partir du OFW (CEX) 4.91\nNoyau porté et certains modules d'OFW 4.84 DEX\nFabriqué manuellement sans outils automatiques\nPSN/SEN activé\nCorrection des dispositions 272/480 à partir de l'OFW 4.90\nSuppression désactivée des fichiers act.dat et .rif non signés\nFichiers act.dat et .rif non signés autorisés\nExécution autorisée d'applications non signées\nCompatibilité avec FSELF\nDéverrouillage des démos C00\nVérification de la licence LIC.EDAT désactivée\nPeut être installé sur OFW 3.55\nPeut être installé sur +3,56 OFW (avec le toolset de bguerville)\nPeut être installé sur n’importe quel CFW CEX\nLes fonctions Cobra 8.4 ajoutées et activées par défaut\nCompatibilité complète des jeux PS2\nPossibilité de downgrade à partir de n'importe quel CFW avec des QA flags actifs\nQA flags actifs s'ils ont été précédemment activés\nMessage d'épilepsie désactivé au démarrage\nCompatibilité avec les jeux PSX/PSP/PS2 en ISO\nCompatibilité avec les jeux PS3 au format dossier ISO/JB\nCompatibilité avec ReactPSN\nAffichage des températures dans XMB In-Game sur les jeux PS2\nContournement d'écran RSOD\nContournement d'écran BSOD\nPS3_GAME/app_home\nCapture d'écran du jeu XMB\nGestionnaire de packages ajouté\nCoreOS Hash Check corrigé pour empêcher Brick sur les consoles de mise à niveau non déhachées\nPatché pour supprimer la protection LV2\nPeek and Poke (LV2)\nPeek and Poke (LV1)\nProtection CINAVIA désactivée\nPossibilité de trier les jeux par nom et date\nAutoriser l'utilisation d'un contrôleur tiers dans le menu de récupération\nCompatibilité avec d'autres systèmes d'exploitation\nMise à jour désactivée depuis OFW PUP en mode de récupération\nCompatible double démarrage\nInstallation autorisée du PKG de vente au détail sur DEX\nAutorisé à installer un PKG pseudo-retail\nActivation des options [★Déverrouiller], [★Verrouillage] et [★Supprimer] dans les trophées\nCompatibilité avec la lecture à distance\nGameboot_multi.ac3 ajouté\ngameboot_stereo.ac3 et coldboot_stereo.ac3 supprimés\nRemplacez \"Dissocier\" par \"Supprimer le dossier\" dans XMB\nErreur de diffusion PAL contournée sur les films BD/DVD\nContournement de tous les codes d'erreur sur les films BD/DVD\nActivation du menu Debug dans les jeux PS2 (ps2_netemu.self)\nProblème CBOMB corrigé\nTarget Manager corrigé pour afficher la version 4.9.1\n \nCobra8.4 : \nFailsafe Cobra stage2 (par bguerville/aldo)\nRestaurer les appels système CFW sans redémarrer en entrant simplement dans « Paramètres > Mise à jour du système » sur XMB (par aldo)\nFAN à contrôle dynamique intégré (pour contrôler le ventilateur lorsque webMAN est déchargé) (par aldo/Evilnat)\nPrise en charge de l'intégration de l'interface graphique photo avec webMAN MOD (monter des jeux à partir de la colonne « Photo ») (par aldo/DeViL303)\nObtenir/Définir la vitesse du VENTILATEUR (par aldo)\nActiver/désactiver les fonctionnalités : interface graphique photo, restauration des appels système (par aldo)\nOpcode pour créer des Syscalls CFW (6, 7, 8, 9, 10, 11, 15, 35) (par aldo)\nOpcode pour créer une licence (RIF) (par Evilnat)\nMise à jour de ps3mapi_load_process_modules pour charger des modules personnalisés et des modules système (par haxxxen)\nAjout de ps3mapi_get_process_module_info\nAugmentation de 24 à 32 le nombre maximum de chemins de carte (par aldo)\nAjout du patch sm_get_temperature dans le noyau (par Evilnat)\nAjout du patch sm_get_fan_policy dans le noyau (par Evilnat)\nAjout du patch sm_set_fan_policy dans le noyau (par Evilnat)\nAjout de la prise en charge du décryptage des ISO REDUMP à la volée (par Evilnat)\nOpcode pour basculer l'animation de démarrage à froid (par Evilnat)\nOpcode pour basculer l'avertissement d'épilepsie (par Evilnat)\nOpcode pour basculer l'animation et le son du gameboot (par Evilnat)\nOpcode pour basculer les informations cachées sur les trophées (par Evilnat)\nCorrectif de Target Manager pour DEX (par haxxxen)\nCorrection de la charge utile Control FAN, évite de charger le mode précédent (par Evilnat)\nDésactivez stage2.bin pendant que le menu de récupération est chargé (par haxxxen)\nCorrection de la vitesse maximale du VENTILATEUR après l'arrêt (par Evilnat)\nCorrection d'un écran noir dans les jeux convertis CFW2OFW (par Evilnat)\nAjout de sm_ring_buzzer avec single_beep, double_beep et triple_beep (par Evilnat)\nIgnorer la création de la licence (rif) si elle existe déjà (par aldo)\nOpcode pour basculer l'icône PS2 (ISO/BIN.ENC) dans XMB (par Evilnat)\nAjout du symbole cellFsMkdir (par Evilnat)\nAjout d'une vitesse de ventilateur constante lors du lancement d'un ISO PS2 (par Evilnat)\nCréation d'un faux act.dat lors du lancement d'un jeu PSN (par Evilnat)\nBloquer la connexion sur PSN/SEN lorsque les appels système CFW sont activés (par DeViL303)\nActiver le mode OFW au démarrage (par aldostools et Evilnat)\nBlocage des lanceurs PSP si un PSPISO n'a pas été monté (par aldostools)\nPetites optimisations (Par aldostools)\nCode \"inutile\" supprimé (par aldostools)\nOpcode pour basculer le démarrage du jeu (par Evilnat)\nOpcode pour basculer le démarrage à froid et le son (Par Evilnat)\nOpcode pour basculer l'avertissement d'épilepsie (Par Evilnat)\nCellUsb000_mount_symbol ajouté (par haxxxen)\nAjout des drapeaux usb_flag et no_cobra (par aldostools et Evilnat)\nChargez le stage2 externe et les plugins depuis /dev_usb000 (par aldostools, haxxxen et Evilnat)\n \nTraductions\nPortugais : @jcorrea et @LuanTeles\nPolonais : @KcrPLo et @Agrippa et HackZy01\nItalien : @Sheireen\nEspagnol : Evilnat\nChinois traditionnel/simplifié : @xiaoyang\nJaponais : @Kyan_dudl\nRusse : @MrYadro\nFrançais : @EimGdt et @Chronoss09\nAllemand : @FadedHD3\n \n \nLes versions proposées sont les versions CEX, D-PEX, DEX et PEX\n \n \nTéléchargement :  CFW Evilnat 4.91 Cobra 8.4 [PEX] [CEX][DEX] et [D-PEX]\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187870/in-ps3-cfw-491-evilnat-cobra-84-disponible-1.jpg"
        }
    },
    "news_2": {
        "title": "[WiiU] ExZap continue d'améliorer Cemu qui passe en 2.0-68",
        "content": "Le développeur ExZap a travaillé hier sur une nouvelle version de son émulateur de Nintendo Wii U, Cemu, qui passe en version 2.0-68. Les nouvelles fonctionnalités qui ont été ajoutées concernent surtout Vulkan, afin d'utiliser VK_KHR_synchronization2, mais ce n'est pas tout le développeur a retiré des instructions d'impression superflues dans nsyshid, et apporter l'ajout du package llvm pour Fedora. \n \nConcernant Vulkan, ce sont réellement plusieurs optimisations qui ont été apportées, avec la suppression de certains index tampons inutiles comme ceux qui concernent les calls de bakcbuffer drawcall, des corrections de bugs, ou encore des optimisations sur le filtre MSAA.\n \nCes nombreux changements ne sont pas sans conséquences, il y a eu de nombreux rapports d'utilisateurs qui se sont vus bloqués avec des pilotes Vulkan de 2019, ceux de Kepler par exemple, donc pour le moment, ExZap a fait le choix de limiter voir de reporter les changements à la future version stable. \n \n\n \nChangelog entre 2.0-66 et 2.0-68 : \n \nBUILD.md: Add llvm package for Fedora (#1101)\n \nnsyshid: remove stray print statements (#1106)\n \nVulkan: Update some code to use VK_KHR_synchronization2\n \nVulkan: Remove unnecessary index buffer for backbuffer drawcall\n \nVulkan: Avoid calling vkCmdClearColorImage() on compressed textures \n \nVulkan: For MSAA surface copies make the target MSAA too \n \nREADME.md: Fix minor ambiguity\n \nRevert \"Vulkan: Update some code to use VK_KHR_synchronization2\" \n \n \n \nComme toujours Cemu est proposé pour Windows x86 et x64, MacOS, Ubuntu et AppImage\n \nTéléchargement : Cemu\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187858/in-wiiu-exzap-continue-dameliorer-cemu-qui-passe-en-20-68-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS4] Une nouvelle version de l'émulateur PS4 psOff publiée",
        "content": "Le développement des émulateurs PS4 est toujours intéressant car la difficulté réside dans la puissance nécessaire à déployer. La PS4 est encore une console récente, et l'émuler n'est pas simple, la console intéresse de plus en plus les développeurs. \n \nAprès fpPS4 et RPCSX, qui sont des projets réellement solides, un nouveau arrive, il s'agit de psOff. Pour le moment, cet émulateur se concentre sur la restitution sur PC Windows, et sur les GPU AMD, bref, c'est plutôt restrictif puisqu'aucun pilote n'a pour l'heure était déployé pour les cartes nVidia. \n \nComme tous les émulateurs PS4, psOff exécute une couche qui permet aux logiciels de s'exécuter en traduisant les API et les systemcalls de la console. \n \n\n \n\n \n \nInstallation :\n \nPour tester, téléchargez simplement la dernière version. Et installez le SDK Vulkan\n \nPour le développement, définissez CMAKE_INSTALL_PREFIX sur le dossier des émulateurs téléchargés.\n \n \n\n \n \nTéléchargement : psOff\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187854/in-ps4-une-nouvelle-version-de-lemulateur-ps4-psoff-publiee-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1187854/in-ps4-une-nouvelle-version-de-lemulateur-ps4-psoff-publiee-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1187854/in-ps4-une-nouvelle-version-de-lemulateur-ps4-psoff-publiee-3.png"
        }
    },
    "news_4": {
        "title": "[PS4] Le store GameBato est disponible en 1.70",
        "content": "L'équipe en charge du store de téléchargement GameBato propose depuis quelques heures une nouvelle version de leur proposition. \n \nCe sont plus de 2000 jeux qui sont directement proposés sur la PlayStation 4 et PlayStation 4 Pro, avec les DLC et les mises à jour, et tout cela d'un simple clic. \n \nLes optimisations portent dans cette version 1.70 sur la vitesse d'exploration et de navigation des applications qui augmente de 900 %, la vitesse de téléchargement a elle progressée de 25 % pour tous les utilisateurs qu'ils soient Premium ou gratuits. \n \nAvec cette nouvelle version vous pouvez ajouter des packages pour différentes version de jeu et modifier le nombre de téléchargements autorisés. Sur ce point, il est possible aux membres gratuits de télécharger jusqu'à 2 fichiers/jeux/DLC/mise à jour tandis que ce nombre passe à 8 simultanément pour les membres Premium. \n \nL'équipe a aussi optimisé la stabilité de la solution puisque le risque de kernel panic ou d'arrêt de la console a été réduit de 85%, sans compter les corrections des problèmes liés au blocage des processus d'installation. \n \n \n\n \n \nVersion 1.70 disponible !\n \nExpérience utilisateur :\n- Augmentation de la vitesse d'exploration et de navigation dans l'application de 900%.\n \nVitesse de téléchargement :\n- Augmentation de la vitesse de téléchargement dans l'application de 25%.\n- Ceci s'applique à tous les utilisateurs, y compris les utilisateurs Premium et Free.\n \nInstallation et téléchargements multilignes :\n- Ajouter des paquets pour différentes versions de jeux. Par exemple, des titres différents et des langues différentes comme l'arabe, le portugais....\n \n- Modifier le nombre de téléchargements dans le Gestionnaire de téléchargements :\n- Mode GameBaTo :\n      Membres gratuits : 2 téléchargements\n      Membres Premium : 8 téléchargements\n- Mode console :\n      Membres gratuits : NaN\n      Membres Premium : 8 téléchargements\n \n- Réduit de 85 % les risques de panique du noyau et d'arrêt de la console.\n- Corrige l'erreur \"Package Installation Busy\".\n- Corrige le problème de blocage du processus d'installation.\n- Correction de quelques problèmes mineurs.\n \n \nTéléchargement : gamebatops4\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187806/in-ps4-le-store-gamebato-est-disponible-en-170-1.png"
        }
    },
    "news_5": {
        "title": "[3DS] Lime, le fork de Citra qui prend la relève",
        "content": "Le projet Lime est un fork de Citra, et il faut avouer qu'il a de l'ambition suite au retrait de la scène de son grand frère. \n \nAvec la disparition de Citra, il est clair que Lime a désormais de l'avenir, il s'agit d'un fork qui s'appuie sur de nombreuses parties de Citra. \n \n \n\n \nDerrière Lime, il y a eu un temps le développeur GPUCode, et c'est désormais Neobrain, auteur de l'émulateur Mikage pour la 3DS, mais d'autres comme ShyVortex ou encore RyzenDew sont très actifs. \n \n \nTéléchargement : Lime-3DS-Emulator\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187792/in-3ds-lime-le-fork-de-citra-qui-prend-la-releve-1.png"
        }
    },
    "news_6": {
        "title": "[PS4] Ajouter des mods Dragon Ball Fighter Z très facilement",
        "content": "En cette triste journée du 8 mars 2024 et suite au décès de MR Akira Toriyama, je publie la version beta 0.9 de mon Modder DBFZ, afin de lui rendre hommage.\n \nE effet, comme précisé juste au dessus, il s' agit d une version Beta, normalement pas destiné à être publié car finie à environ 50/60%, vous pourrez donc rencontrer quelques bugs mineurs (mods non présent ou non fonctionnel sur la ps4) mais rien de grave le plus gros du code étant terminé.\n \n\n \nGrâce à ce script Python, il vous sera très facile de modder votre jeu PS4 en quelques clics. Vous devez posséder le jeu de base CUSA09072 et sa mise à jour correspondante au format FPKG.\n \nCela fonctionne sur toutes les PS4 Jailbreakées, 5.05 à 9.00...\n \nVous trouverez donc dans l archive accompagnant cette new, mon script python, ainsi qu' une vingtaine de MODs PC convertis pour PS4, mais également un fichier.bat (Install pillow.bat) à lancer en premier et qu' une seule fois, afin d' installer les dépendances pour le bon fonctionnement de mon Moddeur.\n \nJe profite de cette new également pour exprimer toutes mes condoléances à la famille de MR Toriyama, notre papa de coeur àtous  bon fan de Dragon Ball, qu 'il repose en paix et un GRAND MERCI à lui pour tous ce qu' il a apporté...\n \n \nVideo tuto:\n \n\n \n \nTélécharger DBFZ Modder BETA V0.9\n \nUn petit Don pour ceux qui veulent continuer à me supporter fais toujours plaisir: https://www.paypal.com/paypalme/markus00095\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187789/in-ps4-ajouter-des-mods-dragon-ball-fighter-z-tres-facilement-1.png"
        }
    },
    "news_7": {
        "title": "[XBS/PS5] Specter commence à chercher sur le SoC AMD 4800s",
        "content": "Le développeur Specter dévoile une première version du plugin pour IDA Pro suite au dump par Flatz du bios du SoC AMD 4800s, qui est a été personnalisé pour être intégré dans les Xbox Series. \n \nCe plugin vous permettra de charger ces fichiers via votre débogueur, le développeur présente sa proposition comme \" Plugin de chargement simple pour IDA pour charger les binaires du firmware AMD-Secure Processor (AMD-SP) anciennement appelé Platform Security Processor (PSP) ou PSP.\" Il rajoute qu'il va \"essayer de charger les blobs du chargeur de démarrage décompressés par PSPTool\" .\n \n \n\n \n \nA noter que son travail est aussi accès sur le 4700s qui est celui utilisé dans la PS5.\n \n \nTout est là : A-IDASP-Loader\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187764/in-xbsps5-specter-commence-a-chercher-sur-le-soc-amd-4800s-1.png"
        }
    },
    "news_8": {
        "title": "[3DS/Switch] Nintendo de plus en plus oppressant sur les développeurs",
        "content": "Il semblerait que le spectre des avocats ou des recours possibles de Nintendo soit de plus en plus oppressant, durant des années Nintendo laissait un peu de liberté, ou faisait moins peur qu'aujourd'hui, où suite à l'affaire Yuzu, certains retirent ou se font retirer d'ailleurs par DCMA leur travail. \n \nLes cas se multiplient ces derniers jours puisqu'après l'accord trouvé avec Tropic Haze LLC de 2.4 Millions de $ impressionne les développeurs indépendants. Ainsi l'émulateur Drastic a été passé en gratuit, en open-source, son développeur Exophase explique que son émulateur DS sur Android est disponible depuis de nombreuses années. Suite aux retombées de la situation de Yuzu et Citra, il a décidé de le retirer du Google Play.\n \n \n\n \n \nLa situation s'est accélérée et selon lui le problème est devenu \"plus urgent\". L'émulateur auparavant était vendu 4.99 $, désormais il est gratuit mais bientôt il sera retiré du store. \n \nEnsuite ce sont les Github qui tombent, FBI de Steveice10 n'est plus accessible sur Github.com pire, le profil de Steveice10 semble avoir disparu, soit il l'a retiré soit c'est Nintendo qui l'a fait retirer, d'habitude la notion de DCMA apparait si le retrait a été demandé par Nintendo, nous pourrions penser que c'est donc le développeur qui a retiré intentionnellement son compte. \n \n \n\n \n\n \nUn autre projet, Linkalho, proposé par le développeur portugais rdmrocha, vient aussi d'être retiré de Github, le développeur a conservé son profil de développeur. \n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187751/in-3dsswitch-nintendo-de-plus-en-plus-oppressant-sur-les-developpeurs-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1187751/in-3dsswitch-nintendo-de-plus-en-plus-oppressant-sur-les-developpeurs-2.jpg"
        }
    },
    "news_9": {
        "title": "[PS3] RPCS3 v0.0.31 Alpha disponible",
        "content": "L'équipe en charge du développement du meilleur émulateur PlayStation 3, RPCS3, propose une nouvelle version majeure de leur proposition. Ils dévoilent en effet la version v0.0.31, une version qui compile l'ensemble des correctifs apportés et le changelog est donc conséquent. \n \n \n\n \n \nDepuis que la v0.0.30 a été balisée :\n \n> 254 nouveaux commits\n> 325 fichiers de code source ont été édités\n> 24 555 lignes de code ont été ajoutées et 12 301 supprimées\n> 16 contributeurs de code\n> 62 jours de développement\n \nRPCS3 a vu son développement débuté il y a 13 ans, avec deux développeurs DH et Hykem et aujourd'hui regroupe une équipe de choc.\n \n \n\n \n \n \n \nTéléchargement : RPCS3 v0.0.31\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187652/in-ps3-rpcs3-v0031-alpha-disponible-1.png"
        }
    },
    "news_10": {
        "title": "[Switch] Yuzu et Citra même combat, Citra est aussi dans l'accord et disparait",
        "content": "Coup dur pour le monde de l'émulation, en plus de perdre Yuzu, les utilisateurs de Citra se trouvent aussi sur le carreau. Ce sont les deux émulateurs qui sont visés par l'accord trouvé entre Tropic Haze LLC et Nintendo. \n \nYuzu étant un fork de Citra, il est donc logique Citra disparaisse également, ce n'était pas encore le cas hier soir quand Yuzu a été retiré en premier, mais c'est désormais chose faite, le site https://citra-emu.org/ fait apparaitre le même message que le site https://yuzu-emu.org/  \n \n \n\n \n \n \nBonjour aux yuz-ers et aux fans de Citra :\n \nNous vous écrivons aujourd'hui pour vous informer que yuzu et le soutien de yuzu à Citra sont interrompus, avec effet immédiat.\n \nyuzu et son équipe ont toujours été contre le piratage. Nous avons commencé nos projets en toute bonne foi, par passion pour Nintendo, ses consoles et ses jeux, et nous n'avions pas l'intention de causer du tort. Mais nous constatons aujourd'hui que nos projets, en contournant les mesures de protection technologique de Nintendo et en permettant aux utilisateurs de jouer à des jeux en dehors du matériel autorisé, ont donné lieu à un vaste piratage. En particulier, nous avons été profondément déçus lorsque des utilisateurs se sont servis de nos logiciels pour faire fuir le contenu de jeux avant leur sortie et ruiner l'expérience des acheteurs légitimes et des fans.\n \nNous avons décidé que nous ne pouvions pas continuer à permettre que cela se produise. Le piratage n'a jamais été notre intention et nous pensons que le piratage des jeux vidéo et des consoles de jeux vidéo doit cesser. À partir d'aujourd'hui, nous allons mettre hors ligne nos dépôts de code, arrêter nos comptes Patreon et nos serveurs Discord et, bientôt, fermer nos sites web. Nous espérons que nos actions constitueront un petit pas vers la fin du piratage des oeuvres de tous les créateurs.\n \nNous vous remercions pour vos années de soutien et pour votre compréhension de notre décision.\n \n \n \nLancé en Avril 2014, Citra était un émulateur libre et open-source de la console de jeu portable Nintendo 3DS, comme nous le voyons, l'impact est donc désormais large, les deux émulateurs sont donc tombés face à la puissance de Nintendo. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187629/in-switch-yuzu-et-citra-meme-combat-citra-est-aussi-dans-laccord-et-disparait-1.png"
        }
    },
    "news_11": {
        "title": "[PSP] pspident et PKGi PSP se mettent à jour",
        "content": "La PSP n'est pas encore à enterrer, du moins certains de proposer encore quelques programmes qui permettent d'en profiter. \n \n\nC'est le cas du développeur Yoti qui propose pspident dans sa version 3.1 apportant un peu correctif pour la PSP Go. \n \nIl y a quelques jours il a mis en ligne la version 3.0 qui a apporté quelques améliorations. \n \nChangelog 3.0 :\n \n- Ajout de la version UMD FW (sauf Go, par @krazynez)\n- Ajout de la détection de la PSP Go TA-094 (nom de code Strider2)\n- pspIdent fonctionne maintenant sur OFW (par @Acid_Snake)\n \nTéléchargement : pspident 3.1\n \n \nAutre nouveauté, PKGi PSP qui se met à jour. \n \n \n\n \nChangelog \n \n\nAjout :\n- Affichage du niveau de la batterie\n- Prise en charge des fichiers .zip (Téléchargement et extraction de liens .zip)\n- Installation locale de fichiers .PKG\nInstaller des fichiers .pkg à partir de la clé USB de la PSP\n- Analyse et liste des paquets à partir de ms0:/PKG\n- Ajouter l'option de stockage PSP-Go (Modifier le fichier config.txt pour changer l'emplacement de stockage et ajouter la ligne storage ms0)\n \nCorrection :\n- Correction de l'ETA de la barre de progression lors de la reprise des téléchargements\n \nDivers : \n- Ajout d'une version compatible OFW (@krazynez)\n\n \n \nTéléchargement : PKGi PSP\n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-90654181.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] Nintendo et Yuzu ont trouvé un accord : arrêt du dév et 2.4 Millions",
        "content": "Et bien cela n'aura pas duré bien longtemps, Nintendo et Yuzu ont trouvé un accord, ou plutot Nintendo et Tropic Haze LLC, la société qui développe l'émulateur Yuzu, enfin qui développe, qui développait du coup. \n \n \n\n \n \nOui l'accord est immédiat, et porte donc sur le fait de la disparition de Yuzu, Nintendo va recevoir 2.4 Millions de $, l'injonction permanente interdit à Tropic Haze LLC de : \n \n- Proposer, commercialiser ou distribuer l'émulateur Yuzu ou son code source\n- Proposer d'autres logiciels ou appareils qui contournent les mesures de protection contre la copie de Nintendo\n- Violer les droits d'auteur de Nintendo directement ou indirectement\n- Utiliser le domaine yuzu-emu.org et les domaines similaires\n- Détruire ou cacher des preuves\n \n \nLe domaine est transféré à Nintendo et le développement est arrêté, cela n'aura pas trainé. Sur le serveur Discord, le développeur principal Bunnei a également annoncé que les développeurs ne travailleraient plus ni ne prendraient plus en charge l'émulateur 3DS Citra (Yuzu étant un fork de Citra). \n \nYuzu a déjà été retiré du site https://yuzu-emu.org, son téléchargement n'est plus possible, le lien /github.com/yuzu-emu/ a aussi été retiré, bref c'est la fin de Yuzu, du moins dabs la forme que nous connaissions depuis plus de 4 ans. \n \n \nTout est là : storage.courtlistener.com\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187571/in-switch-nintendo-et-yuzu-ont-trouve-un-accord-arret-du-dev-et-24-millions-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS5] PS4-5 Eboot DLC Patcher a été mis à jour",
        "content": "Le développeur idlesauce vient de mettre à jour son script PS4-5-eboot-dlc-patcher qui est toujours en bêta.\n \nComme vous le savez cet outil permet d'appliquer des correctifs au fichier eboot pour charger un fichier .prx contenant les ID des DLC, et certaines autres fonctions comme libSceAppContent par exemple.\n \n \n\n \n \nCertaines des fonctions qui sont émulées : \n \n- sceAppContentGetAddcontInfoList\n- sceAppContentGetAddcontInfo\n- sceAppContentGetEntitlementKey\n- sceAppContentAddcontDelete\n- sceAppContentAddcontMount\n- sceAppContentAddcontUnmount\n- sceAppContentGetPftFlag \n \n \nToutes les bibliothèques ne sont pas encore correctement émulées, comme par exemple libSceNpEntitlementAccess, et à l'origine il a été conçu pour les fPKG de la PS4, pas pour la PS5.  \n \nLes changements sont nombreux et se trouvent ici : changelog\n \nTout est là : ps4-eboot-dlc-patcher\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187523/in-ps5-ps4-5-eboot-dlc-patcher-a-ete-mis-a-jour-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] Ryujinx présente la nouvelle interface Avalonia",
        "content": "L'équipe Ryujinx est fière d'annoncer l'arrivée de la toute nouvelle interface Avalonia. Il s'agit d'un framework qui vient en surcouche en interface utilisateur multiplateforme basé sur .NET. L'un des grands avantages est que cette interface est assez souple, et offre un style de système flexible.\n \n \n\n \n \nCette nouvelle interface apporte plusieurs fonctionnalités, comme un écran de démarrage du loader de jeux, un gestionnaires de mods, une vue en grille de la liste des jeux, ou encore la gestion des thèmes sombres et clairs. \n \n \n \n\n \n \n \nLa Team explique qu'il n'y aura pas de rapport d'avancement ce mois-ci car le rédacteur n'a pas eu assez de temps disponible pour pouvoir le rédiger. \n \n \nTéléchargement : ryujinx.org\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187519/in-switch-ryujinx-presente-la-nouvelle-interface-avalonia-1.png"
        }
    },
    "news_15": {
        "title": "[Switch] SimpleModDownloader 2.0.0 disponible!",
        "content": "Salut à tous, c'est avec grand plaisir que je vous annonce la sortie de la version 2.0.0 de SimpleModDownloader. Pour rappel cet homebrew va vous permettre de télécharger les mods depuis gamebanana directement depuis votre switch. Cette mise à jour est particulière rien qu'en voyant le tag, en effet c'est une mise à jour majeur. J'ai réécris l'application de zéro en utilisant un fork de borealis qui est bien plus avancé et m'a permis de faire une UI bien plus jolie. Tous les bugs connus ont été fixé, le changelog est plutôt conséquent\n \n \n\n \n\n \nvidéo:\n\n \nChangelog :\n- Réécriture de l'app avec borealis\n- Passage vers un nouveau build tool : cmake\n- Fix #46 and #39\n- Une nouvelle page pour voir la preview du mod\n- Ajout d'une détection pour voir si un mod est compatible avec SimpleModDownloader (en réalité l'application regade si dans l'archive il y a un dossier romfs, l'api de gamebanana le permet)\n- Ajout d'un fix pour éviter un crash qui arrivait quand le mod comprenait des caractères spéciaux\n- Les temps de chargement sont réduits en plus d'utiliser du multi threading\n \n \nTéléchargement : SimpleModDownloader 2.0.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187517/in-switch-simplemoddownloader-200-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1187517/in-switch-simplemoddownloader-200-disponible-2.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] La team Yuzu se prépare pour répondre à l'action de Nintendo",
        "content": "Il fallait s'en douter, la team Yuzu ne va pas se laisser faire et compte bien continuer à proposer son émulateur, et c'est le volet juridique que cela va désormais se passer.\n \nL'équipe vient en effet de répondre aux injonctions de Nintendo en commençant en assurer sa défense, la team Yuzu est accompagné d'un avocat spécialisé dans la résolution de litiges internationaux. \n \n \n \n\n \n \n \n \nMichael Daly est un avocat spécialisé possédant une expérience significative dans les arbitrages internationaux, sa pratique vise à aider ses clients à résoudre des défis transfrontaliers, notamment les plus grandes entreprises et les représentants gouvernementaux. Il conseille actuellement le Centre international pour le règlement des différends relatifs aux investissements (CIRDI), la Chambre de commerce internationale (CCI), la Cour d'arbitrage international de Londres (LCIA) et le tribunal de district des États-Unis.\n \nMichael a auparavant été conseiller juridique au Tribunal des réclamations Iran-États-Unis à La Haye et auprès de Charles N. Brower, ce n'est à priori pas l'avocat du coin de la rue. Bien entendu le risque est tellement grand pour Tropic Haze LLC, l'entreprise qui détient Yuzu, qu'elle se devait de répondre avec une assistance juridique sérieuse. \n \n \n \n\n \n \n \nIl y a urgence, l'ordonnance du tribunal interdit à Tropic Haze de diffuser, commercialiser ou fabriquer l'émulateur Yuzu et oblige l'entreprise à se rendre et à cesser d'utiliser le nom de domaine YUZU-EMU.ORG. Nintendo demande la saisie, la mise en fourrière et la destruction de toutes les copies de l'émulateur Yuzu ou d'autres appareils ou logiciels dans un délai de 30 jours.\n \nTous les documents juridiques sont compilés quotidiennement ici : courtlistener.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187472/in-switch-la-team-yuzu-se-prepare-pour-repondre-a-laction-de-nintendo-1.jpeg",
            "image_2": "https://www.logic-sunrise.com/images/news/1187472/in-switch-la-team-yuzu-se-prepare-pour-repondre-a-laction-de-nintendo-1.png"
        }
    },
    "news_17": {
        "title": "[Series X/S] Flatz a dumpé la rom AMD PSP du CPU 4800s",
        "content": "Le développeur Flatz vient d'annoncer sur X avoir réussi à dumper la Rom AMD PSP de l'APU 4800s d'AMD, bon dit comme ça cela ne signifie pas grand chose. \n \nLa Rom AMD PSP, pour AMD Platform Security Processor, est la partie de l'APU qui jusqu'à présent était inaccessible. Le processeur 4800s est l'APU de PC de bureau qui est utilisé dans les consoles Xbox Series X, nom de code Arden et Sparkman.\n \nPour rappel, l'AMD Secure Processor (AMD-SP) anciennement appelé Platform Security Processor (PSP) est un minuscule coprocesseur microcontrôleur intégré dans les puces d'AMD qui fournit les fonctionnalités nécessaires au management de certains assets à distance, un sous-système dédié à la sécurité et du démarrage sécurisé.\n \n \n\n \n \nAinsi arriver à dumper cette partie de l'APU permet d'en explorer le coeur, le fait d'avoir le dump de la ROM permet de lire son code, mais aussi d'en trouver des failles. Au début il s'est trouvé confronté à un blocage au niveau de l'interface UART, puis à un disfonctionnement du loader PSP qui ne configurait pas la puce SuperIO. Pour cela il a du utiliser une carte mère spécifique de MSI, utilisant la même puce SuperIO, mais le faible volume de documentation technique ne permet pas d'avancer rapidement. \n \nAprès une semaine d'essai, d'utilisation de la force brute, de flash de bios dans lequel il a intégré le payload PSP, puis réussi à faire fonctionner le bus LPC à l'aide de Logic Analyzer, et ainsi il a pu trouver une combinaison de registres/bits qui devaient être basculés pour activer l'UART.\n \n \n\n \n \n \nEnfin, il a appliqué des primitives de lecture/écriture/appel appropriées exécutées via le serveur UART à partir de son payload PSP qui fonctionne en mode SVC.\n \nBien entendu tout cela ne signifie en rien que la Xbox Series X va être craquée, mais cela montre que certains s'intéressent toujours à tenter d'en faire sauter certaines sécurités. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187470/in-series-xs-flatz-a-dumpe-la-rom-amd-psp-du-cpu-4800s-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1187470/in-series-xs-flatz-a-dumpe-la-rom-amd-psp-du-cpu-4800s-2.png"
        }
    },
    "news_18": {
        "title": "[Switch] Strato, l'émulateur Switch qui vaut le coup d'oeil",
        "content": "Comme vous le savez, les équipes en charge du développement de Ryujinx et Yuzu sont désormais dans le viseur des avocats de Nintendo, ce qui menace à long terme les deux solutions, même si les deux teams souhaitent continuer chacune à proposer leur solution software.\n \nLes forks de ces émulateurs sont nombreux, même si pour la plupart cela se limiter à quelques optimisations assez spécifiques, l'un d'entre eux, Strato, sort du lot. \n \n \n \n\n \n \n \nStrato est une solution open-source permettant d'émuler une Nintendo Switch sur Android,  des progrès significatifs ont été effectués récemment. \n \nStrato a été lancé après l'arrêt de Skyline, un précédent émulateur Nintendo Switch™, en mai 2023. Le projet Strato a été créé pour poursuivre le travail de Skyline, en résolvant ses problèmes et en améliorant ses performances et sa compatibilité.\n \n \n \n\n \n \n \nD'ailleurs, l'un des 8 développeurs, Senhor Linguica, montre une vidéo assez impressionnante de Nier : Automata tournant sous Snapdragon 8 Gen 2, de quoi se donner une idée des capacités de Strato en attendant sa sortie vers Juin 2024.\n \nLe site officiel est là : https://strato-emu.github.io/\n \n(edit RomAnOCrY: modif de la news suite au commentaire d'Adrien98)\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2046505681.png"
        }
    },
    "news_19": {
        "title": "[Switch] Le Mig Switch bénéficie d'une mise à jour firmware",
        "content": " \nL'équipe en charge du développement du Mig Switch a dévoilé il y a quelques jours une mise à jour firmware pour leur solution. Le 26 février 2024, le firmware 1.1.0 a été mis en ligne, ce qui d'un côté rassure les utilisateurs et futurs acheteurs car cela faisait quelques semaines que nous n'avions plus de nouvelles sur leur site, et puis cela permet d'améliorer la solution. \n \nDisponible dans la partie \"Download\" de leur site, cette mise à jour vise à améliorer le temps de démarrage des fichiers XCI fragmentés sur une partition formatée en exfat. \n \nCette mise à jour apporte aussi une amélioration sur la détection lors du lancement des ROM. \n \n \n\n \n \nLa Team communique aussi au travers de ce ticket puisqu'elle informe que le design du Mig Dumper a été finalisé, et que sa production a démarré lentement, tout en ajoutant qu'elle laisse de la place au Mig Card. Elle assure qu'elle met tout en oeuvre pour que chacun puisse obtenir ses deux solutions le plus rapidement possible. \n \n \n \nTéléchargement : Firmware 1.1.0 pour le Mig Switch\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187416/in-switch-le-mig-switch-beneficie-dune-mise-a-jour-firmware-1.png"
        }
    },
    "news_20": {
        "title": "[PS3] Nathan Martin travaille sur le CFW Evilnat 4.91 CEX Cobra",
        "content": "Le développeur Nathan Martin nous informe via un tweet qu'il finalise le développement de son nouveau custom firmware basé sur l'OFW 4.91 de Sony.\n \nSon CFW qui portera le nom de CFW Evilnat 4.91 Cex Cobra nécessite encore un peu de temps pour tester si tout fonctionne correctement. Il est fort probable que d'ici quelques jours il soit disponible en privé pour tout une batterie de tests avant de le libérer plus largement au téléchargement. \n \n \n\n \n \nLes CFW sont maintenant moins nombreux, les développeurs ayant désormais arrêtés les développements, ou ont basculés vers la PS4 ou plus récemment la PS5. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2027253783.png"
        }
    }
}