{
    "news_1": {
        "title": "[Switch] DeepSea 4.6.0 disponible",
        "content": "Le développeur Team-Neptune propose une nouvelle version de DeepSea qui comme les petits copains apportent le support de la dernière version d'Atmosphere. \n \nPour rappel, DeepSea est un Pack AIO regroupant tout en un pack, l'objectif est de facilité l'accessibilité pour les utilisateurs d'Atmosphère.\n \n \n\n \n \nCette version ajoute la prise en charge du dernier firmware Nintendo 16.0.3 : \n \n- Mise à jour d'Atmopshere vers 1.5.3\n- Mise à jour de Hekate vers 6.0.4\n- Mise à jour de AiO Switch Updater vers 2.21.4\n- Mise à jour de emuiibo vers 1.0.0\n- Mise à jour de MissionControl vers 0.9.2\n- Mise à jour de nx-ovlloader vers 1.0.7\n- Mise à jour de Status-Monitor-Overlay vers 0.9.0\n- Mise à jour de sys-clk vers 1.0.3\n \n \nTéléchargement : DeepSea 4.6.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173720/in-switch-deepsea-460-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[Switch] NeXT 3.00 disponible",
        "content": "Le développeur mistervampi vient de mettre en ligne une nouvelle version de NeXT, il faut dire qu'il fallait bien apporter le support du dernier firmware 16.0.3.\n \nPour rappel NeXT est un tout en un qui supporte les CFW que ce soit Atmosphere ou SX OS, de plus sa gestion des applications est largement simplifiée par une interface utilisateur très fonctionnelle. Similaire à DeepSea ou encore RetroReloaded, NeXT intègre de nombreux payloads, et sa plus grande des possibilités est de pouvoir facilement gérer Atmosphere et SX OS au travers d'une interface graphique riche. \n \n \n\n \n \nChangelog : \n \n- Prise en charge de la version 16.0.3 \n- Compatibilité totale avec toutes les consoles Switch moddées Soft / Hard\n \nMises à jour : \n \n- Nouveau Bootmenu basé sur Heakate\n- Atmosphère => 1.5.3\n- Sigpatches => 1.5.3\n- Tesla OVL\n- Emuiibo\n- Lan Play\n- AIO Switch Updater\n- DBI\n- Nombreuses mises à jour majeures \n- Paquet à très haute compression\n \nFYI : Tous les patches/hombrew/sys-modules les plus importants ont été testés avant cette sortie publique afin de vérifier la compatibilité et le bon fonctionnement de cette AIO avec le dernier firmware système disponible. Mais dans certains cas, les modules hombrew/sys ne sont pas mis à jour par leurs développeurs au moment de chaque sortie de NeXT. Il faut donc garder à l'esprit que l'utilisation de certains modules hombrew/sys non mis à jour peut entraîner un blocage ou un plantage du système. \n \n \nTéléchargement : NeXT 3.00\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173710/in-switch-next-300-disponible-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS5] PS5 NOR Modifier 1.0 disponible",
        "content": "Le développeur TheCod3r vient de publier son outil PS5 NOR Modifier, sous ce nom se cache un outil qui vous aide à mettre à jour le  fichier flash NOR de la PS5, vous l'aurez compris cet outil se destine avant tout à des réparateurs.\n \nTheCod3r n'en est pas à son coup d'essai puisqu'il a largement contribué à la scène PS4 et PS5 notamment lors de lecteur blu-ray HS. Dernièrement il a travaillé sur le fait de reclasser une console PS5 disposant d'un lecteur HS en modèle numérique afin d'empêcher les erreurs qui y sont liées. \n \n \n \n\n \n \nPS5 NOR Modifier vous permet de modifier votre fichier PS5 NOR pour le convertir entre les éditions numériques et sur disque pour enregistrer votre PS5 lorsque votre lecteur de disque tombe en panne ou lorsqu'aucun lecteur de disque n'est disponible.\n \nGrâce à ce logiciel gratuit, vous pouvez ramener votre console de la tombe en convertissant une édition disque en édition numérique, ainsi qu'en changeant le numéro de série et la variante signalée afin de remplacer votre rom flash SPI lorsqu'elle meurt ! Ceci est particulièrement utile lorsque vous ne disposez pas non plus d'un lecteur de disque correspondant, en convertissant un disque en une édition numérique afin de permettre de futures mises à jour (restauration de la fonctionnalité en ligne en gardant votre PS5 à jour). Si votre rom flash SPI meurt (très courant), vous pouvez maintenant modifier le vidage à partir d'une autre console et conserver la fonctionnalité du lecteur de disque. Vous n'avez plus besoin de convertir en version numérique lorsque votre rom flash SPI meurt!\n \nCaractéristiques:\n \n- Lisez le numéro de série de vidage du BIOS signalé, la version signalée (disque ou numérique) et la variante de carte (modèle CFI-XXX).\n- Modifiez le numéro de série indiqué dans le vidage du BIOS.\n- Alternez entre les versions disque et numérique.\n- Changer de variante de carte.\n- Traitement en un clic, pas besoin d'expérience en ligne de commande ou de compétences en édition HEX.\n- Rapide, léger et facile à utiliser.\n- Application autonome, aucune installation requise.\n- Entièrement portable. Transportez l'application sur une clé USB et exécutez-la instantanément.\n \nTéléchargement : ps5-nor-modifier-v1-0-0-0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173693/in-ps5-ps5-nor-modifier-10-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[Switch]DBI 563 disponible",
        "content": "Rashevskyv, le développeur de DBI propose une nouvelle version de son logiciel, la version 460. DBI pour DB Installer est un gestionnaire et installateur de fichiers NSP/NSZ/XCI et XCZ via SD, USB. Il fonctionne tout aussi bien en standalone ou bien en créant son propre serveur http local. Il permet aussi de gérer et supprimer les fichiers orphelins les tickets (mise à jours par exemple). Hormis une tendance très minimaliste exacerbée, DBI est apprécié pour ses fonctionnalités et une partie backend de Windows qui permet de faciliter les transferts.Grâce au multi-threading, l' installation du NSP a été accélérée d'environ 40 %, désormais plus d'informations sont affichées pendant le processus d'installation et certaines erreurs de sortie ont été corrigées lorsque la console est en mode dock. Les dumps de plus de 4 Go peuvent désormais également être dumpés sur des périphériques FAT32 grâce au fractionnement. Le menu de sauvegarde des données a été repensé et un code QR s'affiche au démarrage du serveur FTP.\n \n\n \nChangelog 563 :- Potentiellement corrigé l'installation de nouveaux jeux\n \nTéléchargement: DBI 563\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173684/in-switchdbi-563-disponible-1.jpg"
        }
    },
    "news_5": {
        "title": "[Vita] HexLauncher Custom v2.0 disponible",
        "content": "La version fortement modifiée de HexFlow Launcher et gestionnaire de sauvegarde avec interface utilisateur 3D pour les consoles PlayStation Vita et PlayStation TV, l'HexLauncher Custom passe en version 2.0 et autant le dire les changements sont très nombreux. \n \nA commencer par RetroFlow (activez-le dans les paramètres), SwitchView/GridView, JIT rolling cache, pas moins de 8 fonds d'écran, 10 langues, l'ajout d'un nouveau style pour \"Bouton de catégorie : haut/bas\", et de très nombreuses corrections. \n \nCette application utilise Adrenaline Manager au lieu du lanceur d'adrénaline de RetroFlow , car de nombreuses personnes ont signalé des problèmes avec le lanceur d'adrénaline.\n \nCette version 2.0 vient corriger de nombreux bugs de la version 1.2.1 et 1.2.2, en effet parfois, si le rolling cache est activé, il efface le cache au lieu de mettre à jour la ligne. L'écran \"écrire dans le cache\" ne devrait s'afficher que lorsque vous installez une nouvelle application ! Si vous avez eu ce bug, le démarrage de l'application devrait maintenant être beaucoup plus rapide. C'est ~3.9 secondes avec 500 jeux mais si vous activez RetroFlow, cela ajoute ~2 secondes.\n \n \n\n \n \n \n\nChangelog v2.0\n\n\nLA GRANDE MISE À JOUR DE RETROFLOW !\n \nAperçu rapide :\n \nRetroFlow (activer dans les paramètres), SwitchView/GridView, JIT rolling cache, 8 backgrounds, 10 langues\n \nEnfin, un réglage a été ajouté : RetroFlow ON/OFF !!! A toutes les catégories de RetroFlow 6.0 sauf : PSM,\nScummVM, MAME/MAME+, NeoGeo, et FBA... Cependant, veuillez noter qu'il supporte plusieurs catégories \"plus récentes\" de RetroFlow.\ncatégories RetroFlow \"plus récentes\" : RetroArch PS1, Pico-8, Dreamcast. Supporte la PS1/PSP sans RetroFlow\n(Adrenaline Manager) mais ne supporte pas (encore) les PSP Categories Lite.\n \nIl lira les dossiers de données créés par RetroFlow, mais ne créera ni ne supprimera aucun dossier ou fichier, sauf lors des téléchargements de pochettes.\ndossiers ou fichiers, sauf lors des téléchargements de pochettes. Si vous utilisez RetroFlow pour la première fois, il est recommandé\nd'installer la dernière version de RetroFlow, de l'exécuter au moins une fois et de suivre les instructions d'installation.\ninstructions d'installation. Cette application utilise Adrenaline Manager au lieu d'Adrenaline\nLauncher de RetroFlow, car de nombreuses personnes ont des problèmes avec Adrenaline Launcher.\n \nLe cache restera magiquement toujours à jour grâce à la génération de commutateurs JIT (\"Rolling Cache\")\nC'est probablement la principale raison d'utiliser cette application plutôt que RetroFlow.\n \nCorrection d'un bug majeur de la v1.2/v1.2.1 où parfois, si le rolling cache est activé, il efface le cache au lieu de mettre à jour une ligne....\ncache au lieu de mettre à jour une ligne... Vous saurez que vous avez ce problème si l'écran \"writing to cache\" s'affiche à chaque fois.\ns'affiche à chaque fois - ce n'est pas censé être le cas. Espérons que ce problème sera corrigé dans cette version. L'écran\nL'écran \"écrire dans le cache\" ne devrait s'afficher que lorsque vous installez une nouvelle application ! Si vous avez eu ce bug,\nle démarrage de l'application devrait maintenant être beaucoup plus rapide. C'est ~3.9 secondes avec 500 jeux mais si vous activez\nRetroFlow, cela ajoute ~2 secondes.\n \n \nJ'ai enfin publié l'affichage en grille, disponible dans le menu de démarrage avec \"Allow View #5/#6\", parce qu'il a enfin été suffisamment optimisé pour ne pas causer de lag.\na finalement été suffisamment optimisé pour ne pas causer de lag massif.\n \nTéléchargement des couvertures RetroFlow \"Loose match\"... Beaucoup de gens voulaient vraiment cela à cause de\nconventions de nommage de RetroFlow sont très strictes. Exemple : vous pouvez télécharger une pochette pour un\njeu qui s'appelle simplement \"Super Metroid\"... le téléchargement se fera par défaut sur la pochette des USA.\n \nAmélioration des téléchargements de pochettes par le menu de démarrage : saut des entrées qui ont déjà des pochettes. Ajout d'un\n\"Screen.waitVblankStart()\" pour que vous puissiez voir brièvement quelles couvertures sont ignorées.\nFonctionne maintenant pour toutes les catégories, y compris les bières maison qui ont une couverture de type vita (vous devriez les remplacer si c'est le cas).\nles remplacer si c'est le cas). Le téléchargement est devenu synchrone au lieu d'asynchrone : cela semble beaucoup plus rapide.\nLes téléchargements massifs de pochettes pour PSP/PS1 utiliseront désormais le scanner d'identité, comme c'est le cas dans le menu triangle.\nCorrection d'un cas où il n'y avait pas d'erreur en cas d'absence de wifi.\n \nProtection de cur_quick_dir, une variable utilisée pour les overrides et partout où le code\nSystem.doesFileExist(...) (cur_quick_dir est beaucoup plus rapide mais moins stable).\n \nAmélioration drastique de la fonction d'augmentation et de diminution de la catégorie (c'est à dire : pour\nlorsque vous appuyez sur la touche carré). Elle permet désormais de cacher correctement une catégorie CUSTOM existante mais vide.\n \nAjout d'un nouveau style pour le \"Bouton de catégorie : Haut/Bas\"\n \nCorrection de l'espacement N64 en vue plate (expérimental)... ajout de la fluidité en vue zoomin et en vue gauche.\nCrédit à Axce pour l'idée mais son code n'a pas été utilisé. Actuellement en train d'expérimenter la meilleure\nla meilleure façon d'ajouter de la fluidité aux vues autres que la vue zoomin/gauche.\n \nLa catégorie CUSTOM peut être utilisée de la même manière que les \"collections\" dans RetroFlow, par exemple pour contenir toutes vos applications de type \"utilitaire\".\npour contenir toutes vos applications de type \"utilitaire\". Cependant, elle a besoin d'être mise à jour pour supporter les entrées de RetroFlow... la mise à jour est actuellement en cours de test.\nest actuellement en cours de test. Lorsque ce sera fait, vous pourrez ajouter des choses à la catégorie CUSTOM via le menu triangle.\nle menu triangle.\n \nCorrection d'une situation où, si c'était la première fois que l'on démarrait, les overrides ne fonctionnaient pas du premier coup.\n \nInclut également la correction d'un bug mineur de la v1.2.1 où certaines catégories pouvaient ne pas s'afficher correctement lors du premier démarrage.\nau premier démarrage.\n \nAjout d'un nouveau bouton en bas du menu de démarrage \"Exit\", comme une sorte de placeholder :\nil sera remplacé par \"Utilities\" ou \"System Apps\" le cas échéant.\n \nL'application RetroFlow actuelle peut ne pas enregistrer les couvertures téléchargées à partir de cette application si vous avez\nl'analyse au démarrage est désactivée dans l'application RetroFlow actuelle. Les couvertures téléchargées dans RetroFlow apparaîtront toujours ici\nà chaque fois grâce au cache mobile.\n \nIl y a un bug concernant RetroFlow et \"Return to Last-Played Game\"... si vous avez 2\nRetro avec les mêmes noms de fichiers dans des catégories DIFFÉRENTES, il se peut que le choix se porte sur le mauvais jeu si la catégorie\ndernière catégorie jouée était \"All\"/\"CUSTOM\"\n \nSi vous utilisiez une version expérimentale, le fichier \"ux0/data/HexFlow/debugfile.dat\" peut être supprimé.\n \nChangement du titre de l'application en \"HexFlow Custom\". Si l'ancien titre subsiste, il se peut qu'il ait été enregistré comme un \"renommage\".\ncomme un \"renommage\". Vous pouvez le réinitialiser en défilant jusqu'à HexFlow Custom... en appuyant sur le triangle... en sélectionnant\n\"renommer\"... et en le mettant à blanc, ce qui réinitialisera le titre.\n \nAjout d'une meilleure protection au code Category_Plus(), Category_Minus(), et categoryButton ;\noù vous ne pouviez pas changer de catégorie si vous aviez piraté \"categoryButton\" dans config.dat pour en faire une valeur invalide, et où la première fois que vous changiez de catégorie, la valeur de \"categoryButton\" devenait invalide.\nvaleur invalide et où la première fois que vous appuyez sur le bouton de catégorie, il n'est pas enregistré si vous avez piraté \"showCat\".\nsi l'on pirate \"showCat\" dans config.dat pour qu'il ait une valeur invalide (pour une meilleure compatibilité).\n \nCorrection (avec un peu de chance) de la situation où une nouvelle installation pouvait être retardée lors du premier lancement si l'option Recently Played était activée.\n \nAméliorations mineures : Seuls les dossiers d'applications avec 9 caractères importés, supprime les\nles doublons ou les dossiers sauvegardés manuellement / renommés.\n \nMise à jour des traductions italiennes, crédit DaRk_ViVi\n \nNouveaux bugs :\n \nLorsque vous quittez le menu triangle, la modbox va légèrement dérailler pendant environ 1/60ème de seconde ou moins dans certaines catégories.\nseconde ou moins dans certaines catégories. Vous le manquerez facilement même si vous le cherchez.\n \nSi vous avez 2 entrées RetroFlow avec le même nom de fichier de base, alors \"retourner à la dernière lecture\",\nla catégorie \"récemment écouté\" et la catégorie \"personnalisé\" peuvent afficher le mauvais fichier. Pour cette raison, la catégorie\npour cette raison, la catégorie \"personnalisée\" ne prend pas facilement en charge les entrées RetroFlow. Il faudra\nune énorme refonte pour la faire fonctionner correctement La \"refonte\" permet également à cette application d'utiliser les \"Collections\" - l'une des applications les plus intéressantes de RetroFlow.\n\"Collections\" - l'une des grandes nouveautés de la version actuelle de RetroFlow 6.0... Cette\nCette \"refonte\" est déjà faite mais est actuellement en test de bogues.\n \nindex.lua est le code source\n \n\n \n\n\n \n \n\nTéléchargement : HexFlow-Launcher-Unofficial-Custom 2.0\n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-137760304.png"
        }
    },
    "news_6": {
        "title": "[PS4] Saturn2Ps4 v1.1 pour 5.05, 6.72 et 9.00",
        "content": "Voici la mise à jour de mon script permettant de convertir un jeu Saturn pour PS4 qui passe donc en version 1.1, apportant quelques nouveautés.\n \n\n \nEn effet, grâce à ce nouveau script il vous sera possible de profiter des vos jeux Sega Saturn sur votre PS4 5.05, 6.72 et 9.00. Vous pourrez ainsi jouez à un grand nombre de titre Saturn en plein écran si vous le désirez, garder à l esprit par contre que certains titres ne seront pas compatibles et que d'autres fonctionneront plus ou moins bien...\nA savoir également qu'il vous faudra le goldhen 2.3 minimum pour faire fonctionner cet émulateur Saturn.\n \n\n \n \nDans les nouveautés vous trouverez comme  le screen ci dessus, les traductions espagnole et italienne du script (merci aux traducteurs NanospeedGamer et PepeCobain), une nouvelle option qui permet de désactiver le Widescreen et avoir un écran en 4/3 mais aussi 2 nouveaux formats de jeux saturn pris en compte, MDS/MDF et CCD/IMG/SUB.\n \nPour savoir comment utiliser mon script il vous suffit de regarder ma vidéo tuto ci dessous:\n \nVidéo tuto:\n \n\n \nChangelog:\n \n\nV1.0:\n- Version initiale\n \nV1.1:\n- Ajout de la langue Espagnole traduction par NanospeedGamer\n- Ajout de la langue Italienne traduction par PepeCobain\n- Prise ne charge des formats CCD/IMG/SUB et MDF/MDS\n- Ajout d' une option pour désactiver le widescreen (écran 4/3)\n- Correction d' un bug dans l'injection du config .INI\n \n \n\n \nTélécharger Saturn2PS4 v1.1\n \nUn petit don pour me soutenir est toujours le bienvenue ^^:https://www.paypal.com/paypalme/markus00095\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173651/in-ps4-saturn2ps4-v11-pour-505-672-et-900-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173651/in-ps4-saturn2ps4-v11-pour-505-672-et-900-1.jpg"
        }
    },
    "news_7": {
        "title": "[Switch] Suite au DMCA, Picklock RCM remplace Lockpick RCM",
        "content": "Comme vous le savez Nintendo a décidé de passer la seconde sur Github, le géant a carrément demandé le retrait de Skyline, un émulateur Switch, celui de Boot Manager RetroReloaded Pro développé par RetroGamer74, et NeXT par du développeur mistervampi a également été annulé, mais ce n'est pas tout, il y a aussi Lockpick RCM. \n \n \n\n \n \nLe blocage définitif du Github de Lockpick et de tous ses forks possibles marque les esprits, mais il semble que pour Lockpick RCM, il y a une forme de rébélion, puisqu'il est déjà de retour, la même application a été uploadée sur le service d'hébergement Github par le développeur Slluxx (alias Calvin), et comme une provocation il y a même un commentaire \" You aint taking this down \", que l'on pourrait traduire par \" Vous n'allez pas l'enlever \" ou \" Vous n'allez pas le supprimer \". \n \nPicklock_RCM est un payload Nintendo Switch qui dérive des clés de chiffrement à utiliser dans les logiciels de gestion de fichiers Switch tels que hactool, hactoolnet/LibHac, ChoiDujour sans démarrer Horizon OS. En raison des changements imposés par le firmware 7.0.0, l'homebrew Lockpick ne peut plus dériver les dernières clés. \n \nClairement c'est un risque que prend Calvin Slluxx en dévoilant Picklock RCM, nous verrons bien si Nintendo arrive à réagir rapidement.\n \n \nTéléchargement : Picklock_RCM v1.9.10\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173561/in-switch-suite-au-dmca-picklock-rcm-remplace-lockpick-rcm-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] switch_AIO_LS_pack 4.12.0",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 4.12.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\nMise à jour de Atmosphere et de Hekate vers la dernière version de ceux-ci.\nMise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 4.12.0:\nCompilé avec la dernière version de la Libnx.\n\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\nN'hésitez pas à faire vos retours, ils seront les bienvenues.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-4.jpg"
        }
    },
    "news_9": {
        "title": "[Switch] Hekate v6.0.4 disponible",
        "content": "Le développeur CTCaer dévoile une nouvelle version de hekate qui passe en version v6.0.4, Nyx lui est toujours proposé en v1.5.3. Contrairement à d'habitude ces versions n'apportent pas beaucoup de changements. \n \n \n\n \n \nA priori le seul intérêt de cette version d'Hekate est d'apporter le support du nouveau firmware officiel 16.0.3, et c'est déjà pas mal.\n \n \nTout est là : Hekate 6.0.4\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173486/in-switch-hekate-v604-disponible-1.png"
        }
    },
    "news_10": {
        "title": "[PSP] Baryon Sweeper mis à jour en Mai 2023 pour unbrick plus de PSP",
        "content": "Notre ami sunriseur Smada nous informe que le logiciel Baryon Sweeper a été mis à jour dans une version \"Mai 2023\". \n \nPour les plus jeunes d'entre vous, Baryon Sweeper est un logiciel né d'un travail collaboratif de plusieurs hackers de la scène en Janvier 2021. \n \nA l'origine c'est le développeur Khubik qui avait partagé un guide vidéo sur la façon d'utiliser Baryon Sweeper, en conjonction avec une batterie Pandora \"nouveau style\", pour débrick une PSP 3000.\n \n \n \n\n \n \n \nQu'est-ce que Baryon Sweeper ? \n \nLa batterie Pandora  était probablement la version la plus importante de la scène de hack PS : un simple hack de la batterie PSP, permettant à la console de passer en mode service. Et à partir de là bricoler l'appareil, notamment pour installer et exécuter des custom firmwares, ou flasher un firmware propre sur une PSP brickée. Mais Sony a mis à jour le processus de mode de service de la PSP avec de nouvelles révisions matérielles, rendant la batterie Pandora inutile sur les nouveaux modèles PSP Slim (PSP 2000) et tous les modèles PSP Brite (PSP 3000). .\n \nBaryon Sweeper est un outil qui rend enfin possible un processus de type Pandora sur la plupart des PSP. C'est cependant un peu plus lourd que le processus Pandora, et bien c'est ce logiciel qui a été mis à jour, imitant les outils de récupération officiels de Sony. \n \n \n\n \n \n \nC'est grâce au travail de Davee qui a récupéré la semaine dernière de nouvelles clés permettant ainsi l'unbrick sur pour les modèles PSP 3000 04g, 07g, et 09g.\n \nPour mettre à jour le mieux est d'utiliser pysweeper ( https://github.com/khubik2/pysweeper)en remplaçant le fichier keys.json, en attendant que khubik2 mette à jour les clés contenu dans Baryon Sweeper directement. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173457/in-psp-baryon-sweeper-mis-a-jour-en-mai-2023-pour-unbrick-plus-de-psp-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] Atmosphère 1.5.3 disponible",
        "content": "SciresM est en réaction permanente face à Nintendo, et propose déjà une nouvelle version d'Atmosphère, à croire qu'il est en mode veille et que chaque mise à jour firmware déclenche en lui une version de son célèbre logiciel. \n \nQuoiqu'il en soit voilà la version 1.5.3 d'Atmosphere avec bien entendu le support du firmware officiel 16.0.3, mais ce n'est pas tout, il en profité pour mettre à jour beaucoup d'autres éléments de sa solution.\n \nCette version 1.5.3 est la soixante-douzième version officielle d'Atmosphère, cette version est fournie avec hbl 2.4.3, et hbmenu 3.5.1.\n \n \n\n \n \n \nCe qui suit a été modifié depuis la dernière version :\n \n- Le support du firmware officiel 16.0.3 a été ajouté.\n- Atmosphère a été mis à jour pour utiliser GCC 13/newlib (dernières versions de devkitA64/devkitARM).\n- Remarque : Cette mise à jour introduit un problème connu, sur lequel nous travaillons actuellement.\n- Comme vous vous en souvenez peut-être dans le changelog de la version 1.4.1, Fire Emblem : Engage nécessite d'énormes quantités de mémoire pour pouvoir utiliser les mods layeredfs dans le jeu.\n- La dernière version de GCC/newlib augmente légèrement la taille de l'overhead malloc, ce qui rend l'augmentation de mémoire précédente insuffisante.\n- Une solution générale à ce problème est en cours d'élaboration, ce qui devrait, je l'espère, résoudre le problème d'une manière qui ne me portera pas la poisse pour l'avenir.\n- Un certain nombre de problèmes mineurs ont été corrigés et des améliorations ont été apportées :\n- Un problème a été corrigé qui faisait que le remplacement de la police système ne fonctionnait pas sur la version 16.0.0+.\n- Un problème mineur de précision a été résolu dans la gestion par mesosphere de certaines plages de mémoire ; ce problème n'aurait eu aucun impact visible pour l'utilisateur final.\n- Améliorations générales de la stabilité du système afin d'améliorer l'expérience de l'utilisateur.\n \n \nTéléchargement : Atmosphère 1.5.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173454/in-switch-atmosphere-153-disponible-1.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] Nintendo sort le firmware officiel 16.0.3",
        "content": "Nintendo vient de dévoiler cette nuit un nouveau firmware à destination de la Nintendo Switch, le firmware officiel 16.0.3 vient en effet d'être mis en ligne par le géant japonais. \n \nQuoi en attendre, pas grand chose, ce firmware ne contient à nouveau que des corrections de bugs, en particulier dans le module système FS. Atmosphère et les patchs de signature ont déjà été mis à jour et sont donc pleinement fonctionnels. \n \nLes rapports Yellow's8 sont là : yls8.mtheall.com\n \n \n\n \n \n \nSystem Titles :\n \nSeuls SystemVersion et BootImagePackages ont été mis à jour.\n \nPaquets d'images de démarrage\n \nSeul le paquet2 a été mis à jour. Le noyau n'a pas été mis à jour. Tous les KIPs autres que FS ont été reconstruits (la seule différence est le hachage de la construction GNU).\n \nFS\nLes fonctions Mutex lock et unlock ont été ajoutées à certaines fonctions SaveData qui en étaient auparavant dépourvues.\nEn particulier, il s'agit de nn::fs::save::SaveDataFileSystemCore::HasOpenedFiles et nn::fs::save::SaveDataFileSystemCore::HasOpenedEntries.\n \n \nOfficiellement la communication parle d'une amélioration de l'expérience utilisateur. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173452/in-switch-nintendo-sort-le-firmware-officiel-1603-1.png"
        }
    },
    "news_13": {
        "title": "[Vita/PSTV] Vita3K version 0.1.8 et Android Release 5",
        "content": "Vita3K est le tout premier émulateur open-source pour la PlayStation Vita compatible avec Windows, Linux, macOS et Android. Cet émulateur n'a pas pour but de permettre l'activité illégale mais de restituer au mieux la PlayStation Vita sur PC. \n \nLes versions PC Windows, Linux, macOS et Android sont mises à jour, et passe de la version 0.1.6 à la version 0.1.8, le développeur évoquant avec humour le fait qu'il n'aime pas le 7. \n \n\n \nChangelog Vita3K Android Release 5 : \n \n- Ajout d'un moteur de rendu OpenGL ES (expérimental) (nécessite OpenGL ES 3.2)\n- Nouvelles méthodes de mappage de la mémoire (Double buffer et Page table)\n- Correction des boutons de recouvrement L2/R2\n- Amélioration de la gestion du tactile : le swipe tactile et la reconnaissance multitouch devraient maintenant fonctionner correctement\n- Ajout d'un bouton optionnel pour basculer entre l'écran tactile avant et arrière de la PS Vita\n- Ajout de capacités de débogage\n- Amélioration de la mise à l'échelle des DPI\n- Mise à jour de SDL vers 2.26\n- Mise à jour de ffmpeg vers 5.1.3\n \nReconstruction de la version PC de Vita3K :\n \n- io : Corrige la valeur de retour de savedata, corrige l'avertissement \"Not enough memory\" sur Minecraft (ExtremeExploit)\n- modules : Corrige une corruption de pile lors de l'appel à mktime sous Linux (ExtremeExploit)\n- gui : Quelques améliorations de la qualité de vie (bookmist et Zangetsu)\n- gui : Ajout d'une section supporter (Zangetsu)\n- lang : Amélioration de nombreuses traductions (Croden, nishinji, HuanJiCanShang)\n- audio : Fixe le nombre de retour d'échantillons de ngs, rend les danses de persona 3 et 5 jouables (Macdu)\n- audio : Correction de la valeur de retour de sceNgsVoiceGetStateData, rend Trails of Cold Steel 2 jouable (Macdu)\n- io : Standardisation des chemins de recouvrement, permet à Killzone d'atteindre le menu (Macdu)\n- renderer : Implement surface sync, vulkan only, permet aux écrans de Project Diva X d'être rendus correctement et corrige la luminosité de Ys Memories of Celceta (Macdu)\n- moteur de rendu : Ajout de quelques textures manquantes et support des swizzles, support de BC4, et correction de la décompression PVRT2, utilisé par Killzone (Macdu)\n- En ce qui concerne le mapping mémoire, le double buffer devrait être moins efficace que les autres méthodes (native buffer et page table), mais il devrait aussi être moins dépendant du pilote. D'après mes tests, il semblerait que le native buffer fonctionne sur le GPU Adreno et que la page table ne fonctionne pas, alors que l'inverse se produit sur le GPU Mali. Je ne suis pas sûr.\n \n- Note : Si vous mettez à jour depuis une version précédente, le tampon natif ne fonctionnera pas : Si vous mettez à jour à partir d'une version précédente, le niveau de log sera réglé sur trace. Si vous n'avez pas l'intention de l'utiliser, il est recommandé de le désactiver (Paramètres->Emulateur) pour améliorer les performances.\n \n \nTout est là : vita3k.org\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173441/in-vitapstv-vita3k-version-018-et-android-release-5-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] FPSLocker v1.1.4 disponible",
        "content": "Le développeur Masagrator propose une nouvelle version de FPSLocker, sous ce nom se cache un programme qui va vous permettre de profiter de plus de 30 images par seconde dans les jeux qui sont verrouillés. \n \nSon application homebrew qui fonctionne comme une superposition pour la Nintendo Switch permet aux utilisateurs de définir des FPS personnalisés pour les jeux Switch. Pour fonctionner, cette application nécessite NX-FPS et SaltyNX, à noter que certains fichiers YAML utilisés par FPSLocker, et des correctifs spécifiques sont aussi disponibles dans un entrepôt de données qui se trouve ici. \n \n \n\n \n \n \nChangelog : \n \n- FPSLocker peut désormais afficher le nombre de framebuffers utilisés par NVN en les affichant dans les paramètres avancés.\n- “Buffered frame: 2” = Le jeu utilise un vrai double buffer. Comme ce numéro ne peut pas être modifié à la volée, il s'agit uniquement d'une mise à jour d'informations.\n \nTéléchargement : FPSLocker v1.1.4\n \n",
        "images": {}
    },
    "news_15": {
        "title": "[PS4] Hogwarts Legacy disponible en backport par Cyb1K",
        "content": "Il n'aura fallu que quelques heures à Cyb1K pour backporter Hogwarts Legacy sur PlayStation 4 et PlayStation 4 Pro. Le jeu est sorti officiellement ce matin à minuit, mais il n'a été accessible dans sa version physique qu'aujourd'hui. \n \nComme la plupart des backports il faut plusieurs versions avant que parfois Cyb1K ne trouve une version stable, ainsi pour Cyberpunk 2077 il avait créé plus d'une centaine de releases avant de parvenir à proposer la version compatible avec le firmware 5.05.\n \n \n\n \n \nDans ce premier backport, il n'est pas possible de changer la langue, ce n'est pas un problème lié à l'audio, mais un problème de librairie. Il est certain qu'il ne faudra que très peu de temps pour corriger le problème.\n \nMerci de ne diffuser aucun lien sous peine de retrait de votre commentaire, et d'un éventuel ban. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173271/in-ps4-hogwarts-legacy-deja-backporte-par-cyb1k-1.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] Nx-ovlloader et Tesla-Menu ont été mis à jour",
        "content": "Le développeur WerWolv propose une mise à jour de Nx-ovlloader et Tesla-Menu, il avait déjà proposé le 16 Mars dernier une mise à jour afin de supporter le firmware 16.0.0, mais ces nouvelles versions viennent apporter un réel support des firmwares 16.0.0+ plus propres.\n \n \n\n \n \n \nNx-ovlloader comme vous le savez est un fork de nx-hbloader, il s'agit d'un processus hôte pour le chargement des OVL (NRO), en fait il s'agit du service de chargement de l'écosystème Tesla. Lorsqu'il est lancé, ce service essaie automatiquement de chainloader /switch/.overlays/ovlmenu.ovl, le menu Tesla. A partir de là, il chargera et basculera entre différents overlays sur demande.\n \nTesla-Menu quand à lui est un menu de superposition qui sera chargé par nx-ovlloader. Son but principal est de permettre à l'utilisateur de sélectionner d'autres overlays à charger. Le répertoire par défaut pour les overlays est /switch/.overlays où seuls les fichiers .ovl (les anciens fichiers .nro renommés en .ovl pour les différencier des homebrew normaux) sont chargés.\n \n \nTéléchargement : Nx-ovlloader 1.0.7 / Tesla-Menu 1.2.2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173262/in-switch-nx-ovlloader-et-tesla-menu-ont-ete-mis-a-jour-1.png"
        }
    },
    "news_17": {
        "title": "[Switch] emuiibo v1.0.0 disponible",
        "content": "Le développeur XorTroll est de retour sur la scène Nintendo Switch et propose une nouvelle version de son outil Emuiibo, cela n'avait pas été le cas depuis plus de 15 mois, donc les changements sont importants et nombreux.\n \nComme vous le savez, emuiibo est un module qui permet de profiter de l'émulation d'amiibo au moyen de fichiers \"Bin\" présent sur la carte SD, Emuiibo utilise ce format de stockage de données sur la carte microSD.\n \n \n\n \n \nChangelog\n \nL'étape majeure de cette mise à jour (parmi d'autres) est de finalement intercepter le service nfp:sys, AKA interceptant les paramètres du système/le support amiibo de l'applet - par conséquent, beaucoup de changements ici sont dus à cela.\n \nemuiibo n'est plus une pré-version\n \nNOTE : n'oubliez pas de mettre à jour la dernière version de nx-ovlloader/Tesla menu !\n \nLe format amiibo virtuel a subi quelques changements majeurs, le support des paramètres système étant nécessaire :\n \n- Les informations sur les zones sont désormais enregistrées dans <amiibo>/areas.json, qui contient des paires de valeurs access_id et program_id. La prise en charge des paramètres du système nécessite également de connaître l'ID du programme du titre qui utilise la zone, c'est pourquoi les informations relatives à la zone sont désormais sauvegardées ici.\n \n- Ce JSON contient également un champ current_area_access_id : l'option des paramètres du système pour supprimer les données de sauvegarde d'un amiibo est en conflit avec l'implémentation de la sauvegarde d'emuiibo (les amiibos réels ont une seule sauvegarde de jeu alors qu'emuiibo en permet plusieurs), donc ce champ contient la zone actuellement \"sélectionnée\", qui consiste en la zone que les paramètres du système vont voir et afficher des informations sur/supprimer.\n\n \nAfin de convertir les anciens formats à ces nouveaux changements, le fichier areas.json sera créé automatiquement, mais comme il n'y a aucun moyen pour emuiibo de dire l'ID du programme des zones amiibo ordinaires, il mettra un certain ID par défaut (pour être distingué du reste, j'ai opté pour celui de \"Retain Interactive Display Menu\", qui est un programme de débogage), et pour que l'ID correct soit mis sur l'info de la zone, l'utilisateur doit utiliser l'amiibo avec le jeu en question. Je sais que cela peut être un peu fastidieux, mais c'est la meilleure façon de procéder\n \n- Désormais, les amiibos virtuels dont le nom comporte plus de 10 caractères sont ignorés et considérés comme invalides. Pour des raisons techniques (et parce que Nintendo est trop incohérent avec ses formats), je pensais à l'origine que la limite était de 40 caractères, mais dans certains contextes (comme les paramètres système) où la limite de 10 caractères est imposée, les amiibos virtuels existants avec des noms plus longs ont tendance à provoquer des comportements bizarres/imprévus.\n \n- L'option de formatage des paramètres système supprimera toutes les zones d'amiibos virtuels (sans les désenregistrer comme pour les vrais amiibos, car les amiibos virtuels n'ont pas la notion d'être (dés)enregistrés).\n \n- L'option system-settings game-save-deleting supprimera la zone amiibo sélectionnée, qui peut être changée depuis l'overlay. Cette zone sélectionnée sera également celle que les réglages du système afficheront toujours.\n\n\n \n- L'option random-UUID a maintenant son propre champ dans le fichier amiibo.json (use_random_uuid), de sorte que les amiibos auront leur propre UUID qui ne sera pas effacé lorsque random-UUID sera activé (voir les changements liés à l'overlay).\n \n- Les anciens formats supportés dans les anciennes versions d'emuiibo (raw bin dumps et anciens amiibos virtuels) sont maintenant entièrement supportés ! La rétrocompatibilité a été réimplémentée afin que ces formats obsolètes soient automatiquement convertis au format moderne au démarrage (pour les bin dumps, le fichier binaire de dump est déplacé mais pas supprimé).\n \n- La cryptographie est maintenant supportée, de sorte que si /switch/key_retail.bin est présent, les sections cryptées des bin dumps seront accessibles par emuiibo, de sorte que les amiibos convertis qui en résultent contiendront toutes les données amiibo présentes (cela inclut les zones de données d'applications de jeu, AKA amiibo game save-data).\nemuiibo\n \n- Compilé avec les dernières bibliothèques\n \nTous les changements de format ci-dessus ont entraîné des changements de code pour les prendre en charge, bien sûr :\n \n- Le service emuiibo IPC (utilisé par la surcouche et d'autres homebrew pour contrôler emuiibo) a quelques nouvelles commandes reflétant les changements de format. Comme toujours, l'overlay est le meilleur exemple d'un homebrew utilisant ce service pour contrôler l'émulation amiibo.\n \n- Certains bugs internes de l'amiibo ID ont été corrigés (encore une fois, un grand coup de chapeau à Nintendo pour avoir été inutilement et lourdement incohérent avec leurs formats amiibo à travers les plateformes), ce qui aurait causé des problèmes avec certains jeux (comme Monster Hunter Rise, Splatoon, etc.).\n \nOverlay\n \n- Compilé avec la dernière version de libtesla/libnx\n \n- Un bug de nettoyage de l'interface utilisateur de libtesla a été corrigé, ce qui pouvait parfois causer des plantages.\n \n- L'interface utilisateur a été étendue (suite aux changements de format) pour afficher/changer la zone sélectionnée de l'amiibo virtuel actif, ainsi que pour changer l'option UUID aléatoire de l'amiibo.\n \n- Les entrées du répertoire amiibo/plain sont désormais classées par ordre alphabétique.\n \n- Si le titre est installé, son nom sera affiché ; sinon, l'ID du programme sera affiché.\n \n- La version d'emuiibo est maintenant vérifiée, de sorte qu'une superposition refusera de fonctionner avec des versions anciennes ou nouvelles d'emuiibo et ne fonctionnera qu'avec la même version.\n \n- Le support de la langue française a été ajouté\n \nemutool\n \n- La version du framework .NET a été abaissée à v4.5.2, dans l'espoir d'améliorer la compatibilité avec certains systèmes.\n \n- Les Amiibos dont le nom par défaut contient \"/\" sont remplacés par \"_\", et les caractères spéciaux sont également remplacés par leurs équivalents ASCII (comme E à partir de È) pour éviter les problèmes avec les chemins d'accès du système lors de la création d'amiibos virtuels.\n \n\n \nTéléchargement : emuiibo 1.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-761668142.png"
        }
    },
    "news_18": {
        "title": "[Switch] switch_AIO_LS_pack 4.11.3",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 4.11.3.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\nMise à jour de SimpleModManager, de TeslaMenu et de Ovlsysmodule vers la dernière version de ceux-ci, pour l'instant les anciens overlays de SimpleModManager sont conservé.\nMise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 4.11.0:\nAjout d'un choix permettant de supprimer les modules d'Atmosphere avant l'installation du pack, ceci supprimera tous les modules existants, pratique si vous venez d'un autre pack ou lors d'une mise à jour du firmware histoire de ne pas avoir une erreur au lancement d'Atmosphere à cause des modules se qui est plutôt fréquent.\nAjout d'un contrôle du téléchargement du pack et de l'application via un contrôle SHA256, ceci permet de s'assurer que le fichier téléchargé est bien celui attendu.\n\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\nN'hésitez pas à faire vos retours, ils seront les bienvenues.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-4.jpg"
        }
    },
    "news_19": {
        "title": "Nintendo engage des demandes de retraits de projets à Github, notamment pour l'outil Lockpick",
        "content": "A la veille de la sortie du très attendu (mais déjà disponible) The Legend of Zelda: Tears Of the Kingdom, Nintendo suscite encore le débat, en soumettant plusieurs demandes de retrait au titre du Digital Millennium Copyright Act (DMCA, protégeant les données numériques sous licence)  à la plateforme de développement GitHub. \n \nLockpick, un outil open source créé par le développeur shchmue permettant aux utilisateurs de la console Nintendo Switch de récupérer les clés de chiffrement de leur propre console, est notamment dans la ligne de mire de ces demandes de retrait. En effet, les clés récupérées par Lockpick sont nécessaires pour déchiffrer les fichiers système de la console et sont essentielles pour effectuer des tâches telles que la création de sauvegardes de jeux et l'installation de homebrews.\n \nL'outil Lockpick, et sa version en payload Lockpick-RCM, a été largement utilisé par la communauté homebrew de la Nintendo Switch depuis sa création en 2018, car il permet aux utilisateurs de contrôler leur propre matériel et d'effectuer des tâches qui ne sont pas prises en charge par la console de manière native. En outre, il convient de préciser que les clefs sont générées à partir de la carte mère de la console de l'utilisateurs, qui, de facto, est la propriété unique de celui-ci et ne revient plus à Nintendo. \n \n\n \nVoici un extrait du document relatant la demande effectuée par Nintendo of America Inc., dont certains éléments sensibles ont été retirés (coordonnées, méthodes de sécurité etc.) :\n \n \n\nÊtes-vous le titulaire des droits d'auteur ou autorisé à agir au nom du titulaire des droits d'auteur ?\n \nOui, je suis autorisé à agir au nom du titulaire des droits d'auteur.\n \nSoumettez-vous une notification DMCA révisée après que GitHub Trust & Safety vous a demandé de modifier votre notification originale ?\n \nNon.\n \nVotre réclamation concerne-t-elle du contenu sur GitHub ou npm.js ?\n \nGitHub.\n \nVeuillez décrire la nature de votre propriété intellectuelle ou de votre autorisation d'agir au nom du propriétaire.\n \nPour le propriétaire des droits d'auteur, Nintendo of America Inc.\n \nVeuillez fournir une description détaillée de l'œuvre protégée par le droit d'auteur originale qui aurait été violée. Si possible, incluez une URL où elle est publiée en ligne.\n \nLa console Nintendo Switch et les jeux vidéo contiennent plusieurs mesures techniques de protection (\"Mesures Techniques\") qui permettent à la console Nintendo Switch d'interagir uniquement avec des fichiers de jeux vidéo légitimes de Nintendo. Ce processus protège les jeux vidéo de Nintendo protégés par le droit d'auteur, y compris, mais sans s'y limiter, ceux couverts par les numéros d'enregistrement de copyright américain PA0002213509 (Super Mario Maker 2) ; PA0002233840 (Animal Crossing: New Horizons) ; PA0002213908 (Luigi's Mansion 3) ; et PA0002028142 (The Legend of Zelda: Breath of the Wild), en empêchant les utilisateurs de jouer à des copies piratées de jeux vidéo de Nintendo sur la console Nintendo Switch et en empêchant les utilisateurs de copier et de jouer à des jeux vidéo de Nintendo de manière illégale sur des appareils non autorisés.\n \nQuels fichiers doivent être retirés ? Veuillez fournir des URL pour chaque fichier ou, si le dépôt entier, l'URL du dépôt.\n \nhttps://github.com/shchmue/Lockpick_RCMhttps://github.com/shchmue/Lockpick\n \nRevendiquez-vous la mise en place de mesures techniques pour contrôler l'accès à votre contenu protégé par le droit d'auteur ? Veuillez consulter nos [documents] \"Plaintes concernant la technologie de contournement\" si vous n'êtes pas sûr.\n \nOui.\n \nQuelles sont les mesures techniques que vous avez mises en place et comment contrôlent-elles efficacement l'accès à votre contenu protégé par le droit d'auteur ?\n \n[Privé]\n \nComment le projet incriminé est-il conçu pour contourner vos mesures de protection technologique ?\n \nLe dépôt signalé offre et fournit un logiciel de contournement qui viole les droits de propriété intellectuelle de Nintendo. Plus précisément, le dépôt signalé fournit Lockpick aux utilisateurs. L'utilisation de Lockpick avec une console Nintendo Switch modifiée permet aux utilisateurs de contourner les mesures technologiques de Nintendo pour les jeux vidéo; en particulier, Lockpick contourne les TPM de la console pour permettre un accès non autorisé, l'extraction et le décryptage de toutes les clés cryptographiques, y compris les clés de produit, contenues dans la Nintendo Switch. Les clés décryptées facilitent la violation du droit d'auteur en permettant aux utilisateurs de jouer à des versions piratées de logiciels de jeux protégés par le droit d'auteur de Nintendo sur des systèmes sans TPM de console Nintendo ou sur des systèmes sur lesquels les TPM de console Nintendo ont été désactivés. Le trafic de logiciels de contournement, tels que Lockpick, viole la loi américaine sur le droit d'auteur du millénaire numérique (plus précisément, 17 U.S.C. §1201) et viole les droits d'auteur détenus par Nintendo.\n \nLe travail est-il sous licence open source ?\n \nNon.\n \nQuelle serait la meilleure solution pour l'infraction présumée ?\n \nLe contenu signalé doit être supprimé.\n \nAvez-vous les coordonnées de la personne présumée responsable de l'infraction ? Si oui, veuillez les fournir.\n \nNon, nous n'avons pas les coordonnées.\nJ'ai une bonne foi en croyant que l'utilisation des matériaux protégés par le droit d'auteur décrits ci-dessus sur les pages Web contrefaisantes n'est pas autorisée par le propriétaire du droit d'auteur, ou son agent, ou la loi.\nJ'ai pris en considération le fair use.\nJe jure, sous peine de parjure, que les informations de cette notification sont exactes et que je suis le propriétaire du droit d'auteur ou que je suis autorisé à agir au nom du propriétaire d'un droit exclusif qui est présumé avoir été enfreint.\nJ'ai lu et compris le Guide de soumission d'un avis de retrait DMCA de GitHub.\n \n\n \n \nL'extrait complet est disponible sur le compte Twitter de Simon Aarons.\n \n\n\n\n\n\n\nDans l'univers des smartphones comme dans celui des consoles de jeux, les projets de hackers se multiplient tels des hydres, une tête coupée en engendrant dix autres. Il est donc peu probable que l'outil Lockpick disparaisse dans les limbes, mais il est regrettable de voir que schmue, défenseur du logiciel libre et contributeur majeur à la scène Switch, se retrouve aujourd'hui dans une situation inconfortable. Cette affaire mérite d'être suivie de près... \n \n\n\n\n\n\n \n\n\n\n\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173239/in-nintendo-engage-des-demandes-de-retraits-de-projets-a-github-notamment-pour-loutil-lockpick-1.jpeg"
        }
    },
    "news_20": {
        "title": "[Switch] Les vendeurs chinois vendent des HWfly équipées de RP2040",
        "content": "Certains vendeurs chinois font preuve d'originalité, voilà qu'après les clones, nous retrouvons désormais plusieurs vendeurs qui ont répertoriés des puces HWfly alimentées par des RP2040. \n \n \n\n \n \nCes nouvelles puces sont vendues une dizaine d'euros, ce qui reste accessible, bien plus qu'une HWfly, et elles sont compatibles avec les Switch Erista et Mariko, Lite et OLED. Elles sont livrées avec le câble flex pour souder le Soc Tegra de la console comme cela est possible avec l'ancien câble flex de la HWfly. \n \n \n\n \n \nDu reste, cela est intéressant de pouvoir tester ces nouvelles puces, pour voir si elles peuvent être une nouvelle alternative, entre les RP2040 un peu trop nus, et les HWfly un peu trop chères. \n \n \n\n \n \n \nIl semblerait que Nintendo lâche un peu du leste aux revendeurs chinois avec moins de suivis judiciaires. \n \nEdit 05.05.2023\n \nMerci de ne pas mettre de lien en commentaire sous peine de ban par un modérateur, merci de ne pas renvoyer vers des techniciens non plus. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173154/in-switch-les-vendeurs-chinois-vendent-des-hwfly-equipes-de-rp2040-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173154/in-switch-les-vendeurs-chinois-vendent-des-hwfly-equipes-de-rp2040-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1173154/in-switch-les-vendeurs-chinois-vendent-des-hwfly-equipes-de-rp2040-1.jpg"
        }
    }
}