{
    "news_1": {
        "title": "[PS4-PS5] Retroarch en un clic sur vos PS4 et PS5",
        "content": "Petite mise à jour de mon outil  de création d'émulateur en un clic, fonctionne sur toutes les PS5 et PS4 jailbreakés.\n \n\n \nGrâce à ce petit GUI (toujours en batch) il vous sera très très simple de créer un FPKG d'émulateur rétro pour vos PS5 4.xx, 6.xx  et 7.xx , et PS4, un simple clic sur l'émulateur voulu et tous se fera automatiquement, juste à patienter... Je ne peux pas faire plus simple ^^...\n \nIl utilise retroarch PS2, ce sont donc des versions PS2 que vous allez lancer sur vos PS4 et PS5...\nCertains me diront c est pas du natif et c est de la ps2 blablabla, le plus important est que cela fait le taf et permet de jouer à nos vieux jeux retro, non ?!\n \nVous pourrez donc en un clic créer un FPKG comprenant un émulateur GameBoy - Color, Nes, Snes, GameGear, Master System, Megadrive, Atari 800, Lynx, WonderSwam ou NeoGeo Pocket.\n \nUne seule chose à faire copier/coller vos roms dans le dossier Games, puis cliquer sur l' émulateur voulu, rien d'autre...\n \nAttention !!! Avant le premier lancement du .bat il vous faudra régler imgburn afin qu il crée l' ISO ps2, sans ce réglage, l' émulateur ne trouvera pas vos roms une fois lancé sur vos PS5 et PS4...Cette manip n' est à faire qu' une fois avant le premier lancement du .bat...\n \n\n- Lancer imgburn.exe  dans le dossier tools/\n- Sélectionner Create image file from files/folders\n- Puis l'onglet Advanced\n- Puis l' onglet Restrictions\n- Et sélectionner bien Level 2 - 31 characters\n- Fermer imgburn\n- Voilà il est bien configuré...\n \n\n \n \n\n \n \n \nTuto:\n \n\n- Copier/coller vos roms dans le dossier Games/\n- Cliquer sur l' émulateur de vos roms\n- Patienter\n- Installer le pkg sur votre PS5\n- Lancer l app une fois sur le menu appuyer O\n- Selectionner CDFS:/ puis core\n- Lancer le .elf\n- Une fois le menu vert ouvert séléctionner load content\n- Lancer la rom voulue\n- Jouer\n\n \nTélécharger PS4-PS5 retroarch.rar\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205645/in-ps4-ps5-retroarch-en-un-clic-sur-vos-ps4-et-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175709/in-ps4-creer-un-fpkg-demulateur-en-un-clic-2.png"
        }
    },
    "news_2": {
        "title": "[PS5] etaHEN 2.1B détaillé par LightningMods",
        "content": "Le développeur LightningMods continue de détailler les options qui seront rajoutées dans le prochain etaHEN 2.1B. En plus des nouveautés dont il a déjà parlé précédemment, le développeur rajoute que la v2.1B va donc intégrer une nouveauté très intéressante. \n \n \n\n \n \netaHEN 2.1B va disposer en effet d'une nouvelle option qui permettra de mettre en pause et de reprendre kstuff à tout moment, ci-dessous une vidéo qui montre cette fonctionnalité en action avec un test de performance dans itemzflow montrant l'énorme différence entre la pause et la reprise.\n \n \n\n \n \nVous allez donc pouvoir désactiver automatiquement kstuff quelques secondes après le chargement du jeu, puis l'activer à la fermeture du jeu. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205613/in-ps5-etahen-21b-detaille-par-lightningmods-1.png"
        }
    },
    "news_3": {
        "title": "[PS5] Kstuff désormais compatible avec les firmwares 7.00 à 7.61",
        "content": "Le développeur EchoStretch a mis à jour Kstuff, cette nouvelle version apporte le support de l'ensemble des firmwares compris entre le 7.00 et 7.61.\n \n \n \n\n \n \nKstuff supporte donc désormais tous les firmwares 7.xx : \n \nfirmware 7.00\nfirmware 7.01\nfirmware 7.01.01\nfirmware 7.20\nfirmware 7.40\nfirmware 7.60\nfirmware 7.61\n \nL'intégralité des firmwares compris entre 3.00 et 7.61 sont désormais officiellement supporté par kstuff. \n \nComment cela se caractérise, par l'arrivée d'une nouvelle version de PS5 Kstuff qui est maintenant proposé en version 1.4 : kstuff 1.4\n \nBien entendu, l'exploit webkit n'ayant pas été trouvé au delà du firmware 6.50, il faut passer par l'exploit BD-J ou lua. \n \n \n\n \n \n\nLe développeur tient à remercier sleirsgoevy pour avoir créé ce projet ! Il rappelle que ce projet n'aurait pas pu avec lieu sans l'aide de Zecoxao et de ces amis qui ont donné des clés. Un grand merci également à buzzer-re , BestPig , idlesauce , Al-Azif et à tous ceux qui ont contribué, sans compter le soutien de nombreux. \n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205612/in-ps5-kstuff-desormais-compatible-avec-les-firmwares-700-a-761-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205612/in-ps5-kstuff-desormais-compatible-avec-les-firmwares-700-a-761-2.png"
        }
    },
    "news_4": {
        "title": "[PS5] Backporter vos dumps PS5 vous même en un clic",
        "content": "Voici quelques jours que les backports PS5 pululent sur internet grâce au script python de Idlesauce disponible ici\n\nJe m en suis moi même servis pour backporter plusieurs jeux PS5 comme DBZ Kakarot ou Atomic Heart qui fonctionnent maintenant en 4.03.\n\n\n\n\nVoici un petit batch qui automatise toute la procédure du backport...\n\nCe bat vas donc vous permettre de backporter vos jeux PS5 vers 4.03 en 1 seul clic... Attention à savoir que tous les jeux ne sont pas backportables, si vous obtenez un écran noir cela signifie que le jeu en question ne peut être backporté (en tous cas avec cette méthode).\n\nIl vous faudra aussi bien respecter la procédure suivante\n \n- Créer un dossier Backport\n- Décompresser l' archive auto_backport dedans\n- Récupérer le fichier eboot.bin.esbak, TOUS  les *.prx.esbak présent en général dans (sce_module et parfois prx) et parfois ailleurs de vos dumps PS5 (sans les fichiers .esbak le backport n est pas possible)                                                                                                                                                                              - Copier ces fichiers .esbak dans votre dossier backport (vous pouvez copiez directement les dossiers sce_module et prx comprenant les .prx.esbak)\n- Lancer auto_backport.bat\n- Patientez\n- Si tout s est bien passé vous aurez alors un fichier eboot.bin et des .prx en plus des fichiers .esbak\n- Copier/coller ensuite ses nouveaux fichiers dans votre dump PS5 en respectant bien l arborescence de base.\n- Lancer votre jeu...\n \n\nSi vous obtenez un écran noir c est que votre jeu ne peut être backporté... De plus les jeux 6.XX ET 7.XX ne peuvent être backportés. Il leur faut en plus un patch pour le GPU qui n est pas présent dans le script d origine.\n\n\nTélécharger  Auto_Backport\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205609/in-ps5-backporter-vos-dumps-ps5-vous-meme-en-un-clic-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] La nouvelle version de Sphaira est disponible (maj)",
        "content": " \nLa nouvelle version de Sphaira vient d'être mise en ligne, rappelons que c'est le développeur TotalJustice qui propose sa solution de remplacement du hbmenu intégrant des fonctionnalités inédites, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \nLes changements dans cette version sont nombreux, et certains d'entre eux nous les devons à shadow256 que nous tenons encore à remercier pour tout le travail qu'il accomplie. \n \nCette nouvelle révision vise à introduire plusieurs nouvelles fonctionnalités, des correctifs et des améliorations, sur les fonctionnalités mais aussi sur la localisation et les traductions. Les changements se trouvent dans le changelog ci-dessous. \n \n \n\n \n\n \n\n \n \nChangelog : \n \n- Ajout d'une nouvelle chaîne par Yorunokyujitsudans  \n- Mise à jour de se.json avec la dernière chaîne ajoutée par HenryBabydans  \n- [Thème] icônes alt + thème par spkats1 \n- README édité, traductions italiennes mises à jour par LNLenost \n- Mise à jour de la traduction française par shadow256\n- Mise à jour de pt.json par ninstar\n- Mise à jour de zh.json par BIGBIGSUI\n- Ajout d'une horloge de 12 heures au menu principal par therealbungus\n- Ajout 12 dans notre chaîne de temps dans les fichiers de traduction et traduction en français par shadow256 \n- Réparation de themezer\n \n \nEdit 21.04.2025 : \n \nTéléchargement : Sphaira 0.7.0\n \n \n \n  \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205596/in-switch-la-nouvelle-version-de-sphaira-est-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205596/in-switch-la-nouvelle-version-de-sphaira-est-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1205596/in-switch-la-nouvelle-version-de-sphaira-est-disponible-3.jpg"
        }
    },
    "news_6": {
        "title": "[PS5] Un exploit kernel de TheFlow dévoilé via le syscall sys_fsc2h_ctrl",
        "content": "Le 15 décembre 2024 TheFlow, l'expert en sécurité avait déposé un rapport au programme bounty rapporté par hackerone.com sous le numéro 2900606 procurant une nouvelle prime de 10 000 $ au développeur. \n \nComme vous le savez, ces rapports sont soumis à des conditions de divulgation très stricte, mais d'un autre côté lorsqu'ils sont déposés, il suffit d'attendre quelques mois avant d'en découvrir le contenu. \n \nC'est donc quelques 5 mois après son dépôt que ce rapport est dévoilé, le 18 avril 2025, et il est très croustillant.\n \n \n\n \n\n \n \n \nL'exploit kernel, qui permet d'obtenir les privilèges, se base sur un débordement de le syscall sys_fsc2h_ctrl, qui est une composante de la table de la console, reste à savoir de laquelle car nous retrouvons ce syscall sys_fsc2h_ctrl notamment dans mast1c0re ici.\n \nAinsi l'exploit kernel permet d'obtenir les privilèges au travers d'un syscall sys_fsc2h_ctrl qui est cassé avec 4 threads et divers commandes, et une allocation de mémoire spécifique sur malloc(). \n \nIl est fort probablement que cet exploit soit sur PS5 (et seulement sur PS5) mais cela reste à confirmer. \nIl se murmure que cela serait corrigé autour du firmware 10.40, mais attendons d'en savoir plus. \n \nLe rapport est disponible ici : https://hackerone.com/reports/2900606\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205555/in-ps4ps5-un-exploit-kernel-de-theflow-devoile-via-le-syscall-sys-fsc2h-ctrl-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205555/in-ps4ps5-un-exploit-kernel-de-theflow-devoile-via-le-syscall-sys-fsc2h-ctrl-2.png"
        }
    },
    "news_7": {
        "title": "[GBA/NDS/DSi] No$gba mis à jour en 2025",
        "content": "Voilà que le développeur nocash123 propose une nouvelle version de son émulateur No$gba, pour rappel no$gba est un excellent émulateur Game Boy Advance / Nintendo DS / DSi et Pocket Station.\n \nNo$GBA, diminutif de No Cash GBA est un émulateur Nintendo DS / DSi / DS Lite et GameBoy Advance, supporte le multijoueur et il est envisageable de charger plusieurs roms NDS pour jouer en réseau, un peu comme si vous étiez sur un réseau de Gameboy.\n \nCette mise à jour arrive après quasiment 4 ans d'absence, c'est donc largement un évènement car No$gba n'avait pas été mis à jour depuis Août 2021.\n \n \n\n \n \n \nChangelog 3.06\n \nGBA/BIOS/clone : \n- Ignore CpuFastSet dans la zone BIOS en lecture seule (merci à Denim).\n \nIOMAP : \n- Correction de l'affichage des arrière-plans BG0-3 en mode GBA (sans ext_pal, contrairement à NDS/DSi).\n \nInterface graphique : \n- Correction de la fenêtre d'aide sur la version du jeu (affichée au-dessus de la fenêtre du jeu).\n \nContrôles/Écran tactile : \n- Détection des deuxièmes clics de souris (via WM_LBUTTONDBLCLK).\n \nConfiguration des contrôles : \n- Option pour interroger les sticks analogiques à chaque frame (lent sur les ports de jeu).\n \nVisionneuse de fichiers :\n- Prévisualisation des icônes/textures NDS/DSi/3DS.\n- Prévisualisation des dumps HEX, texte ASCII, et images (GIF/JPG/BMP/TGA/PNG).\n- Prise en charge des archives GFC/GOB et des arborescences Dict dans les fichiers vidéo 3D NDS.\n- Tri plus rapide des dossiers volumineux (via TVI_FIRST + TVM_SORT).\n \nRaw-DOS : \n- Active A20 une seule fois au démarrage (pour éviter les conflits avec les claviers USB).\n \nDSi/Aide : \n- Ajout de détails sur certains registres BPTWL.\n \nCPU/Aide : \n- Nouveau chapitre sur la syntaxe UAL pour le code ARM/THUMB.\n \nNDS/Aide :\n- Meilleures spécifications pour les formats de fichiers vidéo 3D .nsbxx (merci à Scurest).\n- Spécifications pour les fichiers son HWAS (Multiblock Sound Wave Data).\n- Spécifications pour les archives GFC/GOB (compression zlib).\n- Accès aux EEPROM GBA depuis la NDS (voir GBA EEPROM Timings, merci à pk11).\n \nCGB/Aide : \n- Notes sur le mode CGB en compatibilité GBA.\n \n3DS/Aide :\n- Formats de texture GPU 3DS (ordre des bits et format ETC1).\n- Spécifications incomplètes sur les exports DSiWare et la réinitialisation parentale.\n- Spécifications HWCAL (valeurs de vieillissement, checksums XOR, CRC16, clé SHA256HMAC).\n- Format d'icône 3DS rétro-conçu (ordre des pixels/tuiles).\n- CODEC_SNDEXCNT.bit30 doit être activé en mode GBA (sinon son dissonant).\n- Le biais en GBA (port 4000088h) n'a pas d'effet sur la 3DS en mode GBA.\n- Avertissement sur les valeurs TSC inversées dans HWCAL/config.\n- Bits MCU[3Fh] non réinitialisés au redémarrage/extinction.\n- Correction du symbole du transistor BC547 dans le flasheur MCU (CBE au lieu de BCE).\n \nDSi/Aide :\n- Ajout d'un chapitre sur les signaux/testpoints AUX DSi.\n- Brochages des connecteurs DSi XL P16/P24 (merci à Poro).\n \nDSi/Disass/A22i/Aide :\n- Assembleur/désassembleur 78k0 pour les opcodes/SFR (puce BPTWL).\n- Mise à jour de la carte annotée de la carte mère DSi : http://problemkaputt.de/twl-core.jpg.\n \nA22i :\n- Prise en charge des noms de fichiers entre guillemets dans .include et .import.\n- Directives .ual et .pre_ual pour forcer la syntaxe UAL ou ancienne.\n- Prise en charge de la syntaxe UAL avec condition en fin (ex. ldrh{cond}).\n- Alias neg pour rsb,0 (style THUMB/UAL).\n- Autorise ldm/stm sans {amod} (style UAL par défaut).\n- Vérification des registres pairs pour ldrd/strd (UAL).\n- Suffixe {S} obligatoire pour les opcodes THUMB modifiant les flags.\n- Variantes UAL pour MOV/ADD/SUB THUMB (avec/sans modification des flags).\n- Correction : espace obligatoire après ldrex/strex.\n- label equ xx ne supprime pas les labels locaux (contrairement à label:).\n- Ajout de descriptions pour .macro, .rept, .endm, .undef.\n \nDSi/Disass : \n- Désassemblage BPTWL : http://problemkaputt.de/disass_dsi_bptwl.txt.\n \n \n \nTéléchargement : No$gba v3.06\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205550/in-gbandsdsi-nogba-mis-a-jour-en-2025-1.jpg"
        }
    },
    "news_8": {
        "title": "[XB] La mise à jour firmware d'Avril d'Xbox",
        "content": "Microsoft vient de proposer la mise à jour d'Avril pour les consoles Xbox, cette mise à jour vise à améliorer l'expérience utilisateur tout en optimisant l'offre et l'accès au contenu. \n \nAu delà de ces mots qui ne veulent finalement pas dire grand chose, l'une des nouveautés attendues est la possibilité d'acheter des jeux et du contenu supplémentaire directement depuis l'application Xbox sur les appareils iOS et Android. \n \n \n\n \n \n \nMise à jour Xbox d'avril :\n \n- Diffusez votre propre jeu – maintenant sur les consoles Xbox\n- Achetez des jeux, rejoignez Game Pass et utilisez des avantages directement depuis l'application mobile Xbox\n- Les joueurs peuvent désormais jouer à n'importe quel jeu installé sur leur console en visitant http://xbox.com/remoteplay sur n'importe quel appareil doté d'un navigateur Web pris en charge \n- Présentation d'une nouvelle méthode améliorée pour libérer de l'espace de stockage sur les consoles Xbox\n- Nouveaux hubs de jeux sur les consoles Xbox\n \n \n\n \n \nL'idée est que les utilisateurs pourront précommander des jeux, souscrire à un abonnement Game Pass et échanger des avantages pour les membres Ultimate. \n \nCes fonctionnalités seront étendues au Google Play Store et Apple Store afin que les processus achats soient implémentés, et des extensions aux Xbox Series X et S, et Xbox One sont rajoutées pour les membres Ultimate du Game Pass. \n \nDes évolutions sur le cloud gaming et le rétro gaming sont aussi opérées, de quoi contenter tout le monde. \n \n \nTout est là : news.xbox.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205547/in-xb-la-mise-a-jour-firmware-davril-dxbox-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205547/in-xb-la-mise-a-jour-firmware-davril-dxbox-1.png"
        }
    },
    "news_9": {
        "title": "[PS5] OpenBOR adapté pour PS5 (version PS4)",
        "content": "Voici une adaptation d OpenBOR version PS4 pour PS5. A la base developpé par Znull, j' ai adapté cette version PS4 pour qu' elle fonctionne sur PS5.  Pour rappel, OpenBOR est un moteur de jeu personnalisable, permettant de créer de nouveaux jeux. Les jeux développés pour le moteur Beats of Rage sont communément appelés «mods», les créateurs \"moddeurs\", et le moteur lui-même est communément désigné comme \"modifiable\". Beats of Rage est devenu si populaire en raison de la capacité de personnalisation du moteur qu'il est devenu le modèle des moteurs de personnalisation pour les consoles de jeux vidéo. Par contre cet homebrew ne fonctionne que sur PS5 4.03 et non sur sur 5.xx et 6.xx due à un bug sur le montage de la sandbox (PS5/data/) qui devrait être fixé dans la prochaine version d' EtaHEN de LM.  Tuto: - décompresser l' archive OpenBOR.rar- Copier/coller par FTP ou PS5 Explorer le dossier openbor dans data/... sur votre PS5- Installer le Fpkg OpenBOR.pkg- Lancer l' application depuis votre menu PS5- Séléctionner le mod voulu- Jouer... Attention vérifier bien que mount data soit activé dans Etahen (onglet utilites). Télécharger OpenBOR_PS5",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205533/in-ps5-openbor-adapte-pour-ps5-version-ps4-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205533/in-ps5-openbor-adapte-pour-ps5-version-ps4-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] Les jeux et DLC 7.xx backportés sur 4.xx et 5.xx",
        "content": "Il semblerait que nous sommes en train de vivre l'une des évolutions les plus importantes de ces dernières semaines sur la scène PS5, la première étape de cette évolution est le fait que le DLC de Hogwarts Legacy a été débloqué par la team Duplex sur PS5. \n \nDans cette release a été intégré le jeu, avec son DLC et surtout le backport 4.xx, sous entendu l'eboot permettant de lancer le DLC et le jeu sur les firmwares 4.xx. \n \nUn \" développeur \", répondant au nom de baderlink, s'est alors empressé de trouver la solution pour certains jeux du firmware 7.xx pour tenter de les backporter sur les firmwares 4.xx et 5.xx, et cela semble fonctionner, certains titres commencent à sortir comme fonctionnels !\n \n \n \n\n \n \nListe des jeux qui sont désormais backportés du firmware 7.xx au 4.xx / 5.xx:\n \n- The Chant\n- Lies of P\n- The Eternal Cylinder\n- Police Simulator Patrol Officers\n- WWE 2K23\n- Shadow Warrior Définitive Edition\n \nIl semblerait que ce soit les toutes dernières releases de Duplex qui soient donc en train d'être backportées. Il prend comme référence WWE 2K23 qui a été release il y a quelques jours, et qui fonctionne donc parfaitement sur 5.50 et etaHEN Beta 2.0.\n \n \n\n \n \n \n \n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205476/in-ps5-les-jeux-et-dlc-7xx-backportes-sur-4xx-et-5xx-1.jpg"
        }
    },
    "news_11": {
        "title": "[3DS] Mise à jour importante de l'émulateur Azahar 3DS",
        "content": "L'émulateur Azahar vient de recevoir une mise à jour importante, ce projet, issu d'un fork de Citra développé par PabloMK7 et Lime3DS, avait été annoncé pour la première fois en novembre 2024. Azahar représente une évolution prometteuse dans le monde de l'émulation, surtout après l'arrêt du développement de Citra en mars 2024. Cet arrêt faisait suite à un accord juridique entre les développeurs de Citra (également responsables de l'émulateur Switch Yuzu) et Nintendo. Contrairement à Yuzu, qui a été frappé d'une injonction, Citra n'a pas été directement affecté par des restrictions légales, permettant ainsi à des projets comme Azahar de voir le jour.\n \nQuoiqu'il en soit, la mise à jour 2120.3 apporte davantage de stabilité, elle vise à résoudre certains problèmes issus de la version initiale, et se permet également d'améliorer la convivialité de certains menus. Il semblerait que cette version soit la dernière avant la prochaine version majeure qui appartiendra à la branche 2121 (annoncée ici) \n \n \n\n \n\n \n\n \n \n \nChangelog \n \nAndroid : \n- Ajout d'une nouvelle invite pour les utilisateurs qui auraient pu sélectionner par inadvertance un répertoire utilisateur différent après la mise à niveau depuis Lime3DS, ce qui donne l'impression que des données telles que des sauvegardes ont pu être perdues. \n- Cette nouvelle invite permet aux utilisateurs de choisir entre continuer à utiliser leur nouveau répertoire utilisateur ou restaurer leur ancien.\n- La nécessité de resélectionner le répertoire utilisateur après la mise à niveau n'était pas intentionnelle et était le résultat d'un bug.\n- Nous nous excusons si vous avez été affecté par ce problème et que vous pensiez avoir perdu des données.\n \nToutes les versions : \n- Correction d'un problème où les systèmes 3DS coréens, chinois et taïwanais ne pouvaient pas démarrer une application utilisant la police système en raison du remplacement de police open source manquant (cela incluait l'outil de configuration du système). \n- Pour l'instant, la police EUR/USA/JPN sera utilisée, mais la plupart des glyphes seront remplacés par des points d'interrogation.\n- Cela permet de terminer le processus de configuration, même sans pouvoir lire le texte.\n- Une police avec les glyphes manquants pourra être ajoutée ultérieurement.\n- Correction d'un problème où les consoles dont les régions avaient été modifiées via un micrologiciel personnalisé ne pouvaient pas démarrer le processus de configuration du système via l'outil de configuration Azahar Artic.  \n \nDesktop : \n- Version SDL2 groupée mise à jour pour résoudre un problème où les contrôleurs Xbox devaient être réappairés à chaque fois qu'ils étaient éteints.  \n- L'application Azahar définit désormais explicitement sa propre icône de Windows  \n- Pour la plupart des plateformes, cela ne devrait rien changer, mais sous Linux, cela est connu pour résoudre certains problèmes d'icônes d'application.\n \nTechnique :\n- Correction de l'échec de compilation lors de la tentative de construction à l'aide de Qt 6.9.0 ou version ultérieure.  \n- Correction de l'échec de compilation lors de la tentative de création pour le bureau avec la prise en charge de Discord activée lors de l'utilisation de CMake 4.0 ou version ultérieure. \n- Les avertissements MSVC C4711 et C5045 ont été désactivés pour rendre les journaux de compilation moins désagréables à consulter. \n- Aucun de ces avertissements n’est important.\n- La version de NSIS que nous utilisons pour créer nos installateurs Windows est passée de 3.10 à 3.11.\n \n \n \nTéléchargement : Azahar 3DS 2120.3\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205466/in-3ds-mise-a-jour-importante-de-lemulateur-azahar-3ds-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205466/in-3ds-mise-a-jour-importante-de-lemulateur-azahar-3ds-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1205466/in-3ds-mise-a-jour-importante-de-lemulateur-azahar-3ds-3.jpg"
        }
    },
    "news_12": {
        "title": "[Switch 2] Sera-t-elle crackée plus rapidement que la Switch ?",
        "content": "Si nous revenons un peu en arrière la Switch de première génération a été rapidement hackée du fait de la présence de la puce nVidia qui a été utilisée. \n \nA l'origine la Switch de première génération était censé disposer de commandes au travers de l'USB, permettant ainsi une ouverture de la mémoire tampon, puis Fusée-Gelée a été découvert, il s'est avéré que cette commande tampon ne vérifiait pas la taille, et donc le hack de cette mémoire a pu être mis en place, puis l'utilisation de l'eMMC a pu être accessible, permettant de souder des puces directement dans les consoles, des opérations rendues plus difficile avec les modèles OLED et Lite. \n \nSur la Switch 2, il est certain que Nintendo va avoir appris de ces erreurs,  on se souviendra tous que la Switch a été hacké grâce à un trombone moins d'un an après sa sortie ! Notamment avec le mode RCM, un Tegra X1 peu sécurisé, et un exploit fail0verflow.\n \nLancée en Mars 2017, la Switch a été intégralement hackée en pas moins de 8 mois, et tout a été dévoilé en Avril 2018. \n \n \n\n \n\n \n\n \n \n \nSur la Switch 2, on imagine que Nintendo va apprendre, et masquera les connexions les plus courantes de DAT0, RST, CPU, CMD à CLK... pour perturber les fabricants de puces mod. Ils pourraient facilement cacher les lignes cmd, clk et dat0 dans une troisième couche d'une carte à 4 ou 5 couches. Ils pourraient laisser des traces juste en dessous, sur une autre couche. \n \nLa sortie de la MIG Switch les a effrayés et les a poussés à retarder la sortie de cette console pour des raisons de sécurité. Ils feront tout leur possible pour empêcher les puces de mods de fonctionner. \n \n \n\n \n \n \nDes rumeurs suggèrent également que des parties du bootroom ont été réécrites. On trouve des traces d'instructions de verrouillage. Ils utilisent également quatre BCT plus petits au lieu d'un seul comme sur la Switch.\n \nQue dire des exploits Nereba et Caffeine qui ont enchanté les pocesseurs de la première heure, du firmware 1.0.0 au 4.0.0, dès lors faut-il acheter ou précommander une Switch 2 dès maintenant pour bénéficier du firmware le plus bas, probablement, mais cela signifiera une console hors-ligne, et donc très partiellement utilisable. \n \n \n\n \n \n \nLe problème est toujours le même, comme Sony sur la PS5, Nintendo a besoin de menu debug, debug settings ou autre service de maintenance, mais il est vrai que le hack Nintendo se base davantage sur les bootrooms ou les procédures de démarrages. \n \nL'espoir réside dans le fait que Nintendo a du faire évoluer sa console que ce soit en terme d'ouverture, notamment avec l'arrivée du port USB, de caméra, et de toute la nouvelle architecture, qui en conséquence amèneraient de nouvelles possibilités. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-1.jpg"
        }
    },
    "news_13": {
        "title": "[Vita] Ps Vita RetroFlow Launcher v7.2.2 disponible",
        "content": "Le développeur jimbob4000 propose la mise à jour de PS Vita RetroFlow Launcher, il est toujours intéressant de mettre à jour cet utilitaire s'il est installé sur votre console portable afin de bénéficier des dernières corrections. \n \nPour rappel, RetroFlow-Launcher est une jolie petite interface graphique permettant de parcourir et de lancer vos jeux Retro sur la PS Vita, et est à l'origine un fork de HexFlow-Launcher par VitaHEX.\n \n \n\n \n \nIl s'agit d'une version modifiée de HexFlow Launcher, un coverflow 3D comme un lanceur pour PS Vita. Cette version comprend des catégories de jeux rétro qui peuvent être lancées sans bulles pour RetroArch, DaedalusX64 et Flycast. Les jeux Playstation et PSP peuvent également être lancés sans avoir à créer de bulles pour chaque jeu. Vous l'aurez compris RetroFlow remplacera le Menu Bull avec le plus bel effet. \n \n \n\n \n \nChangelog : \n \n- Correction d'un bug de la vue Liste où certains jeux ne se lançaient pas\n- Correction d'un bug PSTV où l'application de lien PS4 n'était pas incluse dans les applications système \n- Correction d'une erreur de script 533 catégorie valeur nulle\n- Traductions allemandes mises à jour (remerciement à Andiweli)\n \nLe guide d'installation se trouve ici : RetroFlow-Launcher/installation  \n \n \nTéléchargement : Ps Vita RetroFlow Launcher v7.2.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205430/in-vita-ps-vita-retroflow-launcher-v722-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205430/in-vita-ps-vita-retroflow-launcher-v722-disponible-2.png"
        }
    },
    "news_14": {
        "title": "[XB/XB360] XCAT v1.05 disponible",
        "content": "Les spécialistes de la préservation de la Xbox et de la Xbox360 ont travaillé d'arrache-pied au développement de XCAT, un outil automatisé gratuit permettant aux propriétaires de Xbox de rechercher sur leurs consoles du contenu Xbox perdu et de le télécharger dans le cadre d'un effort collaboratif d'archivage de DLC, de mises à jour de titres, de contenus maison (applications, skins...). Grâce à cet outil, la communauté peut unir ses efforts pour archiver le contenu Xbox perdu qui pourrait subsister sur les consoles Xbox et le préserver pour le bien de tous. \n \nCompatible avec les consoles Xbox softmoddées et hardmoddées, cet utilitaire est très léger, moins de 4 mo,  ce qui lui permet de tenir sur une carte mémoire, ceci est particulièrement utile pour les utilisateurs qui ne souhaitent pas modder leur console, mais qui souhaitent néanmoins contribuer au projet XCAT pour la préservation du contenu potentiellement perdu de leur Xbox.\n \n \n \n\n \n\n \n\n \n \n \nXCAT analysera le disque dur de l'utilisateur, en recherchant ces chemins :\n \nC:\\\nE:\\\nF:\\apps\\\nF:\\jeux\\\nG:\\apps\\\nG:\\jeux\\\nX:\\\nY:\\\nZ:\\\n \nXCAT calcule une somme de contrôle unique pour chaque fichier trouvé. La liste des sommes de contrôle est ensuite envoyée aux serveurs XCAT pour analyse. Si un fichier est nouveau et non encore archivé, il est placé dans une file d'attente et téléchargé directement depuis la console de l'utilisateur. Si un fichier est déjà présent sur les serveurs XCAT, il ne sera pas téléchargé à nouveau. Cette méthode évite également les doublons dus à des schémas de nommage différents, car chaque fichier est haché.\n \n \n \n\n \n \n \nLa récupération du contenu perdu n'est qu'une étape du processus de préservation. L'étape suivante consiste à partager tout contenu perdu pertinent avec l'ensemble de la communauté. Cela se fait de différentes manières. Le contenu récupéré, utile ou pertinent pour jouer à des jeux sur Insignia (le remplaçant moderne du Xbox Live), est partagé avec l'équipe Insignia et est mis à disposition sous forme de mises à jour du jeu concerné.\n \nD'autres contenus, tels que des applications homebrew perdues, des jeux, des skins... sont mis à disposition sur les canaux concernés.\n \n \nChangelog v1.00 : \n \n- Version initiale\n \nChangelog v1.01 : \n \n- Correction d'une erreur de chargement d'image pouvant survenir en cas de corruption de fichiers sur le disque dur\n- Ajout d'une option pour réinitialiser la configuration réseau en cas d'échec d'accès à Internet\n- Correction d'un écran noir sur les systèmes équipés de modchips Stellar\n- Suppression du temps total écoulé à l'écran de fin, car souvent incorrect. Ce point sera corrigé dans une future version.\n \nChangelog v1.02 : \n \n- Amélioration majeure de la vitesse de traitement des fichiers\n- Gestion améliorée des erreurs réseau\n- Ajout d'un système de mise à jour automatique\n- Affichage des fichiers traités récemment pendant le traitement\n \nChangelog v1.02b : \n \n- Ajout des composants manquants pour l'écran de fin\n \nChangelog v1.03 :\n \n- Ajout d'un assombrissement de l'écran après 5 minutes sans interaction avec la manette\n \nChangelog v1.04 :\n \n- Réduction du temps de démarrage\n- Stockage des fichiers multimédias dans une sauvegarde de jeu appropriée pour éviter l'affichage d'une sauvegarde corrompue sur le tableau de bord Xbox\n \nChangelog v1.05 :\n \n- Ajout d'un contrôle plus agressif du ventilateur pour éviter la surchauffe des consoles plus anciennes\n \n \n \nL'équipe XCAT reconnaît que les consoles Xbox modifiées peuvent être utilisées à des fins diverses, au-delà du simple jeu. C'est pourquoi XCAT évite volontairement les répertoires susceptibles de contenir des données potentiellement sensibles, telles que l'historique de lecture multimédia et les caches de vignettes générés par XBMC. XCAT est également conçu pour ignorer l'analyse des répertoires DEVKIT afin que les développeurs travaillant sur des projets ne téléchargent pas par inadvertance leurs logiciels inédits.\n \nCeci dit, les utilisateurs doivent savoir que cet outil analyse une grande partie du disque dur de leur Xbox. Si votre console est équipée d'une distribution Linux, XCAT ne la recherchera pas intentionnellement, mais il vous conseille de prendre des mesures pour protéger toute information personnelle que vous ne souhaitez pas partager, si elle existe sur votre console. Si de tels contenus personnels existent, vous pouvez éviter leur téléchargement en les déplaçant simplement hors de l'un des répertoires analysés (listés plus haut dans cet article).\n \nTéléchargement : XCAT 1.05\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205403/in-xbxb360-xcat-v105-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205403/in-xbxb360-xcat-v105-disponible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1205403/in-xbxb360-xcat-v105-disponible-3.png"
        }
    },
    "news_15": {
        "title": "[3DS/Switch] Checkpoint v3.9.0 disponible",
        "content": "La dernière version de Checkpoint (3.9.0) vient d'être publiée, apportant des correctifs essentiels et des optimisations, notamment pour résoudre le problème de crash au démarrage qui affectait les utilisateurs depuis la version 3.8.0. Le développeur Bernardo Giordano propose en effet une nouvelle version de Checkpoint à destination de la 3DS et de la Switch. Pour rappel, CheckPoint permet de gérer vos sauvegardes sur 3DS et sur Switch, mais aussi bien de faire des backups que des restaurations de vos sauvegardes.\n \n \n\n \n \n\n \n \n \n \nChangelog \n \n- Correctifs majeurs :\n \nRésolution du crash au démarrage présent depuis la 3.8.0, grâce à l'aide précieuse de achinech sur Discord.\n \nOptimisation du scan des cartouches : désormais effectué sur un thread séparé (2 fois par seconde), améliorant ainsi les performances.\n \nMeilleure gestion des fichiers de configuration et synchronisation des threads.\n \nAjout de blocs try-catch pour éviter les plantages liés à des exceptions non gérées.\n \n- Nouvelles fonctionnalités :\n \nSupport réseau et serveur HTTP intégré : permet d’accéder aux logs en temps réel via :\n \nhttp://adresse-IP-3ds:8000/logs/memory (logs actuels) \n \nhttp://adresse-IP-3ds:8000/logs/file (logs du jour) \n \nSystème de logs amélioré (stockés dans /3ds/Checkpoint/logs).\n \nOptimisations du compilateur (passage à O3 et LTO).\n \n- Améliorations générales :\n \nMises à jour graphiques.\n \nDocumentation mise à jour avec de nouvelles captures d’écran.\n \nStabilité globale renforcée pour une meilleure expérience utilisateur.\n \n- Prochaines étapes :\n \nL’équipe reconnaît que le code source a besoin d’être restructuré, et les futures versions se concentreront sur le nettoyage et l’optimisation. Un grand merci à la communauté pour son soutien ! Les contributions (pull requests) sont les bienvenues.\n \n \n \nTéléchargement : Checkpoint 3.9.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205401/in-3dsswitch-checkpoint-v390-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205401/in-3dsswitch-checkpoint-v390-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[PS5] Streets of rage MOD adapté pour PS5 4.xx, 5.xx et 6.xx",
        "content": "Voici une petite mise à jour de mon homebrew fétiche Streets of rage MOD afin qu' il fonctionne sur PS5.\n \n\n \nEn effet cet homebrew sortis de base sur PS3 en version Paintown, a été réécrit pour fonctionner sur PS4 grâce à OpenBOR et aujourd'hui adapter pour PS5.\n \nIl a été testé sur PS5 4.03, 5.10, 6.00, 6.50 et fonctionne parfaitement.\n \n\n \nTélécharger  Streets of rage MOD PS5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205395/in-ps5-streets-of-rage-mod-adapte-pour-ps5-4xx-5xx-et-6xx-1.png"
        }
    },
    "news_17": {
        "title": "[PS5] Les performances d'UMTX2 largement améliorées",
        "content": " \nLe développeur idlesauce a largement optimisé le lancement de son jailbreak PS5 UMTX2, et pas qu'un peu, l'exploit désormais se lance entre 1 à 3 secondes là où avant il fallait entre 10 à 60 secondes. \n \n \n\n \n \nLe projet UMTX2 est le fruit du travail de plusieurs développeurs et chercheurs en sécurité informatique, qui ont fait le choix de mettre en commun leurs connaissances, UMTX2 est un nouvel outil de jailbreak qui exploite la vulnérabilité UMTX pour permettre l'exécution de code non autorisé sur la console PS5 de Sony, le code d'exploitation est largement basé sur l'implémentation Lua développée par les développeurs Shahrilnet et n0llptr, disponible dans le référentiel remote_lua_loader.\n \nAvec cette mise à jour les performances sont justes extraordinaires. \n \n \n \n\n \n \n \n \nChangelog : \n \n- Performances et taux de réussite améliorés\n- Latence des appels réduite de ~6 ms à ~0,2 ms.\n- Ne pas céder avant la destruction de l'umtx.\n- L'exploit se termine désormais souvent en 1 à 3 secondes (au lieu de 10 à 60 secondes)\n- Prend en charge le firmware PS5 1.00-5.50\n- Utilise PSFree 150b par abc (un exploit webkit connu pour exécuter des exploits sur PS5 de manière stable)\n- Payloads mis à jour avec un menu spécifique\n \n \nTout est là : https://github.com/idlesauce/umtx2\n \nWeb Host : https://umtx2.pages.dev/\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205378/in-ps5-les-performances-dumtx2-largement-ameliorees-1.jpg"
        }
    },
    "news_18": {
        "title": "[WiiU] WiiUDownloader voit une mise à jour depuis 10 mois",
        "content": "Voilà la première mise à jour de WiiUDownloader depuis 10 mois, la dernière, la v2.60 avait été proposée le 20 juin 2024, voilà donc que débarque la v2.61.\n \nPour rappel, WiiUDownloader est une application développée en langage Go et qui permet de télécharger des jeux Wii U directement depuis les serveurs Nintendo. Disposant d'une interface graphique du plus bel effet, déployée grâce à GTK, elle permet de parcourir les fichiers présents sur la Wii U.\n \n \n\n \n \n \nLe logiciel prend en charge le décryptage du contenu téléchargé, le rendant utilisable directement sur la console Wii U. La possibilité de rechercher les jeux, les mises à jour, les DLC, des démos, il intègre aussi la gestion d'une file d'attente, selon le téléchargement, en positionnant des options de cryptages. \n \nDes sections de classement par ID, par non, ou bien par région, le programme intègre des outils pour décrypter, télécharger, déprotéger le contenu sans autorisation, sachant que WiiUDownloader est proposé sous licence GPLV3, et il s'appuie sur des bibliothèques qui doivent parfois être mise à jour. \n \nC'est le cas de cette mise à jour qui apporte : \n \n- La mise à jour des dépendances\n- Résolution du problème de blocage lors du décryptage alors qu'il est réellement terminé\n- Cette version augmente la version minimale de MacOS à MacOS 13 Ventura\n \n \n \nTéléchargement : WiiuUDownloader v2.61\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205376/in-wiiu-wiiudownloader-voit-une-mise-a-jour-depuis-10-mois-1.png"
        }
    },
    "news_19": {
        "title": "[Wii/WiiU] Enorme mise à jour pour ModMii qui est proposé en v8.0.1",
        "content": " \nLe développeur XFlak propose une mise à jour importante de ModMii, l'outil est un utilitaire PC qui vous guide étape par étape dans le processus de modding de votre Wii, Wii U ou encore de son mode Wii. \n \nAvec ModMii, la configuration des loaders USB ou SNEEK est beaucoup plus facile et intuitive. \n \nCette nouvelle version propose un \"Nettoyage de fichiers\" avec des options plus poussés permettant d'exclure certains fichiers. La page de téléchargements avancés de ModMii Classic a été entièrement repensée, et il est possible de s'appuyer sur le générateur de transfert de téléchargement pour créer des chaînes cachées. \n \nS'agissant d'une version importante, la version incluse du d2x-cIOS a été mise à jour vers la v11 beta3, tout un programme qui se retrouve dans l'énorme changelog proposé par Xflak.\n \n \n \n\n \n \n \nChangelog 8.0.1 :\n \nPrincipaux changements : \n- Ajout d'une option permettant d'ignorer les fichiers de la fonction Nettoyage de fichiers de ModMii, afin de pouvoir sélectionner précisément ceux à nettoyer/supprimer. Des fichiers supplémentaires ont également été ajoutés à la liste de nettoyage de fichiers de ModMii.\n- La page des Téléchargements Avancés de ModMii Classic a été radicalement modifiée et améliorée. Les utilisateurs peuvent désormais créer plusieurs versions différentes de cIOS d2x dans la même file d'attente. L'ajout de téléchargements cIOS avancés à une file d'attente est beaucoup plus rapide et demande moins d'invites. Une option permettant de supprimer le dernier téléchargement avancé de la file d'attente en cas d'erreur a été ajoutée. Les emplacements de téléchargement cIOS avancés sont désormais limités à 200-253 ; cela signifie qu'il n'y a aucun risque de blocage des téléchargements avancés de ModMii (SAUF pour les téléchargements personnalisés définis par l'utilisateur, qui peuvent néanmoins être dangereux si vous ne savez pas comment les utiliser).\nLes files d'attente de téléchargement sont chargées différemment pour les files d'attente créées avec ModMii 8.0.0 ou une version antérieure, et pour les versions 8.0.1 et suivantes. Les files d'attente 8.0.1 et suivantes fonctionneront normalement et prendront en charge plusieurs versions de d2x dans la même file. Les anciennes files d'attente 8.0.0 ou une version antérieure (créées pour une seule version de d2x) continueront d'être synchronisées avec la version de d2x sélectionnée dans les options de ModMii.\nTous les IOS ont été supprimés de la page Téléchargements avancés ; ceux-ci peuvent toujours être récupérés à l'aide de l'option de téléchargement personnalisé défini par l'utilisateur de ModMii.\n- Lors de l'exécution d'un assistant incluant des cIOS d2x, ModMii demandera désormais aux utilisateurs s'ils souhaitent utiliser le dernier cIOS d2x « recommandé » plutôt que le cIOS « fourni ». La version recommandée de d2x peut désormais être modifiée en saisissant « R » dans la page des options de d2x. La restauration des paramètres par défaut activera également la version recommandée de d2x si elle diffère de la version fournie et en informera l'utilisateur.\nModMii ne recherche les autres versions de D2X disponibles en ligne qu'une seule fois par session. Cela permet de changer plusieurs fois de version de D2X au cours d'une même session beaucoup plus rapidement.\nAu démarrage, mais pas plus d'une fois par jour, ModMii vérifiera/confirmera silencieusement la dernière version « recommandée » du cIOS d2x.\n- Le générateur de redirecteurs de téléchargements avancés de ModMii permet désormais de créer des WAD de redirection de chaînes masqués (non applicable aux redirecteurs d'ID de chaîne, car cela serait redondant). Ceci est particulièrement utile pour les utilisateurs WiiU qui démarrent des homebrews ou des jeux Wii directement depuis des redirecteurs WUHB, mais qui ne souhaitent pas que les chaînes soient visibles ou occupent de l'espace dans le menu Wii.\n- Lanceur d'applications ModMii amélioré avec prise en charge des fichiers wuhb, rpx et wps pour pouvoir télécharger ces types de fichiers depuis votre PC vers votre WiiU via Internet (nécessite le plugin Wiiload).\n- Ajout des plugins Wiiload et FTPiiU pour WiiU\\Aroma à la page de téléchargement 5 et aux vérifications de l'application de mise à jour.\n- Version groupée mise à jour de d2x cIOS vers v11 beta3 .\n \nOptions : \n- Toutes les options sont désormais enregistrées automatiquement lorsqu'elles sont modifiées et l'option d'enregistrement des paramètres dédiée a été supprimée.\n- Lors de la définition de la lettre (ou du chemin) du lecteur SD ou USB HDD via le menu des options, ModMii vous demandera désormais si vous souhaitez analyser le lecteur pour rechercher des applications à mettre à jour ou à nettoyer (uniquement après une rapide vérification des applications ou du dossier WiiU). La même procédure est effectuée dans ModMii Skin, mais l'utilisateur sera averti même si rien n'est trouvé, car il s'agit de la seule option de nettoyage de fichiers et de mise à jour d'applications dans ModMii Skin.\n- Les opérations de nettoyage de fichiers et de mise à jour d'applications ne modifieront plus le paramètre Lecteur/Chemin de la carte SD enregistré.\n- Ajout du menu contextuel, des informations sur la barre d'outils du Launchpad et du programme d'installation/de désinstallation aux options de ModMii Classic (en plus du menu « F = ouvrir un fichier ou un dossier »). Consultez le journal des modifications de la version 7.0.0 pour plus d'informations.\n \nGuide : \n- Des étapes ont été ajoutées aux guides applicables pour vérifier/modifier le style de partition MBR des cartes SD (en plus des disques durs USB) car de nos jours, elles ne sont pas toujours nécessairement vendues en tant que MBR par défaut.\nÉtapes Priiloader améliorées dans les guides indiquant comment gérer les erreurs potentielles « cIOSPAGHETTI ».\n- Lors du téléchargement de yawmME UNIQUEMENT dans le cadre d'un assistant/guide de mise à jour SysCheck, ModMii garantit que \\WAD\\wm_config.txt est désactivé pour garantir qu'aucun paramètre de configuration personnalisé ne provoque de problèmes comme celui-ci .\n \nCorrections de bugs mineurs et améliorations :\n- ModMii ajoute désormais une barre oblique (/) au début des chemins dol du forwarder v14. La plupart des homebrews n'y prêtent pas attention, et c'est donc passé inaperçu pendant longtemps. Le forwarder USBLoader(s) v14 de ModMii a également été mis à jour, mais il ne devrait pas être nécessaire de le faire depuis l'ancienne version.\n- Correction d'un bug dans l'assistant de mise à jour vWii SysCheck où vIOS80 et Priiloader étaient toujours considérés comme nécessitant des mises à jour.\n- Correction d'un bug mineur où l'assistant ModMii Skin vWii permettait aux utilisateurs de continuer avec des versions d2x personnalisées activées qui ne prennent pas en charge l'IOS 38 de base de vWii, tant que les trois autres IOS de base de vWii étaient pris en charge. Dans ce cas, un cIOS vWii avec l'IOS 38 de base aurait été exclu des téléchargements/guides.\n- Correction d'un bug où le chargement d'une file d'attente de téléchargement, puis le retour en arrière et le chargement d'une deuxième file d'attente entraînaient le basculement des éléments de la première file d'attente.\n- Correction d'un bug où ModMii plantait parfois lors du téléchargement d'applications depuis oscwii.org si le site était inaccessible ou si le PC était hors ligne. Désormais, si aucun accès à oscwii.org n'est disponible, ModMii considérera la version en cache de son dossier temporaire comme la dernière version disponible (le cas échéant). Dans le cas contraire, le téléchargement sera signalé comme manquant.\n- Correction de l'impossibilité pour le lanceur d'applications de ModMii de récupérer correctement les arguments des fichiers meta.xml contenant des octets nuls ou des commentaires sur une seule ligne avant chaque argument (les commentaires de bloc étaient corrects). L'analyse des arguments meta.xml a également été ajustée pour exclure les arguments contenus dans les balises disabled_arguments (une fonctionnalité récemment introduite par USB Loader GX dans la version r1282).\n- Correction d'un bug lors de l'affichage des options pour les thèmes d2x ou skin où des options supplémentaires non valides étaient affichées ; cela était inoffensif car elles ne pouvaient pas être basculées.\n- Correction de l'erreur bénigne « Impossible de trouver C:\\ModMii\\temp\\DLgotos.txt » qui s'affichait parfois lors de la création d'émunands. Même si cette erreur avait été rencontrée, les résultats auraient été corrects.\n- Correction d'un bug mineur qui se produisait si ModMii Classic était exécuté en tant qu'administrateur et qu'une des pages de téléchargement était lancée, ce qui faisait que la fenêtre de la console ModMii restait ouverte au lieu d'être masquée.\n- Si ModMii Classic est exécuté en tant qu'administrateur, les instructions à l'écran informant les utilisateurs qu'ils peuvent glisser-déposer des fichiers dans la fenêtre de la console sans avoir à saisir le chemin d'accès ne s'affichent plus (car cette fonctionnalité est désactivée en mode administrateur). Notez qu'il n'a jamais été nécessaire d'exécuter ModMii en tant qu'administrateur, sauf si vous choisissez de l'installer ou d'écrire dans un dossier protégé.\n- Les lanceurs de raccourcis mis à jour (ModMii.exe, ModMiiSkin.exe et ModMii_32bit.exe) détectent également les instances de ModMii si elles sont exécutées en tant qu'administrateur (par exemple « Administrateur : ModMii ») afin de mieux avertir les utilisateurs contre l'exécution de plusieurs instances de ModMii.\n- Le skin ModMii et le fichier ModMii.bat basculeront vers la version 32 bits de ModMii.exe sur les anciennes versions de Windows non prises en charge, même s'il s'agit d'un système d'exploitation 64 bits. La version 32 bits de ModMii.exe ne permettra pas automatiquement à ModMii de fonctionner pleinement avec les anciennes versions de Windows, mais elle améliorera légèrement la situation.\n- Mise à jour de l'effet optionnel « Tourner » lors de l'application des thèmes. Cette modification visait simplement à redimensionner le contour du canal, comme décrit ici .\n- Mise à jour de la version de wiiload utilisée par ModMii vers la version v0.5.3-1 et suppression de la vérification de la taille des fichiers du lanceur d'applications (validée sur le récepteur)\n- Pour votre protection, le modificateur WAD IOS de ModMii empêche désormais les utilisateurs de modifier l'emplacement d'un stub IOS en un emplacement utilisé par les menus système.\n- Autres changements mineurs.\n \nedit 15.04.25 : \n \nTéléchargement : ModMii v8.0.2\n \n \n \n",
        "images": {}
    },
    "news_20": {
        "title": "[PS3] Apollo Save Tool s'améliore sur PS3 avec des options cloud",
        "content": "Le développeur Damian Parrino, connu sous le pseudonyme Bucanero, vient de mettre en ligne une mise à jour d'Apollo Save Tool dans sa version d'origine, c'est à dire celle déployée pour la PS3. \n \nPour rappel, Apollo Save Tool est un outil qui permet avant tout d'archiver ses sauvegardes de jeux et de les restaurer en cas de disfonctionnement de votre espace de stockage. Mais il ne sert pas qu'à ça, il a su évoluer avec le temps et offrir des possibilités beaucoup plus étendues. \n \nLes capacités d'Apollo Save Tool sont intéressantes et en plus elles sont accessibles puisque l'outil peut être lancé sur custom firmware mais aussi sur PS3HEN, l'application peut donc fonctionner sur FAT, Slim et Superslim. \n \nAvec cette mise à jour, la version 2.2.0 sur PS3, le développeur a souhaité rendre possible la possibilité de sauvegarder et de restaurer les sauvegardes PS1/PS2 et PS3 sur le cloud, si vous avez un serveur FTP (comme un NAS, un serveur local ou un hébergement type web host..). Un guide à d'ailleurs été mis en oeuvre : Apollo-FTP-Guide.\n \n \n \n\n \n \n \nChangelog\n \nAjout :\n- Prise en charge du serveur FTP (enregistrement de la sauvegarde dans le cloud)\n-- Compressez, téléchargez et sauvegardez les enregistrements sur un serveur FTP défini par l'utilisateur\n-- Répertorier, télécharger et restaurer les sauvegardes à partir d'un serveur FTP défini par l'utilisateur\n-- Sauvegarde des sauvegardes PS1, PS2 et PS3\n- Copie vers HDDO : ption améliorée\nMenu Paramètres :\n- FTP Server URL : Option ajoutée\n- Ajout de l'option de sélection ( FTP/Online DB) pour les téléchargements de sauvegardes\n- USB Source : Option de sélection ajoutée\n- Debug log : Option persistante\n- Save Owner : Option supprimée\nDivers :\n- Mise à jour du moteur de correctifs Apollo vers la version 1.3.0\n- Ajout djb2une fonction de hachage\n- Ajout la prise en charge des balises pour les options sélectionnées par l'utilisateur sur .savepatchles fichiers\n- Prise en charge de SaveWizard et des codes BSD avec plusieurs options\n \n \nTéléchargement : Apollo Save Tool 2.2.0\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205366/in-ps3-apollo-save-tool-sameliore-sur-ps3-avec-des-options-cloud-1.png"
        }
    }
}