{
    "news_1": {
        "title": "[PS5] PS Multi Tools v13.1.1 disponible",
        "content": "Le développeur SvenGDK vient de mettre en ligne une nouvelle version de PS Multi Tools, l'outil à tout faire pour utilisateurs PlayStation est donc disponible dans sa version 13.1.1. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \nCette nouvelle version apporte son lot de changements. \n \n \n\n \n \nNouveau dans PS Multi Tools :\n \n- Ajout du dernier loader JAR de PS5 jusqu'au firmware 7.61 (pas d'exploit complet)\n- Menu Hôtes & DNS réorganisés\n- Ajout de nouveaux hôtes (Sleirsgoevy & Zecoxao)\n- Ajout d'un DNS alternatif (par Kameleon)\n- Plus de téléchargements ajoutés\n- etaHEN (par LightningMods)\n- etaHEN avec cheats\n- Homebrew Store (par LightningMods)\n- PS5-Kstuff (par Sleirsgoevy)\n- Mise à jour des patchs pour le jeu PS5 (libhijacker)\n \nCorrections :\n \n- Corrections et ajustements de l'utilisation hors ligne\n- Correction : PS3 PUP Unpacker ouvre maintenant la bonne fenêtre\n- Correction : Crash ou erreur lors de la recherche de correctifs pour les jeux PS5\n- Correction : PS5 PKG Builder n'acceptait pas un chemin avec des espaces\n- Correction : PSX XMB Installer Game Editor plantait lors du chargement de données non existantes depuis PSXDatacenter\n \n \nTéléchargement : PS Multi Tools v13.1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182043/in-ps5-ps-multi-tools-v1311-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PS5] Sistr0 travaille sur un GoldHen PS5",
        "content": "Le développeur Sistr0 travaille sur une version de son payload GoldHen pour PS5, l'un des développeurs les plus connus de la scène PS4 vient en effet de publier une capture d'écran qui ne laisse aucun doute sur l'arrivée de la solution sur PS5. \n \nGoldHen est un payload PS4 qui s'apprente à une boite à outils qui intègre toutes les possibilités dans un seul endroit, avec lui sur PS4, il est possible de profiter d'énormémement de fonctions, comme le Debug Settings, le serveur FTP, un journal, les correctifs, patches, et autres mods, la possibilité d'appliquer des cheats codes ou encore la possiblité de lancer des homebrews. \n \n \n\n \n \nLe fait qu'il dévoile qu'il travaille sur une version PS5 de GoldHen est rassurant, cela signifie qu'il a bon espoir de porter GoldHen, qui viendra quelque peu en concurrence avec etaHEN de LightningMods, mais qui a n'en pas douter élargira les possibilités offertes sur PS5. \n \n \n \n\n \n \n \nLa capture d'écran montre un débogueur en cours d'exécution, qui se nommerait ps5debug v0.1 codé par Ctn & Sistr0 et ce qui serait un menu personnalisé. \n \n \nSource : ko-fi.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182016/in-ps5-sistr0-travaille-sur-un-goldhen-ps5-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182016/in-ps5-sistr0-travaille-sur-un-goldhen-ps5-1.png"
        }
    },
    "news_3": {
        "title": "[PS4] Unreal Engine 4 game MODDER v1.0",
        "content": "Il y a quelques temps, sur mon compte twitter, je vous annonçais avoir enfin réussi, après 3 ans environ, à convertir des mods complet Dragon Ball Fighter Z pc pour PS4. En effet, depuis un long moment je travaillais sur la conversion complète des mods PC vers PS4 mais j'étais bloqué à cause des textures PC qu'il fallait adapter pour PS4, c est maintenant chose faite...  De plus après un petit sondage, toujours sur mon compte Twitter, je vous proposais soit de publier les mods complets directement en PKG ,soit de publier mon outil de créationde FPKG des mods.Le résultat bien que très très serré, donne mon outil gagnant.  Vous trouverez donc cet outil et son fonctionnement dans cette new... Le principe est simple, ce script va décrypter la mise à jour du jeu, y ajouter les mods que vous aurez sélectionner et recréer la mise à jour incluant les mods, il ne vous restera plus qu' à installer le FPKG. Mon outil prend en compte les mods Dragon Ball Fighter Z, mais aussi les mods de Sifu, mais attention, il vous faudra AVANT de créer le FPKG convertir vous même les mods PC vers PS4, copier un mod PC directement dans l outil vous donnera un problème de textures in game...Je vous fourni une vingtaine de mods Dragon Ball Fighter Z convertis PS4, d autre viendront plus tard...Vous trouverez dans ce 1er pack de mods, Broly Xeno, Goku Armor, Trunk Armor, Gohan SSJ4, Goku God, Mod music, etc...  Tuto: - Placer le fpkg du jeu de base v1.0 dans le dossier game/dbz/- Placer le fpkg de la mise a jour du jeu dans le dossier maj/dbz/- Placer les mods voulus dans le dossier mods/dbz/- Lancer mod_builder.bat- Entrer le numéro CUSA de votre jeu (le numéro seulement)- Appuyer enter et patienter Pour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:https://www.paypal.com/paypalme/markus00095  Télécharger UE4 game modder v1.0Télécharger Mods_DBFZ ",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181991/in-ps4-unreal-engine-4-game-modder-v10-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1181991/in-ps4-unreal-engine-4-game-modder-v10-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1181991/in-ps4-unreal-engine-4-game-modder-v10-2.jpg"
        }
    },
    "news_4": {
        "title": "[XB360] J-Runner avec Extras v3.3.0 r2 disponible",
        "content": "En ce début de mois de novembre 2023, on se met au vert, cela faisait longtemps, donc basculons un peu dans le monde de Microsoft, bon bien entendu pour pouvoir le faire il faut se positionner sur deux générations de consoles, la Xbox 360. \n \nUne nouvelle mise à jour a été publiée pour J-Runner avec Extras, l'un des outils les plus complets toujours maintenu à jour par Octal450, et qui comme vous le savez s'intègre dans Xebuild pour lire, écrire ou encore créer des images NAND de la console de Microsft afin de réiniatialiser les problèmes de paramétrages ou appliquer le hack Jtag. \n \nLes nouveautés sont intéressantes, cela passe par une commande \" Nouvelle session \" qui a été améliorée, des correctifs pour les HDD XL, ou encore la correction d'un problème de détection d'image pour le modèle Corona 4 GO.\n \n \n\n \n \nChangelog :\n \n- Ajout : Amélioration de la commande New Session\n- Ajout : Mise à jour du patch XL HDD\n- Correction : Problème de détection de l'image Corona 4GB\n \nInstructions :\n \n- Téléchargez et extrayez J-Runner-with-Extras.zip pour l'exécutable et les fichiers d'assistance.\n- N'utilisez pas JR-Auto-Update-Delta.zip, ou le paquet pourrait ne pas être mis à jour correctement.\n \n \nTéléchargement :  J-Runner avec Extras v3.3.0 r2 \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181974/in-xb360-j-runner-avec-extras-v330-r2-disponible-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS5] PS5 Homebrew Store de LightningMods",
        "content": "Le développeur LightningMods a annoncé avoir mis en ligne le Homebrew Store pour la PS5, il a du pour cela travailler très dur puisqu'il a fallu refaire tous les packages des jeux et utilitaires de Lapy pour qu'ils fonctionnent sur PS5. \n \nAttention comme il le rappelle il faut disposer de etaHEN 1.0b (ou plus récent) pour en profiter, et bien entendu du firmware 4.03 et 4.50, seuls compatibles pour le moment. \n \n \n\n \n \nBien entendu, il ne s'agit pas d'un nouveau store, mais celui de la PS4 existant sur pkg-zone, il a juste été adapté pour qu'il fonctionne sur PS5.\n \nAvec lui vous allez pouvoir télécharger et installer les fPKG compatibles, si certains ne l'étaient pas, il faut le signaler à l'équipe PKG-Zone qui le travaillera pour remplacer le package et ainsi le rendre compatible PS5, preuve que ces changements sont plutôt simples à réaliser. \n \n \n\n \n \n \nIl existe toujours une page avec le chargement direct du payload \n \nLien : https://pkg-zone.com/exploit/PS5/index.html\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181953/in-ps5-ps5-homebrew-store-de-lightningmods-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1181953/in-ps5-ps5-homebrew-store-de-lightningmods-2.jpg"
        }
    },
    "news_6": {
        "title": "[PS5] Les premières photos de la PS5 slim, quoi en penser",
        "content": "A deux semaines du lancement officiel, voilà déjà que la PS5 \"Slim\" montre le bout de son nez, certains ont déjà le loisir d'en profiter et ont pu mettre la main sur ce nouveau modèle. \n \nQuelques utilisateurs de Twitter dévoile en effet des photos de PS5 Slim, mais là cela devient intéressant c'est lorqu'on la compare à l'ancien modèle.\n \n \n\n \n\n \n\n \n\n \n \nBien entendu, elle parait plus fine, mais elle l'est, elle est plus fine, plus légère, moins consommatrice d'énergie, les ports sont similaires, un port HDMI, deux ports USB, un connection d'alimentation et un port Ethernet. \n \nLe bémol, comme nous l'avions vu, il faudra bel et bien connecter votre PS5 à internet pour enregistrer votre lecteur optique à votre console. Il est en effet \"impossible d'utiliser le lecteur de disque. Vous devez connecter votre PS5 à votre réseau pour l'enregistrer sur votre PS5\". \n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181950/in-ps5-la-premiere-ps5-slim-en-image-quoi-en-penser-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1181950/in-ps5-la-premiere-ps5-slim-en-image-quoi-en-penser-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1181950/in-ps5-la-premiere-ps5-slim-en-image-quoi-en-penser-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1181950/in-ps5-la-premiere-ps5-slim-en-image-quoi-en-penser-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1181950/in-ps5-la-premiere-ps5-slim-en-image-quoi-en-penser-5.jpg"
        }
    },
    "news_7": {
        "title": "[2DS/3DS/DS] TWiLight Menu++ v26.2.0 et nds-bootstrap v1.0.2 disponibles",
        "content": "Le développeur RocketRobz est de retour avec de nouvelles versions de TWiLight Menu++ et de nds-bootstrap, au programme des correctifs AP supplémentaires ont été ajoutés à TWiLight Menu++ pour divers jeux, mais aussi le mode couleur pour les GBA/DS.\n \n \n \n\n \n \nTWiLight Menu++ v26.2.0 :\n \n- Ajout du mode de couleur GBA/DS Phat !\n- Le dé-banding des couleurs de la boîte/photo est maintenant utilisable sur les consoles DS debug/dev.\n- @edo9300 : Le niveau de luminosité peut maintenant être modifié sur les consoles DS Phat.\n- @lifehackerhansol : Ajout des fichiers de démarrage automatique pour les cartes EZ-Flash Vi et r4i.cn.\n- @R-YaTian : Ajout de quelques patchs AP et widescreen. (#2308)\n \nCorrections de bugs\n- @edo9300 : Correction de la détection des consoles DS Phat ou DS Lite.\n- @edo9300 : Correction d'un dépassement de tampon dans slot1launch. (#2310)\n- Thèmes R4/GBC : Correction de la liste des fichiers qui ne défile pas vers le bas jusqu'au fichier sélectionné, après avoir sélectionné l'icône Jeu.\n \n \nnds-bootstrap v1.0.2 :\n \n- Lors de l'utilisation des fonctions sans fil, le chargement de la ROM sur la carte SD de la DSi/3DS est à nouveau ralenti, afin d'éviter les erreurs.\n- Correction de la mise en miroir de la ROM si la taille de la ROM est supérieure à la taille de l'appareil définie dans l'en-tête de la ROM.\n- Correction de la prise en charge de certaines ROM modifiées (ex. traductions et ROM hacks).\n- Mode B4DS : Le moteur de triche a été déplacé vers la WRAM arm7 pour Inazuma Eleven 1 & 2.\n- Correction d'un cas où l'ouverture d'un menu fait planter le jeu avec un AP-fix appliqué.\n- Correction de la version européenne de Yoshi Touch & Go ne démarrant pas sur la carte SD de la DSi/3DS.\n- Mode B4DS : Pour éviter les bugs, TWiLight Menu++ doit maintenant être utilisé avec EZ_FLASH_RAM activé dans fat:/_nds/TWiLightMenu/settings.ini, afin d'utiliser une cartouche EZ-Flash Slot-2.\n \n \nTéléchargement : TWiLight Menu++ v26.2.0 et nds-bootstrap v1.0.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181945/in-2ds3dsds-twilight-menu-v2620-et-nds-bootstrap-v102-disponibles-1.jpg"
        }
    },
    "news_8": {
        "title": "[3DS] MSET9 version 1.2 disponible",
        "content": "Le développeur Zoogie vient de publié une nouvelle version de MSET9, cette nouvelle version le rend désormais compatible MacOS, pour rappel MSET9 est un exploit primaire ARM9 pour la 3DS qui peut être lancé avec seulement des données de nom de fichier ajoutées à la carte SD insérée.\nCette exploit fonctionne de la 11.4 a la 11.17, que ce soit sur Old ou New 3DS / 2DS\n \n\n \n\nChangelog :\n \n\n\n \n- Support de MacOS\n\n\n \nLien de téléchargement : MSET9 Beta 1.2\n \n\n \n",
        "images": {
            "image_1": "https://cdn.discordapp.com/attachments/1133267078929985636/1160914937934250014/image.png"
        }
    },
    "news_9": {
        "title": "[3DS/WiiU] Pretendo annonce la béta annuel plutôt que prévue",
        "content": "L'équipe de Prétendo vienne de faire une annonce concernant la sortie de la nouvelle béta et du contenue disponible, disponible des maintenant.\n \nPour rappel, Pretendo est un remplacement gratuit et open-source des serveurs Nintendo pour la 3DS et la Wii U permettant la connectivité en ligne pour tous, y compris après l'arrêt des serveurs officiels.\nComme vous le savez, les serveurs de Nintendo vont officiellement fermé en avril 2024,\nPretendo est donc l'alternative tout trouvé pour réimplémenté le online sur les jeux en ayant besoin sur 3DS et WiiU.\n \n\n \n \nComme annoncé par l'équipe de Prétendo, ils ont travailler pour apporté du nouveau contenue / jeux en béta public, car comme annoncé une béta est en effet proposé chaque année pendant le mois de décembre, mais l'équipe de Pretendo à annoncé que cette dernière allais bénéficier d'un mois supplémentaire et commencerais ce jour, le Mercredi 1 Novembre 2023.\n \n\n \nLes jeux ajoutés avec cette nouvelle béta sont : \n- Super Mario Maker pour la WiiU et la 3DS \n- Splatoon pour la WiiU\n- The Legend of Zelda : Tri Force Heroes pour la 3DS\n- IronFall : Invasion pour la 3DS \n- Pokkén Tournament pour la WiiU\n- PIKMIN 3 pour la WiiU\n- Steel Diver : Sub Wars pour la 3DS\nCela porte la liste totale des serveurs disponibles à\n- Wara Wara Plaza\n- Mario Kart 8 \n- Mario Kart 7 \n- Super Mario Maker pour la WiiU et la 3DS \n- Splatoon \n- The Legend of Zelda : Tri Force Heroes\n- IronFall : Invasion \n- Kid Icarus : Uprising \n- Pokkén Tournament \n- PIKMIN 3 \n- Steel Diver : Sub Wars\n \nLes serveurs suivants ne sont toujours pas disponibles actuellement, pour diverses raisons, mais sont toujours prévus pour la date de sortie initiale de décembre (ou peut-être même plus tôt)\n \n- Juxtaposition (Miiverse) \n- Pokémon Rumble World \n- Team Kirby Clash Deluxe \n \nPour des raisons techniques, les serveurs suivants ne sont pas programmés pour une version bêta publique \n \n- Minecraft : Édition Wii U\n \nLa liste peut-être susceptible à des changements.\nVeuillez noter que toutes les fonctionnalités ne sont pas prises en charge par tous les serveurs. Si une fonctionnalité ne fonctionne pas comme prévu, veuillez consulter le site de Pretendo pour avoir une vue d'ensemble des fonctionnalités prises en charge par chaque serveur. Si la fonctionnalité est listée comme étant prise en charge, mais qu'elle ne fonctionne pas comme prévu, veuillez remplir un rapport de bug dans le support.\nNote importante concernant Super Mario Maker\n \nEn raison de limitations techniques, à partir de cette version bêta, tous les cours postés AVANT sont supprimés. Ceci est dû au fait que nous avons changé de base de données et de fournisseur S3.\nL'ancien système de base de données n'étant pas compatible avec le nouveau, une migration des anciens cours n'était pas possible.\nDe plus, l'ancien serveur faisait BEAUCOUP de mauvaises suppositions concernant les données des utilisateurs et les téléchargements, et avait donc sa propre myriade de problèmes.\nCes problèmes ont été corrigés dans la dernière version, et la nouvelle base de données est conçue de manière à rendre les migrations possibles si un changement devait se produire à nouveau.\nÀ l'avenir, il ne devrait plus y avoir de réinitialisation pour Super Mario Maker, mais comme tout est encore en version bêta, cette situation est toujours sujette à changement \n \nNote importante concernant Steel Diver : Sub Wars\n \nNintendo a actuellement désactivé ce serveur pour des raisons de maintenance. Il n'y a pas eu d'explication publique à ce sujet. Il pourrait s'agir d'un autre exploit non divulgué dans le jeu, ou d'un problème sans rapport avec le jeu. Nous vous recommandons de procéder avec prudence\nPour installés et utilisé Pretendo.\nUn guide vous est présenté sur le site de Pretendo\n",
        "images": {
            "image_1": "https://news.nobuyoshi.red/articles/ressources/articles_images/Pretendo-1638441907.png",
            "image_2": "https://cdn.discordapp.com/attachments/413884110667251722/1158876793554604182/2022-08-17_13.53.29.466_TV.jpg"
        }
    },
    "news_10": {
        "title": "[Switch] NeXT 3.05 disponible",
        "content": "Le développeur mistervampi propose une nouvelle version de NeXT, la solution passe en version 3.05 à l'occasion d'Halloween.\n \nNeXT, pour ceux qui ne le connaitrait pas, est un tout en un qui supporte les CFW que ce soit Atmosphere ou SX OS, de plus sa gestion des applications est largement simplifiée par une interface utilisateur très fonctionnelle. Similaire à DeepSea ou encore RetroReloaded, NeXT intègre de nombreux payloads, et sa plus grande des possibilités est de pouvoir facilement gérer Atmosphere et SX OS au travers d'une interface graphique riche. \n \n \n\n \n \nNeXT assure une compatibilité totale avec toutes les consoles Switch qu'elles soient modifiées en hard ou en software. \n \nMise à jour de cette version 3.05 : \n \n- Support intégral du firmware 17.0.0\n- Atmosphere 1.6.2\n- Sigmapatches\n \n \nTéléchargement : NeXT 3.05  \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-167416608.jpg"
        }
    },
    "news_11": {
        "title": "[PS4] PS4 Wee Tools v0.9.5 disponible",
        "content": "En ce dernier jour d'octobre, le développeur Abkarino propose une nouvelle version de son outil PS4 Wee Tools qui est désormais livré en v0.9.5.\n \nLa solution gratuite de donwgrade PS4 dispose donc de nouvelles fonctionnalités.\n \n\nNouveautés :\n \n- NOR : patcher Southbridge\n- NOR : patcher Torus (WiFi+BT)\n- NOR : analyse et récupération de partition\n- NOR : mode rapide/expert pour la récupération des partitions\n- NOR : bascule du flag toogle actif\n- NOR : patch légitime rapide (drag&drop 2 dumps sur run.bat)\n- SCFlasher : Effacement sûr de syscon\n- SC : nettoyage complet\n- SC : autopatch fonctionne maintenant avec n'importe quel* syscon\n- SC : correction de la méthode B\n- SC : le patch manuel fonctionne maintenant avec flatdata\n- SC : affiche le compteur de lignes\n- Mise à jour de la librairie Util\n- Correction des bogues d'Utils\n- Optimisation du code\n \n\n \n\n \n\n \n \n \nPS4-Wee-Tools v0.9.5 disponible :\n- Mode rapide/expert pour la récupération des partitions\n- Patcheur Southbridge\n- Patcheur Torus (WiFi+BT)\n- Mise à jour de la librairie Util\n \nLe patcheur Torus (wi-fi+bt) est désormais inclus. Peut-être que pour quelqu'un ce sera quelque chose de \"nouveau\" mais toutes ces fonctionnalités sont très simples et en fait elles pouvaient être réalisées avec les versions précédentes de wee-tools comme le précise l'auteur. Cette option vous permet simplement de gagner du temps. \n \n \n \nTéléchargement : PS4-Wee-Tools v0.9.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2077743693.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1537784304.png"
        }
    },
    "news_12": {
        "title": "[PSP] Apollo Save Tool v1.2.0 disponible",
        "content": "Le développeur Bucanero propose la version 1.2.0 d'Apollo Save Tool pour la PSP. C'est une bonne nouvelle pour celles et ceux qui disposent encore d'une PSP exploitable.\n \nLe logiciel évolue une nouvelle fois avec de nombreuses nouveautés, et le changelog est impressionnant. Pour rappel, il s'agit d'une application qui vous permet de gérer les fichiers de sauvegarde de jeu sur PlayStation Vita et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur la PSP.\n \n \n \n\n \n \nAjout :\n- Prise en charge du stockage ef0 (mémoire interne de la PSP Go)\n- Ajout de la lecture de la musique de fond AHX\n- Ajout d'un clavier à l'écran\n- Ajout d'un téléchargeur d'URL (outils réseau, supporte https, http, ftp, ftps)\n- Détection automatique des paramètres des boutons X/O\n- Compression des fichiers .ISO en .CSO\n- Décompression des fichiers .CSO en .ISO\n- Ajout d'une base de données de clés de sauvegarde pour les jeux PSP\n- Nouveaux codes de triche pour PSP\n> Persona (ULUS10432)\n- Nouveaux correctifs anti-copie pour PSP\n> InviZimals : Shadow Zone (UCES01411, UCES01581, UCUS98760)\n> InviZimals : The Lost Tribes (UCES01525)\n> SOCOM : Fire Team Bravo 2 (UCUS98645)\n- Prise en charge des sommes de contrôle personnalisées\n> InviZimals : Shadow Zone (UCES01411, UCES01581, UCUS98760)\n> InviZimals : The Lost Tribes (UCES01525)\n \nCorrection :\n- Online DB : correction du cache des fichiers\n- Serveur web simple : liens de dossiers corrigés\n- Correction de l'horodatage des journaux de débogage\n \nDivers :\n- Mise à jour du moteur de patch apollo-lib en v0.5.5\n- Ajout de rappels d'hôtes (nom d'utilisateur, mac lan, mac wlan, nom du système, psid, identifiant de compte)\n- Ajout de la fonction de hachage murmu3_32\n- Ajout du décryptage de MGS5 PS3/PS4\n- Ajout de la somme de contrôle Castlevania:LoS\n- Ajout du checksum Rockstar\n- Correction de SaveWizard Code Type C\n- Correction de right() sur les plateformes little-endian\n \n \nTéléchargement : Apollo Save Tool v1.2.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181846/in-psp-apollo-save-tool-v120-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[Switch] DeepSea 4.9.0 disponible",
        "content": "Le développeur Team-Neptune vient de mettre à jour sa solution All-in-one DeepSea, pour rappel, DeepSea est un Pack AIO regroupant tout en un pack, l'objectif est de facilité l'accessibilité pour les utilisateurs d'Atmosphère.\n \nBien entendu cette version apporte le support du firmware 17.0.0 mais vient proposer la mise à jour des derniers homebrews et utilitaires disponibles pour la Nintendo Switch.\n \n \n\n \n \nChangelog : \n \n- Cette version ajoute le support du firmware 17.0.0\n- Mise à jour d'Atmosphere vers la version 1.6.2\n- Mise à jour de Hekate vers la version 6.0.7\n- Mise à jour de MissionControl vers 0.10.0\n- Mise à jour de Status Monitor à la version 0.9.2\n- Mise à jour de DeepSea Assets à la version 1.0.9\n- Ajout Goldleaf\n- Suppression de Tinwoo\n \n \nTéléchargement : DeepSea 4.9.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181844/in-switch-deepsea-490-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] Rekado 5.2 disponible",
        "content": "Le développeur MenosGrante vient de dévoiler une nouvelle version de Rekado,\nPour rappel Rekado est un Lanceur de Charge utile dit \"Payloads\" via Android, il permet donc de lancer Hekate, fusee et autre payloads depuis un périphérique Android sur la Switch, en général a l'aide d'un câble OTG.\nIl permet aussi de vérifier si une Nintendo Switch est patcher en utilisant les numéros de série ou en scannant un code barre sur la boite de la console.\n\nChangelog\nLocalisation:  Toutes les localisations terminées de Crowdin\nDeveloppement: Prise en charge complète d'Android 14.\nPayloads: Mise à jour vers les dernières versions.\n \n\nLien de téléchargement : Rekado 5.2\n",
        "images": {
            "image_1": "https://www.tomsguide.fr/content/uploads/sites/2/2019/08/switch-serial-number.png"
        }
    },
    "news_15": {
        "title": "[Switch] Haku33 supporte désormais le Firmware 17.0.0",
        "content": "L'équipe StarDustCFW vient de mettre en ligne la version 5.7/6.0 de Haku33.\nPour rappel Haku33 permet de réinitialiser la Nintendo Switch pour qu'elle soit le plus clean possible lors de sont utilisation en ligne ou pour de la revente d'occasion. En effet ce programme open source a pour fonction d'éliminer les fichiers critiques de la console pour effectuer une réinitialisation matérielle de la console, ne laissant que l'essentiel pour démarrer.\nChangelog : \n- Ajout d'une exception pour éviter de supprimer le fichier d'index.\n- La réinitialisation de ce fichier provoque un softbrick pour les consoles 17.0.0 ou supérieures.\n- Il s'agit d'une modification apportée par Nintendo à la manière dont les sauvegardes système sont gérées dans la version 17.0.0.\n- Jusqu'à la version 17.0.0, cette liste n'était pas utilisée pour les sauvegardes système,\nmais après la mise à jour, elle est utilisée pour cela et fait que la console ne trouve pas les fichiers importants pour démarrer le système d'exploitation (explication complète ici -> SciresM 17.0.0 Save File Management).\n- Ainsi que le format du fichier imkvdb.arc (pour les plus avertis) Ici\n- La solution vient de SciresM avec Atmosphere 1.6.1 qui détecte le problème et reconstruit les données perdues pour que le système redémarre.\n- Bien qu'il existe d'autres solutions plus manuelles (signer un fichier depuis une autre console et l'insérer) qui n'impliquent pas l'exécution de CFW, celle-ci est la plus simple et la plus sûre de toutes, et l'exécution de CFW elle-même ne vous fait pas bannir, donc tant que vous n'exécutez que Atmosphere pour corriger l'erreur, il ne devrait pas y avoir de risque de bannissement par la suite.\n- Après le changement effectué par Nintendo à partir de la 17.0.0, Haku33 va manipuler le système pour supprimer toutes les sauvegardes en une seule fois de manière sécurisée, et en n'utilisant pas de 3 party too\n\nLien de téléchargement : Haku33 6.0\n",
        "images": {
            "image_1": "https://user-images.githubusercontent.com/2240909/101447359-0b0d5980-3960-11eb-93fd-a1c191946814.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] Moonlight-Switch 0.13.4 disponible",
        "content": "Le développeur XITRIX vient de dévoilé une nouvelles version de Moonlight-Switch, la 0.13.4, sous cette homebrew ce cache un portage de la célèbre application d'nVidia, Moonlight qui pour rappel est une implémentation open source de GameStream de NVIDIA, tel qu'utilisé par NVIDIA Shield, l'adaptation officiel est sous Windows, Mac et Linux.\nBasé sous Moonlight-NX de Rock88 cette version utilise le nouvelle UI Graphique borélis développé par natinusala.\n \n\nInstallation\n\n- Télécharger la dernière Moonlight-Switch version .\n- Mettez br_moonlight.nro sur sdcard:/switch/moonlight;\n- Lancez hbmenu sur la redirection de titre (pour un accès PLEIN RAM);\n- Lancez le clair de lune.\n \nChangelog\n- Mise à jour de la version de Moonlight-Core\n- Support Firmware 17.0.0\n \nLien de téléchargement : Moonlight-Switch 0.13.4\n",
        "images": {
            "image_1": "https://pbs.twimg.com/media/E39DcZ8WEAEgl5E?format=jpg&name=large",
            "image_2": "https://pbs.twimg.com/media/E39DcbXXwAE0tIn?format=jpg&name=large",
            "image_3": "https://pbs.twimg.com/media/E39DcbTXoAUCAfQ?format=jpg&name=large"
        }
    },
    "news_17": {
        "title": "[Switch] AtmoPackUpdater 2.0.0 disponible",
        "content": "Bonjour à tous. Après 5 mois sans mise à jour j'ai sorti la dernière version de AtmoPackUpdater en version 2.0.0\nEn effet dernière mise à jour car je ne maintiendrai plus l'application jugeant qu'elle est terminée. Cependant si des bugs sont reportés des correctifs verront le jour.\n\n\n \nChangelog : \n-Ajout des traducteurs dans l'onglet À propos\n-Implémentation directe de l'installation de la mise à jour du système dans AtmoPackUpdater (#18).\n-Ajout d'un choix pour le chemin de sauvegarde des homebrews\n-Ajout d'un onglet pour les packs customisés\n-Si vous voulez faire une config avec un pack customisé veuillez modifier le fichier situé dans /config/AtmoPackUpdater/config.json comme ci-dessous\n\n{\n    \"auto-update\" : false,\n    \"custom-pack\" : [\n          {\n               \"name\": \"Nom du pack\",\n               \"url\": \"Url en téléchargement direct du pack\"\n          }\n     ]\n}\n\nTéléchargement : AtmoPackUpdater 2.0.0\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181821/in-switch-atmopackupdater-200-disponible-1.jpg"
        }
    },
    "news_18": {
        "title": "[Switch] Hombrew Menu 3.6.0 dès maintenant disponible!",
        "content": "La nouvelle version du Hombrew launcher, qui apporte de nombreuses améliorations, est disponible depuis le 28 octobre 2023.\n \n\nEffectivement, la nouvelle version 3.6.0 a été publiée sur le GitHub de SwitchBrew. Cela faisait presque 2 ans qu'il n'y avait pas eu de nouveautés sur le Homebrew launcher.\n \n\n \nCe que la mise à jour apporte : \n- Prend en charge la gestion de la température pour le firmware 17.0.0\n- Correction du problème avec l'affichage de la force wifi\n- Comme Dpad ainsi que bas/haut, des boutons supplémentaires ZL/ZR ont été ajoutés pour se déplacer\n- Construit avec la dernière version de libnx\n \nSource : https://github.com/switchbrew/nx-hbmenu/releases\n\n \n \n",
        "images": {
            "image_1": "https://hackintendo.com/wordpress/wp-content/uploads/2020/12/nx-hbmenu.jpg"
        }
    },
    "news_19": {
        "title": "[PS5] Des modifications de Sleirsgoevy sur ps4jb-payloads",
        "content": "Le développeur Sleirsgoevy continue son travail sans relâche sur ps4jb-payloads, autant sur la partie compatibilité logicielle et optimisations du code que sur la partie découverte, et ajout de nouvelles fonctionnalités à l'exploit. \n \nAinsi depuis quelques jours, il a rajouté pas mal d'évolutions sur ps4jb-payloads et ps5-kstuff, et nous voyons bien que son intérêt est d'élargir le portage sur d'autres firmwares que les seuls 4.03 et 4.50. \n \nAinsi il essaye de revoir comment fonctionne l'exploit et son processus, en tentant de compenser en dur les nombreuses fonctions qui le compose. Ce travail est long et fastidieux, il consiste à trouver manuellement les offsets et fonctions dans chaque partie du code, un travail rendu encore plus complexe à cause de XOM. \n \nAfin de faciliter ce travail de recherche le développeur a apporté un script qui permet de trouver plus facilement ces ouvertures, plutôt que de devoir les chercher manuellement. \n \n \n\n \n \nPar exemple, nous pouvons voir qu'il a récemment intégré la prise en charge de la recherche des décalages mmap_self pour n'importe quel firmware donné. Cela permettrait à son décrypteur SELF de fonctionner sur n'importe quel firmware, même s'il existe déjà une alternative de Specter pour cela, cela pourrait être très utile. \n \nD'autres éléments très techniques, comme l'ajout d'un outil make_fself qui prend la forme d'un script vient lui aussi d'être porté hier en python3 par Sleirsgoevy, et il l'a modifié pour qu'il fonctionne comme un module. \n \nCe travail sur les dérivations et l'ajout d'outils sous forme de scripts va certainement porter ses fruits pour élargir la palette de firmwares compatibles avec les fPKG, reste plus qu'à être patient. \n \nTout est là : ps4jb-payloads\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181791/in-ps5-des-modifications-de-sleirsgoevy-sur-ps4jb-payloads-1.png"
        }
    },
    "news_20": {
        "title": "[PS4/PS5/Switch] DS4Windows 3.2.18 disponible",
        "content": "Le développeur Travis Nickles, connu aussi sous le pseudo Ryochan, nous propose de découvrir une nouvelle version de DS4Windows. Cette version apporte quelques corrections notamment sur les fonctions gyroscopiques de la DualSense Edge, mais aussi la mise à jour de certaines bibliothèques et certains registres. \n \nComme vous le savez probablement DS4Windows est une interface efficace pour paramétrer une manette sur PC, il est basé sur un fork de Jays2Kings. Pour en profiter cela passe par un câble micro-USB, mais il est aussi possible de s'en servir sans fils avec quelques adaptateurs Bluetooth 2.1 (ou supérieur). \n \n \n\n \n \n \n \nChangelog 3.2.18 :\n \n- Correction de la vérification du registre HidHide lorsque la clé n'existe pas\n- Correction des index des déclencheurs Gyro Mouse Joystick pour certains déclencheurs. Les déclencheurs DualSense Edge en particulier\n- Mise à jour des bibliothèques SharpOSC\n- Correction du réglage par défaut de l'application pour l'option JoyCon LinkMode\n- Ajout d'une traduction en turc. Contribution de onuralpyilkin\n- Changement du helpURL pour le message d'avertissement SendInput\n \n \n \nTéléchargement : DS4Windows 3.2.18\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1181790/in-ps4ps5switch-ds4windows-3218-disponible-1.png"
        }
    }
}