{
    "news_1": {
        "title": "[Vita] Les sécurités du Cobra Blackfin ont sauté",
        "content": "Le Cobra Blackfin en 2016 a fait parlé beaucoup de lui, grâce à ce dongle il était possible de simuler une cartouche de jeu PlayStation Vita, afin un émulateur et un système peer2peer de rendre accessible une bibliothèque de backups. Il était livré avec un cardemu et btdongle permettant d'utiliser une carte microsd sur laquelle était logés les jeux temporairement.\n \nUn système complexe qui vient d'être soumis au reverse engineering de Silica and Pina (qui se fait appeler Silica ou LiEnbyy désormais), et qui nous informe sur Twitter/X avoir réussi à faire sauter les sécurités de l'authentification.\n \n \n\n \n \nC'est sur le firmware 3.60 que cela se passe, il a ainsi publié les clés du Cobra Blackfin. Ainsi il annonce avoir rétabli le fonctionnement du Cobra Blackfin sur les firmwares 3.60 et supérieur et ainsi de pouvoir s'en servir. Il y avait une raison technique de faire cela, il avait besoin de son enregistreur de paquets cmd56 qui ne fonctionnait pas, mais maintenant il fonctionne.\n \n \n \n\n \n \nPour le fun, il a nommé son script PythonWhiteFin.\n \nTéléchargement : PythonWhiteFin\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185459/in-vita-les-securites-du-cobra-blackfin-ont-saute-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1185459/in-vita-les-securites-du-cobra-blackfin-ont-saute-2.jpg"
        }
    },
    "news_2": {
        "title": "[PS5] PS5 Xplorer v1.0 disponible",
        "content": "La toute première version officielle de PS5 Xplorer vient de débarquer sur PKG-Zone.com, il s'agit comme vous le savez d'un des meilleurs managers/utilitaire créé sous Unity et qui permet d'effectuer diverses opérations comme couper, copier, coller, renommer, supprimer des fichiers ou des dossiers, ou encore d'explorer le stockage de la console. \n \nAprès quelques versions tests, voilà donc que débarque la version 1.00 de PS5 Xplorer, proposé par le développeur Lapy, il tient à remercier le travail incroyable de LightningMods et de Zecoxao.\n \n \n\n \n \n \nS'agissant de la toute première version, il ne faut pas s'attendre à toutes les options présentes dans PS4 Xplorer, mais vous pouvez utiliser les fichiers de traductions de PS4 Xplorer 2.0. A noter qu'il faut disposer au moins d'etaHEN 1.4 minimum (ou plus récent).\n \nTéléchargement : PS5 Xplorer v1.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185457/in-ps5-ps5-xplorer-v10-disponible-1.jpg"
        }
    },
    "news_3": {
        "title": "[Switch] Le Mig Dumper présenté par la team Mig Switch",
        "content": "La team Mig Switch (NDLR : ce nom n'a rien d'officiel) vient de publier un nouveau message sur son site officiel https://migswitch.com/ . Ce dernier concerne le Mig Dumper, l'accessoire qui viendra en plus du Mig Switch.  \n \n \n \n \n\n \n \n \nLa Team s'exprime : \n \n \nNous recevons beaucoup de demandes concernant la disponibilité de notre deuxième produit : le Mig Dumper. Mig Dumper est le compagnon idéal de votre Mig Switch. Bien qu'il ne soit pas nécessaire d'utiliser votre Mig Switch, c'est le moyen le plus pratique et le plus élégant de sauvegarder vos jeux.\n \nNous prévoyons d'expédier les premières unités de Mig Dumper à la fin du mois de février 2024, et il sera disponible au même prix que le Mig Switch. Un câble USB-A vers USB-C sera inclus.\n \nLa raison de ce retard est que, sur le marché actuel, de nombreux circuits intégrés (\"puces\") souffrent d'une pénurie à des degrés divers. Mig Switch et Mig Dumper partagent certains composants clés. Et avec ces circuits intégrés en pénurie sévère, nous avons décidé de donner la priorité au Mig Switch, puisqu'il est le plus demandé et aussi le produit dont vous ne pouvez pas vous passer.\n \nMais nous promettons de livrer Mig Dumper peu de temps après, avec le même niveau de qualité que le Mig Switch.\n \nMerci à tous pour votre patience et votre soutien !\n \n \n \nComme nous pouvons le voir, si vous voulez disposer des deux accessoires, il faudra débourser pas moins de 130 euros. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185450/in-switch-le-mig-dumper-presente-par-la-team-mig-switch-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] Itemzflow v1.05 disponible",
        "content": "La mise à jour d'etaHEN s'accompagne de celle d'Itemzflow, le manager de jeux PS4 et PS5 a lui aussi été mis à jour en v1.05, de quoi là encore en contenter plus d'un. \n \nLa mise à jour apporte des corrections, certaines nouvelles options comme la possibilité d'ajouter une option pour scanner les applications ou encore de supprimer une base de données corrompue. \n \n \n\n \n \nChangelog 1.05 : \n \n- Correction d'un problème qui faisait que le premier lancement d'un jeu prenait un certain temps.\n- Correction de Copier/Déplacer/Supprimer pour certaines applications avec une profondeur de dossier supérieure à 7\n- Ajout d'une option pour scanner les applications\n- Ajout de la possibilité pour l'application de supprimer une base de données corrompue\n- Ajout d'une icône de disque PS5 pour les jeux PS5\n- Correction d'un problème qui provoquait des bégaiements lors de l'utilisation de thèmes\n- Ajout du temps écoulé pour les opérations de déplacement et de copie\n- Vous pouvez maintenant simplement mettre l'IP pour les options NFS si vous êtes sous Windows et que vous utilisez l'emplacement par défaut /.\n- Correction d'un problème qui ne détectait pas toujours si vous essayiez de copier dans le même dossier.\n- Correction de l'icône du disque qui ne s'affiche pas\n \n \nTéléchargement : Itemzflow v1.05\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185449/in-ps5-itemzflow-v105-disponible-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS5] etaHEN v1.4b avec support firmware 4.00 et 4.02",
        "content": "La nouvelle version d'etaHEN est désormais proposée en v1.4b et apporte officiellement le support des firmwares 4.00 et 4.02. Comme vous le savez le plugin est tout simplement similaire à GoldHEN sur PlayStation 4 de SiStr0, il intègre plusieurs fonctionnalités, notamment un serveur FTP, un serveur klog, PS5-kstuff.\n \nAu delà des supports des deux firmwares les nouveautés sont nombreuses ! \n \n \n \n\n \n \netaHEN 1.4b changelog :\n \n- L'application Xplorer de Lapy a été inscrite sur la liste blanche.\n- Correction du dumping des trophées des jeux PS5\n- Correction de la configuration complète qui n'est pas écrite lors de la création\n- Ajout d'un paramètre Testkit (testkit kstuff)\n- Ajout d'une détection pour sortir du mode repos\n- Ajout du support pour les firmwares versions 4.00 et 4.02\n- Affichage de la notification de configuration après l'info etaHEN\n- Correction de certaines notifications pour afficher le WM de etaHEN et non celui d'itemzflow\n- Ajout de l'option Discord RPC par\n- Vérification des paramètres FTP lors du redémarrage des serveurs\n- Le nom du Daemon a été changé en etaHEN\n- Le journal des pannes se trouve maintenant dans /data/etaHEN/etaHEN_crash.log\n- Ajout de la commande IPC delete dir\n- Évite un blocage dans check_addr_change\n- Les correctifs ShellUI seront appliqués après la sortie du mode repos.\n- Le serveur de commande vérifie maintenant l'état du mode repos\n- Mise à jour des codes de triche par le développeur Illusion\n \n \nTéléchargement : etaHEN 1.4b\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185448/in-ps5-etahen-v14b-avec-support-firmware-400-et-402-1.png"
        }
    },
    "news_6": {
        "title": "[PS4/PS5] Plus fort que theflow0, il touche 50 000 $ au bounty program",
        "content": "Alors là, il s'agit de la plus importante prime jamais versée au bounty program PlayStation, le développeur aapo vient de remporter pas moins de 50 000 $. Comme d'habitude l'information a été rapportée par le site Hackerone.com.\n \n \n\n \n \nBien que l'exploit n'est pas dévoilé, nous ne savons pas de quoi il s'agit exactement, sachant que ce genre de gain n'est parfois même jamais révélé, ce sont des accords entre le développeur et la firme en question. \n \n \n \n\n \n \n \nEnsuite ce que nous pouvons regarder c'est l'historique du développeur, aapo, qui n'a sauf erreur jamais été impliqué dans le hack console, ou de très loin avec quelques primes Epic Games, Nord Security et il semble spécialisé dans le TLS, peut être a-t-il trouvé une faille importante dans ce domaine dans l'éco-système PlayStation. \n \nDifficile d'apporter plus de précision sur cette prime, difficile de dire si un jour elle sera dévoilée à un large public, donc exploitable sur PS4 ou PS5. \n \nTout est là : hackerone.com\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185333/in-ps4ps5-plus-fort-que-theflow0-il-touche-50-000-au-bounty-program-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1185333/in-ps4ps5-plus-fort-que-theflow0-il-touche-50-000-au-bounty-program-2.png"
        }
    },
    "news_7": {
        "title": "[PS5] L'injection de fichier ELF possible grâce à PS5Debug",
        "content": "Le développeur Kameleon dévoile une application qui vous permet d'injecter sus PS5 un fichier ELF dans un processus de jeu avec l'appui de PS5Debug. \n \n \n\n \n \nPour rappel, PS5Debug est un payload qui permet l'exécution d'un débogueur, et offre donc plusieurs fonctions telles que les points d'arrêt software, les points d'arrêt hardware, la pause, l'arrêt, la lecture et l'écriture de la mémoire, et permet donc d'introduire des fichiers ELF dans un process de jeu.\n \n \n \n \n \n \nLes exemples d'injection se trouve ici : PS5Debug_Elf_Injection\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185323/in-ps5-linjection-de-fichier-elf-possible-grace-a-ps5debug-1.png"
        }
    },
    "news_8": {
        "title": "[Switch] La team Yuzu vous souhaite une bonne année 2024",
        "content": "L'équipe en charge du développement de l'émulateur Switch Yuzu propose son premier rapport de 2024 avec à l'appui des progrès significatif sur la restitution GPY, des évolutions importantes sur le portage Android et d'autres correctifs toujours intéressants à connaitre. La Team nous parle aussi de son projet Leviathan. \n \nLa Team commence avec un article important sur Vulcan et la spécification SPIR-V, et elle détaille que l'arrivée du pilote 540 en Septembre s'est accompagnée de bugs, des problèmes de cache qui n'existaient pas avec les 536/537.\n \n \n\n \n \nSous Android, désormais, la présentation asynchrone est sûre à utiliser, cette version améliore les temps d'image, réduit la latence d'entrée et une solide victoire pour tout le monde.\n \nIdem pour OpenGL, les améliorations sont nombreuses, l'API optimisée par Epicboy est plus précise, des correctifs ont été mis en place, et certains effets de particules ont été corrigés. \n \nDes optimisations pour économiser de la RAM et accélérer les chargements de jeux ont été pousés, ainsi que pour restituer de la 4K. Des régressions ont été introduites avec la version Android, elles ont été corrigées. \n \n \n\n \n\n \n \nDe nombreuses modifications de l'interface utilisateur ont également été opérées, la sélection de langues a été corrigée, ainsi que d'autres évolutions liées à Linux. \n \nLes mises à jour de certains pilotes spécifiques comme ceux de nVidia, Intel, Qualcomm ont demandé des paramétrages pointus à l'équipe Yuzu pour profiter des dernières évolutions, à noter qu'Intel est vraiment le parent pauvre, aucun mot sur le correctif pour le crash des shaders de géométrie que l'équipe a signalé en octobre.\n \nL'article fort intéressant se trouve ici : yuzu-emu.org  \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185287/in-switch-la-team-yuzu-vous-souhaite-une-bonne-annee-2024-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1185287/in-switch-la-team-yuzu-vous-souhaite-une-bonne-annee-2024-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1185287/in-switch-la-team-yuzu-vous-souhaite-une-bonne-annee-2024-3.png"
        }
    },
    "news_9": {
        "title": "[PS4] Icon Mask 1.14 disponible",
        "content": "La version 1.14 d'Icon Mask vient d'être proposée par Lapy, comme vous le savez Icon Mask  permet de modifier l'apparence des icônes sur le dashboard de la PlayStation 4.\n \nIcon Mask est en effet une application Homebrew pour PS4 qui vous permet de modifier l'apparence de vos icônes, en leur appliquant un simple masque PNG. Cela vous permet de modifier la transparence, d'ajouter des bordures, d'afficher vos icônes dans une icône officielle \"PS4 box\".\n \n \n\n \n \nAvec cette version 1.14, ce sont 6 nouveaux masques qui ont été intégrés : \n \n- Ajout de 6 nouveaux masques Anubis_Qz \n- Une refonte complète de l'interface utilisateur par lui  .\n- Nouveau système de favoris\n \nPar défaut, seuls les nouveaux masques sont affichés. Appuyez sur le carré pour les afficher tous et ajoutez ou supprimez ceux que vous souhaitez des Favoris avec un triangle.\n \n \nTéléchargement : Icon Mask 1.14\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185275/in-ps4-icon-mask-114-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[Vita] SoulCalibur Vita v1.0 déjà disponible",
        "content": "Il n'aura pas fallu attendre bien longtemps, voilà déjà que débarque SoulCalibur sur PlayStation Vita et PlayStation TV. \n \nComme toujours c'est au génial développeur Rinnegatamante à qui nous devons ce portage de jeu mobile. C'est la version 1.0.15 du jeu qui a été travaillée, tout n'est pas parfait, certaines scènes font chuter le framerate comme le combat final en mode arcade avec Inferno, ou encore Water Labyrinth, et la château de Takamatsu ou Money Pit ont des arrières plans simplifiés afin de réduire les pertes d'images. \n \n \n\n \n\n \n\n \n \nLorsque vous lancez le jeu pour la première fois, il est recommandé d'aller dans les options et de baisser les volumes des BGM et des SE à 8 ou moins. Si vous ne le faites pas, les SFX risquent de s'interrompre en raison d'un volume trop élevé.\n \nLes étapes qui ne sont pas déverrouillables dans la version Android en raison de l'absence du mode Mission Battle ont été restaurées et seront disponibles dès le début, y compris les étapes alternatives.\n \n \nTéléchargement et instructions ici : soulcalibur_vita\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185273/in-vita-soulcalibur-vita-v10-deja-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1185273/in-vita-soulcalibur-vita-v10-deja-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1185273/in-vita-soulcalibur-vita-v10-deja-disponible-3.jpg"
        }
    },
    "news_11": {
        "title": "[XO] Le projet Xbox HDMI renommé OpenXHD avance à grand pas",
        "content": "La communauté Xbox vient de trouver un nouveau nom de ce qui sera l'un des projets ambitieux sur la Xbox, un projet en développement depuis 4 ans, et basé sur le travail original de Ryzee119.\n \nCe projet est un fork initial de XboxHDMI, et est actuellement en cours de modification pour supprimer l'utilisation de la marque Microsoft \"Xbox\" dans le nom du projet, et pour un nettoyage du code.\n \nQuelques captures HDMI réalisées à partir de cette carte sont disponibles ici : https://imgur.com/a/OkmB1Vs\n \nOpenXHD est un prototype de carte HDMI 100% numérique pour Xbox Original. Il se branche sur le bus pixel du GPU avant qu'il n'entre dans l'encodeur vidéo analogique et le convertit en un signal compatible HDMI.\n \nL'audio numérique SPDIF est prélevé sur la carte mère de la Xbox et est également encodé dans le signal HDMI pour obtenir la meilleure qualité audio possible.\n \nIl s'agit d'une carte prototype qui devrait fonctionner sur toutes les révisions de la Xbox, mais il faudrait concevoir un nouveau flexible pour accueillir les cartes mères v1.6 avec un encodeur Xcalibur.\n \nLe 480i ne fonctionne pas de manière fiable, il est conseillé de forcer l'utilisation du 480p avec un bios. Les modes vidéo du kernel de la Xbox ne sont pas compatibles avec la signalisation HDMI (v/hsync, porch delays, etc.).\n \n \n \n \n\n \n \n\n \n \nLe développeur Harcroft informe qu'il vient de finir de modifier le PCB principal et une première ébauche pour un PCB flexible. Il commandera bientôt des échantillons de chacun pour tester l’ajustement. Le chemin est long mais il pourrait enfin se finir en 2024. \n \n \nTout est là : OpenXHD\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185225/in-xo-le-projet-xbox-hdmi-renomme-openxhd-avance-a-grand-pas-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1185225/in-xo-le-projet-xbox-hdmi-renomme-openxhd-avance-a-grand-pas-1.png"
        }
    },
    "news_12": {
        "title": "[PS5] De nouveaux dumps proposés par BedroZen et par la Team Duplex",
        "content": "Les dumps PS5 continuent de couler comme neige au soleil, expression bien choisie par ce temps glacial actuel qui marque l'arrivée de l'hiver de façon un peu brutale. \n \n \n\n \n \nAprès nous avoir surpris à proposer les dumps de The King of Fighters XV, Returnal ou encore Sifu, Bredozen propose maintenant ceux de :\n \n- Dirt 5  \n- Sniper Ghost Warrior Contracts 2\n \nNotre ami sunriseur Markus95 quand à lui propose la démo de Matrix, nommée The Matrix Awakens, tandis que la fine équipe Duplex propose encore de nouveaux titres. :\n \n- Maneater.PS5-DUPLEX\n-  Aliens.Fireteam.Elite.PS5-DUPLEX\n-  The.Dark.Pictures.Anthology.House.of.Ashes.PS5-DUPLEX\n \n \n \n\n \n \n \nBref, vous l'aurez compris la scène PS5 entre en fusion, et commence à proposer des releases quotidiennement. \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185202/in-ps5-de-nouveaux-dumps-proposes-par-bedrozen-et-par-la-team-duplex-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1185202/in-ps5-de-nouveaux-dumps-proposes-par-bedrozen-et-par-la-team-duplex-2.png"
        }
    },
    "news_13": {
        "title": "[PS4] PS4Shortcuts v3.0 disponible",
        "content": "Le développeur Master-s dévoile déjà la v3.0 de PS4Shortcuts, il a fait largement évoluer son logiciel en quelques jours, passant de la v1.0, à la v2.0 il y a 3 jours et aujourd'hui la v3.0.\n \n \n\n \n \nSon utilitaire PS4Shortcuts est un outil qui va vous permettre de créer et d'ajouter des raccourcis, mais également de modifier le fichier App.db sur votre PlayStation 4 jailbreakée. Pour information, le fichier App.db est une base de données détaillées de toutes les applications et jeux installés sur votre console. Avec PS4Shortscuts vous allez pouvoir personnaliser selon votre bon vouloir votre XMB en retirant par exemple certaines icônes, ou certaines applications comme News, PS Store, Playroom, en les masquant. \n \n \n \n\n \n \n \nLa version 2.0 a apporté l'ajout de l'app exploit host, la v3.0 ajoute notamment une gestion de thème, et un numéro a été ajouté au nom du fichier tbl_appbrowse_ comme la vidéo l'explique bien, à chaque construction de fichier un numéro est automatiquement ajouté.\n \n \n\n \n \n \nTéléchargement : PS4Shortcuts v3.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185193/in-ps4-ps4shortcuts-v30-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1185193/in-ps4-ps4shortcuts-v30-disponible-2.png"
        }
    },
    "news_14": {
        "title": "[PS5] PS Mac Tools v2 disponible",
        "content": "La nouvelle mise à jour v2 de PS Mac Tools v2 a débarqué, cette nouvelle mouture ajoute des actions de menu de bibliothèque (Copier vers, Rechercher des mises à jour, Ouvrir le dossier, Parcourir les ressources), un outil make_fself et le téléchargeur de patchs de jeux PS5.\n \n \n\n \n \nIl prend également en charge les téléchargements simultanés mais affiche la progression directement dans la liste de téléchargement. Ce changement est également prévu pour la build Windows où chaque téléchargement s'ouvre dans une fenêtre séparée.\n \n \n \n\n \n \n \nNouveautés dans PS Mac Tools v2 :\n \nActions du menu contextuel de la bibliothèque de jeux PS5\n- Copier le jeu dans ...\n- Jouer la bande son\n- Vérifier les mises à jour\n- Ouvrir un dossier\n- Parcourir les ressources du jeu\n \nMise à jour des payloads pour PS5\n- Ajout du dernier dumpgame.bin\n- etaHEN v1.3B\n- Ajout de la dernière version de kstuff\n- \"ffplay\" est maintenant inclus en tant que binaire universel\n- GUI make_fSELF pour PS5\n \nNavigateur d'actifs/d'assets de jeux PS5\n- Parcourt rapidement les fichiers d'actifs du jeu sélectionné\nJoue ou affiche (actuellement) les fichiers .mp4, .png, .jpg, .jpeg\nTéléchargeur de patchs/correctifs pour les jeux PS5\n- Recherche les correctifs des jeux PS5 sur prosperopatches et les télécharge dans PS Mac Tools\n- Prend en charge les téléchargements simultanés\n- Actuellement NE supporte pas le téléchargement du _sc.pkg à cause de l'erreur de certificat qui n'est pas si facile à contourner dans WebKit.\n- Correction : Utilise maintenant le chemin Homebrew correct en fonction de l'architecture du processeur.\n- Correction : PKG Merger affiche maintenant le bon message de succès.\n- Correction : Suppression des vues inutilisées\n \n \nTéléchargement : PS Mac Tools v2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185175/in-ps5-ps-mac-tools-v2-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[Switch] Le Mig Switch ne permettra pas de jouer online et de nouvelles précommandes",
        "content": "La Team Mig Switch vient de mettre en ligne un nouvel article sur leur site officiel mettant en garde sur l'utilisation du Mig Switch sur les jeux en ligne. Bien entendu et comme nous pouvions nous en douter, la Team explique que le Mig Switch est un périphérique de sauvegarde et de développement. En tant que tel, nous prenons en charge et garantissons votre jeu uniquement avec vos propres sauvegardes de jeux.\n \n \n\n \n \nSi vous souhaitez jouer en ligne avec la garantie complète du Mig Switch, vous devez utiliser vos propres sauvegardes avec un véritable certificat, UID et ID de jeu, sinon bien entendu vous vous exposez à un risque de ban immédiat du service en ligne, et de votre console. \n \nL'article se trouve ici sur le site officiel : https://migswitch.com/\n \n \n\n \n\n \n \nConcernant le prix de la bête, il est confirmé pour une soixante d'euros par unité sur de nombreux sites de précommandes, pour certains revendeurs les premiers stocks devraient arriver fin Janvier, voir début Février et la production de masse aura lieu en Mars. \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185102/in-switch-le-mig-switch-ne-permettra-pas-de-jouer-online-et-de-nouvelles-precommandes-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1185102/in-switch-le-mig-switch-ne-permettra-pas-de-jouer-online-et-de-nouvelles-precommandes-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1185102/in-switch-le-mig-switch-ne-permettra-pas-de-jouer-online-et-de-nouvelles-precommandes-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1185102/in-switch-le-mig-switch-ne-permettra-pas-de-jouer-online-et-de-nouvelles-precommandes-3.png"
        }
    },
    "news_16": {
        "title": "[Vita] La PS Vita toujours là en 2024 : ONEMenu 3.20 et Soulcalibur arrive",
        "content": "La communauté PlayStation Vita est toujours très active malgré le temps qui passe, au départ la console a eu du mal à se faire une place, mais les divers hacks ont permis quand même de pouvoir proposer quelques pépites, et en 2024 cela continuera, c'est déjà ce qu'a annoncé Rinnegatamante qui ne lâche pas ce qui reste pour l'instant la dernière console portable de Sony. \n \nONElua continue de croire à la PlayStation Vita puisqu'une mise à jour de ONEMenu-for-PSVita vient d'être proposée avec la v3.20. Bien entendu les changements sont plutôt cosmétiques, dans le sens où l'évolution ne porte que sur la détection des jeux PSP et PS1 lors du rechargement de contenu, mais cela marque le fait que le développement est toujours en cours. \n \n \n\n \n \nChangelog 3.20 :\n \n- Ajout de la détection des jeux PSP et PS1 lors du rechargement du contenu.\n \nTéléchargement : ONEMenu-for-PSVita 3.20\n \n \n \n \nAutre point intéressant, comme nous vous le disions le développeur Rinnegatamante a mis en ligne une vidéo du portage en cours de la version mobile de Soulcalibur sur PlayStation Vita. Il s'agit de la version Android proposée avec l'appui de gl33ntwine pour le travail sur sa réimplémentation de sous-système Android qui complète le loader de TheFloW.\n \n \n\n \n \nIl reste encore à optimiser certains temps de chargement, mais le résultat est là et plutôt fluide, comme quoi la PlayStation Vita a encore de beaux restes, et des nouveautés à fournir en 2024. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185094/in-vita-la-ps-vita-toujours-la-en-2024-onemenu-320-et-soulcalibur-arrive-1.png"
        }
    },
    "news_17": {
        "title": "[PS4/PS5] Le Host Exploit d'Al Azif est disponible en v0.5.0 pour la PS5",
        "content": "Le tout premier et l'un des meilleurs host d'exploit, nommé simplement Host Exploit, et proposé par Al Azif vient d'être mis à jour. A l'origine il a été proposé par le développeur Al Azif pour la PS4 afin de protéger les utilisateurs de l'exploit des mises à jour proposées par les serveurs de Sony. Ce host est devenu au fil des mois un incontournable, de part les DNS utilisés qui étaient d'une stabilité remarquable. \n \nIl y a quelques semaines, ces DNS ont été perdus par Al Azif car ils ont été réaffectés par l'hébergeur, ce qui a fait bondir et rebondir le développeur, proposant ainsi une mise à jour pour la PS5, le Host Exploit fonctionnant pour la PS4, mais aussi pour la Wii, la Switch, et même la PlayStation Vita. \n \nLancé en 2018, le développeur a arrêté son développement en 2019, il y a donc 5 années que Host Exploit n'avait pas été officiellement mis à jour, bien que des versions alternatives ont été proposés sur les réseaux bien renseignés. \n \n \n\n \n \nChangelog v0.5.0 : \n \n- \"PS5 Ready\" Exploit Host\n- N'inclut PAS les fichiers d'exploitation. Il suffit de les mettre dans le bon répertoire pour les héberger. ex. /exploits/PS5/ELF-Loader/\n- Merci à djbobo et hoppers pour avoir testé la prise en charge de la PS5.\n \n \nTéléchargement : ps4-exploit-host 0.5.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185093/in-ps4ps5-le-host-exploit-dal-azif-est-disponible-en-v050-pour-la-ps5-1.png"
        }
    },
    "news_18": {
        "title": "[Multi] mGBA 0.10.3 disponible",
        "content": "Le développeur endrift vient de publier la première version de 2024 de son émulateur multiplateforme mBGA, la grande bibliothèque de la GameBoy Advance, mGBA permet pour rappel d'émuler une Game Boy, Game Boy Advance ou Game Boy Color sous PC, 3DS, Nintendo Wii, PlayStation Vita, et Nintendo Switch. \n \n \n\n \n \n \nLes changements apportés sont nombreux, passant de corrections de divers bugs, à l'amélioration du multijoueurs, mais aussi sur la partie sonore de l'émulation.\n\n \nEmulation fixes:\n \nARM: Remove obsolete force-alignment in bx pc  \nARM: Fake bpkt instruction should take no cycles \nGB Audio: Fix channels 1/2 staying muted if restarted after long silence\nGB Audio: Fix channel 1 restarting if sweep applies after stop \nGB Audio: Fix restarting envelope when writing to register \nGB Audio: Improve “zombie mode” emulation in CGB mode \nGB I/O: Read back proper SVBK value after writing 0 \nGB SIO: Disabling SIO should cancel pending transfers \nGBA Audio: Fix sample timing drifting when changing sample interval\nGBA Audio: Fix initial channel 3 wave RAM \nGBA Audio: Fix sample position issues when rate changes \nGBA GPIO: Fix tilt scale and orientation\nGBA BIOS: Fix clobbering registers with word-sized CpuSet\nGBA SIO: Fix normal mode SI/SO semantics \n \nOther fixes:\nGB: Fix applying a patch that changes the cartridge mapper \nGBA Savedata: Fix crash when resizing flash save games for RTC data\nmGUI: Fix cases where an older save state screenshot would be shown\nQt: Re-enable sync for multiplayer windows that aren’t connected \nQt: Fix mute settings not being loaded on setting screen \nQt: Fix screen freezing on macOS after closing save state window \nVita: Fix camera setting not appearing \n \nMisc:\nmGUI: Persist fast forwarding after closing menu \nQt: Add exporting of SAV + RTC saves from Save Converter to strip RTC data\nVFS: Use anonymousMemoryMap for large 7z allocations\n \n \n\n \n\n \nTéléchargement : mGBA 0.10.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185088/in-multi-mgba-0103-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] Lapy permet le téléchargement des premières versions tests de PS5 Xplorer",
        "content": "Le développeur Lapy vient de mettre en ligne les premières versions tests de PS5 Xplorer, après une première version, il dévoile déjà la seconde, bien entendu n'attendez pas l'ensemble des fonctionnalités offertes par la version PS4, ni même son niveau de stabilité, mais cette version fait déjà le job. \n \n \nPS5 Xplorer est une application qui permet d'effectuer diverses opérations comme couper, copier, coller, renommer, supprimer des fichiers ou des dossiers, ou encore d'explorer le stockage de la console PS5. \n \n \n\n \n \nCependant pour le moment la version proposée est disponible uniquement en mode sandbox avec un accès sécurisé et limité aux dossiers PS5 pour éviter tout dommage. \n \nIl est possible de créer des dossiers, de les copier, de les déplacer et de supprimer des fichiers, un accès intégral sera mis en place lorsque tout sera stabilisé. A l'avenir PS5 Xplorer prendra en charge l'installation directe de PKG, et probablement d'autres fonctions liées à l'application et à l'accès à certaines zones, pour l'heure il ne s'agit que d'une version de test à manier avec précautions. \n \n \n \n\n \n \n \n \nTéléchargement : PS5-Xplorer TEST 2.pkg (55.9 Mo)\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185087/in-ps5-lapy-permet-le-telechargement-des-premieres-versions-tests-de-ps5-xplorer-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] PS5-Xplorer v1.00 en préparation par Lapy",
        "content": "Le développeur Lapy est en train de tester la version PS5 de PS4-Xplorer, ou plutôt si vous préférez il annonce l'arrivée prochaine de PS5-Xplorer. \n \n \nPS4 Xplorer est une application créée sous Unity et qui permet d'effectuer diverses opérations comme couper, copier, coller, renommer, supprimer des fichiers ou des dossiers, ou encore d'explorer le stockage de la console PS4, une adaptation PS5 est donc une bonne nouvelle. \n \nZecoxao a demandé à pouvoir explorer facilement les Debug Settings du firmware 4.02 sous PS5, le développeur Lapy a partagé une image montrant l'existence de PS5-Xplorer v1.00 et pesant quelques 64.81 MB. \n \n \n\n \n \nNous espérons que PS5-Xplorer proposera les mêmes options que PS4-Xplorer, à savoir l'accès root, le mode sandbox, la possibilité de bénéficier d'options avancées comme le copier, couper, coller, renommer, supprimer, la création de nouveaux fichiers, l'affichage de la température, la création de raccourcis, la possibilité d'installer des PKG en interne ou en externe, et bien plus encore. \n \n \n \n\nComme toujours Lapy est limité par ses possibilités d'upload, espérons que tout ceci permette rapidement l'arrivée de PS5-Xplorer dans sa version définitive. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185029/in-ps5-ps5-xplorer-v100-en-preparation-par-lapy-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1185029/in-ps5-ps5-xplorer-v100-en-preparation-par-lapy-2.jpg"
        }
    }
}