{
    "news_1": {
        "title": "[PS3] IrisMan et webMAN Mod déjà prêts pour les CFW 4.91",
        "content": "Le développeur Aldo Vargas a déjà réagit à l'arrivée du nouveau firmware de Sony sur PS3 puisqu'il prépare déjà les CFW avec la sortie de la mise à jour de son plugin webMAN Mod pour les CFW 4.91.\n \nwebMAN Mid 1.47.45 a été mis à jour pour apporter le support des CFW 4.91 quand ils seront proposés. \n \nTéléchargement : webMAN Mod\n \n \n \n\n \n \n \n \nIl a profité pour mettre à jour irisMAN lui aussi pour supporter les CFW 4.91, cette mise à jour intègre autant le support des CFW hybrides, la mise à jour Mamba, et la version 7.02 de Movian M7.\n \nTéléchargement : IrisMan 4.91\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1878325690.jpg"
        }
    },
    "news_2": {
        "title": "[PS3] Sony sort le firmware 4.91 pour la PS3",
        "content": "A la surprise générale, Sony vient de mettre en ligne un nouveau firmware pour la PlayStation 3, qui n'a rien demandé, et qui se retrouve une nouvelle fois être mise à jour. \n \nLe firmware 4.91 n'apporte rien de spécial, si ce n'est la mise à jour des clés blu-ray comme d'habitude. \n \n \n \n \n\n \n \n \n \nMise à jour 4.91 du logiciel système PS3\n \nUne mise à jour du logiciel système PS3™ est disponible depuis le 27 février 2024.\n \nPour télécharger la mise à jour, vous devez disposer d'au moins 200 Mo d'espace libre sur le disque dur de votre PS3 (mise à jour système) ou sur un support de stockage amovible (mise à jour PC). \n \nVous devez toujours installer la version la plus récente du logiciel système sur votre système PS3. La mise à jour permet de bénéficier de fonctionnalités supplémentaires, d'une meilleure ergonomie et d'une sécurité renforcée.\n \nRemarque : pour lire des disques Blu-ray, votre système PS3 a besoin d'une nouvelle clé de chiffrement pour le lecteur Blu-ray. Pour renouveler la clé de chiffrement du lecteur Blu-ray, installez la dernière version du logiciel système PS3.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187255/in-ps3-sony-sort-le-firmware-491-pour-la-ps3-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS5] Le HB Store lui aussi a été mis à jour",
        "content": "Le développeur LightningMods a également mis à jour le PS5 HB Store, pour rappel la particularité de ce store est qu'il a été construit en GLES2.\n \n \n\n \n \nL'application a été mise à jour :\n \n- Ajout d'une option pour utiliser les tâches de fond natives de la PS5 (la progression sera affichée dans le menu d'accueil et non dans l'application)\n- Correction d'un problème qui entraînait un décalage de l'application Store s'il y avait moins de 15 articles/PKG.\n- Correction d'un problème qui empêchait la mise à jour fréquente des boutons de la boutique.\n- La section Mises à jour et le compteur de téléchargements in-app continueront d'être désactivés jusqu'à la prochaine mise à jour du site web/backend\n- Diverses corrections de bugs\n \nComme toujours, l'application Store se met à jour automatiquement. Pour obtenir cette nouvelle mise à jour, il suffit de fermer (si elle est déjà ouverte) et de rouvrir l'application Store pour qu'elle se mette à jour. Si vous n'avez pas encore l'application PS5 HB Store, téléchargez-la ici : https://pkg-zone.com/Store-R2-PS5.pkg\n \nPour ceux qui utilisent un CDN local, vous pouvez trouver les fichiers de mise à jour du PS5 Store ici : https://github.com/LightningMods/PS4-Store/releases/tag/4.5\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187196/in-ps5-le-hb-store-lui-aussi-a-ete-mis-a-jour-1.jpg"
        }
    },
    "news_4": {
        "title": "[PS5] etaHEN mis à jour en version 1.7B",
        "content": "Le développeur LightningMods vient de mettre à jour sa solution etaHEN en version 1.7B. Comme vous le savez il s'agit actuellement de la solution à mettre en place pour profiter de la pleine capaicté de votre PS5. Ce plugin est tout simplement similaire à GoldHEN sur PlayStation 4 de SiStr0, il intègre plusieurs fonctionnalités, notamment un serveur FTP, un serveur klog, PS5-kstuff (pour le firmware 4.03 et 4.50) ...\n \n \n\n \n\n \n \netaHEN a été mis à jour à la version 1.7B :\n \n- Ajout d'un service Direct PKG Installer (port 9090)\n- Ajout d'un paramètre pour désactiver le DPI dans /data/etaHEN/config.ini\n \nLe service DPI sera mis à jour à l'avenir pour inclure des fonctionnalités supplémentaires s'il y a suffisamment de soutien.\n \nVous pouvez télécharger la mise à jour du payload ici : etaHEN\n \nA noter que l'outil Remote Package Sender a été mis à jour : ps4-remote-pkg-sender\n \nRemerciements à modded_warfare & à d'autres pour avoir testé et rapporté à quel point cette méthode est plus rapide que les autres.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187185/in-ps5-etahen-mis-a-jour-en-version-17b-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1187185/in-ps5-etahen-mis-a-jour-en-version-17b-1.jpg"
        }
    },
    "news_5": {
        "title": "[Switch/Vita] De nouvelles version de uae4All2 disponible",
        "content": "Le développeur Rsn8887 met à jour Uae4All2 Mod, son portage de l'émulateur Amiga pour la Switch et la PSVita. Ce portage, initialement développé par Cpasjuste pour la PSVita, est désormais disponible sur les deux consoles grâce à ce Mod.\n \n \n\n \n \nChangelog :\n \nVersion 2.10\n \n- Prends en charge le lancement du fichier de configuration par argument en ligne de commande et pour la Nintendo Switch, le fordwarder de RetroArch peut être utilisé ainsi que sur la PsVita un \"générateur\" de bulles personnalisé est fourni. Il utilise la même méthode que DaedalusX.\n \nVersion 2.11 (Bugfix)\n \n- Correction d'un bug sur l'écran tactile de la Nintendo Switch.\n \nTéléchargement : https://github.com/rsn8887/uae4all2/releases\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187172/in-switchvita-de-nouvelles-version-de-uae4all2-disponible-1.jpeg"
        }
    },
    "news_6": {
        "title": "[PS4/PS5] LibHijacker 1.152 disponible",
        "content": "LibHijacker développé par Astrelsky est un outil permettant d’exécuter des applications homebrew sur les consoles PlayStation 4 et 5. Dans sa dernière version, LibHijacker peut lancer des homebrews sous forme de fichiers ELF, et potentiellement même des jeux PS5. Comme vous le savez le code source a été libéré par Astrelsky en Juin dernier, puis repris par SiSTR0, quelques patchs sont mis à jour et cette nouvelle version prend en charge l'activation des correctifs à partir du fichier de configuration et l'ajout d'un titleID supplémentaire à la liste de déverrouillage du framerate dans la version 1.152.\n \n \n\n \n \nPS4 : \n- Batman: Arkham Knight v1.15: 60 FPS\n- Bloodborne v1.09: 60 FPS by Lance McDonald : Notes: You may encounter softlock during Laurence (optional DLC boss) cinematic. Disable patch to progress.\n- Also includes: No Motion Blur / No Chromatic Aberration\n- Burnout Paradise Remastered v1.03 : Skip Logo Videos / Skip First Time Introduction Video\n- Crash Team Racing v1.21: 60 FPS\n- Dragon Age: Inquisition v1.12: 60 FPS\n- Driveclub v1.28: 60 FPS\n- Gravity Rush 2 v1.11: 60 FPS\n- The Order 1886: v1.02: 60 FPS : Notes: Softlocks will occur in Chapter 6 and 9 during Quick Time Events. Disable patch to progress.\n- The Last Guardian v1.03: 4K at 60FPS\n- The Last of Us Remastered 60 FPS + Debug Menu (v1.11)\n- The Last of Us Part 2 60 FPS + Debug Menu (v1.00 + v1.09)\n- Uncharted: The Nathan Drake Collection Debug Menu (v1.00)\n- Uncharted 4: A Thief's End 60 FPS (v1.33)\n- Uncharted: The Lost Legacy 60 FPS (v1.09)\n- Just Cause 4 v1.32: 60 FPS\n- Shadow of the Colossus: 1440p at 60FPS + Debug Menu\n- Silent Hills: P.T at 60FPS\n- Red Dead Redemption 2 v1.29: 60FPS\n- Mafia Definitive Edition v1.04: 60 FPS + Skip logo movies\n \nPS5 : \n- Demon Souls v1.00 : 60 FPS Unlock in Cinematic Mode / Debug Menu\n- Uncharted: Legacy of Thieves Collection v1.00 : Debug Menu\n \n \nPour utiliser LibHijacker, suivez ces étapes :\n- Pendant l’étape de chargement ELF, exécutez send_elf.py avec l’adresse IP de votre PS5 comme premier argument (par exemple, python ./send_elf.py 10.0.6.9).\n- Pour simplifier le développement, vous pouvez arrêter le processus daemon en utilisant kill_daemon.py, puis relancer send_elf.py pour envoyer la nouvelle version de l’exécutable du daemon (cela peut être fait en dehors de la fenêtre du navigateur web ou BDJ).\n \n \nTéléchargement : libhijacker 1.152\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187136/in-ps4ps5-libhijacker-1152-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[PS4] bzImages aéolia/belize 5.15.15 compilés en FullLTO et ThinLTO",
        "content": "Hello,\nJe propose des BzImages compatibles en interne/externe pour Ps4 fat/slim/pro aéolia / bélize\nCompilés avec une distribution manjaro linux ps4, paramétrée pour compiler avec ce type de compilation.\nLes bzImages sont déclinés en 2 versions FullLTO ou en ThinLTO\navec 4 types de led ps4 linux\nLes valeurs de benchmark vulkan (vkmark) sont plus haut sur un bzImage compilé en FullLTO\nLes bzImages compilés en ThinLTO sont plus rapides au chargement de Linux, et la distribution est plus réactive.\n-Basé sur une source kernel aeolia/belize de codedwrench\n-Rajouts de divers patchs d'améliorations pour les jeux (dont fsr)\nmore-uarches-for-kernel 5.15-5.16.patch\nprjec_v5.15-r1.patch\n0003-glitched-base.patch\n0003-glitched-base-nonrt.patch\n.patch 0009-glitched-bmq.patch\n.patch 0007-v5.15-futex_waitv.patch\n.patch 0007-v5.15-fsync1_via_futex_waitv.patch\n-Reconnaissance des périphériques au format fat32/ntfs/exfat/ext4\n-Détection manettes :\nwii\nswitch pro controller\n360 filaire\n360 sans fil + adaptateur Microsoft usb/bluetooth spécifique\nps3/ps4 en filaire et bluetooth\n-Partage de connexion internet par téléphone android ou iphone , en usb\n-Reconnaissance des périphériques audio\n-Snap et flatpak fonctionnels sur toutes distributions linux\n-Détection de la webcam ps3 et du kinect 360\n-Bluetooth fonctionnel aussi sur les PS4 ayant le MT7668\nPossibilité d'utiliser un pare-feu\nVidéo de l'apparence des leds sur une ps4 pro avec linux chargé :\n\nVideo de la compilation des bzImages en FullLTO :\n\nVideo de la compilation des bzImages en ThinLTO :\n\nreconnaissance et detection de la webcam ps3 :\nreconnaissance du kinect 360 :\nparefeu activé visible sur la distribution Fedora 39 de DFAUS\nBzImages FullLTO\nps4-linux-5.15.15-aeolia-belize_Full-LTO-LED-goldhttp://e.pc.cd/Uszy6alK\nps4-linux-5.15.15-aeolia-belize_Full-LTO-LED-lavandehttp://e.pc.cd/3ezy6alK\nps4-linux-5.15.15-aeolia-belize_Full-LTO-LED-rose-fushiahttp://e.pc.cd/NHRy6alK\nps4-linux-5.15.15-aeolia-belize_Full-LTO-LED-violettehttp://e.pc.cd/JSvotalK\nBzImages ThinLTO\nps4-linux-5.15.15-aeolia-belize_Thin-LTO-LED-goldhttp://e.pc.cd/Vnzy6alK\nps4-linux-5.15.15-aeolia-belize_Thin-LTO-LED-lavandehttp://e.pc.cd/xszy6alK\nps4-linux-5.15.15-aeolia-belize_Thin-LTO-LED-rose-fushiahttp://e.pc.cd/qpRy6alK\nps4-linux-5.15.15-aeolia-belize_Thin-LTO-LED-violettehttp://e.pc.cd/XYvotalKRemerciements :\ncodedwrench pour les sources 5.15.15 ps4 de son github\nYoshiLightStar pour les .patchs trouvés pour kernel 5.15.15\nBlackdragon pour tous les tests et les videos de l'affichage des leds\nVvSx87 pour les tests sur sa ps4 pro ayant le bluetooth MT7668\n",
        "images": {
            "image_1": "https://sayalinux.free.fr/Release_5.15.15_FullLTO_ThinLTO/reconnaissance_et_detection_webcam_ps3.jpg",
            "image_2": "https://sayalinux.free.fr/Release_5.15.15_FullLTO_ThinLTO/reconnaissance_kinect_360.jpg",
            "image_3": "https://sayalinux.free.fr/Release_5.15.15_FullLTO_ThinLTO/parefeu.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] NSPackBuilder, un programme Windows permettant de personnaliser les CFW pour Switch.",
        "content": "NSPackBuilder est un programme Windows permettant de créer des packs personnalisés.Le développeur OneEyeBlack propose une interface simple et directe afin que les utilisateurs profanes puissent formater, assembler des packs et même personnaliser les logos de démarrage.  Liste des fonctions: BaseAtmosphere: Pure CFW for use you unlock Nintendo Switch.Kefir: A complete package for Nintendo Switch.4ifir: A complete package for Nintendo Switch.Ultra: A complete package for Nintendo Switch.CNX: A complete package for Nintendo Switch.GNX: A complete package for Nintendo Switch.Hekate: is a powerful and user-friendly bootloader for the Nintendo Switch.Boot Files Files necessary to boot some packages.Fusée: is a First-stage Loader, responsible for loading and validating stage 2 (custom TrustZone) plus package2 (Kernel/FIRM sysmodules), and patching them as needed.Lockpick RCM: is a bare payload that derives encryption keys for use in Switch file handling software.Tegra Explorer: is a File Manager that run as payload.Signature Patches: is a set of files necessary for the Switch to be able to run games.Firmware: is the official Nintendo Switch system. It is necessary if you need to update your Switch system.SYSMODULESEdizon Se: Sysmodule and program that load cheats into your games.FPSLocker: Sysmodule that allows to change the FPS of the game.Misson Control: Sysmodule that allow you use bluetooth controller from other consoles.NX-Ovlloader: Sysmodule to load .OVL files on Tesla Menu.OvlSysmodule: Sysmodule that allows you to toggle sysmodules on the fly.QuickNTP: Sysmodule to update your Switch's clock using a list of public NTP servers.ReverseNx-RT: Tesla Overlay that force games to think that you are using docked or handheld mode.SaltyNX: Sysmodule required to run programs in the background.Status Monitor: Sysmodule that show CPU, GPU, Temperature and mode on screen.Switch OC Suite: Sysmodule that allow you to overclocking your Suite.Sys-clk: Sysmodule allowing you to set CPU/GPU/MEM clocks according to the running application and docked state.Sys-FTPd: Sysmodule that allow you to set and get files to your Switch over FTP.Tesla Menu: Initial overlay menu to be loaded by nx-ovlloader.Ultrahand Overlay: \"Tesla Menu enhanced\" with more feactures.Ultra Status Monitor: Enhanced sysmodule that show CPU, GPU, RAM and TEMP and more on screen.HOMEBREWSAIO Switch Updater: Homebrew app to download and update CFWs, FWs and cheat codes.CNX Updater: Homebrew app to download Firmware, games translations and mods.DBI: Homebrew app to install NSP, NSZ, XCI and XCZ files and more features.Goldleaf: File Manager homebrews app with others features.Hekate Toolbox: Homebrew that allows you to change settings of the loader.HB Menu: Program that allow the user to run the homebrews out of Applet Mode. A folder will be created \\homebrews.Linkalho: Homebrew app that will link NNID accounts offline.NX Activity Log: homebrew app that displays more precise information about your play activity.NX Dump Tool: homebrew app that create Dumps from cartriges.NXGallery: Hhomebrew app to transfer your screenshots to your phone or pc.NX Themes Installer: Homebrew app to install themes into Switch.ReverseNX-Tool: Is an tool that takes advantage of SaltyNX patches function and manages creating ReverseNX patches. Requires SaltyNX.Tinfoil: Is an store manager.FILESAtmosphere Exosphere file: A base Custom Firmware for your Nintendo Switch.Atmosphere Override file: Settings for the Atmospheresuch as change the buttons to access the Homebrews and change the buttons to start a game without cheats.Atmosphere System file: Settings for the Atmosphere such as Enable USB 3.0 and more.HB Menu Theme: Change the theme on HB Menu.Hosts file: Is a list of Nintendo's servers that atmosphere use to prevent your Switch to be banned.Hekate IPL file: Launch boot options on Hekate.Hekate Launch Icons: Icons for Hekate Launch boots.Sys FTPd file: Setting file for Sys FTPd.Tesla Config file: Change the combination buttons to access the Tesla menu.OPTIONALSCopy Pack to Drive: It will copy all downloaded files to your SD card. Identical contents on the SDcard will be replaced.Format to FAT32: Format your SDcard to Fat32 before copy all contents.Erase SDcard / Keep emuMMC: When checked, it'll keep the emuMMC folder, but all remain folder and files will be deleted.Keep MODS: Keeps the atmosphere\\contents folder.Keep DBI Saves: Keep the DBISaves folder.Keep NYX: Keep the bootloader\\nyx.ini file.Keep THEMES: Keep the THEMES folder. Alter start the Switch you'll need to apply the theme again.Release Versions: Display the most current Release Version of each item in the github repository.Keep Temp. Folder: It'll keep the \"Downloaded Files\" folder storage at you computer.Open Pack Folder: Open the folder where the Pack was created.Close After Finished: Close the program when everything is finished.BOOTLOGOAdd: Select and add a customized Bootlogo into your package.SDCARDCreate Image: Create a Image File from this drive above.Restore Image: Restore a Image File into drive above.Format now: Format now your drive to FAT32 with unit size of 64k.Téléchargement: https://codeberg.org/OneEyeBlack/NSPackBuilder",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187094/in-nspackbuilder-un-programme-windows-permettant-de-personnaliser-les-cfw-pour-switch-1.gif"
        }
    },
    "news_9": {
        "title": "[Switch] NeXT et ShallowSea retirés par Nintendo pour DMCA",
        "content": "Le géant japonais Nintendo continue de lutter contre ce qu'il estime être du piratage. De manière totalement légitime, les avocats de Nintendo se sont tournés vers Github afin de faire retirer pour DMCA les référentiels de NeXT et ShallowSea. \n \nBien entendu cela va dans la lignée de ce qui s'est produit précédemment avec par exemple Lockpick.\n \nLe développeur Vampitech, a qui l'on doit NeXT, a décidé de continuer l'aventure non plus sur Github mais sur Codeberg. L'avantage selon lui est que Codeberg n'appartient à aucune entreprise, et qu'ainsi le code serait protégé des propriétés de Nintendo. \n \nNeXT Updater continue pour l'heure de fonctionner. \n \n \n\n \n \nComme nous pouvons le voir Nintendo a récemment pris des mesures pour retirer certains outils d’émulation et de déverrouillage de consoles Switch, en invoquant le DMCA (Digital Millennium Copyright Act), ce pas moins de 80 homebrews, fork et outils qui sont dans la ligne de mire de Nintendo, les émulateurs Yuzu et Ryujinx sont aussi visés, Slyline a déjà arrêté son développement. L'élargissement et la pugnacité des avocats de Nintendo portent ses fruits. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187078/in-switch-next-et-shallowsea-retires-par-nintendo-pour-dmca-1.png"
        }
    },
    "news_10": {
        "title": "[Switch] Hekate v6.1.0 et Nyx 1.6.0 disponibles",
        "content": "Le développeur CTCaer propose une nouvelle version d'Hekate qui passe en 6.1.0 et de Nyx qui lui passe en 1.6.0. \n \n \n\n \n \n- Correction d'un problème où l'analyse de l'offset de secteur emuMMC échouait si la carte SD était plus grande que 1TB.\n- Changements L4T et ARC :\n- Permettre à la partition de démarrage d'être exFAT , cela nécessitera une mise à jour de la pile de démarrage des différentes versions de L4T. C'est surtout important pour Lakka et pour les utilisateurs qui ne veulent pas formater.\n- Des changements significatifs ont été apportés à Arachne pour l'optimisation de la mémoire vive afin d'augmenter les performances et la stabilité.\n- Plusieurs timings ont été améliorés et corrigés pour T210/LPDDR4 et T210B01/LPDDR4X.\n- La stabilité a été améliorée pour des fréquences plus élevées pour T210/LPDDR4, cela affecte également de manière significative les modules de mémoire vive à haute densité, comme dans les configurations de 8 Go.\n- De plus, ils peuvent être améliorés avec le mode ram_oc_opt ac.\n- Correction d'un problème où la réduction du timing n'était parfois pas autorisée à 1600 MHz.\n- Un nouveau paramètre ram_oc_opt= a été ajouté pour prendre en charge la configuration avancée de l'occlusion de la ram pour les T210 et T210B01.\n- Principalement pour les utilisateurs de T210/LPDDR4 à cause des basses fréquences et d'autres qui aiment optimiser (T210B01/LPDDR4X).\n- Plus d'informations dans le wiki.\n- La limite de tension maximale de ram_oc_vdd2 a été augmentée à 1237mV pour T210. T210B01 reste à la limite Jedec de 1175mV.\n- Correction d'un problème pour DDR200 sur T210 lorsque la fréquence de la RAM est oc one.\n \nChangements dans Nyx v1.6.0\n- La prise en charge du système de partition dynamique d'Android 13+ a été ajoutée et la taille de la partition système a été augmentée à 3 Go pour l'ancien système (Android 10-11).\n- Correction d'un problème où l'analyse de l'offset de secteur emuMMC échouait si la carte SD était plus grande que 1TB\n- Correction d'un problème avec certaines cartes SD affichant des informations incomplètes (par exemple ADATA)\n- Amélioration de l'information sur les fusibles (correction du majeur/minor et ajout de l'information iddq analysée)\n- Les noms de modèles des modules de RAM de 3ème génération d'Hynix et de Micron sont maintenant affichés correctement.\n- Les informations Hw afficheront désormais les informations sur la RAM par puce au lieu d'une seule puce et de 2 canaux.\n- Le calibrage automatique du joystick lors de l'initialisation a été assoupli pour corriger un problème de dérive avec les mods de joystick basés sur l'effet HAL.\n- De plus, cette correction a également été incorporée dans le mode USB de la manette de jeu Switch to PC.\n- Ajout d'un dumping de calibration 6 axes intégré pour tous les autres SKUs de la Switch et le type de stick pour la Lite pour une utilisation dans L4T.\n- Ajout d'informations sur la vitesse de bus maximale supportée par les cartes SD et consolidation de toutes les classes UHS en un seul champ.\n- Ajout d'informations sur certains clones d'écrans LCD et sur les nouvelles révisions officielles.\n- Le ventilateur est maintenant contrôlé plus finement\n \nChangements dans BDK\n- DRAM : La ram Hynix 3rd gen a été renommée avec le nom du modèle approprié.\n- DRAM : Ajout d'informations supplémentaires sur la ram Micron de 3ème génération.\n- DRAM : Ajout d'informations sur le MRR par puce.\n- HWINIT : reordered sdmmc1 power disable\n- INPUT : L'écran tactile Samsung a été renommé en TSP. BH2109 est la date de fabrication.\n- SE : ajout des fonctions se_aes_cmac_128, se_aes_crypt_hash et se_aes_iv_updated_clear.\n- ACTMON : passage à l'échantillonnage moyen\n- MINERVA : Changement du diviseur d'entrée pll pour 2200-2266 mhz et quelques autres corrections\n- UTILS : sprintf rejette maintenant les caractères terminés par NULL pour %c\n- UTILS : permet à strtol d'analyser les entiers non signés si la base est 16 et le nombre est positif\n \n \nTéléchargement : Hekate v6.1.0 et Nyx 1.6.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187051/in-switch-hekate-v610-et-nyx-160-disponibles-1.png"
        }
    },
    "news_11": {
        "title": "[Xbox] ENDGAME, nouvel exploit Xbox original sans jeux, ni DVD",
        "content": "\nUn nouvel exploit, universel, appelé \"ENDGAME\" est disponible pour la Xbox originale de Microsoft.\nCet exploit a été soigneusement conçu pour être compatible avec toutes les versions commerciales du noyau et du DashBoard publiées pour la Xbox d'origine.\n\nIl ne nécessite pas de jeu, ni même un lecteur de DVD fonctionnel, seulement une carte mémoire. \n\nLa découverte initial de l'exploit revient a @shutterbug2000 etant également le premier à démontrer l'exécution de code dans le DashBoard\n \nEt grâce à des recherches plus approfondies, ENDGAME a été développé par @gaasedelen en exploitant une vulnérabilité adjacente qui offrait un meilleur contrôle et facilitait une exploitation.\n\n\n \nPlus d'info ici : https://github.com/XboxDev/endgame-exploit\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-365714249.gif"
        }
    },
    "news_12": {
        "title": "[PS5] Des outils de création de PKG pour la PS5",
        "content": "Hier ont été dévoilé des outils de compilation de PKGs pour la PlayStation 5. Des outils pour Prospero (nom de code de la PlayStation 5) disponibles en version 1.21.0.10200 et qui seraient des outils officiels, donc probablement soumis au copyright Sony. \n \nEn plus de cela un éditeur de fichier Param pour Prospero (PlayStation 5) en version 1.21.761931406 a lui aussi était dévoilé permettant de créer des PS5 PARAM.SFO . \n \n \n\n \n \nTout cela s'apparente à ce qu'il s'était passé sur PS4 quand les outils devtools de Sony ont été dévoilé puis utilisés par la scène. \n \nLes outils sont proposés ici par DNNDHH : PS5-PKGs\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186985/in-ps5-des-outils-de-creation-de-pkg-pour-la-ps5-1.png"
        }
    },
    "news_13": {
        "title": "[Switch] Ultimate-Switch-Hack-Script 4.3.319 disponible (MAJ)",
        "content": "Cela faisait un moment que je n'avait pas posté de new sur mon Ultimate-Switch-Hack-Script qui, depuis près d'9 mois maintenant, est passé en version 4.3.318.Pour rappel, mon script permet par exemple de préparer une SD avec le contenu nécessaire au lancement d'un CFW, des homebrews, des modules et des overlays; de plus, il est possible de créer des profiles pour chaque élément se qui permet une configuration à la fois assez précise et qui peut être reproduite rapidement. Le script contient aussi de multiples fonctions permettant d'agir sur la nand (infos, dump, restauration, activation/désactivation de l'auto-rcm, montage d'une partie de la nand sur le PC grâce à Memloader...), il contient un lanceur de payload, on y trouve aussi NSC_Builder traduit en français, des outils pour flasher les différentes puces existantes, des outils de débrickage et encore bien d'autres choses, voir cette page pour voir une liste de fonctionnalités plus détaillée qui doit être elle aussi incomplète tant il y a de choses,mais le mieux reste de naviguer dans les menus du script et de voir se qu'il propose.Depuis la dernière new les évolutions sont très nombreuses, bien trop pour être notées ici. Le changement majeur de cette dernière version est la correction du gestionnaire de mise à jour qui avait des problèmes depuis que Github a arrêté le support de Subversion se qui m'a obligé à retravailler tout ça, cependant tout devrait refonctionner correctement maintenant même pour ceux ayant encore d'anciennes versions. Et comme d'habitude le support des derniers firmwares a été ajouté, les mises à jour des différents logiciels utilisés ainsi que des homebrews ont été effectuées et il y a eu des corrections de bugs et probablement d'autres choses que j'ai oublié de noter ici mais voir plus bas pour savoir comment consulter les changelogs complets.Edit: Passage en version 4.3.319, cette version corrige le sélecteur de langues et celui du thème pour qu'ils utilisent la même technique que le gestionnaire de mise à jour pour télécharger les fichiers et les dossiers dont ils peuvent avoir besoin. Je me permet de rappeler que mon script n'est qu'une aide pour le hack et même si les choses sont généralement expliquées durant l'exécution des fonctionnalités cela ne dispense pas de comprendre se que l'on fait, par exemple il y a la FAQ qui est un bon point de départ et qui contient pas mal d'informations et de liens vers différents tutoriels, ce sujet qui contient des informations sur les manipulations basiques ou encore ce sujet qui contient des infos pour les consoles équipées de puces SX Core/Lite ou Hwfly. Il y a aussi la documentation du script qui pourra parfois vous aiguiller sur les choses à faire ou sur les éléments contenus dans la préparation d'une SD, n'hésitez pas à la consulter et même à regarder les crédits qui peuvent contenir des informations intéressantes.Pour voir les évolutions de mon script en détail vous pouvez vous rendre sur cette page pour le changelog du script et sur cette page pour le changelogs des packs de CFW/homebrews/modules/overlays/cheats.La version base peut être téléchargée ici; pour la version complète vous pouvez cliquer ici mais je ne recommande pas de faire ainsi mais plutôt de passer par la version base et d'utiliser le gestionnaire de mises à jour intégré au script pour ajouter ou mettre à jour les différentes fonctionnalités car le téléchargement de la version complète ne récupère pas se qui est lié à des projets externes comme les sig_patches par exemple.Histoire de clarifier le comportement du gestionnaire de mises à jour du script je vais réexpliquer son fonctionnement, la demande intervenant en premier lieu juste après le premier message du script met seulement à jour les éléments de base du script comme les menus ou les programmes indispensables au bon fonctionnement de l'ensemble, ensuite chaque fonctionnalité est gérée indépendamment et si la mise à jour est acceptée sur une fonctionnalité, les éléments de base seront aussi mis à jour. Bon maintenant pour expliquer en pratique on va imaginer que vous utilisiez le script pour lancer des payloads et préparer une SD se qui représente deux fonctionnalités différentes, pour avoir la dernière mise à jour des deux fonctionnalités il faudra lancer chacune d'entre elle et accepter à chaque fois la mise à jour. Il y a aussi une fonction qui permet via le menu \"A propos\", de mettre à jour l'ensemble des fonctionnalités du script en même temps mais ceci peut prendre pas mal de temps car il y aura beaucoup de choses que le script devra vérifier/télécharger.Si vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.En cas de bugs, de propositions de fonctionnalités ou d’améliorations veuillez s'il vous plaît passer par le Github du projet ou bien par le sujet dédié à mon script sur le forum, de cette façon je peux traiter bien plus rapidement les informations/demandes.Enfin, vous avez cette page pour voir les nombreux crédits pour les outils utilisés dans mon script à un moment ou à un autre, comme d'habitude remercions tout ce beau monde pour leurs travaux, leurs participation au projet d'une manière ou d'une autre et également un grand merci aux quelques donateurs.",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1146702/in-switch-ultimate-switch-hack-script-43216-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[PS5] PSX 2 PS5 V1.0: Convertir vos jeux ps1 pour PS5",
        "content": "A la base prévu pour hier, voici la première version de mon script Python permettant de convertir vos jeux PS1 pour PS5.\n \nEn effet j 'annonçais ce week end que je publierai ce nouvel outil lundi, au final il débarque aujourd'hui avec un petit ajout qui explique ce petit retard.\n \n\n \nRéécrit en Python, ce petit outils va donc vous permettre de convertir vos iso PS1 afin de les lancer sur vos PS5 jailbreakéé (4.51 max).\n \nIl comprend quelques nouveautés comme les liens vers mon tweeter (icon Kaneda), mon Paypal (icon paramètre), ma vidéo tuto (logo youtube) et pour finir le plus important, les codes LibCrypt (La loupe).\n \nCe dernier lien (la loupe) pointe donc vers les codes LibCrypt qui vont vous permettre de débloquer certains jeux comme Dino Crisis ou Resident Evil 3 Nemesis (explications dans ma vidéo tuto ci dessous).\n \n\n \nLe petit ajout qui explique le retard de mon outil, est Merge_bin.bat que vous trouverez également dans le .rar de cette new. Ce petit batch vous servira à fusionner vos .bins en un seul .bin afin d'utiliser ensuite PSX 2 PS5 v1.0  mais également de créer le .toc.\n \nCe dernier fichier (.toc)  est important pour certains jeux comme Tekken, sans ce fichier votre jeu fonctionnera mais sans musique, d' où son utilité.\n \n\n \nUn petit don fais toujours plaisir et m' aide beaucoup: https://www.paypal.com/paypalme/markus00095\n \nTélécharger PSX 2 PS5 V1.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186961/in-ps5-psx-2-ps5-v10-convertir-vos-jeux-ps1-pour-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1186961/in-ps5-psx-2-ps5-v10-convertir-vos-jeux-ps1-pour-ps5-2.png"
        }
    },
    "news_15": {
        "title": "[PS5] Le PlayStation Portail a été hacké par TheFlow",
        "content": "TheFlow nous informe sur son profil X qu'il a réussi à cracker le PlayStation Portal, cet accessoire, plus qu'une console, de la PlayStation 5. \n \nIl n'a pas agit seul puisqu'il s'est aussi appuyé sur l'expérience de xyz et de ZetaTwo, qui rapporte avoir beaucoup appris auprès du dieu TheFlow, pour assurer le hack du périphérique.\n \nDévoilé il y a 3 mois, l'appareil n'aura résisté même pas un mois à TheFlow puisqu'il c'est le délai qu'il dit avoir consacré à la manoeuvre. \n \nFonctionnant autour d'une base Android, on pouvait se douter que le périphérique n'allait pas résister bien longtemps. \n \nTheFlow montre une photo d'un PlayStation Portal exécutant l'émulateur PPSSPP, le célèbre émulation de PSP. \n \n \n\n \n \nTheFlow n'a pas l'intention de dévoiler son travail, du moins pour le moment aucune date de divulgation n'est prévue, et selon lui il reste encore pas mal de travail à accomplir pour stabiliser l'ensemble.\n \nIl a rajouté que l'appareil dispose de 6 Go sur une carte SD et que Sony a implémenté un bout de code pour empêcher l'installation de APK, mais qu'il a réussi à la contourner facilement. \n \nComme on le voit, le PlayStation Portal va s'ouvrir au monde, ce qui est intéressant mais le périphérique reste encore cher et difficile à trouver car les stocks sont limités. \n \n \nTout est là : twitter.com/theflow0/\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186942/in-ps5-le-playstation-portail-a-ete-hacke-par-theflow-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS4] GameBato mis à jour en version 1.40",
        "content": "Depuis le 21 Janvier 2024, arrivée de la version payante de GameBato, il y a très peu de mises à jour de l'outil, un peu comme si la disponibilité de la version payante avait cannibalisée le fait d'enrichir les options ou la stabilité de l'utilitaire. \n \nEn un mois, peu de proposition ont été faite, et la mise à jour 1.40 n'apporte pas grand chose comme nouveautés, un changelog en demi-teinte. \n \n \n\n \n \nChangelog 1.40 : \n \n- GameBaTo Navigator : Les utilisateurs peuvent désormais lire des médias, des bandes-annonces et des gameplays à partir de l'application.\n- Correction de quelques problèmes mineurs\n \n \nTéléchargement : GameBato 1.40\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186904/in-ps4-gamebato-mis-a-jour-en-version-140-1.png"
        }
    },
    "news_17": {
        "title": "[PS4/PS5] PS4-Xplorer 2.02 et PS5-Xplorer 1.02 disponibles",
        "content": "Le développeur Lapy vient de mettre à jour ses outils PS4-Xplorer et PS5-Xplorer, il s'agit comme vous le savez d'un des meilleurs managers/utilitaire créé sous Unity et qui permet d'effectuer diverses opérations comme couper, copier, coller, renommer, supprimer des fichiers ou des dossiers, ou encore d'explorer le stockage de la console PS4 et PS5.\n \n \n\n \n \nPas de grand changements à prévoir, quelques petites mises à jour ont été envoyées pour PS4-Xplorer 2.0 (2.02) et PS5-Xplorer (1.02) notamment pour prendre en charge les fichiers LOG à la demande.\n \nLe développeur tient à remercier crump_youtube, notnotzecoxao et DouglasSampaioz pour les tests, mais aussi LightningMods pour la mise à jour du HB Store. \n \n \nTéléchargement : PS4-Xplorer 2.02 / PS5-Xplorer 1.02\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186903/in-ps4ps5-ps4-xplorer-202-et-ps5-xplorer-102-disponibles-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS5] PCXSense 0.7 Bêta disponible",
        "content": "Le développeur Denellyne vient de mettre en ligne une nouvelle version de son utilitaire nommé PCXSense et il est distribué désormais en Beta v0.7.\n \nPCXSense vous permet d'utiliser votre propre Dualsense sur votre ordinateur sans tracas sur n'importe quel jeu de votre choix, mais il y a quelques fonctionnalités intéressantes que vous pourriez également apprécier, sur des émulateurs comme Yuzu et Cemu, les gâchettes adaptatives deviennent plus dures et plus courtes et sur Dolphin, cela fonctionne du gamecube. PCXSense est un projet qui permet d’utiliser votre manette DualSense sur votre ordinateur, en émulant le protocole XInput. \n \nPCXSense traduit les entrées de la manette DualSense en signaux compatibles avec XInput, ce qui vous permet de l’utiliser dans n’importe quel jeu sur votre ordinateur.\n \n \n\n \n \nFonctionnalités :\n \n- Interface graphique conviviale : PCXSense propose une interface facile à utiliser.\n- Prise en charge des vibrations : Vous pouvez ressentir les vibrations de la manette.\n- Modes Bluetooth et USB : Utilisez la manette en mode sans fil ou via USB.\n- Gachette Gamecube : Compatible avec les émulateurs Dolphin.\n- Gachettes Nintendo Switch : Fonctionne avec les émulateurs Yuzu et Cemu.\n- Vérification des mises à jour : PCXSense vous avertit lorsqu’une nouvelle mise à jour est disponible, mais ne la télécharge pas automatiquement.\n \nPour commencer, téléchargez VigemBus, puis rendez-vous dans la section Releases du projet PCXSense pour télécharger la dernière version. Décompressez le fichier et exécutez PCXSense.exe. L’application se mettra à jour automatiquement lorsqu’une nouvelle version sera disponible. Profitez de votre manette DualSense sur votre PC !\n \nChangelog 0.7 Bêta : \n \n- Prise en charge ajoutée pour Dualshock 4\n- Remappage des boutons ajouté\n- Mapping Start/Select vers le pavé tactile dans les profils de jeu\n- Fuite de mémoire corrigée\n- Optimisations…\n \nCes améliorations apportent des fonctionnalités supplémentaires et des corrections pour une meilleure expérience avec votre manette.\n \n \nTéléchargement : PCXSense Beta 0.7\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186818/in-ps5-pcxsense-07-beta-disponible-1.gif"
        }
    },
    "news_19": {
        "title": "[XBO/XBS] La mise à jour de février 2024 est disponible",
        "content": "Malgrés de grosses rumeurs sur le portage de jeux Xbox sur PlayStation ou du moins sur les futures activités de Xbox (nous verrons bien ce soir à 21h00), Microsoft continue d’innover et d’améliorer l’expérience des joueurs sur ses consoles Xbox, que ce soit sur Xbox One ou sur Xbox Series S et X. \n \nLa mise à jour a pour ambition d'apporter l'activation de commandes tactiles dans la lecture à distance, un nouvel outil d'étalonnage des manettes sans fil Xbox, et des filtrages et des tris améliorées. \n \n \n\n \n \nMise à jour de février pour Xbox :\n \n- Contrôles tactiles activés dans le jeu à distance Xbox : Vous pouvez désormais jouer à des jeux à distance sans votre manette Xbox grâce à des commandes tactiles personnalisées. Plus de cent jeux sont compatibles, dont Minecraft Dungeons, Psychonauts 2 et Sea of Thieves.\n- Outil de recalibration des sticks analogiques : L’application Xbox Accessories propose un outil de recalibration des sticks analogiques pour les manettes Xbox sans avoir besoin d’assistance technique.\n- Filtrage et tri améliorés dans “Mes jeux et applications” : Vous pouvez maintenant filtrer vos jeux par accessibilité, langues prises en charge et fonctionnalités techniques. Par exemple, si vous recherchez des jeux compatibles avec le jeu à distance tactile, filtrez par Fonctionnalités techniques > Activé au toucher.\n \nProchaine mise à jour majeure de la console Xbox :\n \n- Mode compact pour les joueurs Windows : Une nouvelle option permettra aux joueurs Windows de profiter d’une interface plus compacte.\n- Support japonais pour les claviers virtuels sur consoles : Les joueurs japonais auront bientôt accès à des claviers virtuels dans leur langue.\n- Outil de réparation des jeux : Un nouvel outil facilitera la réparation des jeux en cas de problèmes.\n- D’autres ajustements et améliorations sont également prévus.\n \nCette mise à jour sera déployée dans quelques heures ou jours sur vos consoles. \n \nTout est là : news.xbox.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186816/in-xboxbs-la-mise-a-jour-de-fevrier-2024-est-disponible-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] Ryujinx supporte désormais Linux sur Arm64",
        "content": "L'équipe en charge du développement de Ryujinx nous informe que leur émulateur Switch supporte désormais Linux sur arm64. Pou rappel, Ryujinx est un émulateur expérimental pour la Nintendo Switch, créé par gdkchan et écrit en C#. Son objectif est d’offrir une excellente précision et des performances optimales, une interface conviviale et des versions cohérentes testées sur plus de 4 050 titres, dont environ 3 400 sont considérés comme jouables.\n \n \n\n \n \nL’équipe de développeurs travaille sans relâche pour améliorer cet émulateur. Parmi les membres clés, on retrouve gdkchan (lead developer), Ac_K, marysaka, riperiperi, LDj3SNuD, emmauss, Moosehunter, et Yoshiyes (web designer / développeur).\n \nPour la petite histoire, le nom se prononce “Ree-You-Jinx” et est inspiré du dieu-dragon mythique Ryujin, avec le “NX” faisant référence au nom de code de la Nintendo Switch.\n \n\n \nRyujinx prenant désormais en charge Linux sur arm64 vous pourriez donc par exemple exécuter divers jeux sur Asahi Linux avec OpenGL.\n \n \nTéléchargement : Ryujinx\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1186809/in-switch-ryujinx-supporte-desormais-linux-sur-arm64-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1186809/in-switch-ryujinx-supporte-desormais-linux-sur-arm64-2.jpg"
        }
    }
}