{
    "news_1": {
        "title": "[Switch] AIO-Switch updater v2.21.4 disponible",
        "content": "Le développeur français HamletDuFromage propose une mise à jour de son outil Aio Switch Updater. Pour rappel, cet outil permet de profiter d'options très utiles comme mettre des DNS Lan Play, de mettre à jour Atmosphere ou les sigpatches, ou encore de gérer des cheats codes (via CheatSlips.com).\n \nLa dernière mise à jour remonte à Décembre dernier, soit il y a quasiment 6 mois, cette nouvelle version améliore la localisation et apporte quelques corrections pour Hekate. \n \n \n\n \n \nChangelog :\n \n- Amélioration de la localisation et des corrections \n- Correction de l'invite demandant de copier la charge utile hekate dans reboot_payload.bin qui ne s'affiche pas.\n- Amélioration de la localisation en allemand (github.com/TTghostsemir).\n- Amélioration de la localisation en japonais (github.com/reindex-ot).\n \n \nTéléchargement : AIO-Switch updater 2.21.4\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173141/in-switch-aio-switch-updater-v2214-disponible-1.jpg"
        }
    },
    "news_2": {
        "title": "[XBS/XBX/XBO] Le circuit intégré ESD Booster U21 pour Xbox One X, Xbox Series X et S",
        "content": "De nombreux circuits intégrés sont proposés par quelques sites internet, et l'un d'entre eux peut être une solution à de nombreux problèmes rencontrés par des utilisateurs de Xbox One X, Xbox Series S et Xbox Series X. \n \n \n\n \n \nLe circuit intégré ESB Booster U21 est un circuit très fragile, sur les consoles Xbox One X, Xbox Series X & Series S, ce circuit est connu pour être défaillant lorsque le port HDMI est endommagé ou qu'il y a un pic d'alimentation. Ce circuit d'origine est un petit circuit BGA en verre de 3x3mm qui est très fragile et sensible à la chaleur et aux mouvements.\n \n \n\n \n\n \n\n \n \nAinsi le site Ubermicro.co.uk propose une solution de remplacement de ce circuit intégré par un circuit beaucoup plus robuste, et facile à installer. Il faut cependant avoir à l'esprit que bien qu'il s'agisse d'un circuit de remplacement, certaines caractéristiques techniques peuvent manquer ou ne pas fonctionner.\n \nJusqu'à présent :\n4kUHD @ 60hz = Fonctionne (120hz TBC)\n1440p @ 60 / 120hz = Fonctionne\n1080p @ 60 / 120hz = Fonctionne\n720p @ 60hz = Fonctionne\nCEC (mise sous/hors tension/sélection d'entrée) = Fonctionne\n \nVoici quelques caractéristiques : \n- HDMI 1.4, 2.0 & 2.1\n- Protection ESD par contact de 8 kV\n- Protection du lien DC (I2C), circuit de conditionnement du signal bidirectionnel et pull-up dynamique\n- Protection du bus CEC\n- HPD pulls down, conditionnement du signal avec décalage de niveau et protection contre le backdrive\n- Protection contre les courts-circuits sur la sortie 5V\n- Réveil à partir de l'état de veille via le bus CEC\n- Support de câble long et/ou de mauvaise qualité avec pull-up dynamique sur le bus DDC\n- A noter que le retrait de l'ancien circuit imprimé BGA en verre U21 est nécessaire avant l'installation. \n- Permet de tester les ports HDMI / diodes TVS HDMI et les drivers HDMI\n \n \n\n \n \n \nCette solution constitue également un excellent outil de diagnostic. Si vous avez l'habitude de reconstruire des pads pour des HDMI abimés, des ports USB-C, avec \"seulement\" 14 fils de liaison à passer, une fois installé, les tests peuvent être lancés en moins de 45 minutes (si vous prenez votre temps).\n \n \nLien source : xbox-esd-hdmi-booster-u21-alternative-for-series-x-series-s-and-one-x\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-782596504.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173092/in-xbsxbxxbo-le-circuit-integre-esd-booster-u21-pour-xbox-one-x-xbox-series-x-et-s-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1173092/in-xbsxbxxbo-le-circuit-integre-esd-booster-u21-pour-xbox-one-x-xbox-series-x-et-s-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1173092/in-xbsxbxxbo-le-circuit-integre-esd-booster-u21-pour-xbox-one-x-xbox-series-x-et-s-3.png"
        }
    },
    "news_3": {
        "title": "[Switch] Une carte d'extension Picofly RP2040-Zero pour faciliter son installation",
        "content": "Le développeur Helder Silva, connu sous le pseudo AngryHelder, propose de découvrir la v1.0 de sa carte d'extension PicoFly destiné à réaliser une installation plus facile et plus propre d'un RP2040-Zero. \n \n \n\n \n\n \n \nUne carte d'extension pour quoi faire ?\n \nCette carte d'extension est une bonne idée, elle intègre par exemple directement les 3 petites résistances pour le DAT0, le CMD et le CLK qui sont nécessaires pour glitcher et dumper/flasher la Nand de la console. Les pads sont aussi beaucoup plus larges que ceux présent sur le RP2040-Zero, et ils sont directement identifiés sur la carte d'extension. \n \n \n\n \n \nTout cela permet de faciliter l'installation, à 3 $ l'unité, ou bien à 2.4 $ par 5 ou 10 unités, ça vaut peut être le coup pour se faciliter le boulot. Pour le RP2040-Zero, il est peut être plus intéressant de passer en direct sur un site spécialisé comme Aliexpress pour limiter l'intermédiaire. Il faut garder à l'esprit que cette carte d'extension n'est en rien obligatoire, surtout si vous êtes à l'aise sur la soudure. \n \nTout est là : heldergametech.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173083/in-switch-une-carte-dextension-picofly-rp2040-zero-pour-faciliter-son-installation-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1173083/in-switch-une-carte-dextension-picofly-rp2040-zero-pour-faciliter-son-installation-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1173083/in-switch-une-carte-dextension-picofly-rp2040-zero-pour-faciliter-son-installation-3.jpg"
        }
    },
    "news_4": {
        "title": "[Vita] Hyperfight Vita v1.0 disponible",
        "content": "Le développeur Anas Halideen propose un nouvel homebrew pour la PlayStation Vita qui continue de vivre son petit bonhomme de chemin, il s'agit d'un portage d'Hyperfight un jeu de combat où chaque coup est mortel et où chaque victoire compte. Vous devrez risquer vos points pour accéder aux coups spéciaux et super coups de votre personnage, qui peuvent faire basculer la partie en un clin d'oeil. Conçu pour être facile à prendre en main et difficile à maîtriser, Hyperfight saura vous mettre au défi. \n \nVous l'aurez compris, il s'agit d'un jeu de combat à un coup en 2D.\n \n \n\n \n\n \n\n \n\n \n \nChangelog (v.1.0) :\n \n- Première version.\n- Basé sur Godot Engine\n- Portage basé sur la version 3.1.1\n \nA noter que certaines polices ne sont pas intégrés, il faudra les télécharger et les installer manuellement dans le répertoire /resources/font/\n \nCommandes :\n \nDéplacer à gauche/droite : Joystick gauche (gauche/droite)\nSauter : Joystick gauche (haut)\nCourse au sol : (si vous n'êtes pas déjà en train de courir) : Joystick gauche/Dpad (double tap à gauche ou à droite)\nCourse aérienne : (si vous n'êtes pas déjà en train de courir) : Joystick gauche/Dpad (double tap à gauche ou à droite en l'air)\nAttaque normale/Sélection de menu : Croix (PS)\nAttaque spéciale : Cercle (PS)\nSuper attaque : Carré (PS)\nDémarrage : Start\n \n \nNotes :\n \nIl faudra un peu de temps pour que l'écran démarre, mais une fois qu'il démarre, le jeu devrait fonctionner parfaitement.\n \nL'option locale 2 joueurs ne fonctionnera évidemment pas (car il faudrait fonctionner Godot Vita avec le jeu ad-hoc sur vita, pour l'heure c'est difficile à réaliser).\n \nMerci à SonicMastr pour avoir créé la compatibilité de Godot 3.5 avec la PS Vita.\n \n \nTéléchargement : Hyperfight Vita v1.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173079/in-vita-hyperfight-vita-v10-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173079/in-vita-hyperfight-vita-v10-disponible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1173079/in-vita-hyperfight-vita-v10-disponible-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1173079/in-vita-hyperfight-vita-v10-disponible-4.png"
        }
    },
    "news_5": {
        "title": "[Switch] The Legend of Zelda: Tears of the Kingdom a été leaké",
        "content": "Cela a commencé par quelques screens dévoilés, puis des vidéos qui ont dévoilés pas mal de contenus, et donc qui ont spoilé pas mals de futurs acheteurs, et désormais nous pouvons l'affirmer,  The Legend of Zelda: Tears of the Kingdom a été leaké.\n \nThe Legend of Zelda: Tears of the Kingdom (aussi appelé Totk) est très attendu, pas moins de 6 années séparent son précédesseur Breath of the Wild.\n \nUn temps il s'agissait d'un fake, avec la disponibilité d'un NSP, mais le XCI lui est bel et bien le leak du titre. De nombreuses personnes se sont empressées de le tester sur Ryujinx et Yuzu, et il fonctionne plutôt correctement. Il y a toujours de baisses de framerates à certains endroits chargés, tout comme dans Breath of the Wild.\n \n \n\n \n \n \nMerci de ne donner aucun lien en commentaire, nous ne sommes là que pour en parler pas pour diffuser, ce qui est différent. \n \nLes vidéos se multiplient sur les réseaux sociaux, cela va être difficile d'éviter les spoils pour ceux qui l'ont précommandé.\n \n \n \n\n \n \n \nLe NSP de The Legend of Zelda: Tears of the Kingdom pèse un peu plus de 16 Go, il fonctionne à partir du firmware 15.0.0. \n \n \n\n \n \nA noter que Shigeru Miyamoto a laissé pensé qu'une adaptation de The Legend of Zelda serait possible au cinéma suite au succès planétaire de Super Mario Bros, le film, produit par le studio Illumination. Là aussi, une version pirate du film circule et elle a déjà été vue par 10 millions de personnes. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173047/in-switch-the-legend-of-zelda-tears-of-the-kingdom-a-ete-leake-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1173047/in-switch-the-legend-of-zelda-tears-of-the-kingdom-a-ete-leake-2.jpg"
        }
    },
    "news_6": {
        "title": "[XBX/XBS/XBO] La nouvelle interface utilisateur Xbox arrive",
        "content": "Un peu de vert dans le champs de blé, Microsoft va très bientôt inaugurer sa nouvelle interface pour ses Xbox Series S et X, mais aussi pour la Xbox One.\n \nElle se voudra beaucoup plus sobre afin d'améliorer la lisibilité, pour l'heure, elle n'est accessible qu'à certains membres insiders, elle sera sans doute déployée auprès de tous d'ici l'été. Cette nouvelle interface simplifiera la navigation, on y trouvera plus de place pour le background, qui pourra être dynamique en fonction du jeu sélectionné. \n \n \n\n \nLa nouvelle interface\n \n \n \n\n \nL'ancienne interface (l'actuelle)\n \n \nCette nouvelle version de Home : \n \n- Fournit une navigation facile vers votre bibliothèque, le Microsoft Store, le Xbox Game Pass, la recherche et les paramètres tout en haut de votre Accueil en introduisant un nouveau menu d'accès rapide.\n- Simplifie la mise en page et vous donne plus d'espace pour voir votre arrière-plan en réduisant la taille de certaines tuiles et en les déplaçant vers le bas de l'écran.\n- Ajoute une fonctionnalité d'art de jeu réactif pour mettre à jour l'arrière-plan par défaut et montrer le magnifique art associé à chaque titre lorsque vous survolez les tuiles.\n \nTout est là : news.xbox.com\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1108708967.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1581543737.jpg"
        }
    },
    "news_7": {
        "title": "[PS4] BwE PS4 NOR Validator 2.2.0 disponible",
        "content": "Le développeur en charge de BwE PS4 Nor Validator propose une nouvelle de son logiciel et nous fait à cette occasion un petit historique.\n \nBwE PS4 NOR Validator c'est pas moins de 2500 dumps validés par mois, mais pas que ça ! \n \n \n\n \n \nBwE PS4 NOR Validator :\n \n- 24 835 lignes de code\n- 929 KB de code\n- 3230 offsets lus\n- 3301 résultats/sorties possibles\n- Presque 5 ans de développement \n- Ecrit en Perl, par moi, en utilisant Notepad++\n \n \nChangelog : \n \n2.2.0 (1/5/23) Correcticon du versionnage, correction de la licence USB, autres petits changements\n2.1.9 (30/4/23) Ajout de la prise en charge de la licence USB, corrections de bogues, correction de l'erreur SB Patch, meilleure gestion du journal UART, ajout de validations non listées/nouvelles, amélioration de la validation UNK (détection de la corruption de bloc)\n2.1.8 (28/3/23) Corrections de bugs, mises à jour des processus de validation, meilleure prise en charge de Windows 11\n \n \nTéléchargement : BwE PS4 NOR Validator 2.2.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173024/in-ps4-bwe-ps4-nor-validator-220-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[PSP] Apollo Save Tool v1.0.0 disponible pour la PSP",
        "content": "Le développeur Bucanero a travaillé sur la version PSP de son outil Apollo Save Tool et offre désormais la version 1.0 de son logiciel pour la PSP. Le logiciel évolue une nouvelle fois avec désormais l'ajout d'un editeur hexadécimal et d'un serveur web pour éditer et sauvegarder les sauvegardes. Pour rappel, il s'agit d'une application qui vous permet de gérer les fichiers de sauvegarde de jeu sur PlayStation Vita et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur la PSP.\n \n \n\n \n \nChangelog : \n \n- Ajout d'un éditeur hexadécimal pour les fichiers de sauvegarde\n- Amélioration du serveur Web de sauvegarde (gestion des sauvegardes en masse)\n- Sauvegarde et téléchargement des sauvegardes au format .Zip\n \nOutils réseau\n- Serveur Web local simple (accès complet à la clé USB de la console)\n- Nouveaux codes de triche PSP et Prise en charge de la somme de contrôle personnalisée pour BlazBlue : Continuum Shift II\n \n \nTéléchargement : Apollo Save Tool 1.0.0 (PSP)\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173023/in-psp-apollo-save-tool-v100-disponible-pour-la-psp-1.png"
        }
    },
    "news_9": {
        "title": "[PSP] PPSSPP 1.15 disponible",
        "content": "Voilà 5 mois que nous n'avions pas eu la joie de voir débarquer de la nouveauté du côté de l'émulateur PPSSPP, et bien voilà la version 1.15 qui est arrivée hier sur les serveurs de l'équipe en charge de son développement. \n \n \n\n \n \nHenrik Rydgård, fondateur du PPSSPP vient de l'annoncer, cette version sera déployée sur GooglePlay dans quelques jours, sachant qu'il y a désormais une version Mac. \n \n \n \n\n \n \n \nNouveautés de la version 1.15 :  \n \n- Le ralentissement causé par la compilation des shaders a été réduit de façon drastique ([#16873])\n- Parallélisation : ([#16802], [#16804], [#16809], [#16812])\n- Réduction des variantes de shaders : ([#16773], [#16778], [#16770], [#16763])\n \nPerformances de rendu et corrections :\n \n- Mise à l'échelle des nombres entiers ajoutée ([#17224])\n- Corrections du post-traitement ([#17262])\n- Suppression du problème de superposition SOCOM, correction de la vision nocturne ([#17297], [#17317])\n- Corrections de la compatibilité PowerVR ([#17232])\n- Correction de CLUT ([#17212])\n- ToP - Narikiri Dungeon X : évitement du readback GPU ([#17181], [#17191], [#17192])\n- DTM / Toca : Éviter la lecture par le GPU ([#16715])\n- Correction de la régression des performances de Dante's Inferno ([#17032], [#17035])\n- Correction d'une mauvaise sélection d'appareil sur les téléphones Poco C40, causant une interface utilisateur cassée ([#17027], [#17022])\n- Correction des performances du GPU de Rainbow Six ([#16971])\n- Correction des sous-titres dans Le Parrain ([#17298], [#17314])\n \nAmélioration du remplacement des textures :\n \n- Moins d'E/S sur le thread principal, conduisant à des taux d'images plus fluides ([#17078], [#17091], [#17120], [#17134])\n- Prise en charge des fichiers KTX2 avec des textures compressées UASTC ajoutée ([#17111][#17104])\n- Ajout du support des fichiers DDS avec les textures BC1-7 ([#17083], [#17103], [#17097], [#17096], [#17095])\n- Amélioration de l'ini par défaut ([#17146])\n- Les Mipmaps sont maintenant toujours utilisées si elles sont fournies ([#17144])\n- Optimisations supplémentaires ([#17139], [#17088])\n \nOptimisations :\n \n- Corrections et performances du moteur de rendu logiciel ([#17295], [#17214], [#17028], [#16753], [#16706], [#16690])\n- Optimisations du téléchargement de textures Vulkan ([#17052], [#17122], [#17121], [#17114], [#17011])\n- Ajout de la lecture en profondeur, corrigeant les éclats de lentilles dans Syphon Filter (au prix de performances..) ([#16907], [#16905])\n- Async readback supporté dans Vulkan - actuellement seulement activé dans Dangan Ronpa ([#16910], [#16916])\n- Optimisations du shader d'éclairage ([#16791], [#16787])\n \nContrôles :\n \n- Le contrôle de l'inclinaison sur Android a été revu et corrigé ([#16889], [#16896])\n- Vous pouvez désormais associer des combinaisons de boutons à des fonctions uniques ([#17210], [#17215], [#17228], etc)\n- Les boutons personnalisés prennent désormais en charge les entrées analogiques ([#16855])\n \nFonctionnalités VR :\n \n- Caméra de haut en bas : ([#17098])\n- Contrôle de la rotation de la tête : ([#16857])\n- Plus de support stéréo : ([#16952], [#16953])\n- Autres : ([#16826], [#16821])\n \nAutres :  \n \n- Prise en charge du dark mode de Windows ([#16704])\n- Corrections de la compatibilité des shaders GLSL ([#16710], [#16709])\n- Correction du problème mathématique de GTA sur macOS/iOS, jouable à nouveau ([#16928])\n- Une émulation VFPU plus précise a été ajoutée, bien qu'elle ne soit pas encore entièrement activée ([#16984])\n- Fonctionnalités et corrections du débogueur ([#17270], [#17269], [#17263], [#17260], [#17203], [#17190], [#17042], [#16994], [#16988], [#16818] etc)\n- Le rembobinage des sauvegardes ne ralentit plus beaucoup les choses ([#17291])\n- Correction des bugs de la fenêtre de chat ([#17241])\n- Corrections IR Jit - aide iOS quand le jit natif n'est pas disponible ([#17129])\n- Corrections du rendu lié à la profondeur ([#17055], [#16880])\n- Plus de travail sur le support RISCV ([#16976], [#16957], [#16962], [#16832], [#16829])\n- Barre de menu native pour macOS ([#16922])\n- Corrections de polices ([#16859])\n- Correction du problème audio de Rockman 2 ([#16810], [#16798])\n- Corrections de l'interface utilisateur : Utilisation verticale de l'espace ([#16795]), barres de défilement ([#16785]), défilement au pavé tactile sous Windows ([#16699])\n \n \nTéléchargement : PPSSPP 1.15\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173022/in-psp-ppsspp-115-disponible-1.png"
        }
    },
    "news_10": {
        "title": "[PS4/PS5/Switch] DS4Windows 3.2.10 disponible",
        "content": "Le développeur Travis Nickles connu sous le pseudonyme de Ryochan propose une nouvelle version de DS4Windows qui est livré désormais en v3.2.10. Comme vous le savez DS4Windows est une interface efficace pour paramétrer une manette sur PC, il est basé sur un fork de Jays2Kings. Pour en profiter cela passe par un câble micro-USB, mais il est aussi possible de s'en servir sans fils avec quelques adaptateurs Bluetooth 2.1 (ou supérieur). \n \n \n \n\n \n \n \nChangelog : \n \n- Ajout d'une routine de compensation de l'instabilité pour la souris gyroscopique\n- Déplacement des appels d'initialisation et de déconnexion du gestionnaire de sortie vers les routines de démarrage et d'arrêt de ControlService\n- Modification des routines de suspension et de reprise\n- Ajout d'une gestion d'exception supplémentaire en cas d'échec de la notification de la barre d'état.\n- Utilisation de DetermineConnectionType dans PostInit de DS3Device. Contribution de SunnyQeen\n- Correction d'un crash lors de l'ouverture des options du périphérique avec l'option null. Contribution de SunnyQeen\n- Ajout de l'option InterpretingOscMonitoring. Contribution de xAdler\n- Ajout de quelques chaînes de traduction OSC. Contribution de xAdler\n- Ajout de l'interprétation du message de surveillance OSC. Contribution de xAdler\n- Ajout du contrôle des déclencheurs OSC. Contribution de xAdler\n- Ajout de vérifications supplémentaires dans la routine ProfileDTO MapFrom.\n- Modification de la façon dont les macros sont sauvegardées à partir de la fenêtre de liaison. Ne pas réinitialiser le déclencheur shift\n- Prise en charge du Horipad 4 FPS. Contribution de markguleno\n- Correction du mode custom led. Contribution de MatrixDJ96\n \n \nTéléchargement : DS4Windows 3.2.10\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173019/in-ps4ps5switch-ds4windows-3210-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] SimpleModManager 2.1.0 disponible",
        "content": "Le développeur Nadrino vient de mettre en ligne une toute nouvelle version de SimpleModManager qui est désormais proposé en version 2.1.0. \n \nSimpleModManager est une application homebrew qui va vous permettre de gérer des mods, via LayeredFS, dans Atmosphère. SimpleModManager facilite la gestion des mods à partir de LayeredFS en redirigeant l'accès des fichiers romfs de la carte SD. Lorsque l'application accède à un fichier romfs, elle vérifie l'existence de ce même fichier dans la carte SD. Si le fichier sur la carte SD existe, l'accès au fichier romfs sera redirigé vers celui-ci.\n \n \n\n \n\n \n\n \n\n \n\n \n\n \n \n \nChangelog :\n \n- Refonte du moteur de base et du code de nettoyage. Devrait être beaucoup plus stable. Pour cette version, le développeur a abandonné le module de superposition car il plante instantanément même avec l'inclusion la plus simple.\n \n- La version console est maintenant expédiée à part car les codes d'échappement (couleurs par exemple) ne s'affichent pas correctement lorsqu'ils sont compilés avec borealis.\n \n \nTéléchargement : SimpleModManager 2.1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173009/in-switch-simplemodmanager-210-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1173009/in-switch-simplemodmanager-210-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1173009/in-switch-simplemodmanager-210-disponible-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1173009/in-switch-simplemodmanager-210-disponible-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1173009/in-switch-simplemodmanager-210-disponible-5.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1173009/in-switch-simplemodmanager-210-disponible-6.jpg"
        }
    },
    "news_12": {
        "title": "[Multi] EasyRPG Player 0.8 disponible",
        "content": "EasyRPG Player est de retour et maintient presque toutes les fonctionnalités de la conception originale RPG Maker 2000 et RPG Maker 2003.\n \nComme toutes les plates-formes sont concernées, notamment PC et Linux, il est bon de rappeler que pour nos consoles ce programme concerne les Nintendo Switch, la Nintendo 3DS et ses dérivées, la Nintendo Wii, et la PlayStation Vita.\n \n \n\n \n \nCette nouvelle version 0.8 affublée du nom de code \"Paralyze\" arrive 18 mois sans nouvelle version, mais le projet n'est pas mort ! A l'origine une nouvelle version intermédiaire était prévue début 2022, mais l'équipe était épuisée. Cependant, cette nouvelle version compensera cette longue attente.\n \nCette version marque un changement dans l'équipe de développement : Après 12 ans, l'un de nos développeurs principaux (Ghabry) va faire une pause dans le développement d'EasyRPG Player pour se concentrer sur l'EasyRPG Editor (enfin !) et d'autres projets annexes non liés à EasyRPG. \n \nComme il est l'un des contributeurs les plus actifs le développement du Player va ralentir encore plus. Ne vous attendez pas à des mises à jour gigantesques dans les années à venir. EasyRPG Player est un projet open source, cette nouvelle version corrige de nombreux bugs. \n \nUn nouveau logo a été introduit, des paramètres vidéos plus importants, des modifications d'audio encore plus poussées, et de nombreuses maintenances pour chaque plate-forme spécifique. \n \nSur 3DS, le système audio a été réécrit de fond en comble pour corriger de nombreux glitchs. En outre, l'écran inférieur affiche désormais l'état actuel de la batterie.\n \nSur la Switch, le docking/déstockage de la console et l'appel du menu HOME sont désormais correctement gérés.\n \nSur la Wii, le chargement des sauvegardes a été corrigé.\n \nBref, vous l'aurez compris, cette version sera probablement l'une des dernières avant un bon moment !\n \n \nTéléchargement : EasyRPG Player 0.8\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173008/in-multi-easyrpg-player-08-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[Switch] SysDVR 5.5.5 disponible",
        "content": "Exelix11 vient de mettre à jour SysDVR, pour rappel sysdvr permet de streamer l'écran directement sur son PC via le wifi ou via un câble. A noter qu'il est possible d'utiliser SysDVR sur windows, Linux et Mac OS.\n \nLe développeur propose un guide utilisateur ici.\n \n \n\n \n \nChangelog : \n \n- Correction du problème de déconnexion du mode réseau #226\n- Ce problème a nécessité l'augmentation de la taille des tampons des sockets, ce qui fait que SysDVR utilise maintenant plus de mémoire que la v5.5, malheureusement je n'ai pas pu trouver de solution, c'est toujours mieux que la 5.4 et la version précédente mais pas aussi bien que la 5.5.\n- Ajout d'un écran de démarrage pour remplacer l'écran blanc affiché lors de la connexion\n- Introduction de la synchronisation des flux audio/vidéo dans le lecteur intégré : - Le SysDVR tentera automatiquement de synchroniser les flux pour éviter les retards.\n- Le délai de correction augmente en fonction du nombre d'erreurs détectées. En cas de mauvaises conditions de réseau, vous pouvez ressentir un certain retard car le lecteur renonce à la synchronisation pour éviter les bégaiements ; l'ouverture du menu d'accueil à tout moment permet de resynchroniser les flux.\n- Si vous rencontrez des bégaiements, cette fonctionnalité peut être désactivée dans les paramètres avancés de l'interface graphique ou avec l'argument de ligne de commande --debug nosync.\n- Introduction de la suppression des images clés en double : Lorsque SysDVR sur la console détecte de nombreux paquets dupliqués dans un court laps de temps, il arrête de les envoyer afin d'économiser la bande passante et de réduire le délai.\n- L'efficacité de cette fonctionnalité dépend du jeu, puisqu'elle peut causer des artefacts visuels. Cette fonctionnalité peut être désactivée dans les paramètres avancés du homebrew SysDVR-Settings.\n- Amélioration de la programmation des images vidéo dans le lecteur intégré : réduction des bégaiements occasionnels qui n'étaient pas liés à la bande passante du canal.\n- Amélioration de la gestion des fichiers de lancement .bat créés par l'interface graphique : ils peuvent désormais être placés n'importe où et vérifier correctement l'existence des chemins d'accès nécessaires.\n- Certains arguments de la ligne de commande ont été modifiés, en particulier l'option --print-stats a été renommée en --debug stats.\n \nLe développeur souhaite remercier quelques personnes du discord qui font du support utilisateur et pour les tests approfondis effectués sur les versions beta de SysDVR qui ont conduit à cette version, en espérant que cela élimine tous les bugs de streaming restants, rendant l'expérience de l'utilisateur plus fluide que jamais.\n \n \nTéléchargement : SysDVR 5.5.5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173001/in-switch-sysdvr-555-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[Wii] Swiss et WiiSX se mettent à jour",
        "content": "Extrems vient de mettre à jour son outil Swiss qui est désormais proposé en version 0.6r1458. \n \n\n \nChangelog :\n \n- Ajustement pour les changements de libogc2.\n- Ajout d'une correspondance de caractères génériques pour l'entrée de l'autoload.\n- Utilisation de caractères génériques pour l'entrée DVD game.\n- Ajustement pour la version 42 de devkitPPC.\n- Correction de la compilation CI.\n- Ajout de sommes de contrôle pour la mise à jour de GC Loader.\n- Ajout de l'autoload pour l'updater GC Loader.\n- Mise à jour de la base de données Redump.\n- Correction de linkscript.\n- Suppression de certains travaux en double.\n- Utilisation d'un nouveau packer exécutable.\n- Utilisation de l'exécutable packer directement pour Action Replay.\n- Activation du chargement de SDLOADER.BIN pour le débogage.\n- Utiliser le nouveau killswitch de l'hyperviseur.\n- Activation de -fipa-pta pour le stub de rechargement.\n- Correction de l'écriture sur un fichier executable.xz existant.\n- Correction d'un problème empêchant l'activation de -msdata.\n- Mise à jour de .gitignore.\n- Build du moteur de triche à partir des sources.\n \n \nA noter qu'Emukidid lui a mis à jour Wii SX / Cube SX Beta en version 3.0 de retour après près de 13 ans avec une nouvelle version officielle !\n \n \n\n \n \nCe qui a changé : \n \n- Nouveau dynarec implémenté grâce au lightrec de pcercuei.\n- Remplace complètement l'ancien dynarec.\n- Augmente considérablement la compatibilité et la vitesse.\n- Synchronisé avec pcsx-ReARMed en amont.\n- Élimine complètement le ralentissement XA/CDDA sur la Wii et ces titres tournent à pleine vitesse.\n- Plugin audio dfsound.\n- Amélioration de la qualité du son et de la compatibilité.\n- Amélioration de la vitesse dans le plugin graphique soft grâce aux conseils de @extremscorner\n- Augmentation de la vitesse de 15% sur l'ensemble des titres.\n- Compilé avec libOGC2\n- Support de SD2SP2 sur GameCube\n- Correction des bugs de l'interface utilisateur et des fuites de mémoire.\n \nTéléchargement : Swiss / Wii SX Cube SX Beta 3.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1680965510.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1612910601.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] MissionControl améliore le support de la DualShock 3",
        "content": "Comme vous le savez, l'avant dernière version de MissionControl (la version 0.9.1) a apporté le support de la Sony DualShock 3, une petite révolution dans le millieu, car cela faisait un moment que nous attendions cela. \n \nBref, c'est désormais l'heure d'en améliorer le support, ndeadly vient de mettre en ligne la version 0.9.2 qui apporte donc des optimisations, même si elles sont faibles, elles ont le méritent d'être là, il s'agit de la dix-neuvième version officielle de Mission Control.\n \n \n\n \n \nCette version résout quelques problèmes critiques introduits dans la version précédente avec la gestion de la DualShock 3. Un problème causé par la configuration d'un filtre d'interface USB avec les mêmes paramètres que ceux utilisés par le module hid. Le module hid ne recevait alors plus d'événements de connexion USB, ce qui interrompait la prise en charge des contrôleurs câblés et des dongles USB officiels et tiers. \n \nUn problème où MissionControl plantait si la base de données d'appairage Bluetooth était pleine en essayant d'appairer une manette Dualshock 3.\n \n \nChangelog :\n \n- Modification du filtre de l'interface usb utilisé dans l'appairage de la Dualshock 3 afin de ne pas entrer en conflit avec le filtre par défaut utilisé par le module HID.\n- Correction d'un problème où le système plantait lors de la tentative d'appairage d'une manette Dualshock 3 lorsque la base de données d'appairage Bluetooth contenait le nombre maximum d'appareils HID appariés.\n \n \nTéléchargement : MissionControl 0.9.2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172911/in-switch-missioncontrol-ameliore-le-support-de-la-dualshock-3-1.jpg"
        }
    },
    "news_16": {
        "title": "[Vita] Vita Moonlight v0.9.3 disponible",
        "content": "Le développeur d3m3vilurr propose une nouvelle version de Vita Moonlight pour la PlayStation Vita, comme vous le savez Moonlight permet de streamer votre pc sur l'écran de votre onsole. Pour rappel, ce logiciel est basé sur nVidia Gamestreams.\n \nS'agissant d'un homebrew vous aurez besoin d'une PlayStation Vita avec HENkaku et VitaShell d'installés, d'un client FTP et surtout votre ordinateur devra être sous Windows et être équipé d'une carte graphique nVidia (minimum GTX 650).\n \nCe code de cette nouvelle version 0.9.3 a été vérifié par Fewnity. Il a également corrigé un ancien problème d'appariement. Si vous rencontrez un problème, merci de lui signaler.\n \n \n\n \n \n \nChangelog : \n- Correction du problème d'appariement  \n- Mise à jour de moonlight-common-c & enet  \n- Mise à jour de la dernière version de libgamestream  \n \nProblèmes connus :\n- Un problème de handshake pourrait être toujours présent. Il doit être corrigé dans le jeu de code handshaking ou dans la partie vitasdk.\n \n \n \nTéléchargement : Vita Moonlight v0.9.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172906/in-vita-vita-moonlight-v093-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[WiiU] de_Fuse v0.4 disponible",
        "content": "Le développeur Max Thomas, connu aussi sous le nom de shinyquagsire23, propose une nouvelle version de de_Fuse qui est désormais proposée en version 0.3 après avoir proposée une version 0.2.\n \n \n\n \n \nde_Fuse est une version initiale pour les premiers utilisateurs qui veulent savoir si leur RPi Pico est correctement câblé pour de_Fuse. Beaucoup de choses ne sont pas encore implémentées et/ou ont besoin d'être améliorées. Cependant, ce qui est fourni est suffisant pour vérifier que le Pico est installé correctement. Comme vous le savez de_Fuse est une puce (en work in progress) pour la Wii U basée sur de_Fuse, une faille dans la machine d'état de lecture OTP eFuse de la Wii U.\n \n \nChangelog 0.3 :\n \n- Nouveautés de l'application\n- boot1.img vérifie maintenant le CRC32 du BoardConfig, et s'il n'est pas valide, la DRAM est initialisée en utilisant les valeurs par défaut.\n- Ajout du support du dumping OTP basé sur PRSHhax pour toutes les versions de boot1 disponibles sur CDN (prod et dev).\n- Ajout du dumping et de la restauration de BOOT1_SLC.RAW\n- Ajout de la prise en charge de la restauration du fichier seeprom.bin\n- Cette option peut résulter en une impossibilité de dumper l'OTP via PRSH hax si vous faites quelque chose de stupide !\n- J'ai ajouté autant de mesures de vérification/sécurité que possible pour m'assurer que PRSH hax ne serait pas bloqué, mais à la fin de la journée, c'est la responsabilité de l'utilisateur de garder otp.bin et seeprom.bin sauvegardés et en sécurité.\n- Une liste incomplète de choses qui peuvent cesser de fonctionner irrémédiablement si vous perdez votre sauvegarde seeprom.bin et que vous flashez quelque chose d'incorrect comprend :\n- Le lecteur de disque\n- Les sauvegardes stockées sur des clés USB\n- Ajout d'un support pour synchroniser les versions SEEPROM boot1 avec la NAND après avoir flashé BOOT1_SLC.RAW.\n- Cette option nécessite une copie de otp.bin depuis la même console (et ceci est vérifié).\n- Ajustement du partitionnement de redNAND pour placer 1MiB d'espace libre au début de la carte SD pour les images Ancast.\n- Améliorations diverses de la fiabilité\n \n \nChangelog 0.2 : \n \n- Correctif : Correction du fait que l'OTP n'est pas téléchargé sans otp.bin sur la carte SD (lol)\nDump OTP via Backup and Restore > Dump OTP via PRSHhax\nRestauration de SLC.RAW et SLCCMPT.RAW, via Backup and Restore.\nEntrée console série plus rapide et plus fiable.\nUn chainloader fw.img série pour minute_minute dev\nDéfinir la variable env MINUTE_MINUTE_FW_IMG au chemin absolu de fw.img.\nINSTRUCTIONS D'INSTALLATION\nIl s'agit d'une version initiale pour les premiers utilisateurs qui veulent savoir si leur RPi Pico est correctement câblé pour de_Fuse. Beaucoup de choses ne sont pas encore implémentées et/ou ont besoin d'être améliorées. Cependant, ce qui est fourni est suffisant pour vérifier que le Pico est installé correctement.\n \n \nTéléchargement : de_Fuse v0.2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172901/in-wiiu-de-fuse-v03-disponible-1.jpg"
        }
    },
    "news_18": {
        "title": "[WiiU] Wii-U Nand-AID pour faire revivre une Nintendo Wii U",
        "content": "Le développeur Voultar vient de finaliser son projet de résurrection de Nand de Nintendo Wii U, et pour cela il a eu l'idée de créer une mini board prenant place sur un PCB pour remplacer la Nand par une micro SD pour sauver les Wii U qui ont leur Nand HS.\n \nL'idée est de proposer une solution open-source afin que chacun puisse soit profiter de ses plans, soit créer son propre PCB, c'est surtout de proposer une solution contre quelques euros pour réparer une Nand. \n \n \n\n \n \n \nSous le nom de Wii-U Nand-AID se cache un convertisseur eMMC/NAND permettant de réaliser une récupération/remplacement pour la Wii-U. Ce PCB est conçu pour s'insérer proprement sur la carte mère de la Wii-U sans nécessiter l'installation d'un module eMMC BGA et sans que l'installateur n'ait à retirer le module BGA eMMC. Cet outil vous permet de lire/décharger plus facilement l'eMMC existante et de remplacer l'eMMC via MicroSD.\n \n \n \n\n \n \n \nL'idée est aussi de proposer deux types de PCB, un de 0.6 mm ou un de 0.8 mm, avec un isolement spécifique sur le bas du circuit. La nomenclature est incluse dans le fichier zip. Ces choses sont extrêmement bon marché à fabriquer, donc cela ne devrait pas coûter beaucoup d'argent.\n \nLe cavalier \"DIS\" relie l'horloge de l'eNAND/eMMC à la masse afin qu'elle ne flotte pas. Vous devrez le laisser ouvert lorsque vous dumperez l'eMMC et le court-circuiter une fois que vous aurez terminé avec l'eMMC originale afin qu'il ait un état logique défini.\n \nLe développeur annonce qu'il ne maintiendra pas à jour un github par manque de temps, mais qu'il rendra ses travaux publics afin que tout le monde puisse réparer sa Wii U. \n \n \nTout est là : GBAtemp.net\n \nMerci HoYoHoYo pour l'information\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172900/in-wiiu-wii-u-nand-aid-pour-faire-revivre-une-nintendo-wii-u-1.jpg"
        }
    },
    "news_19": {
        "title": "[Wii] WiiStation améliore l'émulation PS1 avec un nouveau recompilateur dynamique",
        "content": "Voilà que débarque la version 2.0 de l'émulation PS1 sur Wii, une toute nouvelle version 2.0 vient en effet de paraitre dans les lignes de code de WiiStation, WiiStation, anciennement connu sous le nom de \"WiiSX RX 2022\", a été modifié par son développeur pour être largement améliorée. \n \n \nLes modifications sont nombreuses et méritent le coup d'oeil puisque xjsxjs197 a changé la méthode de restitution et de compilation en utilisant désormais Lightrec, un nouveau recompilateur dynamique, ce qui devrait augmenter considérablement les performances.\n \n \n \n \n \n\n \n \n \n \n \nAinsi de nombreux jeux devraient désormais fonctionner à pleine vitesse, le journal de jeu sur le mur Wii sera mis à jour après le jeu et le moteur du code de PCSX-ReARMed sera utilisé, ainsi des jeux comme Batman Beyond : Return of the Joker et Driver 2 ne plante plus.\n \n \n \n\n \n \nWiiStation Changelog Ver 2.0 :\n \n- Utilisation d'une nouvelle méthode de compilation dynamique (dynarec) Lightrec, une méthode super cool.\n- De nombreux jeux peuvent maintenant tourner à pleine vitesse.\n- Ajout du support du Wii Message Board pour l'écriture du playlog (Merci SuperrSonic et saulfabregwiivc).\n- Importation du code GTE de PCSX-ReARMed.\n- Correction de problèmes sur Batman Beyond : Return of the Joker qui ne pouvait pas être joué et sur Driver 2 dont une mission ne pouvait être émulée. \n- Modification du code pour supporter les versions supérieures de Devkitppc.\n- Note : Pour le numéro 81, la dernière version haute de Libogc doit être utilisée.\n \n \nTéléchargement : WiiStation Version 2.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1278342954.png"
        }
    },
    "news_20": {
        "title": "[PS4] Noob404 propose la mise à jour de Puppy Linux pour PS4 et PS4 Pro",
        "content": "Le développeur Noob404 propose de découvrir la nouvelle version de Puppy Linux, une version optimisée de Linux pour PS4 et PS4 Pro et qui nécessite moins de 240 Mo de Ram pour fonctionner. \n \nCette distribution est très légère, fonctionnelle et assez simple d'utilisation, elle est capable de faire tourner la plupart des jeux Linux, et se base sur Ubuntu 22.04, son nom de code est \"Bolt Pup\". Cette moture corrige les bugs audio et supporte Vulkan.\n \n \n\n \n \nSi vous rencontrez un écran noir au démarrage, il existe une marche à suivre, c'est un problème très courant. Pour  réparer l'écran noir sur Puppy Linux pour PS4 , suivez ces instructions :\n \n- Déconnectez et reconnectez le câble HDMI.\n- Appuyez sur Ctrl + Alt + F2 pour accéder au shell TTY.\n- Connectez-vous avec le nom d'utilisateur et le mot de passe indiqués ci-dessus.\n- Tapez startxet appuyez sur Entrée\n \n \nTéléchargement : Puppy Linux pour PS4 – Bolt Pup / Forum PS4linux.com\n \n",
        "images": {}
    }
}