{
    "news_1": {
        "title": "[XBO] Quelques modules de la nouvelle Xbox se montrent",
        "content": "Ce n'est plus qu'une question de temps ou de date de NDA (accord de non-divulgation), quelques nouveaux modules de la prochaine Xbox sont déjà sous l'objectif des photographes. Il s'agit de modules destinés au refresh du devkit (XDK) de la nouvelle Xbox Series.\n \n \n\n \n\n \n\n \n\n \n\n \n \n\n \n\n \n \nDeux modules ont été dévoilés via la certification Veritas, le module Wifi 6e, ainsi que son antenne et le module RF sur lesquels nous voyons bien la marque Microsoft et comme nous pouvons le voir les puces employées proviennent du fondeur Mediatek.\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188938/in-xbo-quelques-modules-de-la-nouvelle-xbox-se-montrent-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1188938/in-xbo-quelques-modules-de-la-nouvelle-xbox-se-montrent-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1188938/in-xbo-quelques-modules-de-la-nouvelle-xbox-se-montrent-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1188938/in-xbo-quelques-modules-de-la-nouvelle-xbox-se-montrent-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1188938/in-xbo-quelques-modules-de-la-nouvelle-xbox-se-montrent-5.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1188938/in-xbo-quelques-modules-de-la-nouvelle-xbox-se-montrent-6.jpg",
            "image_7": "https://www.logic-sunrise.com/images/news/1188938/in-xbo-quelques-modules-de-la-nouvelle-xbox-se-montrent-7.jpg"
        }
    },
    "news_2": {
        "title": "[PS3] ezRemote Client de Switch, PS4 et Vita adapté à la PS3",
        "content": " \nezRemote Client est une application de gestion de fichiers qui vous permet de connecter votre console à des serveurs FTP, SMB, WebDAV distants pour transférer et gérer des fichiers. Il remplace les applications \"Switch SMB Client\" et \"Switch FTP Client\" sur Switch par exemple, mais il existe aussi des versions PS4 ou Vita de ce programme. \n \n \n\n \n \nDésormais il s'agit de la version PS3 qui est proposée par cy33hc, il s'agit d'un portage d'ezRemote Client, sachant que les fonctionnalités diffèrent d'une console à l'autre.\n \nSur la PS3, voici les fonctionnalités : \n- Connexion et transfert de fichiers entre la PS3 et un serveur FTP/SMB/NFS/WebDAV/HTTP\n- Prise en charge de la connexion à des serveurs Http tels que (Apache, Nginx, RClone, Microsoft IIS, NPX Serve) avec des listes de répertoires html.\n- Installation de fichiers PKG à partir de n'importe quel serveur distant. Ceci téléchargera automatiquement le PKG sur la PS3 et installera les fichiers rap/rif s'ils sont trouvés. Crée la bulle d'installation dans le \"PlayStation Network Content\" de Package Manager.\n- Les fichiers rap/rif doivent se trouver dans le même dossier ou dans un sous-dossier exdata que le fichier PKG sur le serveur distant. Si un fichier rif existe déjà dans le compte PS3, le fichier rif ne sera pas remplacé. Voir l'exemple de capture d'écran\n- Dans la boîte de dialogue des paramètres de l'application, vous avez la possibilité de choisir le compte PS3 pour l'installation des fichiers rap/rif.\n- Pour les serveurs WebDAV et HTTP qui ne nécessitent pas de nom d'utilisateur/mot de passe, vous avez la possibilité d'activer les téléchargements Backgroud. Comme pour le PKGi PS3, vous devez redémarrer la PS3 pour que les téléchargements en arrière-plan démarrent.\n- Créer des fichiers Zip\n- Extraction de fichiers zip et 7zip\n- Fonction de gestion de fichiers incluant couper/copier/coller/renommer/supprimer/nouveau dossier/fichier pour les fichiers sur PS3.\n- Éditeur de texte simple pour effectuer des changements simples dans les fichiers texte de configuration. Limité à l'édition de fichiers de plus de 32kb et limité à l'édition de lignes jusqu'à 512 caractères. Si vous essayez d'éditer des lignes de plus de 512 caractères, elles seront tronquées. Pour les fichiers texte courants avec les extensions suivantes (txt, log, ini, json, xml, html, conf, config), les sélectionner dans le navigateur de fichiers avec le bouton X ouvrira automatiquement l'éditeur de texte.\n \nProblèmes connus :\n- Des problèmes d'interface utilisateur, mais qui n'affectent pas les fonctionnalités. Nous essaierons de résoudre les problèmes d'interface utilisateur plus tard.\n \n \nTéléchargement : ps3-ezremote-client.pkg v1.00\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188928/in-ps3-ezremote-client-de-switch-ps4-et-vita-adapte-a-la-ps3-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS5] BwE PS5 Code Reader v1.2.4 et BwE PS5 NOR Tool v1.2.6 disponibles",
        "content": "Le développeur BwE propose la mise à jour de BwE PS5 Code Reader qui est désormais proposé en version v1.2.4 ainsi que de BwE PS5 NOR Tool qui lui passe en v1.2.6, si vous suivez le développeur sur Twitter vous pouvez voir les échanges assez musclés avec Abkarino, surtout quand on sait que Andy_maN annonce l'arrivée de ps4-wee-tools en v1.0.0 après un travail acharné. \n \n \n \n\n \n \n \nChanglog BwE PS5 Code Reader v1.2.4 :\n \n- Juste plus d'améliorations dans l'ensemble.\n- Egalement fait une mise à jour massive de la base de données !\n- Bientôt de nouvelles détections/fonctionnalités dans les prochaines versions\n \n \n\n \n \nChangelog BwE PS5 NOR Tool v1.2.6 :\n \n- Mise à jour massive de la validation\n- Mise à jour du Re-Generator (dernier FW, dernières cartes)\n- Mise à jour du Southbridge Patcher (Dernier FW, Dernières cartes)\n- Autres petites mises à jour\n \n \n\n \n \n \nTéléchargement : \n \nhttps://betterwayelectronics.com.au/#ps5codereader\n \nhttps://betterwayelectronics.com.au/ps5nortool\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188889/in-ps5-bwe-ps5-code-reader-v124-et-bwe-ps5-nor-tool-v126-disponibles-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1188889/in-ps5-bwe-ps5-code-reader-v124-et-bwe-ps5-nor-tool-v126-disponibles-2.png"
        }
    },
    "news_4": {
        "title": "[Switch] switch_AIO_LS_pack 5.9.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.9.0 - Frisco.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.9.0:\nDernier firmware compatible mis à jour en 18.0.0.\nBootlogo mis à jour pour fonctionner sur le firmware 18.0.0.\nPatches pour les thèmes mis à jour pour le firmware 18.0.0.\nSuppression de fichiers devenus inutiles, le script Windows de nettoyage se chargera aussi de les supprimer mais le homebrew AIO_LS_pack_Updater lui ne le fera pas, ceci n'est pas grave en soi.\nMise à jour d'Atmosphere, de Hekate, de Lockpick-RCM, de Sys-patch, de SimpleModDownloader et de Haku33 vers la dernière version de ceux-ci.\nChangements dans les configurations de Hekate.\nMise à jour du script TegraExplorer servant de boîte à outils pour y corriger un petit bug dans la restauration d'un PRODINFO créé via ProdinfoGen.\nMise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.50.00:\nAjout de la possibilité de supprimer le contrôle parental.\nAffichage du menu légèrement retravaillé.\nLégères modifications des configs de Hekate intégrées au homebrew.\nQuelques autres corrections mineures.\n\n- Changelog pour la version 5.8.0:\nLa suppression des modules via le script de nettoyage supprimera également se qui se trouve dans le dossier \"atmosphere/kips\".\nMise à jour de DBI, de Status-Monitor-Overlay et de NXMP vers la dernière version de ceux-ci.\nChangement dans les configurations de AIO-Switch-Updater et de FastCFWSwitch.\nMise à jour des tutoriels.\nMise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.40.00:\nAjout d'une validation par l'utilisateur durant l'installation du pack, maintenant l'utilisateur doit confirmer qu'il utilise une SD formatée en FAT32 pour continuer. Attention, ceci n'est pas vérifié par le homebrew ensuite, cela sert plutôt d'avertissement.\nLa suppression des modules supprime également se qui se trouve dans le dossier \"atmosphere/kips\".\nCorrection de fautes dans les messages affichés.\nChangements pour pouvoir compiler avec les dernières mises à jour de l'environnement de développement.\n\nNote: Pour traiter les problèmes particuliers de lancement de la sysnand en firmware 17.0.0 c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_5": {
        "title": "[PS3] CFW 4.91.2 Evilnat PEX/D-PEX Beta 3 disponible",
        "content": "Et voilà la Bêta 3 du CFW 4.91.2 d'Evilnat qui est proposé par Nathan Martin, il s'agit des versions PEX et D-PEX qui sont en ligne avec un changelog plutôt conséquent. \n \nEncore une fois le développeur nous montre qu'il est clairement le meilleur pour proposer un CFW sur PS3, avec notamment la mise à jour des fonctions Cobra en 8.5 qui ont été une nouvelle fois mise à jour, et il a corrigé quelque blocages et plantages aléatoires révélés lors pendant plusieurs heures de tests de Emanuel Orellana (ktemanuel).\n \n \n\n \n \n \nChangelog Beta 3 : \n \n+ Nouveau core/Cobra payload build\n+ Correction des blocages aléatoires\n- Cobra mis à jour vers la version 8.5\n- Correction de l'écran noir/du gel lors du lancement des ISO PS3/PSP/PSX\n- Correction du freeze lors de l'installation de PKG à partir d'un périphérique exFAT/NTFS externe\n- Annulation du patch qui causait des problèmes lors de la lecture de films BD\n- Mise à jour de Trophy Unlocker à la version 1.1\n- Création de variantes [noBD] pour PEX et D-PEX\n- [COBRA] Ajout de la prise en charge du décryptage à la volée des ISO REDUMP    \n- [COBRA/XAI] Opcode pour basculer l'animation du coldboot\n- [COBRA/XAI] Code optique pour activer l'avertissement d'épilepsie\n- [COBRA/XAI] Code optique pour activer l'animation et le son du gameboot\n- [COBRA/XAI] Opcode pour activer l'information sur les trophées cachés\n- [COBRA/XAI] Correction du gestionnaire de cibles pour DEX\n- [COBRA/XAI] Ajout du symbole cellUsb000_mount_symbol\n- [COBRA/XAI] Ajout des drapeaux usb_flag et no_cobra\n- [COBRA/XAI] Option pour faire basculer l'icône du disque PS2 (ISO/BIN.ENC) dans le XMB\n- [COBRA/XAI] Activation du titre/détail/icône des trophées cachés dans le XMB\n- [COBRA/XAI] Activation du titre/détail/icône du trophée caché INGAME\n \nTéléchargement : CFW 4.91.2 Evilnat PEX/D-PEX Beta 3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188845/in-ps3-cfw-4912-evilnat-pexd-pex-beta-3-disponible-1.jpg"
        }
    },
    "news_6": {
        "title": "[PS5] TheFlow confirme que son bug est corrigé à partir du firmware 2.06",
        "content": " \nLe développeur Andy Nguyen, connu sous le pseudonyme de TheFlow, vient d'annoncer avoir reporté à Sony son bug découvert sur le PlayStation Portal, dans l'objectif, comme vous vous en doutez de toucher une prime. \n \nSelon lui, son bug a été corrigé à partir du firmware 2.06, ce qui signifie que si vous souhaitez un jour profiter de nouvelles capacités de votre PlayStation Portal, de rester sur un firmware inférieur ou égal au 2.0.5.\n \n \n\n \n \nL'idée de ne plus mettre à jour la console n'est pas simple, afin de garder votre console sur le firmware vulnérable, et comme l'explique mbcrump, il suffit d'effectuer un arrêt sur le bouton du haut, de glisser vers la droite dès que le système d'exploitation démarre et de sélectionner le mode avion. Le PlayStation Portal sera alors bloqué en mode avion et aucune mise à jour ne sera lancé, empêchant ainsi toute mise à jour, une fois le shutdown passé, la seconde fois il ne sera plus nécessaire de faire cette manipulation. \n \n \n\n \n \nTheFlow a souhaité aussi répondre à ceux qui critiquent le fait qu'il reporte les bugs, il tient à rappeler qu'il ne faut pas oublier que s'il rapporte au public, Sony corrigera de toute manière, et que cela ne prendra que quelques semaines de plus. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188830/in-ps5-theflow-confirme-que-son-bug-est-corrige-a-partir-du-firmware-206-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1188830/in-ps5-theflow-confirme-que-son-bug-est-corrige-a-partir-du-firmware-206-3.jpg"
        }
    },
    "news_7": {
        "title": "[Switch] uLaunch 0.3.8 disponible",
        "content": "Le développeur XorTroll vient de proposer une nouvelle version de uLaunch, rappelons que uLaunch est la ré-implémentation personnalisée et open source de qlaunch (le menu HOME de la console Switch). Orienté homebrew, ULaunch est simplement une ré-implémentation complète, 100% open-source, qui reprend également l'applet eShop, le contrôle parental et le titre du système de flagellation (tous sont pratiquement inutiles avec cette ré-implémentation) pour sa fonctionnalité étendue.\n \nLe développeur annonce le support du firmware 18.0.0 et d'Atmosphere 1.7.0, sachant que la réécriture complète de uLaunch est en cours de finition.\n \n \n\n \n \n \nChangelog : \n \n- 0.3.8 - Mise à jour du support pour 18.0.0 / Atmosphère 1.7.0 Pre-release\n- Tout a été compilé avec les dernières bibliothèques, ce qui signifie un bon support d'Atmosphère 1.7.0 / système 18.0.0 entre autres choses\n- Gardez à l'esprit que ces versions mineures sont simplement des mises à jour de support, alors que la réécriture profonde de uLaunch est en cours d'achèvement.\n \n \nTéléchargement : uLaunch 0.3.8 \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188825/in-switch-ulaunch-038-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[2DS/3DS/NDS] TWiLight Menu++ v26.9.0 et nds-bootstrap v1.4.1",
        "content": "Le développeur RocketRobz proprose TWiLight Menu++ v26.9.0 et nds-bootstrap v1.4.1, ces versions corrigent quelques bugs et ajoutent le support du format .ntrb. \n \nTWiLightMenu++ est pour rappel est un menu alternatif, open source et personnalisable pour lancer des homebrews DS, jeux et roms DS, GBA, BD via la DS, 3DS ou 2DS.\n \n \n\n \n \n \nChangelog de TWiLight Menu++ v26.9.0 :\n \n- Ajout de la prise en charge du nouveau format .ntrb, créé par Skylark et @rvtr. Il est utilisé pour les applications ShaberuSoft, découvertes par eux + @Kaisaan dans NitroSDK.\n- Application de l'optimisation du temps de liaison afin d'éliminer le code inutilisé.\n- Les fichiers autoboot N5 ont été découverts pour fonctionner sur les linkers R4-PLUS.\n \n \nChangelog nds-bootstrap v1.4.1 :\n \n- Correction de la tentative de décompression d'un binaire arm9 déjà décompressé pour certaines ROM hacks, ce qui les empêchait de démarrer.\n \n \nTéléchargement : TWiLight Menu++ v26.9.0 et nds-bootstrap v1.4.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188797/in-2ds3dsnds-twilight-menu-v2690-et-nds-bootstrap-v141-1.jpg"
        }
    },
    "news_9": {
        "title": "[Multi] ScummVM 2.8.1 disponible",
        "content": " \nL'équipe en charge du développement de ScummVM propose une nouvelle version de leur logiciel. Cette mise à jour inclut des mises à niveau pour les moteurs suivants : AGI, AGS, GRIM, SWORD2, MM, mTropolis, NANCY, SCUMM, TWINE, Ultima et V. -Croisière.\n \nLes portages Android, Atari et macOS ont reçu plusieurs corrections de bugs, principalement pour améliorer la stabilité globale et éviter certains plantages que nous avons observés dans certaines circonstances.\n \n \n\n \n \n \nChangelog 2.8.1 (2024-03-31)\n \nGénéral:\n- Correction de l'analyse de la version GLSL sur certaines plates-formes OpenGL ES2.\n- N'essayez pas d'utiliser des shaders sur d'anciennes implémentations OpenGL.\n \nAGI :\n- Correction du freeze de Space Quest 1 version 1.0X dans le skimmer.\n- Correction des boîtes de message Mixed-Up Mother Goose pendant les comptines.\n- Correction des graphismes mélangés de Mother Goose dans la version Amiga.\n- Correction de l'heure de l'horloge de la ruée vers l'or aux vitesses les plus rapides et les plus rapides.\n- Correction de la version Atari ST de Manhunter 1 qui ne démarrait pas.\n- Correction de la version Tandy CoCo3 de Leisure Suit Larry 1 qui ne démarrait pas.\n- Correction des ports non officiels de Tandy CoCo3 qui ne démarraient pas.\n- Correction des menus Amiga dans Space Quest 1, Manhunter 1 et Manhunter 2.\n- Correction de Graham faisant face au roi dans King's Quest 1.\n- Correction d'Alexandre coincé dans les escaliers dans King's Quest 3.\n- Correction de Larry pouvant voler à l'étalage dans Leisure Suit Larry 1.\n- Correction des canards qui ne sautaient pas au début du terrain de jeu de Donald Duck.\n- Correction de la mort instantanée dans le jeu de fans \"Phil's Quest: The Search for Tolbaga\".\n- Correction du freeze des boutons dans le jeu de fans \"DG: The AGIMouse Adventure\".\n- Correction de mots non reconnus dans le jeu de fans \"V - The Graphical Adventure\".\n- Ajout de la détection pour la version Macintosh de Mixed-Up Mother Goose.\n \nAGS :\n- Tableaux de détection mis à jour.\n- Importation simplifiée de personnages depuis les jeux Sierra pour QfG2 AGDI.\n- Correction d'un problème graphique affectant Unavowed et Heroine's Quest.\n- Correction des contours partiels de certaines lettres dans Kathy Rain.\n- Correction d'un crash dans Alum.\n- Ajout d'un talon pour éviter un crash au début de Falcon City.\n \nBroken Sword 2 :\n- Correction d'un crash lors de la fermeture du jeu alors qu'il était en pause.\n \nMM :\n- Moteur activé, permettant de compiler MM1 et Xeen.\n- Ajout du support MT32/LAPC-1 pour le moteur Xeen.\n- Correction de la régression Xeen qui provoquait l'arrêt brusque de certains effets sonores.\n \nmTropolis :\n- Correction d'un crash dans Muppet Treasure Island sur certaines plates-formes.\n- Correction du puzzle de bijoux dans Muppet Treasure Island qui n'était pas randomisé.\n \nNANCY :\n- Correction des indices téléphoniques dans Secrets Can Kill.\n- Correction des problèmes de plantage et de dessin sur les machines ARM lors de la lecture du mini-jeu de labyrinthe de Message dans un manoir hanté.\n- Correction de la touche du clavier « M » qui ne fonctionnait pas dans Message dans un manoir hanté.\n- Autorisation d'afficher les keymaps générales dans le menu Keymaps du moteur.\n- Le clavier virtuel se déclenche désormais correctement lorsque la saisie de texte est nécessaire.\n \nSCUMM :\n- Correction de la corruption de l'écran (et parfois même des plantages) dans Mac Loom et - Indiana Jones and the Last Crusade, notamment lors de l'utilisation des touches de raccourci de menu.\n- Correction de l'activation/désactivation d'Ouvrir et de Sauvegarder dans Mac Indiana Jones et la Dernière Croisade.\n \nTWINE:\n- Correction de la régression de l'escalade de l'échelle.\n- Correction d'un problème de zoom de paysage.\n- Correction des problèmes d'animation après avoir utilisé l'holomape.\n \nUltima :\n- Correction de la mini-carte cachée d'Ultima VIII bloquant l'utilisation du porte-clés.\n- Correction des sauts de page Ultima VIII dans les livres.\n- Correction du centrage du texte Ultima VIII pour les plaques.\n- Correction du crash d'Ultima VIII lors du déplacement d'éléments vers le bord de l'écran.\n- Correction d'un saut inattendu d'Ultima VIII lors d'un clic gauche.\n- Correction de la caméra Ultima VIII pendant les cinématiques du Sanctuaire des Anciens.\n- Correction du placement invalide des éléments dans les conteneurs d'Ultima VIII.\n- Correction des sons de lave sans fin d'Ultima VIII.\n \nV-Cruise :\n- Correction d'un crash dans Reah : Face the Unknown et Schizm : Mysterious Journey lorsque la musique est coupée.\n \nPortage Android :\n- Correction d'un crash dans l'aide intégrée avec la langue allemande.\n \nPortage Atari :\n- Correction d'un crash lors de la sortie de ScummVM.\n- Correction du gameplay de BBVS (et éventuellement d'autres) en utilisant un modèle mathématique plus précis.\n \nPortage MacOS :\n- Correction d'un problème où certains jeux Mac ne chargeaient pas correctement les ressources.\n- Icône d'application mise à jour pour se conformer aux normes modernes.\n \n \nTéléchargement : ScummVM 2.8.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188790/in-multi-scummvm-281-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[Switch] MissionControl v0.11.0 disponible",
        "content": "Le développeur ndeadly vient de mettre à jour MissionControl qui est désormais proposé en v0.11.0, pour ceux qui le connaitrait pas c'est un module système personnalisé qui permet de profiter de contrôleurs Bluetooth tiers qui peuvent être utilisés de manière native sur la Switch, et tout cela sans dongle ni autre matériel externe.\n \nIl s'agit de la vingt-troisième version officielle de Mission Control, cette version ajoute la prise en charge du firmware 18.0.0, une nouvelle manette et des correctifs binaires permettant aux appareils Android fonctionnant avec Joycon-Droid de fonctionner avec le firmware 12.0.0+ sans avoir besoin d'un accès root.\n \n \n\n \n \nChangelog :\n \n- Ajout d'un support complet pour le firmware 18.0.0.\n- Ajout du support pour la manette SCUF Vantage 2.\n- Ajout de correctifs binaires pour permettre à Joycon-Droid de fonctionner sans accès root sur le firmware 12.0.0+.\n- Correction d'un problème où les valeurs de déclenchement analogiques étaient interverties pour la manette 8BitDo SN30 Pro Xbox Cloud Gaming Edition.\n \n \nTéléchargement : MissionControl v0.11.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188789/in-switch-missioncontrol-v0110-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[Wii] WiiMC-SS v3.0.0 - 2024 disponible",
        "content": "Alors que les services en ligne 3DS et Wii U seront définitivement interrompus le 09 Avril 2024 à 1h00, le jeu en ligne ne sera plus possible après ça, une nouveauté arrive pour la Nintendo Wii, il s'agit de la version 3.0.0 de WiiMC-SS, oui la version 2024.\n \nWiiMC-SS est un lecteur multimédia qui vous permet de lire quasiment tout sur la Nintendo Wii, que ce soit en format audio qu'en format vidéo, cette mise à jour a pour ambition d'inclure de nouveaux correctifs qui concerne la lecteur de contenu, mais aussi pour rectifié des bugs. \n \n \n\n \n\n \n \nChangelog :\n \n- Plus de corrections de lecture pour les contenus entrelacés.\n- Correction d'une erreur de la version précédente qui empêchait le chargement de ko.ttf.\n- A été renommée la structure du répertoire 7z en apps/wiimc/ certains utilisateurs l'ont gardé en apps/wiimc-ss/ causant des problèmes avec des chemins codés en dur.\n \n \n \nTéléchargement : WiiMC-SS v3.0.0 - 2024\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188761/in-wii-wiimc-ss-v300-2024-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1188761/in-wii-wiimc-ss-v300-2024-disponible-2.png"
        }
    },
    "news_12": {
        "title": "[Switch] Le dernier firmware de Mars pour le MigSwitch",
        "content": "Hier la team MigSwitch a dévoilé le tout dernier firmware à destination de leur solution, l'équipe en charge du développement de MigSwitch a en effet dévoilé le firmware 1.1.3. Comme nous le montre une nouvelle fois l'équipe, le support de ce linker est assuré, les mises à jour sont régulières. \n \n \n \n\n \n \n \nEncore une fois, cette mise à jour ne serait pas là sans l'appui des utilisateurs, les deux principales améliorations sont les suivantes :\n \n- Amélioration de la prise en charge du mode veille\n- Amélioration du démarrage de la carte microSD\n \n \nTéléchargement : Firmware 1.1.3 pour le MigSwitch\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188760/in-switch-le-dernier-firmware-de-mars-pour-le-migswitch-1.png"
        }
    },
    "news_13": {
        "title": "[PSP] La PSP Homebrew Dev Conférence 2024 samedi prochain",
        "content": "Samedi prochain, le 06 Avril, se tiendra la PSP Homebrew Dev Conférence 2024, la PSP fête ses 20 ans, il faut dire que la bestiole est sortie le 12 décembre 2004 sur le marché japonais.\n \n \n\n \n \nNos amis de Wololo.net nous informe que la PSPHDC, ou PSP Homebrew Dev Conférence, est un rassemblement durant lequel les développeurs d'homebrews pour la PSP dévoileront leurs programmes, et il y a déjà un programme qui est plutôt complet : \n \nProjet de traduction Kurohyou (équipe K4L) ; L'histoire derrière une traduction par des fans pour la série de jeux PSP Kurohyou\nProjet Aether Engine (IridescentRose); L'évolution de la conception du moteur de jeu vers un moteur de jeu multiplateforme spécialement conçu\nAuthentification TOTP4PSP (arcyleung); Un projet homebrew pour utiliser le matériel PSP comme générateur de jetons d'authentification hors ligne. Un aperçu rapide du processus de développement.\nARK-4 (Acid_Snake); Le dernier et le plus impressionnant CFW PSP \nSSL avec cURL (Bucanero); Obtenir un réseau TLS1.2 sécurisé sur PSP avec cURL + mbedTLS\nToolchain PSP (davidgf); Une présentation pas à pas de la toolchain PSP, des progrès, des mises à jour et de nouvelles perspectives passionnantes \nSDL2 (Wouter); Une discussion sur le portage de jeux sur PSP à l'aide de SDL et d'autres outils courants \n \n \n\n \n \nL'événement se tiendra ici : https://www.youtube.com/c/PSPHDC\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188749/in-psp-la-psp-homebrew-dev-conference-2024-samedi-prochain-1.jpg"
        }
    },
    "news_14": {
        "title": "[Switch] NeXT 3.10 avec support firmware 18.0.0",
        "content": " \nLe développeur espagnol vampitech est de retour avec une nouvelle version de son pack tout en un, NeXT, qui est proposé désormais en version 3.10 via codeber.org. Pour rappel NeXT est un pack qui supporte les CFW que ce soit Atmosphere ou SX OS, de plus sa gestion des applications est largement simplifiée par une interface utilisateur très fonctionnelle. \n \n \n\n \n \nPour le moment, NeXT 3.10 est proposé uniquement en espagnol, le support de l'anglais sera de retour dans une prochaine version, le développeur ayant à coeur d'apporter le support du firmware 18.0.0 et de mettre à jour quelques homebrews essentiels comme Atmosphere ou Hekate. \n \n \n \n\n \n \n \nChangelog 3.10 : \n \n- Support du firmware 18.0.0\n- Compatibilité totale avec les consoles Erista (2017-2019) et Mariko (v2 - Lite et Oled)\n- Atmosphere 1.7.0\n- Hekate 6.1.1\n- Sys-Patch 1.5.0\n- DBI 658\n \nD'autres mises à jour arriveront très vite, tout ce qui est contenu dans ce package a été testé avant publication afin de vérifier la compatibilité et la stabilité du TEU avec le firmware le plus récent disponible. Pourtant, tous les services et homebrews ne sont pas mis à jour par leurs développeurs au moment de chaque version de NeXT. \n \nTéléchargement : NeXT 3.10\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188740/in-switch-next-310-avec-support-firmware-1800-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1188740/in-switch-next-310-avec-support-firmware-1800-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS4] psOff v0.4 Bêta disponible",
        "content": "Voilà que débarque déjà une nouvelle version de psOff, l'émulateur PS4 qui semble vouloir s'extirper de l'ensemble des nombreux émulateurs de PS4. Développé par SysRay, mais aussi GamingDuck, VKokielov et igor725, psOff permet désormais d'exécuter Tomb Raider I-III Remastered suite à de nombreuses modifications. \n \n \n\n \n \nDe nombreux correctifs ont été appliqués, rectifiant des problèmes de saccades, mais aussi la taille de fenêtre, et cette version ajoute le support des fichiers de configuration, et la possibilité d'enregistrer des points de sauvegardes. \n \nPour rappel, et comme tous les émulateurs PS4, psOff exécute un bon nombre d'API et de systemcalls, mais il reste encore beaucoup à faire comme la prise en charge des tampons liés aux commandes, les boucles sur les shaders, et il manque les opcodes ou encore beaucoup de symboles. A noter que les utilisateurs nVidia ont toujours des problèmes graphiques. Le développeur principal annonce l'intention d'apporter beaucoup de correctifs pour la prochaine version.\n \n \n\n \n \nChangelog : \n \n- Correction du son saccadé   \n- Correction de la fenêtre est trop grande, à plus grande échelle. (Nécessite un nouveau émulateur.exe)\n- Support des fichiers de configuration\n- Autoriser la spécification du point de terminaison de journalisation\n--update pour le point de montage /app1/\n- Sonic est redevenu bleu\n- Redirection vers les journaux vers un fichier\n- Le trou noir fonctionne à nouveau\n- Plus de symboles, meilleure prise en charge des contrôleurs\n \n \nTéléchargement : psOff v0.4 Bêta \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188739/in-ps4-psoff-v04-beta-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1188739/in-ps4-psoff-v04-beta-disponible-2.png"
        }
    },
    "news_16": {
        "title": "[PS4] Nathan Martin propose de tester le CFW Evilnat 4.91.2 Beta 2 avec Cobra 8.5",
        "content": "Le développeur Nathan Martin vient de mettre en ligne son tout nouvel CFW en version Bêta 2, il y a un peu plus d'une semaine, le développeur dévoilait la première version Beta du CFW Evilnat 4.91.2, voilà donc la seconde version. \n \nLes utilisateurs de PS3 sensibles peuvent désormais tester ce CFW qui est l'un des derniers développé, il faut dire que Evilnat ne fait jamais les choses à moitié, et va jusqu'à offrir également les variantes [noBD] en PEX et D-PEX.\n \nChose étonnante le changement de version des fonctions Cobra qui passent désormais en v8.5, il faudra voir ce que cela cache. Il a aussi corrigé des écrans noirs, lors du lancement des ISO PS3/PSP/PSX ou encore un freeze lors de l'installation de PKG à partir d'un périphérique exFAT/NTFS externe. Il a aussi profiter de l'occasion pour faire évoluer Trophy Unlocker en v1.1.\n \n \n\n \n \n \nChangelog : \n \n- Cobra mis à jour vers 8.5\n- Correction de l'écran noir/du freeze lors du lancement des ISO PS3/PSP/PSX\n- Correction du freeze lors de l'installation de PKG à partir d'un périphérique exFAT/NTFS externe\n- Annulation du correctif qui causait des problèmes lors de la lecture de films BD\n- Mise à jour de Trophy Unlocker à la version 1.1\n- Création de variantes [noBD] pour PEX et D-PEX\n \n \nTéléchargement : CFW Evilnat 4.91.2 Beta 2 (avec fonctions Cobra 8.5)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188685/in-ps4-nathan-martin-propose-de-tester-le-cfw-evilnat-4912-beta-2-avec-cobra-85-1.jpg"
        }
    },
    "news_17": {
        "title": "[Switch] Hekate v6.1.1 &#38; Nyx v1.6.1 disponibles",
        "content": " \nUne bonne nouvelle n'arrivant que rarement seule, voilà que le développeur CTCaer dévoile lui une nouvelle version d'Hekate et de Nyx, on ne les présente plus, ils sont indispensables pour ceux qui disposent d'une Switch sensible. Bien entendu l'objectif reste toujours le même, apporter le support du dernier firmware 1.8.0 de Nintendo, mais aussi apporter avec lui aussi un lot de correctifs. \n \n \n\n \n \nChangelog hekate v6.1.1 :\n- Prise en charge du firmware 18.0.0\n- L'échec du démarrage de Stock en raison de problèmes pkg1 redémarrera désormais sur OFW si les conditions sont remplies (T210B01 ou pas d'autorcm pour T210)\n- Correction d'un problème avec l'effacement des compteurs du système\n- Modifications L4T et ARC :\n> La configuration avancée des timings de RAM (ram oc opt) est maintenant finalisée (consultez le site d'assistance pour le nouveau %)\n> Correction d'un problème avec les priorités de la banque de RAM (augmente les performances de 1 à 5 %, dépend de la plage d'utilisation)\n> Mise à l'échelle ajustée pour SDMMC1 et DDR200\n> T210 : Les fréquences transmises sont passées de 204/408/666/800/1600/OC à 204/408/800/1333/1600/OC\n \nChangelog emuMMC\n- Prise en charge du firmware 18.0.0\n- Comme toujours basé sur https://github.com/m4xw/emuMMC\n \nChangelog de Nyx v1.6.1\n- Prise en charge du firmware 18.0.0\n- Ajout un ID de clone d'écran OEM de 6,2 pouces\n- Ajout des détails à l'erreur imu cal (si eMMC/prodinfo est mutilé)\n \nChangelog de BDK\n- RTC : ajout de max77620_rtc_set_epoch_offset et max77620_rtc_get_time_adjusted pour définir le décalage horaire et obtenir une date/heure ajustée\n- CCPLEX : ajout du verrouillage vectoriel sans réinitialisation et de la mise sous tension du cluster\n- AFFICHAGE : ajout un panneau LCD clone de 6,2 pouces\n- SMMU : pilote de refactorisation\n- SMMU : prise en charge des PA 34 bits\n- SMMU : prise en charge du mappage de région de 4 Mo\n- SMMU : autorise la configuration de n'importe quel ASID\n- SMMU : corrige l'OP de charge utile, désactivez ccplex après avoir défini l'activation de smmu et supprimez le code redondant de n'importe où ailleurs\n- HEAP : ajout de zalloc (comme calloc mais ne prend qu'un seul argument de taille)\n \nComment mettre à jour :\n- Faites glisser et déposez bootloaderle dossier à la racine de la carte SD et cliquez sur Fusionner/Remplacer.\n- Pas besoin de supprimer ce dossier au préalable , surtout si vous voulez vos configurations et charges utiles.\n- Vous pouvez choisir de mettre à jour votre dispositif d'injection RCM ou votre PC avec le nouveau hekate_ctcaer_x.x.x.binou non.\n- Dans tous les cas, bootloader/update.bin, sera vérifié et s'il est plus récent, il sera chargé.\n- update.bin est hekate et il est déjà copié avec le bootloaderprocessus de mise à jour du dossier par glisser-déposer.\n \n \nTéléchargement : Hekate v6.1.1 et Nyx v1.6.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188684/in-switch-hekate-v611-nyx-v161-disponibles-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] Atmosphère 1.7.0 disponible avec support firmware 1.8.0",
        "content": "Le développeur SciresM est de retour du Japon, et nous propose donc la version adaptée d'Atmosphère au firmware 1.8.0, bien entendu il s'agit d'un version pré-release qui ne contient pas toutes les modifications que la version stable apportera dans son temps. \n \nCette version 1.7.0 d'Atmosphère est la soixante-dix-huitième version officielle d'Atmosphère, et comme toujours, le développeur tient à remercier l'équipe switchbrew, Atmosphère 1.7.0 étant fourni avec hbl 2.4.4 et hbmenu 3.6.0, ce qui va permettre de remplacer les versions non officielles qui ont été proposées. Cette version reste une pré-release, il est possible que vous rencontriez quelques bugs qui seront rectifiés d'ici l'itération \"finale\" de cette version 1.7.0.\n \n \n\n \n \n \nLes éléments suivants ont été modifiés depuis la dernière version (changelog) :\n \n- Le support de base a été ajouté pour le firmware 18.0.0.\n- La console devrait démarrer et l'atmosphère devrait être entièrement fonctionnelle. Cependant, tous les modules n'ont pas été entièrement mis à jour pour refléter les derniers changements.\n- Il ne devrait rien en résulter pour l'utilisateur, mais ce problème sera abordé dans une prochaine mise à jour d'Atmosphère, une fois que je ne serai plus autant en déplacement.\n- Exosphère a été mis à jour pour refléter le dernier comportement officiel du moniteur sécurisé.\n- Mesosphère a été mis à jour pour refléter le dernier comportement officiel du noyau.\n- spl a été mis à jour pour refléter le dernier comportement officiel.\n- Fusee ne prend plus en charge l'application des correctifs IPS aux KIPs.\n- Les seuls KIPs qui sont toujours présents sont a ) les modules atmosphère, b ) les modules système personnalisés, ou c ) FS.\n- Le sous-système IPS a été conçu à l'origine pour faire fonctionner les correctifs nogc pour FS, mais ceux-ci sont maintenant internes, et il semble que les seuls correctifs littéraux kip qui existent sont pour le piratage.\n- Je n'ai trouvé nulle part de patchs kip postés dans un autre but.\n- Il n'est pas logique de ralentir le démarrage de tous les utilisateurs normaux pour une fonctionnalité qui n'a pas d'utilité réelle, en particulier lorsque fusee cherche à être un bootloader minimal.\n- Des améliorations mineures ont été apportées à gdbstub d'Atmosphere, notamment :\n- Le support de QStartNoAckMode a été ajouté.\n- Un problème qui pouvait provoquer une erreur fatale lors de la création de trop nombreux points d'arrêt a été corrigé.\n- Un certain nombre de problèmes mineurs ont été corrigés et des améliorations ont été apportées, notamment :\n- pt-BR (PortugueseBr) est désormais accepté comme langue valide lors de la modification des paramètres locaux du jeu.\n- Un bug a été corrigé qui pouvait amener Atmosphere à sérialiser incorrectement les ID des objets de sortie sur IPC lors de l'utilisation d'objets de domaine.\n- Un bug a été corrigé dans la logique d'augmentation de la limite de ressources de pm qui pouvait potentiellement faire échouer des augmentations légitimes dans certaines circonstances.\n- loader/ro lancera désormais une erreur fatale lors de l'utilisation de patchs IPS invalides qui sortent des limites, au lieu de corrompre la mémoire.\n- La prise en charge a été corrigée pour le démarrage en utilisant une configuration de mémoire de la moitié de la mémoire réellement disponible (par exemple, forcer une configuration de 4 Go sur une carte de 8 Go).\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n \n \nTéléchargement : Atmosphère 1.7.0 Pre-release / fuse.bin\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188681/in-switch-atmosphere-170-disponible-avec-support-firmware-180-1.png"
        }
    },
    "news_19": {
        "title": "[PS4/PC] OrbisPro Beta v0.1 disponible",
        "content": "Le développeur SvenGDK vient de publier la toute première mouture de OrbisPro en version Bêta v0.1. Sous ce nom se cache un Media Center qui permet de lancer les jeux Windows le tout avec une interface très proche de celle de la PS4. \n \n \n\n \n\n \n\n \n\n \n\n \n \nIl fait une démonstration sur une Ally Rog d'Asus et le résultat est impressionnant. Une configuration rapide et un test de la nouvelle combinaison « Home Return » et de l'App Switcher. Les jeux seront désormais suspendus lors du retour à « Accueil » et reprendront lors du retour au jeu. Le deuxième bug de changement dans cette vidéo est déjà corrigé.\n \n \n \n\n \n \nExigences recommandées :\n \n- CPU : AMD Zen 2 / Intel Skylake avec 6 cœurs et 12 threads, 8 cœurs ou plus (x64, prise en charge AVX2)\n- GPU : AMD RX 400 / NVIDIA GTX 900 ou plus récent (avec prise en charge de l'API Vulkan)\n- Limitation d'affichage actuelle : résolution d'écran Full HD (1 920 x 1 080) avec mise à l'échelle de 100 %.\n- RAM : 8 Go de RAM double canal (2x4 Go)\n- Système d'exploitation : Windows 10 ou 11 x64\n \n \n \nModifications de configuration\n- Prise en charge de l'Asus ROG Ally\n- Configuration personnalisée\n- Actuellement bloqué lors de la première configuration (la vidéo ne démarre pas...), appuyez simplement sur le bouton A pour continuer\n- Prend en charge tous les boutons nécessaires -> Basculez le mode de contrôle sur « Gamepad » !\n- Appuyez sur le bouton « Options » pour ouvrir le sélecteur d'application.\n- Appuyez simultanément sur le bouton « Fenêtre » (Retour) + « Options » (Démarrer) pour simuler un bouton HOME\n- Modifications de configuration pour tous les autres appareils\n- Vérifie maintenant les mises à jour\n- OrbisPro redémarrera automatiquement lorsqu'une mise à jour est appliquée\n- Vérifie maintenant les jeux installés\n- Vérification rapide par défaut dans \"C:\\Program Files (x86)\" et \"C:\\Games\"\n- Plus de jeux peuvent être ajoutés manuellement par la suite\n- Vérifie maintenant les applications installées\n- Analyses des applications installées dans le registre (les applications portables sont exclues de cette analyse)\n- Plus d'applications peuvent être ajoutées manuellement par la suite\n- Les configurations de l'émulateur sont maintenant disponibles dans les paramètres\n- Personnaliser l'interface utilisateur d'OrbisPro\n- Définissez votre nom d'utilisateur\n- Définir le pack audio de navigation\n- Définir l'arrière-plan\n \nNouvelles fonctionnalités de base\n- Suspendre et reprendre un jeu ou une application en cours (comme sur les consoles de jeux)\n- Retourner à la maison\n- Revenez à l'écran d'accueil à partir de N'IMPORTE QUEL jeu ou application en cours d'exécution\n- Appuyez simultanément sur les boutons \"Retour/Partager\" ET \"Démarrer/Options\" (ou sur la touche HOME d'un clavier)\n- Sélecteur d'applications/fenêtres\n- Basculer entre les exécutables en cours d'exécution (comme le retour au jeu)\n- Tuez les processus en cours d'exécution qui ont une fenêtre active\n- Appuyez sur le bouton « Retour/Partager » (ou sur la touche « O » d'un clavier) pour ouvrir le Switcher.\n- Gestion Bluetooth\n- Rechercher des appareils Bluetooth\n- Associer/dissocier des appareils Bluetooth (prend en charge la saisie du code PIN)\n- Connecter/Déconnecter des appareils Bluetooth\n- Gestion du réseau Wi-Fi\n- Rechercher les réseaux WiFi disponibles\n- Connectez/déconnectez les réseaux WiFi sécurisés et ouverts (prend en charge la saisie du mot de passe)\n- Affiche l'état de connexion des réseaux WiFi\n- Ajout de la prise en charge de plusieurs manettes de jeu (pas encore activée dans la version 0.1)\n- Lecteur multimédia\n- Peut être démarré à partir de l'explorateur de fichiers\n- Utilise VLC (LibVLCSharp)\n- https://code.videolan.org/videolan/LibVLCSharp#features\n- Travail toujours en cours\n- La disposition des boutons de la manette de jeu change en fonction de la manette de jeu/de l'appareil connecté.\n- La disposition des boutons de la manette de jeu peut être définie manuellement dans les paramètres\n- Fenêtre de message système\n- Affiche des informations, des avertissements ou des erreurs d'OrbisPro\n \nNouveaux paramètres\n- Ajout de nouveaux paramètres :\n- Paramètres de gestion de compte ajoutés\n- Paramètres réseau ajoutés\n- Se connecter à Internet -> Active/Désactive la connexion Ethernet\n- Configurer la connexion Internet -> Utiliser pour les connexions Wi-Fi\n- Paramètres de notification ajoutés\n- Paramètres d'émulateur ajoutés\n- Activer/Désactiver l'animation d'arrière-plan\n- Activer/Désactiver la musique de fond\n- Activer/Désactiver l'animation de changement d'arrière-plan\n- Définir un arrière-plan personnalisé\n- Activer/Désactiver les notifications\n- Définir la durée de la notification (en secondes)\n- Activer/Désactiver la connexion Internet\n- Définir un chemin de téléchargement\n \nModifications des paramètres\n- Les paramètres ont été réorganisés\n- Correction de la sélection visuelle des éléments (la ligne sous l'élément sélectionné était toujours visible)\n- Correction de la resélection de l'élément précédent lors du retour aux paramètres précédents\n \nModifications de l'interface utilisateur\n- Les éléments du menu Accueil doivent désormais conserver leur position et leur taille\nCEPENDANT, ce n'est pas encore complètement corrigé car l'entrée de la manette de jeu pourrait réagir trop rapidement en dehors de l'animation en cours (si elle n'est pas ajustée). Cela entraîne un menu d’accueil foiré.\n- Appuyer trop rapidement sur les touches fléchées d'un clavier gâche également le menu Accueil.\n- Pour réinitialiser le menu Accueil, appuyez simplement sur les boutons L & R ensemble (actuellement absents dans la version 0.1) (appuyez sur F1 sur le clavier)\n- CORRIGÉ : Crash en essayant de passer à rien (très gauche/droite)\n- Ajout de quelques sons manquants\n- Ajout d'un nouvel arrière-plan animé PS2 Dots\n \nModifications de la bibliothèque de jeux et d'applications\n- Contrôles de bouton ajoutés (Fermer/Démarrer/Supprimer/Options)\n- Ajout du support de navigation pour la manette de jeu (manquait dans la version Alpha)\n- Les jeux et applications peuvent désormais être supprimés de la bibliothèque\n- Le menu \"Autres options\" permet UNIQUEMENT de démarrer le jeu/l'application sélectionné\n- L'organisation en dossiers sera ajoutée dans une prochaine version\n- \"Informations\" affichera plus d'informations sur le jeu/l'application sélectionné dans une prochaine version\n- \"Désinstaller\" lancera le programme de désinstallation du jeu/de l'application sélectionné dans une future version\n \nModifications de l'explorateur de fichiers\n- L'option \"Ajouter à la bibliothèque de jeux\" prend désormais en charge davantage de formats de fichiers\n- Sélectionnez le fichier .exe OU le fichier ROM du jeu\n- Ouvrez \"Plus d'options\"\n- Sélectionnez \"Ajouter à la bibliothèque de jeux\"\n- Ajout de l'option \"Ajouter à la bibliothèque d'applications\"\n- Ajout de « Play Media »\n- L'option \"Supprimer\" fonctionne désormais\n- Les répertoires seront supprimés de manière récursive.\n- AVERTISSEMENT : aucune boîte de dialogue de confirmation.\n- CORRIGÉ : crash lors de l'ouverture d'un dossier vide\n- CORRIGÉ : Revenir au dossier précédent à partir d'un dossier vide\n- Plus d'icônes d'extension de fichier ajoutées\n- Travail toujours en cours\n \nModifications de la configuration de l'émulateur\n- Certains émulateurs nécessitent une configuration supplémentaire pour exécuter des sauvegardes de jeux comme rpcs3 et vita3k.\n- OrbisPro ne fournit PAS de fichiers de firmwares mais vous aide à les télécharger et à les installer pour ces émulateurs.\n- Les fichiers BIOS pour d'autres émulateurs comme ePSXe et pcsx2 doivent être ajoutés manuellement pour le moment.\n- La manette de jeu est préconfigurée pour la plupart des émulateurs (disposition par défaut).\n- Si les commandes ne fonctionnent pas, vous devez ajuster les paramètres de la manette de jeu manuellement à l'aide de l'émulateur. (\\Système\\Émulateurs..)\n \n- La configuration de l'émulateur est disponible dans Paramètres -> Émulateurs -> Configurer les émulateurs.\n- Configuration pour PS3 (rpcs3)\n- Configuration pour PS Vita (vita3)\n- Nouveaux émulateurs pris en charge\n- Ajout de l'émulateur Fusion Sega (SG1000, SC3000, Master System, Game Gear, Genesis/Megadrive, SegaCD/MegaCD et 32X)\n- Ajout de l'émulateur Dolphin (GameCube et Wii)\n- ROM démarrables de l’émulateur Mednafen mises à jour\n \nAutres changements internes\n- Modification de l'option de compilation du projet \"Option Strict\" en \"On\".\n- Suppression des doublons de code, des éléments inutilisés et de certains commentaires\n- Modification de presque toutes les étiquettes en TextBlocks (en utilisant TextBlock.Text au lieu de Label.Content.ToString)\n- \"Settings.ini\" déplacé de \"\\Config\\Settings.ini\" vers \"\\System\\Settings.ini\"\n- Corrections de navigation au clavier (cela devrait éviter de focaliser le mauvais élément)\n- Empêche actuellement l'ouverture de plusieurs applications/jeux (nécessite un ajustement supplémentaire pour permettre le multitâche)\n- Une notification sera affichée si un exécutable est toujours en cours d'exécution\n- Utilise désormais SharpDX.XInput & SharpDX.DirectInput au lieu de XInput.Wrapper pour les manettes de jeu\n- Remplacement de ManagementEventWatcher par WNDPROC et DevBroadcastInterface\n- DevBroadcastInterface utilise WM_DEVICECHANGE pour détecter les modifications de périphérique et de volume\n- La plupart des animations s'exécutent désormais sur des threads séparés\n- La fenêtre Paramètres utilise désormais un seul ListView pour tous les paramètres au lieu de plusieurs\n- Lit maintenant les fichiers de configuration INI, JSON et YAML et les paramètres de l'émulateur stockés dans le registre\n- GameStarter mis à jour\n- Vérifier l'utilitaire de fichier ISO\n- DolphinJSON ajouté\n- Utilisé pour désérialiser/sérialiser la sortie DolphinTool\n- Ajout de ProcessUtils\n- Utilitaire de suspension/reprise du fil de discussion\n- Autres options de ThreadAccess\n- Ajout de l'entrée Orbis\n- Charge les manettes de jeu\n- Définit les propriétés de la manette de jeu\n- Définit le taux d'interrogation général de la manette de jeu\n- Ajout de structures Orbis\n- OrbisUtils ajouté\n- Vérificateur d'URL\n- Obtenir l'icône de l'exécutable\n- Divers utilitaires ListView\n- Asset Finder pour les jeux (applications bientôt)\n- Vérificateur de fréquence du moniteur\n- Afficher l'utilitaire de processus\n- Utilitaire Afficher/Masquer le clavier virtuel\n- Obtenir Hex à partir de l'utilitaire String\n- Ajout d'OrbisBluetooth\n- Gère les outils de ligne de commande Bluetooth\n- Obtenir des informations sur l'adaptateur Bluetooth\n- Configurer l'adaptateur Bluetooth\n- Découvrez les appareils et services\n- Associer/Dissocier des appareils\n- Ajout d'OrbisPowerUtils\n- Vérifie si l'appareil mobile\n- Obtenir des informations sur la batterie\n- Adaptateur réseau ajouté\n- Wrapper pour Win32_NetworkAdapter, créé à l'aide de \"mgmtclassgen Win32_NetworkAdapter /L CS -p NetworkAdapter.cs\"\n- Converti de C# en VB\n- Ajout du réseau Orbis\n- Activer/désactiver l'utilitaire WiFi\n- Obtenir l'utilitaire de SSID WiFi\n- Créer un utilitaire de profil WiFi sécurisé/ouvert\n- Obtenir l'utilitaire d'interfaces Ethernet\n- Activer/Désactiver l'utilitaire Ethernet\n \n \nTéléchargement : OrbisPro Bêta v0.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188647/in-ps4pc-orbispro-beta-v01-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1188647/in-ps4pc-orbispro-beta-v01-disponible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1188647/in-ps4pc-orbispro-beta-v01-disponible-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1188647/in-ps4pc-orbispro-beta-v01-disponible-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1188647/in-ps4pc-orbispro-beta-v01-disponible-5.png"
        }
    },
    "news_20": {
        "title": "[WiiU] Dumpling s'améliore face à Aroma",
        "content": " \nLe développeur Crementif propose une mise à jour de Dumpling, surtout pour le plugin Aroma, mais aussi pour corriger une police sur l'écran de démarrage. Cet homebrew Dumpling a été déployé à l'origine par emiyl pour la Nintendo Wii U, il s'agit d'un fork de l'outil FT2SD de dimok789.\n \nFT2SD (File Tree 2 SD) est un outil qui servait à dumper l'arborescence de fichiers SD, ce programme servait à exporter plusieurs chemins prédéfinis directement sur votre carte SD, comme par exemple le contenu disque d'un jeu contenu du disque, des mises à jour, les tickets, le contenu slc, contenu vWii, mcl ... Il a été conçu comme une alternative à l'époque à ddd il y a quelques années maintenant. \n \nDumpling est donc un dumpeur de fichier Wii U développé avec l'intention de rendre la mise en place de Cemu plus rapide et plus facile, ce a quoi il a clairement réussi avec le recul. \n \n \n\n \n \nQuand à la mise à jour proposée ici, elle a pour objectif de remettre l'outil à la page puisqu'il s'adapte surtout à Aroma.\n \nCaractéristiques :\n \n- Dumps de fichiers nécessaires pour le jeu en ligne Cemu\n- Vous devez vider otp.bin et seeprom.bin séparément avec wiiu-nanddumper\n- Suppression de l'application \"Friends List\" pour utilisation au Cemu\n- Créer des dumps de disques de jeux décryptés sans région\n- Dumps des jeux numériques, les mises à jour et les DLC du système ou du stockage USB\n- Sauvegardes de jeux à partir du système ou du stockage USB\n- Dumps de l'ensemble du nand décrypté (Cela peut prendre beaucoup de temps)\n \nChangelog : \n \n- Les utilisateurs d'Aroma se verront désormais demander s'ils souhaitent activer l'accès à la carte SD. Cela nécessite maintenant d'arrêter temporairement Aroma lorsque Dumpling est en cours d'exécution.\n- Cela permet d'éviter une corruption potentielle de la carte SD causée par Dumpling et Aroma qui accèdent simultanément à la carte SD.\n- Les clés USB sont toujours accessibles quelle que soit l'option choisie.\n- Correction du rendu des polices à l'écran de démarrage\n \n \nTéléchargement : Dumpling 2.7.1",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188623/in-wiiu-dumpling-sameliore-face-a-aroma-1.png"
        }
    }
}