{
    "news_1": {
        "title": "[PS5] Le lecteur optique et la PS5 slim décortiqués par Abkarino",
        "content": "Le développeur Abkarino que l'on connait bien pour PS4SysconTools ou encore quand il était membre de la Team Rebug, a désormais entre ses mains une PlayStation 5 Slim. \n \n \n\n \n \n\n \n\n \n \nIl s'agit d'une CIF-2000 A01 qui a pu être désossé, l'occasion pour nous de découvrir l'ensemble du PCB dans des photos intéressantes puisqu'il l'a démonté entièrement, et aussi de découvrir le lecteur optique lui aussi mis à nu, avec cache retiré et PCB apparent. \n \n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n \n \nTout est là : twitter.com/AbkarinoMHM\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-5.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-6.jpg",
            "image_7": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-7.jpg",
            "image_8": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-8.jpg",
            "image_9": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-9.jpg",
            "image_10": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-10.jpg",
            "image_11": "https://www.logic-sunrise.com/images/news/1182509/in-ps5-le-lecteur-optique-et-la-ps5-slim-decortiques-par-abkarino-11.jpg"
        }
    },
    "news_2": {
        "title": "[PS5] PS5 Wee Tools supporte désormais le modèle slim",
        "content": "Le développeur Andy_maN vient de mettre en ligne une nouvelle version de PS5 Wee Tools, comme vous le savez il s'agit d'un outil gratuit qui permet de réaliser sensiblement les mêmes choses que Nor Tool proposé par Better Way Electronics. \n \nIl s'agit d'un script python qui pour l'heure est assez limité dans son nombre d'options, il permet tout de même de connaitre les informations sur le dump de la NOR, comme le MD5, l'ID de la carte, le modèle, le SKU, la région, le numéro de série, l'id Kiban, le firmware actuel / minimum / usine, l'adresse MAC (LAN/Wifi) ou encore permet d'autres options pour activer/désactiver IDU (mode kiosque) et le type de modèle (avec lecteur optique ou numérique).\n \nCette version permet aussi bien entendu de réaliser des dumps, des extractions de partitions ou encore des contrôles basiques de validation, et cette nouvelle version apporte le support du modèle Slim. \n \n \n \n\n \n \n \nNouveautés :\n \n- Prise en charge du modèle Slim\n- Région #18 ajoutée\n- PS5 Nor dump info\n- Flags toggle : idu, modèle, slot actif\n- Pack/déballage du dump PS5\n- Validation de base\n- Navigateur de fichiers\n- Terminal (UART) avec surbrillance (win10+)\n- Comparaison des fichiers Multy\n- Emballer/déballer des fichiers 2BLS\n- Optimisation du code\n- Correction de bugs mineurs\n \n \nTéléchargement : PS5 Wee Tools 0.1.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182504/in-ps5-ps5-wee-tools-supporte-desormais-le-modele-slim-1.png"
        }
    },
    "news_3": {
        "title": "[Switch] DBI v633 disponible",
        "content": "Hormis une tendance très minimaliste exacerbée, DBI est apprécié pour ses fonctionnalités et une partie backend de Windows qui permet de faciliter les transferts. Avec cette nouvelle version, les jeux peuvent désormais être transférés d'une console à une autre via USB. De plus, les contrôles de mise à jour (en DBI) pour certains jeux peuvent être désactivés via la config.\n \nRashevskyv, le développeur de DBI propose la v633 de DBI (pour DB Installer) qui est un gestionnaire et installateur de fichiers NSP/NSZ/XCI et XCZ via SD, USB. Il fonctionne tout aussi bien en standalone ou bien en créant son propre serveur http local. Il permet aussi de gérer et supprimer les fichiers orphelins des tickets (mise à jours par exemple).\n \n \n\n \n \n \nAjout :\n \n- Transfert de captures d'écran via HTTP : Les utilisateurs peuvent désormais transférer des captures d'écran de leur appareil vers un PC en utilisant HTTP. Cette fonctionnalité est disponible sous l'option de menu Outils > Parcourir l'album via HTTP.\n- Options de configuration :\n- EnableNSZ=true : Permet l'installation de NSZ/XCZ en mode applet. Cette option désactive l'installation des fichiers NSZ/XCZ lorsque DBI fonctionne en mode applet. Elle garantit que les installations ne peuvent être effectuées qu'en mode titre, soit par l'intermédiaire d'un transitaire, soit par l'intermédiaire d'un jeu. Ce mode se caractérise par un fond noir dans l'application, ce qui élimine l'erreur due à l'insuffisance de mémoire lors du décompactage.\n- CreateLFS=true : Crée un dossier LFS (Large File Storage) dans /atmosphere/contents après l'installation du jeu.\n- Traduction en chinois traditionnel : Une nouvelle version de l'application, DBI_znch.nro, a été ajoutée pour prendre en charge le chinois traditionnel.\n \n \nTéléchargement : DBI v633\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182501/in-switch-dbi-v633-disponible-1.jpg"
        }
    },
    "news_4": {
        "title": "[PS4] PS4 Edit RCO v1.0.3 disponible",
        "content": "Le développeur Master-s propose une nouvelle version de PS4 Edit RCO, qui prend la forme de CXMLDecompilerRCO_1.0.3, et qui vous permet de modifier facilement le fichier RCO de votre PS4. \n \n \n\n \n\n \n \nAvec ce programme, vous allez pouvoir éditer 3 fichiers : \n \n- TopMenu.rco\n- Notification.rco\n- Settings.PkgInstaller.rco\n \net ainsi apporter une personnalisation aux arrières plans, aux notifications et à certains paramètres du XMB et d'installation de PKG de la PS4 comme le montre le développeur. \n \n \n \n\n \n \n \nTéléchargement : CXMLDecompilerRCO_1.0.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182476/in-ps4-ps4-edit-rco-v103-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1182476/in-ps4-ps4-edit-rco-v103-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[Vita] Apollo Save Tool v1.2.8 disponible",
        "content": "Le développeur Damian Parrino, alias Bucanero, nous informe de la disponibilité d'une nouvelle version d'Apollo Save Tool pour la PlayStation Vita, proposé en version 1.2.8, cette mouture apporte de nombreuses nouveautés. \n \nCela faisait un bon moment que nous n'avions pas eu droit à une mise à jour la dernière avait été proposée le 12 Avril 2023, les changements sont donc nombreux au fil des versions PS4 et PSP.\n \nPour rappel, il s'agit d'une application qui vous permet de gérer les fichiers de sauvegarde de jeu sur PlayStation Vita et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur la PlayStation Vita. \n \n \n \n\n \n \n \nChangelog 1.2.8 : \n \nAjouts : \n- Détection automatique des paramètres des boutons X/O\n- Compression des fichiers .ISO en .CSO\n- Décompression des fichiers .CSO en .ISO\n- Ajout d'une base de données de clés de sauvegarde pour les jeux PSP\n- Nouveaux cheat codes Vita :  Odin Sphere Leifthrasir (PCSE00899, PCSB00986)\n- Nouveaux cheat codes PSP : BlazBlue : Continuum Shift II (ULUS10579, ULES01526), Persona (ULUS10432), Monster Hunter Freedom Unite (ULES01213, ULUS10391), Monster Hunter Portable 2nd G (ULJM05500)\n- Prise en charge du décryptage personnalisé : Patapon 3 (UCUS98751, UCES01421), Monster Hunter Freedom Unite (ULES01213, ULUS10391), Monster Hunter Portable 2e G (ULJM05500), Monster Hunter Portable 3 (ULJM05800)\n- Nouveaux correctifs de déverrouillage de copie pour PSP : InviZimals : Shadow Zone (UCES01411, UCES01581, UCUS98760), InviZimals : The Lost Tribes (UCES01525), SOCOM : Fire Team Bravo 2 (UCUS98645)\n- Prise en charge des checksum personnalisées : InviZimals : Shadow Zone (UCES01411, UCES01581, UCUS98760) , InviZimals : Les Tribus Perdues (UCES01525), Monster Hunter Freedom Unite (ULES01213, ULUS10391), Monster Hunter Portable 2nd G (ULJM05500), Monster Hunter Portable 3 (ULJM05800)\n \nCorrections : \n- Correction de l'installation du plugin Key dumper pour les sauvegardes PSP\n \nDivers :\n- Prise en charge des paramètres de proxy HTTP réseau\n- Mise à jour du moteur de patch apollo-lib en v0.6.0\n- Ajout de rappels d'hôtes (nom d'utilisateur, mac wlan, psid, id de compte)\n- Ajout des fonctions de hash murmu3_32 et jhash\n- Ajout du décryptage de Patapon 3 PSP\n- Ajout du décryptage de MGS5 (PS3/PS4)\n- Ajout du décryptage de Monster Hunter 2G/3rd PSP\n- Ajout de la checksum de Castlevania:LoS\n- Ajout de la checksum de Rockstar\n- Correction de SaveWizard Code Type C\n- Correction de right() sur les plateformes little-endian\n \n \nTéléchargement : Apollo Save Tool v1.2.8 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182472/in-vita-apollo-save-tool-v128-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[PS5] Un pilote PSVR2 nommé iVRy bientôt disponible pour PC et Steam VR",
        "content": "Comme vous le savez, le casque PlayStation VR 2 n'est officiellement compatible qu'avec la PlayStation 5, et il semble même plus fermé que la première version car il semble entièrement lié à un format prioritaire et au format USB Type-C, ce qui fait qu'il attire forcément les développeurs qui souhaitent élargir sa compatibilité avec d'autres périphériques. \n \nUn prix accessible par rapport aux autres casques sur le marché, avec des spécifications techniques intéressantes pour cette gamme, et nous comprenons aisément que certains ont travaillé le sujet comme cela avait été le cas sur la première génération.\n \n \n\n \n \nL'équipe iVRy, déjà à l'origine d'un pilote pour le PSVR1, vient de mettre en ligne une solution de replis pour le PSVR2, entendez par là qu'elle propose un pilote permettant aux utilisateurs d'utiliser un iphone, un périphérique Android, GearVR, Oculus Mobile ou encore le casque PSVR 2 à la fois sur PC et sur SteamVR. \n \n \n\n \n \n \nIl y a tout de même quelques limites, à savoir que la solution n'est compatible qu'avec un GPU AMD RDNA2+, et qu'elle nécessite un dongle et même un port VirtualLink via un adaptateur BizLink, cela commence à faire beaucoup mais il n'est pas perdu d'étendre la compatibilité avec les GPU nVidia d'ici quelques mois, l'équipe parle de jusqu'à 6 mois de développement nécessaire. \n \nConcernant les limites, le PSVR2 ne fournit que des informations nécessaires au mode cinéma, et il s'appuie sur la PS5 pour ses caractéristiques d'affichage, lorsque la PS5 n'est plus présente il faut venir élargir la communication avec un périphérique intermédiaire qui va faire le relai. Des limites spécifiques au PSVR2 qui bloque la proposition de la Team iVRy, et la rend forcément peu accessible. \n \n \nTout est là prochainement : iVRy_Driver_for_SteamVR_PSVR2_Premium_Edition\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182470/in-ps5-un-pilote-psvr2-nomme-ivry-bientot-disponible-pour-pc-et-steam-vr-1.png"
        }
    },
    "news_7": {
        "title": "[PS5] PS5 Backup Payload disponible",
        "content": "Le développeur Jeroendev-one propose un nouveau payload qui se nomme PS5 Backup Payload. \n \nUtilisez ce payload pour sauvegarder les fichiers app.db et appinfo.db, si vos jeux externes ont disparu, vous pouvez les restaurer via FTP pour les remettre sur votre écran d'accueil.\n \n \n \n \n\n \n \n \n \nEn fait le payload permet de sauvegarder les données du répertoire /system_data/priv/mms sur la clé USB, et ainsi de restaurer certains fPKG qui seraient toujours présent sur un disque dur externe, mais non visibles à l'écran après une reconstruction forcée de base de données. A noter d'ailleurs que les jeux installés en interne seront perdus lors d'une reconstruction.\n \n \nTéléchargement : ps5-db-backup\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182466/in-ps5-ps5-backup-payload-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[PS4] PS4 Kernel BTTF v1.00 disponible",
        "content": "Le développeur Lapy vient de dévoiler au téléchargement un nouvel utilitaire nommé PS4 Kernel BTTF qui permet de régler la date et l'heure de l'horloge interne de la PS4. Comme vous pouvez le voir, le thème a été largement inspiré de Retour vers le futur, et du tableu de bord de la DeLorean de Marty McFly.\n \nPour le moment, il faudra disposer d'un firmware inférieur à la 9.00, son mode de fonctionnement est similaire à celui du payload ReactPSPlus, renommé Kernel Clock est qui permet de réinitialiser l'horloge interne de la PS4 à 2013.\n \n \n\n \n \nA quoi cela sert ? Cela pourrait être efficace dans le cadre du C-BOMB, qui pourrait rendre inutilisable votre console si sa batterie tombe en panne et que vous ne parvenez plus à vous connecter au PSN.\n \n \nTéléchargement : PS4 Kernel BTTF v1.00\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182440/in-ps4-ps4-kernel-bttf-v100-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[Switch] Haku33 et SaltyNX se mettent à jour",
        "content": "Les développeurs de Haku33 et SaltyNX ont mis à jour leur proposition, le premier a été corrigé pour fonctionner parfaitement avec le firmware 17.0.0, tandis que le second a été corrigé pour éviter d'importantes corruptions. \n \nRappelons que Haku33 est une application homebrew livrée sous format NRO qui va vous permettre de nettoyer votre NAND sous Nintendo Switch. Ecrit en C++, ce programme open source a pour fonction d'éliminer les fichiers critiques de la console pour effectuer une réinitialisation matérielle de la console, ne laissant que l'essentiel pour démarrer. L'utilisation de cet outil n'est pas sans risque, il est donc fortement conseillé de sauvegarder sa nand avant son utilisation.\n \n \n\n \n \nLe plugin SaltyNX quand à lui facilite la gestion du processus qui nous permet d'envoyer des commandes en arrière-plan pour éditer des fichiers et du code sous Nintendo Switch.  \n \n \nHaku33 : \n \n-  Correctif pour le firmware 17.0.0\n \n \nSaltyNX 0.7.1 :\n \n- Appliquer une solution de hack pour les importations qui ne fonctionnent pas dans les jeux commerciaux en utilisant RELR.\n- Réduire la taille du core de moitié\n \n \n \nTéléchargement : SaltyNX / Haku33\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182437/in-switch-haku33-et-saltynx-se-mettent-a-jour-1.jpg"
        }
    },
    "news_10": {
        "title": "[Switch] Status Monitor Overlay 1.0.1 disponible",
        "content": "Le développeur masagrator a déployé une grosse mise à jour de son outil Status Monitor Overlay pour la Nintendo Switch. Comme son nom l'indique il s'agit d'un overlay Tesla permettant sous Atmosphere de surveiller le statut et la charge des différents composants de la Switch.\n \nL'application permet de surveiller la console Switch pendant le jeu en cours en affichant la fréquence du CPU, du GPU et de la RAM, ainsi que la température et le niveau de rotation du ventilateur. L'outil propose à ce titre six modes (profils) différents à choisir dans le menu principal, Complet , Mini , Micro , Compteur FPS , Batterie et Divers.\n \nLa mise à jour ajoute un fichier expérimental de configuration qui vous permettra de modifier la combinaison de touches, des interfaces utilisateurs, de gérer vos FPS, les taux de rafraîchissement et plus encore. \n \n \n\n \n \n \n \nChangelog : \n \n- Autoriser le masquage des fréquences réelles, des deltas et des fréquences cibles en mode complet (les deltas ne sont pas affichés si les fréquences réelles et cibles sont masquées).\n \n- Cette version comprend également 2 mises à jour fantômes pour la version 1.0.0, qui incluent des correctifs pour le débordement des fréquences réelles + deltas, ainsi que des calculs de positionnement de la RAM corrigés dans les modes Micro et Mini.\n \nBugs corrigés :\n \n- Les températures des PCB et des SoC ont été inversées dans la version 0.9.2.\n- Parfois, la sortie du mode entraînait la sortie de la superposition\n- Introduction d'un fichier de configuration expérimental, qui permet de modifier la combinaison de boutons de sortie, les interfaces utilisateur Mini + Micro + FPS Counter + FPS Graph, les taux de rafraîchissement. Plus d'explications ici .\n- Les combinaisons de boutons sont lues à partir de 3 fichiers de configuration différents, le plus important étant la configuration du moniteur d'état, la configuration suivante utilisée par la superposition Ultrahand et la dernière configuration pour le menu Tesla.\n- Le bouton combo par défaut est désormais L + D-PAD Down + R Stick. Si quelqu'un souhaite ramener l'ancien combo, utilisez le fichier de configuration status-monitor.\n- Autoriser la lecture des fréquences réelles du module sys-clk 2.0.0_rc4+, s'il n'est pas installé, les fréquences affichées en modes Mini et Micro retombent sur les fréquences cibles\n- Autoriser la lecture de la charge RAM depuis sys-clk 2.0.0_rc4+\n- Supprimer l'option pour modifier le taux de rafraîchissement avec la combinaison de boutons\n- Supprimer l'option pour changer la position des modes Mini et FPS Counter avec la combinaison de boutons\n- Afficher les icônes de boutons appropriées en mode complet (seules les exceptions sont générales UP, et parce qu'elles incluent à la fois les Sticks et le D-Pad)DOWNLEFTRIGHT\n- Correction des calculs de positionnement de la RAM en modes Micro et Mini lorsque sys-clk ne fonctionne pas.\n- Correction des fréquences réelles et des deltas débordant au-dessus de INT32_MAX\n \n \nTéléchargement : Status Monitor Overlay 1.0.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182419/in-switch-status-monitor-overlay-101-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[PS4] L'émulateur fpPS4 a fait d'énormes progrès",
        "content": "Déjà presque la moitié du mois de Novembre, que le temps passe vite, l'occasion pour nous de reparler un peu de l'émulation PS4, au travers de l'un des émulateurs qui semble sur la bonne voie. Régulièrement mis à jour par son développeur principal Red-Prig, l'émulateur fpPS4 a fait des progrès importants notamment avec l'arrivée de l'émulation de la partie sonore. \n \n \n\n \n \n \nA date, l'émulateur revendique pouvoir démarrer 92 jeux PS4, contre 81 précédemment, même si l'émulation jouable n'est pas encore là, la liste de compatibilité se trouve ici : \nhttps://github.com/red-prig/fpps4-game-compatibility/issues\n \nSur ces 92 jeux, 64 sont des jeux commerciaux, et 28 sont des homebrews, les meilleures émulations se font sur Sonic Mania, Super Meat Boy, ou encore Undertale.\n \n \n \n\n \n\n \n \n \nLa partie sonore de BloodBorne. \n \n \nTout est là : \n \nhttps://github.com/red-prig/fpPS4/actions\n \nSi vous voulez supporter le développeur c'est par ici : https://boosty.to/fpps4\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-782698320.png"
        }
    },
    "news_12": {
        "title": "[WiiU] GamePad Auto Standby v0.5 disponible",
        "content": "Le développeur Lynx64 propose la mise à jour de son plugin GamePad Auto Standby, il s'agit d'un plugin pour la Nintendo Wii U et qui permet au GamePad d'entrer automatiquement en mode veille ou de s'éteindre lorsqu'il est laissé inactif pendant une durée configurable, comme n'importe quelle autre manette.\n \n \n \n\n \n \n \n \n \nPour en profiter : \n \n- Allumer le GamePad à distance depuis le menu de configuration du plugin (il doit évidemment être à portée).\n \n- Lancer les forwarders .wuhb vWii sur la TV uniquement au lieu des deux écrans.\n \n \nChangelog v0.5 :\n \n- Ajout d'une option pour garder le GamePad allumé lorsqu'il est en charge ou branché.\n- Ajout d'une option pour éteindre le GamePad au démarrage.\n- Il ne s'éteindra pas s'il a été utilisé pour allumer la console.\n \n \nTéléchargement : GamePad Auto Standby v0.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182351/in-wiiu-gamepad-auto-standby-v05-disponible-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS5] Le premier unboxing de la PlayStation Portal en vidéo",
        "content": "Un influenceur espagnol répondant au doux nom d'Alberto Lloret nous propose au travers de son site internet Hobbyconsolas où il a même publié un article ici.\n \n \n\n \n \nComme vous le savez, il s'agit d'une tablette à laquelle sont venues se greffer une dualsense coupée en deux de chaque côté et qui permet de jouer à distance avec une PS5 qui reste obligatoire. \n \nPour des raisons de respect de l'embargo, il n'est pas possible de montrer la console en fonctionnement avec l'écran allumé, c'est bien dommage. Nous pouvons cependant voir que l'écran 8 pouces (avec une résolution de 1080p et un taux de rafraîchissement de 60 Hz) est plus grand que la Steam Deck, mais la PlayStation Portal reste légère.\n \n \n \n\n \n \n \nAu travers de cette vidéo nous pouvons découvrir les boutons de fonctionnement, celui qui permet d'allumer la console, un PS Link, un contrôleur de volume, permettant d'accoupler un accessoire de type Pulse ou des écouteurs sans fil. \n \nSur le dessous de l'écran est présent un USB-C permettant de recharger la bête (entre 7 et 9 heures d'autonomie) et un port AUX pour les écouteurs filaires. \n \nReste à voir si la PlayStation Portal, comme le PSVR2, restera un gadget ou si Sony ou les éditeurs se pencheront réellement sur le hardware pour proposer du spécifique dessus. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182317/in-ps5-le-premier-unboxing-de-la-playstation-portal-en-video-1.png"
        }
    },
    "news_14": {
        "title": "[Wii] WiiSX / CubeSX Beta 4.1 disponible",
        "content": " \nLe développeur Emukidid nous propose depuis quelques heures de découvrir une nouvelle version Bêta 4.1 de WiiSX et la version Gamecube, CubeSX.\n \nPour rappel WiiSX est un émulateur PlayStation One qui tourne sous la console Nintendo Wii. WiiSX est la version Wii de l’émulateur pcsx développé lui pour Windows. Il permet de jouer sur Nintendo Wii (et sur gamecube également) aux isos Playstation.\n \nCette version apporte pas mal de corrections comme la correction du changement de BIOS lorsque les fichiers sont sur un périphérique USB. Une option de suppression du scintillement a été ajoutée et les paramètres ont été fondamentalement révisés : les paramètres obsolètes ont été supprimés et ceux-ci sont désormais correctement enregistrés. De plus, certains problèmes de compatibilité ont été à nouveau résolus - plus de détails dans le changelog. \n \n \n \n\n \n \n \n \nChangelog : \n \n- GC : Support de GCLoader\n- GC : Support de SD2SP2\n- Wii : Correction du changement de BIOS lors de l'utilisation de l'USB\n- Wii : Correction de la configuration USB uniquement avec DOL chargé à distance\n- Ajout d'une option deflicker (ne fait rien pour les modes vidéo progressifs)\n- unai : Utilisation du format 8.8 RGB triplet pour l'ombrage gouraud\n- Réécriture du code de l'écran des paramètres (correction des problèmes de sauvegarde/chargement/application des paramètres, suppression des paramètres obsolètes)\n- Correction de l'échange de disques\n- Prise en charge du réglage de la position de l'écran (corrige l'intro de Spyro 2)\n- Réinitialisation de la table d'échange avant de convertir la texture (corrige l'écran d'accueil de MediEvil et d'autres)\n- Set Config.GpuListWalking = -1 (corrige les éléments de menu invisibles dans Crash Bash.)\n- Activer la réverbération par défaut\n- Utiliser la taille minimale du fifo GX\n \nListe de compatibilité ici : Compatibility\n \n \nTéléchargement : WiiSX Bêta 4.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182299/in-wii-wiisx-cubesx-beta-41-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS5] Sony dévoile un nouveau firmware officiel pour la PS5",
        "content": "Le géant japonais vient de publier une nouvelle mise à jour pour la PS5, la firme vient en effet de dévoiler le firmware 23.02-08.20.02.06 et pèse 851 Mo. Comme vous le savez, il y a des versions majeures des firmwares qui amènent de nouvelles options ou des améliorations visuelles ou de concept, mais aussi des mises à jour qui ne visent qu'à corriger des bugs ou des failles.\n \n \n \n\n \n \n \n \nC'est souvent le changelog qui nous permet de savoir ce qu'apporte réellement la mise à jour, et bien sachez que cette version 23.02-08.20.02.06 améliore les performances système. Il ne faut pas longtemps pour comprendre que cette version vient corriger des bugs, ou bien des failles. \n \nSi vous le pouvez, il est préférable de rester sur le firmware le plus bas possible. \n \nCette mise à jour est une version stealth de la 8.20 : https://twitter.com/FwPs5/status/1722181368917229936\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182295/in-ps5-sony-devoile-un-nouveau-firmware-officiel-pour-la-ps5-1.png"
        }
    },
    "news_16": {
        "title": "[Switch/PC/Android] Nouvelle version disponible de NooDS (rolling release)",
        "content": "Le développeur Hydr8gon vient de sortir une nouvelle version de son émulateur NooDS\nL'objectif de NooDS est d'être un émulateur Nintendo DS rapide et portable. Ce n'est pas tout à fait là en terme de vitesse, mais il offre la plupart des autres fonctionnalités que vous pouvez attendre d'un émulateur DS. Il prend même en charge la rétrocompatibilité GBA ! Je fais ça pour le plaisir et comme expérience d'apprentissage, et aussi parce que je suis un grand fan de la DS. Ce n'est peut-être pas encore un concurrent digne des autres émulateurs DS, mais je pense que je pourrai y arriver un jour. Sinon c'est bien aussi ; comme je l'ai dit, je m'amuse juste !\n \nCe projet n'a donc pas de changelog à chaque mis à jour, mais au bout de plusieurs versions consécutives des nouvelles seront données pour rappeler l'existence du projet et ainsi pousser les utilisateurs à tester ce dernier et faire des retours au développeur.\n \nLes dernières modifications : \n- Android : fournir le correctif utilisé pour les builds de Google Play\n- Android : correction d'un crash potentiel en mode GBA\n- Android : ajout d'une vibration de contrôle à l'écran et des paramètre de mise en page\n- Android : ajout d'un dialogue d'information pour les builds Play Store\n- Android : correction de bogues de stockage + obtenir le code de la version à partir de git\n- Implémentation du BIOS GBA HLE\nNooDS est disponible pour Linux, macOS, Windows, Switch, Vita et Android. Les builds automatiques sont fournis via GitHub Actions ; vous pouvez les télécharger à partir de la page des versions\n",
        "images": {
            "image_1": "https://d1eh9yux7w8iql.cloudfront.net/product_images/1525772372.19.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] GameBato se met à jour via un patch",
        "content": "Sans aller jusqu'à proposer une mise à jour de la version actuelle, à savoir la version 1.24, les développeurs de GameBato ont décidé de proposer une update sous forme de patch.\n \nComme vous le savez GameBato est un store compatible avec les firmwares 5.05, 7.55 et 9.00 de la PlayStation 4 et qui permet de profiter pleinement des capacités de la console. \n \nLes changements sans être révolutionnaires restent intéressants pour les utilisateurs, tout en sachant que d'autres bugs sont toujours présents et qu'ils seront rectifiés dans les prochains jours. \n \n\n \n \nPatch de mise à jour !\n \nChangelog :\n \n- Correction du blocage de l'écran de mise à jour de l'application GameBaTo. Si l'utilisateur a un problème de connexion réseau, l'application affiche une erreur de connexion réseau et quitte l'application pour que l'utilisateur puisse la relancer afin de lancer le processus de mise à jour.\n- Correction du blocage de l'écran Loading Graphic Metadata (chargement des métadonnées graphiques).\n- Correction d'un conflit d'images qui provoquait le rendu de plusieurs images à des coordonnées non souhaitées sur l'écran.\n- Les bogues restants seront corrigés et patchés au fur et à mesure de leur résolution.\n \n \n- Pour bénéficier de toutes les fonctionnalités de cette version, les utilisateurs sont invités à télécharger à nouveau le fichier de l'application (.pkg) à partir des sources officielles et à le réinstaller. Ceci n'est pas obligatoire mais recommandé.\n- Official GameBaTo Application Package Direct Download Link : http://gamebatoapp.ir/home/app.pkg\n \nA noter qu'à l'heure où nous écrivons ces lignes, le site internet est inaccessible. \n \n \nTéléchargement : gamebatoapp.ir\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182280/in-ps4-gamebato-se-met-a-jour-via-un-patch-1.png"
        }
    },
    "news_18": {
        "title": "[2DS/3DS] 3DS Homebrew Menu v2.4.2 disponible",
        "content": "Le développeur anglais Dave Murohy, répondant au pseudonyme de WinterMute, propose la mise à jour du 3DS Homebrew Menu d'habitude supporté par le développeur fincs. WinterMute a donc mis à jour l'Homebrew Launcher (hbmenu), le gestionnaire développé à l'origine il y a maintenant quelques années par Smealum. Ces mises à jour sont le bienvenue compte tenu qu'elles arrivent une à deux fois par an.\n \nNous parlons ici du Homebrew Launcher qui permet de lancer les homebrews au format 3DSX. Pour rappel, pour le lancer il faut soit un point d'entrée désormais d'un autre âge comme Ninjhax, hax 2.x ou soit Rosalina. \n \n \n\n \n \n \nCette version 2.4.2 apporte les changements suivants : \n \n- Reconstruit avec les dernières librairies\n- Correction du chemin de configuration à config/3ds-hbmenu\n- Ajout d'un paquet avec config/ssl/cacert.pem pour libcurl\n \n \nTéléchargement : 3DS Homebrew Menu v2.4.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182279/in-2ds3ds-3ds-homebrew-menu-v241-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] Les premiers backups PS5 qui se lancent sur PS5 sont des démos",
        "content": "Pour la première fois et après un travail incroyable de LightningMods, voilà le lancement du premier backup PS5. \n \nLe titre PPSA03527 est jouable et peut donc être lancé sans avoir à ajouter de support de fPKG. \n \nComme nous pouvons le voir, le développeur lance PPSA03527 : Grand Theft Auto III – The Definitive Edition sur sa PS5 via ItemzFlow, mais surtout ce que l'on peut voir c'est qu'il utilise la version Beta 1.2 de etaHEN qui n'est pas encore sortie.\n \nLe firmware utilisé est le firmware 4.03.\n \n \n \n\n \n\n \n\n \n \n \n \nAu delà de cela, il a fait tourner également la démo Matrix, qui nécessite un crack, ou encore la démo d'abandonned, là encore il faut disposer d'un dump pour pouvoir la lancer. Il lance aussi la démo Maiden (la démo de Résident Evil Village).\n \nIl semblerait donc que ce sont les démos PSN dumpés qui fonctionneraient, celles qui ne nécessitent pas de licence, ou plutôt qui disposent de licence libre, donc pour le moment pas de jeu physique ni de jeux disposant d'une licence, et pas de fPKG. \n \nLes dumps qui tournent ce sont ceux sans DRM qui sont en obtenu via FTP, grâce au payload de Specter (app0 + eboot + modules + meta fichiers). \n \n \nTout est là : twitter.com/LightningMods_\n \n \n \n \n",
        "images": {}
    },
    "news_20": {
        "title": "[PS5] Les jeux Sega Saturn s'invitent sur PS5",
        "content": "Depuis le hack de Sleir permettant de lancer les FPKG PS4, nous avons vu la plus part des homebrews de cette dernière être adapté pour PS5. La grande majorité fonctionnent de base sur PS5, d'autres ont besoin d' être adaptés et d' autres ne fonctionnent tous simplement pas.\n \n\n \nC est le cas pour les jeux SEGA Saturn, impossible de les exécuter comme sur PS4, les FPKG donnent une erreur directement après leur lancement.\n \nMais ceci c'était avant, en effet, il est maintenant possible d’exécuter les jeux SEGA Saturn sur PS5, sous certaines conditions et malheureusement pas sur toutes les PS5.\nIl suffit de modifier le fichier nptitle.dat présent dans Sce_sys/ et d' y ajouter le \"CUSA\" de votre jeu pour que le FPKG PS4 soit compatible PS5 (pas de panique mon script le patch automatiquement ^^)\n \n\n \nJ'ai publié ce week end une première version de mon outil Saturn2PS4 v1.2 avec ajout du support PS5, fonctionnant parfaitement sur ma console mais bizarrement, pas sur d'autres PS5, cela donne une erreur au lancement\n \n\n \nJ ai donc modifié mon script afin qu' il soit compatible avec tous les modèles de PS5, cela a eu du bon car les jeux SEGA Saturn fonctionnent avec plus de modèles de PS5 mais pas pour tous malheureusement, donc si vous rencontrez une erreur (le screen du dessus) ne vous inquiétez pas, cela signifie simplement que votre PS5 n' est pas compatible, je cherche encore pourquoi...\n \n\n \nJe publie donc cette mise à jour de mon script v1.2.1 qui fonctionne sur certains modèles et pas sur d'autres, ceci est vraiment très aléatoire, il vous faudra donc tester par vous même pour voir si cela fonctionne pour vous... Je profite également de cette new pour vous demander votre modèle de PS5, votre firmware et si les FPKG Saturn fonctionnent sur vos modèles de PS5 afin de comprendre pourquoi ceci n' est pas compatible sur TOUTES les PS5.\n \nPour le fonctionnement du script je vous laisse visionner ma vidéo tuto PS4, la manip est exactement la même, il vous suffira juste de sélectionner l'option 2 pour PS5.\n \n\n \nPour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:\nhttps://www.paypal.com/paypalme/markus00095\n \n \nTélécharger Saturn2PS4 v1.2.1\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1182233/in-ps5-les-jeux-sega-saturn-sinvitent-sur-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1182233/in-ps5-les-jeux-sega-saturn-sinvitent-sur-ps5-1.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1182233/in-ps5-les-jeux-sega-saturn-sinvitent-sur-ps5-2.jpg"
        }
    }
}