{
    "news_1": {
        "title": "[PS4] L'émulation PS4 s'améliore avec psOff v0.5 (version publique)",
        "content": " \nL'émulation PlayStation 4 s'améliore, psOff semble tirer son épingle des nombreux protagonistes, il semble faire des progrès impressionnants ! Bien que le projet soit encore en développement, il montre déjà des résultats prometteurs. \n \nL’objectif de psOff est simple il s'agit de de créer un émulateur PlayStation 4 pour Windows.\nLe projet utilise également cet émulateur pour exécuter des binaires “Linux” sur Windows, bien que psOff ne soit pas encore pleinement fonctionnel, il peut déjà exécuter certains jeux. Par exemple, il peut faire tourner Sonic Mania Plus à 1449 fps, Worms WMD à 234 fps et Blackhole à 32 fps.\n \n \n\n \n \nComme vous le savez il existe plus de 6 projets d'émulation PS4 en développement, mais psOff est un grand projet où les développeurs sont motivés et les changements et améliorations sont très nombreux. \n \n \n \n \n\n \n \n\n\n \nChangelog versus v0.4 Bêta :\n \nlibSceSaveData things by @igor725 in #52\nlibSceSharePlay initial implementation by @TylerJaacks in #51\nAnother libSceSaveData thing by @igor725 in #54\nImplement ioctl+fcntl IFile functions by @igor725 in #56\nDo not close the emulator if message box failed by @igor725 in #58\nImplement some deprecated SaveData API by @igor725 in #59\nStub libSceVrTracker + Cleanup + libSceNgs2 things by @igor725 in #60\nMove zlib by @SysRay in #62\nSome libScePngDec by @igor725 in #63\nSome libSceNet functions by @igor725 in #64\nImplementation attempt: sceNetEpoll things by @igor725 in #65\nGamereport by @igor725 in #66\nWork by @SysRay in #67\nintercepts, + window resize, + fullscreen config by @SysRay in #69\nSome functions to get the original libSceNgs2 wroking by @igor725 in #68\nRemember window position and size by @igor725 in #70\nFix libScePngDec implementation by @igor725 in #71\nGamereport request by @igor725 in #72\nunittest + frame limiting by @SysRay in #73\nUnit tests action by @igor725 in #74\nRework GameReport a bit by @igor725 in #75\nStub sceRazorIsLoaded by @igor725 in #76\nFix /dev/random creation by @igor725 in #77\nFixes by @igor725 in #78\nMove initialization of /dev/zero and /dev/null, meet POSIX standard by @minecraft8997 in #79\nNpToolkit2, NpParty, Voice stubs by @igor725 in #80\nFix deps for core + config_emu|pthread|appcontent things by @igor725 in #81\nlibSceNet| Resolver by @igor725 in #82\nGameReport| Locales by @igor725 in #83\nWork -> feature by @SysRay in #85\nStubs and functions by @igor725 in #86\nMore translations for GameReport by @igor725 in #84\nProper multiple display support by @igor725 in #88\nStub some funcs by @igor725 in #89\nMoved third_party to new repo by @SysRay in #91\nSymbol stubs by @kr1spy2115 in #90\nSavedata backups by @igor725 in #87\nFormat inplace by @igor725 in #92\nvideout| fix image handling race condition by @SysRay in #94\nFromat inplace fix by @igor725 in #93\nLet ffmpeg decide by @igor725 in #95\nadd emulator version by @SysRay in #97\nAutofill emulator version in game report by @igor725 in #98\nWork by @SysRay in #99\nlibSceGameLiveStreamingSetMaxBitrate + libSceUsbd symbols by @Ordinary205 in #101\nCleanup + Json things by @igor725 in #100\nUpdate window title by @igor725 in #102\nDiscord release notifier by @igor725 in #103\nFix vsync description + ngs2 things by @igor725 in #106\nMultiple Symbols by @Ordinary205 in #105\nRevert audio change by @igor725 in #108\nwork -> features by @SysRay in #109\nlibSceVoice Symbols by @Ordinary205 in #110\nMultiple Symbols (Part 2) by @Ordinary205 in #112\nWiki thing by @igor725 in #55\nlibSceHttp early implementation by @minecraft8997 in #104\nFix wiki action by @igor725 in #113\nSome libc missing syms by @igor725 in #114\nMoving net code to core by @igor725 in #111\nMultiple gamepads support by @igor725 in #115\nSome config range checks and wiki update by @igor725 in #116\nMultiple stubs and implementations by @igor725 in #117\nToggle fullscreen keybind by @igor725 in #118\nMinor libSceUlt research by @igor725 in #119\nWork by @SysRay in #121\nMore stubs, libc implementations and scePadOpen fix by @igor725 in #120\nMultiple Symbols (Part 3) by @Ordinary205 in #122\nFix all kinds of bugs across libScePad by @igor725 in #124\nAdd json validation schemas to config files by @igor725 in #123\nError codes cleanup + more scePad fixes by @igor725 in #125\nUpdate wiki info and json schemas by @igor725 in #126\nNgs2 things again by @igor725 in #128\nHandle ps_regs==nullptr case by @igor725 in #127\nCustom verbosity level for each logging module by @igor725 in #129\nWork by @SysRay in #130\nlibScePad and libScePthread fixes + some stubs by @igor725 in #131\nWork by @SysRay in #133\nrender| v.0.5-nightly_27.04.24 by @SysRay in #134\nGet rid of pad's backend aliases by @igor725 in #132\nFix OpenFile formatting by @igor725 in #135\nFix other strings too by @igor725 in #136\nmove runtime + main to public by @SysRay in #137\nFix renderer version displaying by @igor725 in #138\nfix vulkan limits by @SysRay in #139\nMemoryManager + Missing Symbols fix by @SysRay in #140\nsmall fixes by @SysRay in #141\nvulkanSetup fixes, + exception(more infos) by @SysRay in #143\nStubs again by @igor725 in #142\nfix exception handling by @SysRay in #144\nlibScePngEnc implementation by @igor725 in #146\nCorrect libSceAudioOut behavior by @igor725 in #145\nMultiple Symbols (Part 4) by @Ordinary205 in #148\nFix gmtime_s stack corruption and distorted FLOAT_8CH sound by @igor725 in #147\nsceNpSignaling library stub and log fix by @kr1spy2115 in #150\nwork -> features by @SysRay in #151\nfix imgui resize crash by @SysRay in #152\nTrophies system by @igor725 in #149\nRework hotkey handling + cleanup by @igor725 in #153\nFix unused iterator by @igor725 in #154\nSet of logarithm funcs + config fix by @igor725 in #156\nTrophies list by @igor725 in #155\nAdd symbol names and paths to stacktrace by @igor725 in #157\nDisable IO vbuffer by @igor725 in #158\nMissing symbols and minor fixes by @igor725 in #159\nWork by @SysRay in #160\nFix sampling rate for ngs2 sound by @igor725 in #161\nMultiple Symbols (Part 5) by @Ordinary205 in #162\nFix language detection for trophies by @igor725 in #163\nAnother Ngs2 fix by @igor725 in #164\nTrophies fix by @igor725 in #166\nHandle zero-cases by @igor725 in #165\nbugfixes for libc malloc by @SysRay in #167\nFix POSIX_CALL return value + Library fix by @igor725 in #168\nfixes by @SysRay in #169\nStub some sceNp apis by @igor725 in #170\ngraphicsDriver| use shader regs size by @SysRay in #172\nWork -> features by @SysRay in #173\nWindow size + Thread name bugfix by @igor725 in #174\nFeatures -> main by @SysRay in #175\n \n\n \n\n \nLa liste des compatibilités se trouve ici : psOff_compatibility\n \nTéléchargement : psOff v0.5 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191661/in-ps4-lemulation-ps4-sameliore-avec-psoff-v05-version-publique-1.png"
        }
    },
    "news_2": {
        "title": "[Switch] L'UnlockSwitch commence à être livré et son boitier arrive",
        "content": "Les premières livraisons de l'UnlockSwitch commencent à arriver, les premiers utilisateurs voient arriver dans leur boite aux lettres la première version du linker UnlockSwitch, comme vous le savez la team a sélectionné 40 personnes pour recevoir cette première version, il en reste encore une dizaine.\n \nS'agissant des échantillons tests, cette version est livrée nue sans son boitier transparent qui vient d'ailleurs d'arriver chez UnlockSwitch d'après leur dernier message sur X.\n \n \n\n \nLe linker est livré avec son programmeur permettant de le flasher, cependant pour l'heure il n'est pas encore possible de le flasher faute de logiciel, ce qui ne devrait plus tarder. \n \nLa team s'est engagé à montre le boitier transparent aujourd'hui, celle-ci met en avant le fait que la petite vis présente sur le Mig Switch abime le chariot de chargement de la console en dévoilant une photo. \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191660/in-switch-lunlockswitch-commence-a-etre-livre-et-son-boitier-arrive-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191660/in-switch-lunlockswitch-commence-a-etre-livre-et-son-boitier-arrive-2.jpg"
        }
    },
    "news_3": {
        "title": "[PS4] PPPwn Lite disponible en v5.1 Beta",
        "content": "PPPwn Lite est une version allégée du projet PPPwn, basée sur PPPwn CPP et PPPwn-Loader.\n \n \n \n\n \n \nVoici les principales fonctionnalités de PPPwn Lite :\n \n- Démarrage automatique avec Windows : PPPwn Lite peut être configuré pour démarrer automatiquement avec Windows, ce qui facilite son utilisation.\n- Surveillance du démarrage de la PS4 : PPPwn Lite surveille le démarrage de la PS4 et s’active lorsque la console est allumée.\n- Exécution automatique du payload CPP : PPPwn Lite exécute automatiquement le payload CPP (code d’exploit) nécessaire pour le jailbreak.\n- Arrêt automatique du PC après le jailbreak : Une fois le jailbreak réussi, PPPwn Lite peut éteindre automatiquement votre PC.\n- Mise à jour en ligne : PPPwn Lite peut mettre à jour les fichiers Lite, stage.bin et goldhen directement depuis Internet, sans nécessiter de manipulations manuelles.\n- Sélection automatique du fichier stage.bin : Vous n’avez plus besoin de sélectionner manuellement le fichier stage.bin lors de l’utilisation de PPPwn Lite.\n- Pas besoin de configurer la connexion Internet de test : Contrairement à d’autres méthodes, PPPwn Lite ne nécessite pas que la PS4 soit configurée pour le test de connexion Internet.\n \nPour utiliser PPPwn Lite, voici les étapes générales :\n \n- Téléchargez la dernière version de PPPwn Lite depuis les releases.\n- Décompressez l’archive et exécutez PPPwn Loader.exe.\n- Sélectionnez le port Ethernet auquel vous connectez votre PS4.\n- Choisissez la version système actuelle de votre PS4 dans le menu déroulant.\n- Sélectionnez le fichier stage2.bin que vous souhaitez charger (vous pouvez utiliser celui de la branche PPPwn de @LightningMods ou celui du dossier stage2 dans le répertoire PPPwn à des fins de test).\n- Cliquez sur le bouton “START” pour lancer le processus.\n- Suivez les instructions pour configurer une connexion PPPoE sur votre PS4.\n \nGardez à l’esprit que le taux de réussite de l’exploit actuel n’est pas très élevé, mais PPPwn Lite simplifie grandement le processus.\n \nDans cette nouvelle version de nombreuses modifications ont été effectuées, le code a largement été optimisé et les supports sont élargis. \n \nTéléchargement : PPPwn Lite v5.1 Beta\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191643/in-ps5-pppwn-lite-disponible-en-v51-beta-1.png"
        }
    },
    "news_4": {
        "title": "[Switch] sys-con 1.0.0 disponible",
        "content": "\nUn nouveau projet vient de voir le jour. Inspiré du projet sys-con de Cathery, ce nouveau fork a été réalisé pour ajouter le support de toutes les manettes compatibles PC (avec un profil HID).\n \nCette nouvelle version 1.0.0 (Pour se différencier de l'original 0.6.x) vient supporter l’ensemble des manettes compatibles PC tout en gardant la compatibilité d'origine avec XBOX et DualShock. Ce nouveau portage ouvre donc la porte à de nouveaux horizons, dont le retrogaming avec RetroArch par exemple (Arcade, NES, Snes, etc…)\n \nSys-Con est un module système pour Nintendo Switch, qui vous permet d'utiliser des contrôleurs tiers sur votre console Nintendo Switch. Sys-con a juste besoin que vous connectiez vos contrôleurs en utilisant les ports USB de votre dock, mais le module fonctionne aussi via le port USB C avec un adaptateur OTG.\n \n \n \n\n \n \nInstructions :\n \n- Extrayez le fichier zip et copiez son contenu sur votre carte SD.\n- Si vous n'utilisez pas Atmosphere, renommez le dossier atmosphere/ avec le nom CFW souhaité.\n- Redémarrez votre console Nintendo Switch\n \nFonctionnalités de cette nouvelle version :\n\nSupport des Joysticks et Gamepads avec profil HID. (Autrement dit, toutes les manettes compatibles PC)\n\n\nPossibilité de mapper les touches en fonction du VID/PID de la manette.\n\n\nConfiguration de la deadzone (Déjà disponible dans le module de base)\n\n\nConfiguration de la fréquence de polling.\n\n\nConfiguration de la couleur des manettes en utilisant le standard #RGBA\n\n\nLes vibrations ne sont pas encore fonctionnelles, mais devraient arriver prochainement.\n\nTéléchargement : sys-con 1.0.0\n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191641/in-switch-sys-con-100-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[Wii/Wii U] De nouveaux exploits pour la Wii et la Wii U : ISFShax et szsHaxx",
        "content": " \nLe développeur MikeIsAStar vient de lancer il y a quelques jours un tout nouvel exploit à destination de la Wii, et comme nous allons le voir, la Wii U elle aussi n'est pas avare en nouveauté en matière de hack. \n \nUn nouvel exploit pour la Nintendo Wii\n \nszsHaxx est un exploit récent, puisqu'il a été dévoilé la semaine dernière, pour la Wii qui permet d’exécuter du code arbitraire à partir de la carte SD en utilisant le fichier de sauvegarde de Mario Kart Wii. L’exploit tire parti des données de compétition stockées dans les fichiers de sauvegarde du jeu.\n \n \n\n \n \n \nExplication, dans Mario Kart Wii, les données de compétition sont stockées dans les données de sauvegarde. Les données de prix correspondantes sont compressées à l'aide d'un format propriétaire. L'exploit s'appuie sur un débordement de tampon lors de la décompression de ces données pour exécuter du code non signé.\n \nCependant, pour l'exploit, vous devez supprimer votre sauvegarde de Mario Kart Wii , car il n'existe aucun moyen de la sauvegarder au préalable dans les jeux en ligne. Une vidéo valant de longs discours, en voilà deux, le développeur propose une démonstration de szsHaxx v1.0.0.0 : \n \n \n \n\n \n \n\n \n \n \nTutoriel : \n \n- Trouvez une carte SD d’une capacité de 2 gigaoctets ou moins.\n- Formatez la carte SD en utilisant le système de fichiers FAT16 ou FAT32.\n- Créez le chemin d’accès sd:/private/wii/title/RMC[E|P|J|K] sur la carte SD.\n- Le dernier caractère doit correspondre à la version de Mario Kart Wii que vous utiliserez.\n- Copiez le fichier data.bin correspondant à la version de Mario Kart Wii dans le dossier mentionné ci-dessus.\n- Placez le fichier boot.elf à exécuter à la racine de la carte SD (chemin : sd:/).\n- Activez la fonctionnalité WiiConnect24 sur votre Wii.\n- Supprimez les données de sauvegarde de la version de Mario Kart Wii que vous utiliserez.\n- Transférez les données de sauvegarde depuis la carte SD vers la Wii.\n- Démarrez Mario Kart Wii.\n- Commencez la compétition dans le jeu.\n \n \nTout est là : szsHaxx v1.0.0.0\n \n \n \n \nMais aussi pour la Nintendo Wii U \n \nLa console qui a succédé avec un moindre succès à la Nintendo Wii n'est pas en reste puisque la Nintendo Wii U a vu débarqué aussi un nouvel exploit en Octobre 2023 qui vient d'évoluer avec l'arrivée de nouvelles options. Cet exploit se nomme ISFShax, ISFShax est un coldboot pour la Wii U, il s'appuie lui sur le boot1 avec un superblock ISFS (le système de fichiers du SLC) spécialement conçu. Une fois installé, ISFShax offre des fonctionnalités similaires à de_fuse.\n \n \n\n \n \nIl se lance avant IOSU, ce qui permet d’appliquer des correctifs à IOSU et de réparer la plupart des bricks. Cependant, il ne protège pas contre les bricks causées par la rupture de boot1, les bricks seeprom ou l’installation d’un superblock ISFShax défectueux, c'est pourquoi comme toujours, il est recommandé de se pas se lancer dans la manipulation si vous ne maitrisez pas le sujet parfaitement. De toute façon vous l'aurez compris, ISFShax ne vous aidera pas non plus si vous avez déjà briqué la Wii U.\n \nEn résumé ISFShax permet :\n \n- Reconstruction / mise à niveau du MLC.\n- Suppression de la limite de 64 Go du MLC et désactivation du SCFM.\n- Protection contre les bricks (par exemple, avant de changer de région).\n- Coldboot redNAND (utile lorsque l’eMMC est défaillant).\n- Il offre un CFW minimal, qui peut lancer d’anciens homebrews à l’aide du homebrew launcher (bien que nous ayons maintenant Aroma et Tiramisu).\n \nTutoriel de Sauvegarde :\n \n- Aller vers Backup and Restore\n- Dump SEEPROM & OTP\n- Dump SLC.RAW\n- Retour au menu principal\n \nTutoriel Installation d'ISFShax :\n \n- Choisissez Boot `ios.img`(5x puissance, 1x éjection)\n- Le programme d'installation d'ISFShax devrait maintenant se lancer (cela prend quelques secondes)\n- Suivez les instructions à l'écran, les boutons sont les mêmes qu'en minute. (3x éjection, 1x alimentation, 3x éjection)\n- La console devrait maintenant s'éteindre.\n- [Tiramisu | Navigateur | DNSpresso] remplacez le (crypté) fw.imgsur la SD par le fw.img( PAS celui crypté ) de https://github.com/jan-hofmeier/minute_minute/releases\n- Si l'installation a réussi, la Wii U devrait démarrer directement en une minute une fois que vous la rallumerez.\n \nSauvegarde ISFShax :\n \n- Dumpez à nouveau le SLC.RAW. Cela écrasera le fichier SLC.RAW précédent sur la SD. Ceci est requis si vous devez restaurer le SLC pour le déblocage, sans perdre ISFShax. Conservez cette sauvegarde dans un endroit sûr.\n \n \n \nTout est là : ISFShax et un post ultra complet ici how-to-set-up-isfshax ou des tutos pour corriger des erreurs mémoire\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191591/in-wiiwii-u-de-nouveaux-exploits-pour-la-wii-et-la-wii-u-isfshax-et-szshaxx-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191591/in-wiiwii-u-de-nouveaux-exploits-pour-la-wii-et-la-wii-u-isfshax-et-szshaxx-2.jpg"
        }
    },
    "news_6": {
        "title": "[Multi] Libretro dévoile retroArch 1.19.0",
        "content": " \nL'équipe Libretro vient de dévoiler l'existence de la version 1.19.0 de RetroArch, après la version 1.18.0 lancée le 22 Mars 2024, voilà donc la semaine version de 2024 du célèbre émulateur. \n \nPlus de deux mois après la version précédente voilà donc la v1.19.0 qui débarque avec énormément de nouveautés et de corrections. \n \nPetit retour en arrière sur l'IA qui a été introduite sur les traductions car cela posait de nombreux problèmes, les cores fonctionnent mal, sur les appareils Apple la langue par défaut du sytème sera utilisée, et le support des contrôleurs Switch Online a été amélioré via MFi. \n \n \n\n \n \n \nChangelog 1.19.0 : \n \nAI : Revenir à la version précédente de la traduction de l'IA (correction du fait que la traduction ne fonctionnait pas avec les cœurs rendus HW)\nAPPLE : Essayer d'utiliser la langue préférée du système\nAPPLE : Enregistrement correct des types de fichiers de manière unique\nAPPLE/MFI : Amélioration de la prise en charge de la manette Switch Online par MFi\nAUDIO : Rétablir le basculement audio sur le basculement du menu\nCHEEVOS : Construction d'une carte mémoire RetroAchievements par défaut lorsqu'aucun jeu RetroAchievements n'est chargé\nCHEEVOS : Mise à jour vers rcheevos 11.3\nCHEEVOS : Correction du hardcore agissant comme s'il était activé alors qu'il ne l'est pas\nCLANG : Correction de l'erreur clang incompatible-pointer-types-discards-qualifiers\nCLOUDSYNC/LINUX : Activer Cloud Sync par défaut sur les builds Linux avec réseau (#16456)\nCLOUDSYNC/WEBOS : Activer Cloud Sync par défaut sur les builds Linux avec réseau (#16456)\nCORE : Configurer la journalisation des statistiques compute fps au niveau debug\nEMSCRIPTEN : Ajout de M2000 à la liste déroulante de sélection des noyaux\nFFMPEG : Ajouter la compatibilité avec FFMPEG 7.0\nGLSLANG : Supprime le code ENABLE_HLSL inutile de glslang\nGENERAL : Fuite de mémoire : L'allocation dynamique de msg_hash_get_help_us_enum n'a pas été libérée.\nINPUT/KEYBOARD : Ajout du support pour les touches multimédia - Extension des valeurs RETROK_ avec 18 nouveaux éléments, communément trouvés sur les claviers « multimédia ». Mapping ajouté pour les keymaps SDL, X11, Wayland, dinput, winraw.\nINPUT/MFI : Déclencheurs gauche/droite sensibles à la pression\nINPUT/MFI : Correction des combinaisons Start + L1/L2/R2\nINPUT/MFI : Prise en charge des grondements forts et faibles\nINTL : Récupérer les traductions de Crowdin\nINTL : Ajout du galicien et du norvégien à la liste des langues\nLAKKA : Afficher le message de redémarrage/arrêt même si la configuration n'est pas sauvegardée à la sortie\nLAKKA : Fournir l'URL de mise à jour et le nom de la cible au moment de la construction\nLIBRETRO : Ajout d'un message de débogage pour le callback SET_ROTATION\nmacOS : Accessibilité par défaut activée si VoiceOver est activé\niOS : synchronisation audio par défaut à nouveau activée, également plus de journalisation mfi\niOS : Correction de l'importation de contenu\niOS : Correction du crash de la nightly build ios-arm64\niOS : Importation de contenu depuis iCloud\niOS : Correction du crash #16485 au démarrage\niOS : Afficher l'icône de l'application dans le sélecteur d'icône de l'application dans materialui\niOS/tvOS : Diverses améliorations QoL\niOS/tvOS : Correction de quelques bugs supplémentaires de manipulation des noms de chemin\niOS/tvOS : Meilleure façon d'empaqueter les Frameworks\niOS/tvOS : définir PACKAGE_VERSION pour être App Store MARKETING_VERSION\niOS/tvOS : Correction de la gestion du clavier pour les builds de l'App Store\niOS/tvOS : Correction de la sortie de la sandbox pour les appareils jailbreakés\niOS/tvOS : accessibilité par défaut si la voix est activée\niOS/tvOS : meilleure façon de rapporter la mémoire disponible\nmacOS/iOS/tvOS : activer la synthèse vocale en utilisant AVSpeechSynthesizer.\ntvOS : Correction de la mise à l'échelle pour 720p\nMENU : Nouvelle fonction dans le menu rapide : Ajouter à la liste de lecture\nMENU/XMB : Nouveau thème : FlatUX, conçu pour fusionner les thèmes FlatUI et Retroactive en un seul design unifié.\nNETWORKING/RETROPAD CORE : Correction de la méthode de fermeture de socket\nPIXMAN : Mise à jour de pixman-private.h - patch pour corriger un problème de construction avec musl\nPLAYLIST : Nettoyage de 'Add to Playlist' (#16495)\nSCANNING : Correction pour le scan des ISOs PSP (et probablement quelques autres)\nSAUVEGARDE : Correction de la sauvegarde de la configuration de base\nSAUVEGARDE : Correction de l'enregistrement du nouveau nom de la configuration lorsque le noyau est chargé\nSAVESTATES : Augmenter la taille du chunk de l'état de sauvegarde pour toutes les plateformes - Même une carte SD de classe 6 ou de classe 10 peut gérer des lectures et des écritures de l'ordre du MB/s, ce qui signifie qu'une taille de chunk de 4KB est juste une perte de temps dans les appels syscall. Cela pourrait être corrigé avec un lecteur de mémoire tampon, mais je ne me sens pas à l'aise pour modifier le VFS de libretro-common pour gérer cela. A la place, j'ai pensé qu'il serait bon de supprimer un ifdef et d'augmenter la taille du chunk à 128KB. Pour les cœurs avec de petits états, cela devrait rendre la sauvegarde d'état virtuellement instantanée, et pour les cœurs avec de grands états, cela devrait être une accélération de 32x.\nVIDÉO : Correction d'un crash lors de l'utilisation de la vidéo threadée - pour Mesa 23.2 et ultérieures\nVIDEO/GL : Correction de la réinitialisation des pilotes gl threadés\nVIDEO/VULKAN : ajout de la prise en charge du format HDR A2R10G10B10\nVIDEO/VULKAN : implémenter la lecture HDR - support des captures d'écran\nWAYLAND : Ignorer les évènements de configuration pendant le splash (corrige le fait de ne pas se souvenir de la taille de la fenêtre)\nWAYLAND : Utiliser le gestionnaire de signal du frontend pour quitter (corrige le fait de quitter en fermant la fenêtre)\nWAYLAND : Commit viewport resizes (le redimensionnement de la fenêtre est plus réactif)\nUWP : Aligner MESA sur alpha-2-resfix - Supprimer le traitement spécial de mauvaise résolution pour OPENGL\nUWP : Correction 4K : aligner la lecture MESA de ClientRect sur la procédure retroarch, ceci corrige la résolution maximale fixée à 1080p. Comme la lecture doit être faite à l'intérieur d'un thread de l'interface utilisateur et qu'il s'agit en fait d'une opération asynchrone qui peut retarder la génération d'images, la lecture elle-même est faite une seule fois et mise en cache, ce qui fait que le changement de résolution pendant que l'application est en cours d'exécution est un cas d'utilisation peu probable.\nWINDOWS : Windows mouse ungrab must release the mouse instead of confine it to the current desktop (#16488)\nWINDOWS : Correction des événements de relâchement des touches numlock/pause\n \n \nTéléchargement : retroarch.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191574/in-multi-libretro-devoile-retroarch-1190-1.png"
        }
    },
    "news_7": {
        "title": "[PS4/PS5] TheFlow a présenté sa faille PPPwn à la TyphoonCon",
        "content": " \nLe développeur Andy Nguyen, un peu plus connu sous le pseudonyme TheFlow, vient de dévoiler sa présentation lors de la TyphoonCon, un évènement regroupant un ensemble de conférences de sécurités informatiques qui se tient à Séoul, en Corée du Sud du 27 au 31 mai 2024.\n \n \n\n \n \nDes experts en sécurité, des chercheurs et des passionnés se réunissent pour discuter des dernières vulnérabilités, des exploits et des avancées dans le domaine de la cybersécurité, et TheFlow y est présent pour présenter sa vulnérabilité RCE (Remote Code Execution) permettant d’obtenir des privilèges kernel sur la PlayStation 4.\n \nEn attendant d'avoir une vidéo complète de l'intervention, nous devons nous contenter d'une photo publié par le site officiel de la Typhooncon, dans sa présentation TheFlow a tout d'abord détaillée sa faille, puis il a expliqué les différences entre PS4 et PS5.\n \n \n\n \n \nPour le moment, personne n'a encore dévoilé les slides présentés, souvent TheFlow les libère quelques heures ou jours après la présentation, à moins qu'une vidéo ne sorte avant.\n \n \n \n\n \n \n \nSa présentation montre clairement qu'il y a un espoir pour la PS5, mais pour le moment ce n'est pas encore possible. Rappelons que l'exploit RCE dévoilé ici est compromis au delà du firmware 11.00 sur PS4 et 8.20 sur PS5. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191560/in-ps4ps5-theflow-a-presente-sa-faille-a-la-typhooncon-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191560/in-ps4ps5-theflow-a-presente-sa-faille-a-la-typhooncon-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1191560/in-ps4ps5-theflow-a-presente-sa-faille-a-la-typhooncon-3.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] Le boitier transparent de l'UnlockSwitch terminé",
        "content": "La team UnlockSwitch continue le développement de sa future proposition, après avoir dévoilé les deux premières images de ce qui sera la première version de leur linker, l'équipe dévoile désormais une image 3D du boitier. \n \nDans un premier temps, l'équipe UnlockSwitch ne souhaitait pas montrer son boitier de peur de se faire copier, notamment parce qu'il ne dispose pas de vis, voulant protéger sa conception, le design du boitier transparent est désormais terminé, comme nous pouvons le voir, il intègre le bouton pour changer de jeu. \n \n \n\n \n \nL'équipe informe que la production du boitier transparent a bien été lancée, ce qui signifie que le linker ne devrait plus trop tarder a être disponible, d'ici à fin Juin probablement. Ce sont désormais 30 testeurs qui ont été sélectionnés sur les 50. Sachant que l'équipe est en train de définir son mode de vente, proposant 2 options possibles à ses acheteurs, soit la vente directe via le site internet avec des expéditions depuis la Chine en livrant les revendeurs mais aussi les clients finaux. La seconde option est de vendre qu'à des revendeurs par pays, mais dans tous les cas, l'équipe souhaite conserver le contrôle sur les expéditions afin de limiter les soucis d'approvisionnements. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191538/in-switch-le-boitier-transparent-de-lunlockswitch-termine-1.jpg"
        }
    },
    "news_9": {
        "title": "[Switch] Moonlight Switch v1.1.0 disponible",
        "content": " \nLe développeur Xitrix vient de dévoiler une nouvelle version de Moonlight Switch, Moonlight Switch est un portage de Moonlight Game Streaming Project pour la Nintendo Switch.\n \n \n\n \n\n \n\n \n\n \nChangelog : \n \n- Correction de l’écran gris : Cette mise à jour résout le problème de l’écran gris qui pouvait survenir lors de l’utilisation de Moonlight-NX.\n- Correction des mouvements de souris incorrects : Les problèmes liés aux mouvements de la souris ont également été corrigés.\n- Défilement amélioré : L’interface utilisateur et le défilement sur un PC en streaming (défilement avec deux doigts) ont été améliorés.\n- Ajout d’un combo pour le bouton Guide : Par défaut, il s’agit de la combinaison Minus+Plus.\n- Personnalisation de la cartographie des boutons : Vous pouvez maintenant personnaliser les boutons et les touches de combinaison pour chaque jeu.\n- Fermeture du jeu en cours : Vous pouvez désormais fermer le jeu en cours et lancer un autre jeu même si un jeu est déjà en cours.\n- Nombreuses corrections et améliorations de l’interface utilisateur.\n- Ajout du paramètre Rumble Force\n- Améliorations de la prise en charge du multitouch\n- Correction de l'entrée gyroscopique\n- Correction du réglage du volume du pilote Audren\n- Correction des boutons du clavier USB\n- Correction de l'entrée de la souris USB\n- Prise en charge initiale d'iOS\n- Décodage iOS HW\n- Déclencheurs analogiques pour les appareils supportés\n- Recherche automatique d'hôtes rapide\n- Résolution native - résolution universelle qui démarre le flux avec les paramètres actuels de l'écran\n- Ouverture de la surcouche par un glissement du coin gauche pour pouvoir utiliser l'application en mode tablette (sans joystick)\n- Logos rafraîchis\n \n \nPour installer Moonlight-NX v1.1.0, suivez ces étapes :\n \n- Téléchargez la dernière version de Moonlight-NX.\n- Placez le fichier moonlight.nro dans le dossier sdcard:/switch/moonlight.\n- Lancez le menu Homebrew (hbmenu) pour accéder à la redirection des titres (pour un accès complet à la RAM).\n- Lancez Moonlight-NX.\n \n \nGuide d’installation :\n \n- Consultez d’abord le guide officiel de configuration.\n- Connectez votre PC et la Nintendo Switch au même réseau WiFi.\n- Dans Moonlight-NX, appuyez sur le bouton “Add new host” et entrez l’adresse IP de votre PC.\n- Associez Moonlight-NX à votre PC.\n \n \nTéléchargement : Moonlight-NX v1.1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191535/in-switch-moonlight-switch-v110-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191535/in-switch-moonlight-switch-v110-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1191535/in-switch-moonlight-switch-v110-disponible-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1191535/in-switch-moonlight-switch-v110-disponible-4.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] PS Multi Tools v14.1.5 disponible",
        "content": "Le développeur SvenGDK propose une nouvelle version de PS Multi Tools, il vient de libérer la version 14.1.5 qui comme à son habitude apporte son lot de nouveautés. \n \nComme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n\n \n \n\n \n \nAvec la version 14.1.5, le développeur a proposé les évolutions suivantes : \n \n- Mise à jour PPPwn_cpp avec les derniers changements. \n- Correction d'un crash possible lors de l'installation de npcap\n- Ajout de plus d'options PPPwn\n- Nouvelle option \"Télécharger la dernière version de GoldHEN sur une clé USB\"\n \nTéléchargement : PS Multi Tools v14.1.5 \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191527/in-ps5-ps-multi-tools-v1415-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1191527/in-ps5-ps-multi-tools-v1415-disponible-2.png"
        }
    },
    "news_11": {
        "title": "[PS5] PCXSense v0.9.4 disponible",
        "content": "Suite à l'abandon du développement de DS4Windows, l'alternative la plus efficace est PCXSense, un logiciel permettant d'exploiter les DualShock 4 et DualSense sur votre PC.\n \nPCXSense est un projet open-source qui permet de traduire les entrées du contrôleur DualSense en signaux XInput, le rendant ainsi compatible avec n’importe quel jeu sur PC.\n \nLe logiciel dispose d'une interface graphique conviviale et facile à utiliser, cela est facilité aussi par la prise en charge du retour haptique, sachant que vous pouvez connecter votre DualSense via Bluetooth ou USB.\n \n \n \n\n \n \n \nLes manettes Gamecube sont également prises en charge (utile pour les émulateurs comme Dolphin), mais aussi celles de la Nintendo Switch, utiles pour Yuzu ou Cemu. \n \nPCXSense vérifie automatiquement les mises à jour et les installe sans intervention supplémentaire de votre part, et vous pouvez personnaliser votre expérience avec des profils personnalisés, le contrôle de la barre lumineuse...\n \nLe projet a encore des fonctionnalités à implémenter, telles que la prise en charge des Joycons et du pavé tactile. Si vous rencontrez des problèmes ou si vous souhaitez contribuer, n’hésitez pas à consulter le dépôt GitHub de PCXSense.\n \nCette version vise à corriger quelques bugs, et des plantages lié aux noms de profils noms, mais aussi quelques problèmes liés à l'utilisation de Cemu, Dolphin et Yuzu. \n \n \nTéléchargement : PCXSense Beta 0.9.4\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191524/in-ps5-pcxsense-v094-disponible-1.gif"
        }
    },
    "news_12": {
        "title": "[Switch] NX Venom le pack pour overclocker sous Atmosphère",
        "content": " \nNX Venom est un pack qui intègre tout un tas d'outils et de ressources qui vont vous permettre de pousser les performances de votre console, avec notamment l'appui de l'overclock. \n \nBien entendu overclocker votre console n'est pas sans conséquence, cela présente un risque pour vos données, sachant que Horizon OS n'a pas été prévu pour cela, et qu'il est conseillé de faire cela uniquement dans emuMMC. \n \n \n\n \n \nVoici quelques détails importants :\n \nInstallation : \n- Faites une sauvegarde et supprimez tout sauf les dossiers Nintendo et emuMMC sur la carte SD.\n- Décompressez NX Venom à la racine de la carte SD.\n- Utilisez un lecteur de carte ou allez dans Hekate → Outils → Outils USB.\n- Utilisez l’application homebrew All-in-One Switch Updater pour les mises à jour.\n- L’installation de logiciels supplémentaires et de correctifs pour les jeux se fait via le menu UberHand (cliquez à droite) → Installateur de logiciels.\n \nUtilisation :\n- Ouvrez le menu UberHand (ou quittez le Status Monitor) en appuyant sur ZR + ZL + Bas.\n- Utilisez la superposition sys-clk-oc pour gérer l’overclocking.\n- Utilisez le EOS Wizard pour modifier les paramètres du kip de chargement.\n- Utilisez judicieusement les paramètres d’overclocking recommandés pour le mode portable et l’autonomie de la batterie :\n- CPU : 1020 - 1428\n- GPU : 768 - 921\n- RAM Max : 2133 - 2400 (pour Mariko) et 1862 - 2131 (pour Erista)\n \nMises à jour récentes (version 4.4.5) :\n- 1305 MHz est désormais disponible uniquement si la planification GPU est activée (pour les consoles Mariko).\n- Ajout d’une étape de tension DVB supplémentaire (pour les consoles Erista).\n- CPU UV2&3 permet d’atteindre 2295 MHz (pour les consoles Erista).\n- Prise en charge de Switchcraft 1.2.1 dans SC Wizard.\n- Option de planification GPU ajoutée (désactivée par défaut)2.\n \n \nTéléchargement : NX Venom v4.5.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191520/in-switch-nx-venom-le-pack-pour-overclocker-sous-atmosphere-1.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] L'UnlockSwitch MSK se montre enfin avec son programmeur",
        "content": "Ca y est voilà enfin l'UnlockSwitch MSK (le linker) ainsi que son programmeur, l'équipe UnlockSwitch a dévoilé un long message rappelant ce que l'on savait déjà plus ou moins, sans très grande nouveauté, mais la plus importante d'entre elles est arrivée avec la mise en ligne des deux premières photos.\n \nL'UnlockSwitch MSK est une solution open-source, aucun fichier ou code ne vous sera fourni. Vous aurez un contrôle total sur votre linker, y compris les mises à jour des deux composants sur le circuit imprimé et les mises à jour du firmware, avec d'autres améliorations en cours de développement. Cette fonctionnalité est facilitée par le programmateur UnlockSwitch et son logiciel complémentaire, le logiciel de programmation UnlockSwitch, qui est fourni sans frais supplémentaires.\n \n \n\n \n \nSelon UnlockSwitch plusieurs équipes sont en cours du développement de la solution software, et des tests seront effectués pour proposer plusieurs possibilités. La production de masse permettra de fournir un volume suffisant. \n \n \n\n \n \nL'objectif principal pour le lancement est de dévoiler l'UnlockSwitch ainsi que sa solution de sauvegarde des jeux. Le travail sur le Xtractor est actuellement en cours sachant que la team s'engage à fournir une solution 2 en 1 :  \n \n \n- Permettre aux utilisateurs de sauvegarder leurs jeux de manière indépendante\n \n- Fournir une cartouche pour exécuter leurs jeux.\n \n \nLa team indique vouloir laisser les solutions de piratage à la concurrence, ce n'est tout simplement pas l'objectif de la team UnlockSwitch. Elle indique également qu'elle souhaite un boitier redessiné éliminant le besoin d'une petite vis, une nouvelle conception du circuit imprimé, un nouveau bouton a été ajouté sur la cartouche pour la sélection des jeux, ainsi qu'une antenne Wi-Fi intégrée est maintenant directement incorporée sur le circuit imprimé. Enfin comme nous pouvons le voir sur la photo a été introduit un connecteur pour la liaison avec le programmateur UnlockSwitch.\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191493/in-switch-lunlockswitch-msk-se-montre-enfin-avec-son-programmeur-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1191493/in-switch-lunlockswitch-msk-se-montre-enfin-avec-son-programmeur-2.jpg"
        }
    },
    "news_14": {
        "title": "[PS4] L'interface GUI DroidPPPwn v1.1 disponible",
        "content": " \nDroidPPPwn est une nouvelle application Android qui permet d’exécuter l’exploit PPPwn sur la console PlayStation 4 en utilisant votre smartphone. \n \nDroidPPPwn est une interface graphique (GUI) pour l’exploit PPPwn sur PS4, elle inclut le binaire PPPwn_cpp spécifiquement compilé pour arm-android, ainsi que les fichiers stage1.bin et stage2.bin pour tous les firmwares pris en charge (du firmware 7.00 au 11.00). \n \n \n\n \n \n \nPour les firmwares 9.00, 10.00, 10.01 et 11.00, le stage2.bin est construit à partir du Github de Sistr0, ce qui vous permet de charger des payloads personnalisés tels que GoldHEN. Pour tous les autres firmwares, le stage2.bin est construit à partir du code original de PPPwn, ce qui en fait actuellement davantage une poc (une preuve de concept) affichant “PPPwned” sur la PS4. \n \nVous pouvez également utiliser votre propre stage2.bin en le plaçant à la racine de votre carte SD via la commande push stage2.bin /sdcard/.\n \nExigences :\n \n- Un téléphone Android récent rooté prenant en charge l’OTG.\n- Un câble ou un adaptateur USB OTG.\n- Un adaptateur USB Ethernet.\n- Un câble Ethernet.\n \nUtilisation :\n \n- Téléchargez la dernière version depuis ce dépôt et installez-la sur votre téléphone Android.\n- Sur votre PS4, suivez les instructions de l’exploit PPPwn original pour configurer la connexion Ethernet.\n- Lancez l’application DroidPPPwn et sélectionnez le firmware de votre PS4.\n- Appuyez sur le bouton “Start” dans l’application et simultanément sur la touche “X” de votre manette lorsque vous êtes sur l’écran de test de la connexion Internet.\n- Attendez que l’exploit atteigne l’étape 4 et que le message s’affiche sur votre écran. Si l’exploit échoue, appuyez à nouveau sur le bouton “Start” pour l’arrêter et répétez la dernière étape.\n \n \n \n\n \n \n \nBug connus : Sur certains anciens appareils armv7, lors de l’installation de l’APK, le contenu du dossier “lib” n’est pas copié dans le dossier interne de l’application. Vous pouvez résoudre ce problème en extrayant les fichiers du fichier pppwn.jar (en choisissant entre lib/armeabi-v7a/* et lib/arm64-v8a/* en fonction de votre architecture) et en les transférant manuellement dans /data/data/it.deviato.droidpppwn/lib/. N’oubliez pas de donner les permissions d’exécution à pppwn avec la commande chmod 755 pppwn. \n \n \nChangelog (version 1.1) :\n \n- Ajout de la prise en charge des processeurs 32 bits arm-v7a avec un binaire séparé pour pppwn.\n- Refonte complète du projet en abaissant la version minSdk à 19, ce qui lui permet de fonctionner sous Android KitKat 4.4+.\n- Remplacement de stage2.bin pour les firmwares pris en charge par ceux du référentiel Sistr0 pour permettre le chargement de charges utiles.\n- Possibilité d’utiliser votre propre stage2.bin.\n- Autres petites corrections.\n \n \n \nTéléchargement : DroidPPPwn v1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191469/in-ps5-linterface-gui-droidpppwn-v11-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[Switch] L'UnlockSwitch MSK se montre enfin",
        "content": "Encore une fois, suite aux grandes annonces de Mig Switch ou désormais de l'équipe en charge du développement de MiGDIY 2, nous nous attendions à une grande annonce, bon ben finalement pas grand chose, mais on va dire l'essentiel. \n \nLa team avait annoncé que ce lundi nous allions voir le linker, dans les faits l'équipe vient de dévoiler une photo de la face arrière du PCB du linker. \n \n \n\n \n \nOn peut enfin dire qu'on a du concret, même si cela a mis du temps, voilà donc l'image du PCB du UnlockSwitch. Il est délicat de se faire une opinion sur une simple image il faudra s'en contenter pour le moment, sachant que la team annonce que ce n'est que le début de nombreuses annonces. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191467/in-switch-lunlockswitch-msk-se-montre-enfin-1.png"
        }
    },
    "news_16": {
        "title": "[PS5] Le nouveau payload websrv permet la lecture streaming",
        "content": "Le développeur John Tornblom que l'on ne présente plus vient de mettre en ligne une nouvelle version de son payload websrv à destination des PS5 jailbreakées. \n \nCe payload lorsqu'il est injecté permet d'éxecuter un simple serveur web, cependant il permet beaucoup de choses, puisqu'il permet de lancer des homebrews via le webkit ou bien à distance via un PC, smartphone ou des appareils compatibles. Dans une vidéo, le développeur dévoile les capacités de cette nouvelle version, et c'est plutôt intéressant. \n \n \n\n \n \n \nChangelog 0.3 : \n \n- Ajout de la prise en charge du streaming des URL https avec FFplay\n- Ajout d'un homebrew pour diffuser des émissions de radio en direct depuis sr.se\n- Ajout d'un homebrew pour diffuser des émissions de télévision en direct à partir de svtplay.se\n- Ajout d'un package PS5 qui place une icône sous « média » sur votre tableau de bord avec lequel le lanceur homebrew peut interagir. Merci TeRex777 pour l'avoir mis en place !\n \n \nTéléchargement : PS5 websrv v0.3\n \n",
        "images": {}
    },
    "news_17": {
        "title": "[PS4] Apollo Save Tool PS4 est désormais compatible avec le firmware 11.00",
        "content": " \nLe développeur Bucanero, Damian Parrino, propose depuis quelques heures une toute nouvelle version de son logiciel Apollo Save Tool à destination de la PS4. L'objectif est d'apporter le support du firmware 11.00.\n \nPour rappel, Apollo Save Tool est ce que l'on appelle un must-have sur PS4, ce logiciel permet de sauvegarder, resigner, corriger, télécharger, ou encore déverrouiller les fichiers de sauvegardes des jeux sans avoir à passer par des outils complexes, et tout se fait directement sur la console. \n \n \n\n \n \nAu delà du support du firmware 11.00, le développeur a intégré de nouveaux cheats codes, et divers bugs ont été corrigés qui ont été listé dans le changelog ci-dessous.\n \n\n \nAdded : \n11.00 firmware support (thanks to @LightningMods @SocraticBliss)\nNew cheat codes\n- Like a Dragon: Ishin!\n- Unicorn Overlord\nCustom save decryption support\n- Like a Dragon: Ishin!\n- Metal Gear Solid 5: Ground Zeroes\n- The Last of Us: Part II\n- Uncharted: Drake's Fortune Remastered\n- Uncharted 2: Among Thieves Remastered\n- Uncharted 3: Drake's Deception Remastered\n- Uncharted 4: A Thief's End\n- Uncharted: The Lost Legacy\nCustom checksum support\n- Dead Rising\n- Like a Dragon: Ishin!\n- Strider\n- The Last of Us: Part II\n- Uncharted: Drake's Fortune Remastered\n- Uncharted 2: Among Thieves Remastered\n- Uncharted 3: Drake's Deception Remastered\n- Uncharted 4: A Thief's End\n- Uncharted: The Lost Legacy\n \nFixes\n- Patch Code fixes\n- Metal Gear Solid 5: The Phantom Pain\n \nMisc\n- Updated Apollo Patch Engine to v1.0.0\n- Add jenkins_oaat, lookup3_little2 hash functions\n- Add camellia_ecb encryption\n- Add RGG Studio decryption (PS4)\n- Add Dead Rising checksum\n- Fix SaveWizard Code Type D issue with CRLF line breaks\n- Changed BSD command syntax for decompress(offset, wbits) and compress(offset)\n \n \n \n\n \n\n \nTéléchargement : Apollo Save Tool v1.4.4\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191451/in-ps4-apollo-save-tool-ps4-est-desormais-compatible-avec-le-firmware-1100-1.jpg"
        }
    },
    "news_18": {
        "title": "[Switch] L'émulateur Switch Sudachi disponible en v1.0.1",
        "content": "L'émulateur de Nintendo Switch Sudachi est désormais disponible en version 1.0.1, pour rappel il s'agit d'un nouvel émulateur qui supporte Android, Linux, macOS et Windows. Comme vous pouvez vous en doutez il se base sur Yuzu et va encore plus loin. \n \n \n\n \n \nChangelog : \n \n- Compilation Android corrigée : Les erreurs de compilation sur Android ont été résolues en enveloppant les paramètres pour RebootlessSystemUpdateVersion entre accolades.\n- Stubs SSL ajoutés : Des stubs GetNextAlpnProto et SetNextAlpnProto ont été ajoutés pour résoudre certains problèmes avec les jeux qui tentent de communiquer avec des serveurs.\n- Correction des paramètres système : Le plantage lors de l’accès à la page de support/santé et sécurité dans les paramètres système a été résolu.\n- Compatibilité améliorée : Le jeu Paper Mario: The Thousand Year Door est désormais fonctionnel.\n \n \nTéléchargement : Sudachi 1.0.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191448/in-switch-lemulateur-switch-sudachi-disponible-en-v101-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] PS4Debug adapté au firmware 11.00",
        "content": "Un temps développé par Jogolde, puis par GianPluto sur le 6.72, puis par ChendoChap sur le firmware 7.02, ensuite repris pas Joonie86 sur le firmware 7.55, puis par Kmeps4 qui avait pris le relai sur le firmware 9.00, voilà que c'est désormais golden qui a adapté PS4Debug pour le firmware 11.00. \n \nComme vous le savez, PS4Debug est un débogueur pour la PlayStation 4. Vous trouverez des outils très utiles en ligne ou sur le canal source discord de la PS4. \n \n \n \n\n \n \nCette nouvelle version v1.1.16, a été également mise à jour par ctn123 & SiSTRo, l'idée étant d'ajouter le support du firmware 11.00 et bientôt pour le mode repos. \n \nLe support du 11.00 n'est pas le seul a être ajouté puisque sont pris en charge également le 9.00, 9.60, 10.00 et le 10.01. \n \nTéléchargement : PS4Debug v1.1.16\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1191442/in-ps4-ps4debug-adapte-au-firmware-1100-1.png"
        }
    },
    "news_20": {
        "title": "[Switch] Le clone chinois du Mig Switch se nomme MiGDIY 2",
        "content": " \nLa team UnlockSwitch en avait parlé il y a quelques semaines lors de sa lettre ouverte, et bien le voici, le premier vrai clone du Mig Switch qui est visible dans une vidéo. \n \nLa version chinoise du clone du Mig Switch se nomme MiGDIY 2, elle est identique à la version v1 du Mig Switch, sauf qu'il dispose d'un bouton permettant de réaliser une glissade sur le haut du linker permettant de changer de jeu.\n \n \n\n \n\n \n\n \n \nLa vidéo ci-dessus montre la manipulation à 1 min 30, et permet ainsi de limiter les injections / éjections sur le chariot de chargement des jeux. \n \nPour le moment, pas d'information sur la disponibilité d'un site spécialisé mais le profil Twitter se charge de photos et de vidéo, il est déjà vendu en chine contre 559 yuans, soit environ 70 euros, et risque de faire de l'ombre au Mig Switch dont il en est une copie revendiquée, avec l'évolution de la v2 qui vient tout juste d'être annoncée.\n \n \n \n\n \n \n\n \n \n\n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-96552319.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-429274974.png",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-329184751.jpg"
        }
    }
}