{
    "news_1": {
        "title": "[PS4] PS4-Xplorer 2.05 disponible",
        "content": "Le développeur Lapy vient de mettre en ligne une nouvelle version de PS4-Xplorer qui est maintenant proposé en v2.05.\n \nLe développeur remercie yousef333__ de Discord pour l'avoir testé, dans cette nouvelle version il a ajouté le support jusqu'au firmware 12.02. PS4 Xplorer est une application créée sous Unity et qui permet d'effectuer diverses opérations comme couper, copier, coller, renommer, supprimer des fichiers ou des dossiers, ou encore d'explorer le stockage de la console. \n \n \n\n \n \nChangelog :\n \n- Ajout du support des firmwares jusqu'au 12.02 grâce à yousef333__ de Discord pour l'avoir testé\n \n \n \n\n \n \n \nTéléchargement : PS4-Xplorer 2.05\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207943/in-ps4-ps4-xplorer-205-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207943/in-ps4-ps4-xplorer-205-disponible-1.jpg"
        }
    },
    "news_2": {
        "title": "[PSP] La conférence PSP Homebrew Dev dans 2 jours",
        "content": "Dans 2 jours, à partir de 18h00 se tiendra l'édition 2025 de la conférence PSP Homebrew Dev, elle a fêté ses 20 années, mais elle est toujours là, et elle attire toujours autant la communauté homebrews, ainsi la PSP Homebrew Dev Conférence (PSPHDC), l'événement le plus attendu des développeurs et fans de la scène homebrew PSP, revient avec une édition extraordinaire !\n \nSi vous pensiez que la PSP était juste une chose du passé, préparez-vous car la communauté est plus vivante que jamais, et 2025 sera l'année de la révolution selon eux. \n \n \n \n\n \n \n \nOutils et développement :\n \n« PSPDEV – Qu’est-ce qui a changé ? »  ( @wouter ) – Des nouvelles sur le SDK le plus puissant pour PSP !\n \n« Media Engine Reload : ce qui change en 2025 »  ( @m-cid ) – De nouvelles frontières pour le matériel PSP.\n \n« Leap Engine : amenez vos projets sur PSP ! »  ( @iyenal ) – Un moteur pour simplifier le développement.\n \n« SDL3 »  ( @wouter ) – Mises à jour sur la bibliothèque qui révolutionne les jeux homebrew.\n \nJeux et portages :\n \n« Nazi Zombies: Portable »  ( @Cypress ) – Zombies, armes et survie sur votre PSP !\n \n« Zombie Crisis: Director's Cut »  ( @Andrew « Hudson » Childs ) – Un classique de l'horreur réinventé.\n \n« Neighbours from Hell »  ( @Dantron ) – Le classique culte humoristique enfin sur PSP !\n \n« Minecraft Story Mode pour PSP »  ( @entitybtw ) \n \nModding et firmware :\n \n« ARK-4 Custom Firmware »  ( @acid_snake ) – Le futur du CFW PSP est là !\n \n« Exploration de la sortie vidéo PSP-1000 »  ( @joshjenney ) – Modifications matérielles et logicielles pour la sortie vidéo.\n \nDécompilations et traductions :\n \n« Décompilation correspondante de Castlevania SOTN pour PSP »  ( @xeeynamo ) – La légendaire Symphonie de la Nuit révélée !\n \n\"Puyo Puyo !! Traduction anglaise de l'édition 20e anniversaire\"  ( @Armando ) – Enfin en anglais !\n \n \n \n \n\n \n \n \nRendez-vous le 21 juin 2025 à 18h00 CET !   Discord ici . \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207876/in-psp-la-conference-psp-homebrew-dev-dans-2-jours-1.png"
        }
    },
    "news_3": {
        "title": "[Switch] NxNandManager supporte désormais le firmware 20.1.5",
        "content": "Proposé à l'origine par Eliboa, l'utilisateur JerémKO nous propose de découvrir une nouvelle version de NxNandManager qui supporte le tout dernier firmware 20.1.5. Comme vous le savez NxNandManager  est un utilitaire dont le but principal est de copier le contenu de Nintendo Switch (NAND complet ou une partition spécifique) vers / depuis un fichier ou un lecteur physique, cependant il faut le mettre à jour à chaque arrivée de nouveau firmware. \n \nVous l'aurez compris, il ne s'agit pas d'une version officielle, mais d'un fork de la version 5.2.1 qui supporte la mise à jour 20.1.5.\n \n \n\n \n \nTéléchargement : NxNandManager_v5.2.1_update20.1.5_x64 (112 Mo)\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207855/in-switch-nxnandmanager-supporte-desormais-le-firmware-2015-1.jpg"
        }
    },
    "news_4": {
        "title": "[Switch] Sphaira 0.13.3 disponible",
        "content": " \nLe développeur TotalJustice a proposé plusieurs mises à jour successive de Sphaira, la solution de remplacement du hbmenu proposant des fonctionnalités inédites, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \nLes changements dans ces versions sont nombreux compte tenu qu'il a proposé la v0.13 puis la 0.13.1 et désormais la v0.13.2, cela passe par l'optimisation du téléchargement, du serveur FTP, il est venu corrigé pas mal de crashs, des blocages, et des suppressions intempestives. \n \n \n\n \n\n \n \nv0.13.2 : \n \n- Correction de la détection de carte dans le menu GameCard.\n- Correction de CreateFolderWithPath pour le crash du disque dur en raison d'une déréférencement nullptr.\n \nv0.13.1 :\n \n- Correction d'un blocage potentiel si un jpeg non valide était chargé avec nvjpg (merci à Dark_Iron_Xpour avoir signalé et aidé à corriger le bogue).\n \nv0.13.0 :\n \nCorrections de bugs :\n- Correction d'un crash rare lors de la fermeture de l'App Store.\n- Correction du menu gc ne permettant pas de sélectionner « Retour » lorsqu'une carte de jeu n'est pas insérée.\n- Correction du crash du téléchargement du thème themezer lors du téléchargement de certains thèmes contenant % dans leur nom de fichier.\n- Correction du blocage du disque dur lors de la copie, de la compression ou de la décompression du disque dur vers le disque dur en raison d'un bug de blocage dans usbhsfs (sera bientôt corrigé en amont).\n- Correction de la non-suppression de la sauvegarde avant la restauration, ce qui pouvait entraîner la conservation de fichiers obsolètes.\n- Correction de la structure du ticket es qui n'avait pas la bonne taille, ce qui pouvait entraîner l'échec des installations.\n- Correction du navigateur de fichiers qui n'affichait pas le système de fichiers de montage actuel correct lorsque les traductions étaient activées.\n- Correction du bouton d'écran partagé du navigateur de fichiers qui ne fonctionne pas.\n- Fichiers tik/cert fixes placés au début du nsp lors du vidage, ils sont désormais placés à la fin de la liste des fichiers, conformément au standard NSP.\n \nCe qui a changé : \n- Ajout de la sauvegarde/restauration sur USB.\n- Homebrew s'actualise lorsqu'une application est installée/supprimée de l'Appstore, ainsi que lors du téléchargement via ghdl.\n- Prise en charge ajoutée pour tous les types de sauvegarde (système, bcat, cache, périphérique).\n- Ajout de messages d'erreur plus descriptifs pour les erreurs internes de Sphaira.\n- Activation du mode boost le plus tôt possible lors de l'initialisation.\n- Ajout de la prise en charge du montage personnalisé mtp (carte SD, image SD/NAND, installation, test de vitesse).\n- Utilisation de l'horodatage de sauvegarde réel lors de la création d'une sauvegarde zip de sauvegarde.\n- Ajout d'un correctif de ticket commun si le ticket a été modifié. ceci est appliqué lors de l'installation et du vidage du jeu.\n- Ajout d'une option de conversion de ticket personnalisé -> commun pour l'installation.\n- Mise à jour de nombreuses traductions\n \n \nEdit 17h00 v0.13.3\n \nTéléchargement : Sphaira 0.13.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207852/in-switch-sphaira-0132-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207852/in-switch-sphaira-0132-disponible-2.png"
        }
    },
    "news_5": {
        "title": "[Switch 1 &#38; 2] Nintendo sort le firmware 20.1.5",
        "content": " \nNintendo vient de dégainer un nouveau firmware à destination de la Switch 1 et 2, la firme ne dit pas à quoi sert réellement ce firmware, certains disent qu'il pourrait rectifier les quelques instabilités Wifi relevées sur la Switch 2 par certains utilisateurs. Les deux consoles partagent désormais le même firmware, ce qui va compliqué pour connaitre les nouveautés de l'une et de l'autre si le changelog n'est pas détaillé.\n \n \n\n \n \n \nChangelog :\n \n- Améliorations générales de la stabilité du système pour une expérience utilisateur optimale.\n- SwtichBrew n'a pas encore communiqué sur ce firmware.\n- Comme toujours, veuillez attendre que Homebrew soit à jour si nécessaire pour effectuer la mise à jour.\n \nD'après les premiers retours, ce firmware 20.1.5 ne dispose pas de nouvelles clés, les correctifs Bootloader et PNGShot sont les mêmes que sur le 20.1.1.\n \n \n\n \n \nLa mise à jour concerne : \n \n- Modules système : compte, ns, erpt, pctl, migration.\n- Applets : qlaunch.\n \nTous les changements sont référencés ici : https://switchbrew.org/wiki/20.1.5\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207830/in-switch-1-2-nintendo-sort-le-firmware-2015-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207830/in-switch-1-2-nintendo-sort-le-firmware-2015-2.png"
        }
    },
    "news_6": {
        "title": "[Switch2] David Buchanan continue d'analyser sa Switch 2",
        "content": " \nDavid Buchanan, un spécialiste de rétro-ingénierie, aussi appelée ingénierie inverse ou inversée, a continué d'analyser sa Nintendo Switch 2. Pour rappel, David Buchanan est la personne qui s'est donné comme projet de développer une solution permettant de convertir le port microSD Express en SSD NVMe. \n \nLe développeur précise qu'il est un passionné d'informatique, et d'électronique, mais pas de la Switch 2, sur son profil il est question de la Switch 2, mais aussi de beaucoup d'autres choses intéressantes. \n \nPremière chose intéressante, Nintendo propose un \"jeu\" portant le nom de \"Welcome Tour\", vendu 9.99 euros, ce titre par moment permet de se retrouver dans les entrailles de la console, et bien sachez que Nintendo est allé jusqu'à reproduire exactement le PCB initial de la Switch 2 dans son jeu. \n \n \n\n \n \nDans le jeu c'est la \"Inner Area\" qui montre la console de l'intérieur, on y découvre des détails très précis comme la puissance et la capacité de la batterie, certains se sont empressés de la démonter, mais tout est là, 3.78 volts, 5220 mAh, 19.74 Wh. \n \n \n\n \n\n \n \nMais c'est surtout sur la partie analyse du PCB que les détails sont frappants, les ponts et le circuit imprimé apparait comme en réalité. \n \n \n\n \n \nDavid Buchanan a analysé le signal de la Switch 2, mais cela n'apporte rien et il a republié un Github sur un autre développeur qui propose des plans et templates sur des adaptateurs Micro SD express. Ca s'organise doucement, mais concrètement il faudra passer par l'ajout d'un Raspberry, ce qui complexifie l'approche de David Buchanan, qui elle se base sur les possibilités de gestion du contrôleur PCIe de la Switch 2. \n \n \n \n \n\n \n\n \n \nLa : SD-Express-Template-and-Adapters\n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207810/in-switch2-david-buchanan-continue-danalyser-sa-switch-2-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207810/in-switch2-david-buchanan-continue-danalyser-sa-switch-2-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1207810/in-switch2-david-buchanan-continue-danalyser-sa-switch-2-1.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1207810/in-switch2-david-buchanan-continue-danalyser-sa-switch-2-3.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1207810/in-switch2-david-buchanan-continue-danalyser-sa-switch-2-4.png"
        }
    },
    "news_7": {
        "title": "[PS4] GoldHEN supportera bientôt les firmwares 11.02, 12.00 et 12.02",
        "content": " \nAvec plus de 300 offsets, GoldHEN est comme vous le savez le payload majeur de la PS4, supportant officiellement les firmware 5.05, 6.71, 6.72, 9.00, 9.60, 10.00, 10.01, 10.50, 10.70, 10.71 et 11.00, il n'en demeure pas moins encore sujet à évolution.\n \n \n \n\n \n \n \nRécemment a été découvert la possibilité de lancer les Debugs Settings sur les tous derniers firmwares, notamment en combinant Remote Lua Loader avec Lapse, le dernier exploit découvert pour la PS4, bien entendu pour cela il faut s'appuyer sur la version la plus récente de Remote Lua Loader, et surtout sur les dernières versions des payloads, c'est pourquoi par exemple Al Azif recommande d'injecter les payloads plutôt que d'utiliser des solutions toute-en-une qui parfois ne bénéficient pas des dernières versions. \n \n \n \n\n \n \n \n \nQuoiqu'il en soit avec les possibilités offertes par la mise à jour de Vortex-HEN d'Echo Stretch, et ces nouveaux payloads compatibles avec la version Lua de Lapse, tout devient possible, et le développeur SisTR0 travaille activement à la nouvelle version de GoldHEN, l'exploit a été trouvé, les offsets également, le développeur Zecoxao de son côté demande à tous ceux qui disposent d'une PS4 sous firmware 12.02 avec un compte PSN actif de dumper les jeux via FTP et les lui envoyer, et qu'il s'occupera du reste, rappelant que le chemin d'accès est /mnt/sandbox/pfsmnt.\n \nEn entendant que cette version de GoldHEN se finalise, il est recommandé d'utiliser la version personnalisée de shahrilnet de Remote Lua Loader, qui intègre les toutes dernières évolutions. \n \n \n \n\n \n \n[2025-06-17]\n- Ajout d'un payload pour dumper le kernel via le JB PS4\n- Correction du serveur ftp et de la description de Lapse\n \n[2025-06-16]\n- Ajout de correctifs pour le kernel de la PS4 pour les firmwares compris entre 9.00 et 12.00\n- Ajout de la post-exploitation Lapse PS4 \n- bin_loader.lua \n- Chargement des payloads à partir d'un socket sur le port 9021 ou du système de fichiers.\n- Ajout de FuyuKiss à ftp_server.lua\n \nTéléchargement : remote_lua_loader de shahrilnet\n \n \nL'autre Remote Lua Loader qui évolue rapidement est celui de Master-s qui est régulièrement mis à jour puisqu'il s'agit d'un fork de celui de shahrilnet.\n \n \n\n \n \nTéléchargement : remote_lua_loader 4.3\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207773/in-ps4-goldhen-supportera-bientot-les-firmwares-1102-1200-et-1202-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1207773/in-ps4-goldhen-supportera-bientot-les-firmwares-1102-1200-et-1202-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1207773/in-ps4-goldhen-supportera-bientot-les-firmwares-1102-1200-et-1202-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1207773/in-ps4-goldhen-supportera-bientot-les-firmwares-1102-1200-et-1202-3.png"
        }
    },
    "news_8": {
        "title": "[Xbox] Microsoft annonce une nouvelle génération de console",
        "content": "Microsoft vient d'annoncer le développement de la prochaine génération de consoles Xbox, une bonne nouvelle, sachant que Sony a fait également des allusions à sa PS6 il y a quelques heures. \n \nMicrosoft a confirmé que sa console est actuellement en développement et qu'elle aura pour coeur un APU proposé par AMD, l'annonce a été faite par Sarah Bond, rien de surprenant donc sur ce point, les APU des dernières Xbox étant toujours des dérivés d'APU d'AMD, un kit AMD 4800s pour la Xbox Series X. \n \n \n\n \n \nElle est assez explicite dans sa vidéo, elle annonce que la console sera dans votre salon et entre vos mains, petite information importante, elle annonce que la nouvelle génération maintiendra la compatibilité avec votre bibliothèque actuelle, la fameuse rétrocompatibilité toujours annoncée, et jamais réellement physique puisqu'il faut passer par le cloud ou l'émulation.\n \n \n\n \n \nElle annonce aussi que la limite ne sera plus hardware, mais que la dimension de jeu va se faire au delà, avec notamment du multi-plate forme, on pense tous au Xcloud, et surtout là encore un partenariat étroit avec Windows.\n \n \n\n \n \nBon, il restera à voir ce à quoi nous allons assister, la naissance d'une Xbox portable, ou bien une console hybride à la Switch 2 mais beaucoup plus puissante, l'essentiel étant aussi d'assurer la ludothèque, la disponibilité et la qualité des jeux, ce qui n'a pas toujours été le cas sur la génération actuelle.\n \n \n\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207769/in-xbox-microsoft-annonce-une-nouvelle-generation-de-console-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207769/in-xbox-microsoft-annonce-une-nouvelle-generation-de-console-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1207769/in-xbox-microsoft-annonce-une-nouvelle-generation-de-console-3.png"
        }
    },
    "news_9": {
        "title": "[PS4] EchoStretch dévoile un nouveau HEN compatible avec les firmwares 12.00 et 12.02",
        "content": "Le développeur Echo Stretch dévoile une nouvelle version du HEN, au travers de ps4-hen-vtx, qui dispose du support des firmwares 12.00 et 12.02 de la PS4. \n \n \n\n \n \nAprès avoir proposé quelques correctifs pour le firmware 11.02, le développeur, avec l'aide de egycnq, a mis à jour son HEN afin de rajouter donc le support de ces firmwares. \n \n \n\n \n \nPour rendre cela possible, il faut passer par Remote Lua Loader, puis lancer le payload ps4-hen-1200-vtx, et les debugs settings deviennent alors accessibles. \n \n \nTéléchargement : ps4-hen-vtx\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207671/in-ps4-echostretch-devoile-un-nouveau-hen-compatible-avec-les-firmwares-1200-et-1202-1.jpg"
        }
    },
    "news_10": {
        "title": "[Switch2] Les bans se multiplient suite à l'utilisation du MigFlash sur Switch 2",
        "content": "Il semblerait que le risque de ban de Switch 2, après utilisation du MigFlash, soit très élevé, ou du moins certains utilisateurs commencent à informer que leur console Switch 2 a été bannie après son utilisation. \n \nC'est le cas de SquareSphere et de givemeupvotes qui rapportent en effet sur Reddit que Nintendo a banni leur console, pour le premier il a utilisé en ligne sa console Switch 2 après avoir profité du MigFlash, sa console a été bannie mais son compte lui ne l'a pas été, il n'a utilisé que des sauvegardes personnelles et aucun jeu téléchargé sur internet, il pense qu'il doit y avoir une nouvelle détection de Nintendo. Il rajoute qu'il a voulu jouer en ligne avec son MigFlash, ce qui nous pouvons en convenir n'est pas très malin. \n \n \n \n\n \n\n \n \n \nLe second utilisateur dispose lui de plusieurs consoles, deux Switch (une OLD et une OLED) de première génération et une Switch 2, là aussi un MigFlash avec ses propres sauvegardes, l'utilisant depuis longtemps sur la première génération sans aucun problème.\n \n \n\n \n \nIl raconte lui avoir juste essayer de mettre le MigFlash dans sa Switch 2, et que cela n'a pas fonctionné, il fallait en effet qu'il installe le dernier firmware 1.2.0 pour pouvoir profiter de ces jeux. Il a tenté de télécharger une mise à jour de jeu et d'exécuter ce jeu Switch 1 sur sa Switch 2.\n \nMais il dit que sa console a téléchargé une sorte de mise à jour, probablement il parle là du signalement du bannissement de la console. Clairement si vous utilisez un MigFlash dans une Switch 2, et que vous la connectez à internet (jeu en ligne, nintendo store, eshop...) le risque de ban semble très élevé. \n \n \n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207669/in-switch2-les-bans-se-multiplient-suite-a-lutilisation-du-migflash-sur-switch-2-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1207669/in-switch2-les-bans-se-multiplient-suite-a-lutilisation-du-migflash-sur-switch-2-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1207669/in-switch2-les-bans-se-multiplient-suite-a-lutilisation-du-migflash-sur-switch-2-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1207669/in-switch2-les-bans-se-multiplient-suite-a-lutilisation-du-migflash-sur-switch-2-4.jpg"
        }
    },
    "news_11": {
        "title": "[Switch2] Activer le port MicroSD sans carte MicroSD Extrem",
        "content": "Exactement comme sur la Nintendo Switch de première génération, il est possible sur la Nintendo Switch 2 d'activer la fonction de la carte micro-SD Extrem sans pour autant en disposer, en s'appuyant sur une carte micro-SD classique. La Switch 2 intègre une nouvelle norme microSD, le microSD Express.\n \nL'utilisation de l'emplacement microSD Express de la Switch 2 nécessite au minimum la version 20.1.1 du firmware de la console, mais nécessite également une mise à jour ponctuelle des fonctionnalités, déclenchée par l'insertion d'une carte microSD Express et une connexion à Internet.\n \n \n\n \n\n \n\n \n\n \n \nCette fonctionnalité doit être téléchargée, il pourrait être intéressant de télécharger l'astuce avant qu'une mise à jour vienne corriger le bug, pour réaliser l'astuce, il suffit de mettre une carte SD au format exfat et d'aller sur l'importation de photo et vidéo, une mise à jour se télécharge alors et l'installation du pilote (driver) est donc réalisée via une mise à jour transparente. Cette vidéo explique comment déclencher la mise à jour et l'installer sans utiliser de carte microSD Express, une simple carte microSD standard suffit !\n \n \n\n \n \nTout cela est confirmé par MrMario dans une vidéo, ainsi il n'est pas indispensable de disposer d'une MicroSD Express Cards, une simple SD est bel et bien compatible. \n \n \nMerci à magicden pour l'information en MP\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207581/in-switch2-activer-le-port-microsd-sans-carte-microsd-extrem-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207581/in-switch2-activer-le-port-microsd-sans-carte-microsd-extrem-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1207581/in-switch2-activer-le-port-microsd-sans-carte-microsd-extrem-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1207581/in-switch2-activer-le-port-microsd-sans-carte-microsd-extrem-4.png"
        }
    },
    "news_12": {
        "title": "[Switch2] De nombreuses vidéos fakes sur Nintendo Switch 2",
        "content": "Des petits malins dévoilent de trop nombreuses vidéos sur le lancement de jeux Switch 2 ou sur la possibilité de dumper des jeux Switch 2 pensant pouvoir en tirer quelques euros. Sachez que tout ce que vous pourriez découvrir au travers des réseaux sociaux ou de certains sites commerciaux sont tout simplement des fakes. \n \n \n \n\n \n \n \nLa dernière en date concerne BlueNX, une vidéo postée par un certain deadkernel, tout cela est fake, on y voit clairement que ce lancement se fait sur une Switch de première génération. \n \nLe HOS utilisé est le firmware 18.1.0, firmware qui n'existe pas sur la Switch 2, on y voit que le numéro de série utilisé ne correspond à celui d'une console de seconde génération, puisqu'ils commencent par HAE1003XXXXXX, on y voit clairement l'utilisation de 4 Go de Ram, alors que la Switch 2 dispose de 12 Go.\n \n \n\n \n \n \n \nCe CFW BlueNX-launcher v0.8.1-alpha n'existe nulle part, et est tout simplement un vaporware, ne vous laissez pas tromper. \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207569/in-switch2-de-nombreuses-videos-fakes-sur-nintendo-switch-2-1.jpg"
        }
    },
    "news_13": {
        "title": "[Switch2] MigFlash propose le firmware pour les jeux Switch 1",
        "content": "Comme annoncé, l'équipe en charge du développement du linker MigFlash propose la mise à jour firmware de leur solution permettant de lancer officiellement les jeux Switch 1 sur la Nintendo Switch 2. \n \nLe firmware 1.2.0 vient d'être rajouté à la section téléchargement de leur site institutionnel, permettant à tout détenteur de Switch 2 de lancer les titres Switch 1, l'équipe rajoute que cette mise à jour ne contient rien d'autre. \n \nD'ailleurs, la team informe que \" d'autres nouveautés seront disponibles dans le prochain firmware que nous publierons \" . Les vidéos de lancement de titres Switch 1 sur Nintendo Switch 2 avec MigFlash se multiplient.\n \n \n\n \n \nTout est là : \n \nhttps://migflash.com/\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207566/in-switch2-migflash-propose-le-firmware-pour-les-jeux-switch-1-1.jpg"
        }
    },
    "news_14": {
        "title": "[Switch] ldn_mitm v1.18.0 disponible",
        "content": "Le développeur spacemeowx2 vient de dévoiler une nouvelle version de ldn_mitm désormais suivi de la numérotation v1.18.0.\n \nLe module ldn_mitm, si votre console est bannie ou que vous souhaitez tout simplement vous protéger d'un éventuel ban, vous permet de prendre en charge presque tous les jeux supportant le réseau sans fil local. Ce fichier KIP, nommé Ldn_mitm, vient en complément de switch-lan-play. \n \nAu programme, la première des nouveautés est le support des firmwares de la branche 20.xx.\n \n \n \n \n\n \n \n \nChangelog 1.18.0 : \n \n- Mise à jour de README.md par impeeza \n- Mise à jour des la version Bump afin de prendre en charge le support des firmwares 20.xx et les étapes de construction des builds ont été corrigées par MasonT8198 \n- nightly.yml : correction des nights builds par MasonT8198 \n \n \nTéléchargement : ldn_mitm v1.18.0\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207541/in-switch-ldn-mitm-v1180-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[PS3] Evilnat propose de tester le CFW 4.92.2 Evilnat",
        "content": " \nLe développeur Nathan Martin propose aux détenteurs de PS3 sensibles de tester son tout nouveau custom firmware le CFW 4.92.2 Evilnat. Depuis quelques jours il propose en effet les liens de son CFW 4.92.2 Evilnat en version CEX / PEX et DEX. Il faut garder à l'esprit qu'il s'agit d'une version Test ou Bêta. \n \n \n \n\n \n \n \n \n \nLes évolutions de ce CFW par rapport au précédent : \n \n- Basé sur le dernier firmware 4.92\n- Support Cobra externe chargé depuis l'USB\n- Support Fan Control sur ps2_netemu\n- Overclocking depuis le XMB\n- Nouveau menu CFW Tools & plus...\n \nSi tous les tests sont concluants, cette version Bêta deviendra la version finale d'ici quelques jours précisent le développeur, sinon il continuera à proposer des optimisations. \n \n \nTéléchargement : \n \nCFW 4.92.2 Evilnat [CEX] [TEST]\n \n \nCFW 4.92.2 Evilnat [PEX] [TEST]\n \n \nCFW 4.92.2 Evilnat [D-PEX] [TEST]\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207508/in-ps3-evilnat-propose-de-tester-le-cfw-4922-evilnat-1.jpg"
        }
    },
    "news_16": {
        "title": "[Switch2] MigFlash fonctionnel sur Switch 2 avec les jeux Switch 1",
        "content": " \nLa Team MigFlash vient officiellement de poster l'information qu'elle travaille actuellement sur les prochaines mises à jour de leur linker MigFlash et du dumper pour la Nintendo Switch 2. \n \nElle indique qu'elle a fait une pause pour ajouter la fonctionnalité que tout le monde demandait : jouer aux jeux Switch 1 sur la toute nouvelle Nintendo Switch 2.\n \n \n\n \n \nPour que tout le monde reste serein, elle dévoile une vidéo dans laquelle les jeux Switch 1 se lance sur la Switch 2, pour cela le linker MigFlash dispose d'un nouveau firmware qui n'a pas encore été publié. Elle rajoute que les tests sont rigoureux et sérieux et que toute mise à jour nécessite du temps, sans précipitation. \n \nPour l'heure, seuls les jeux Switch 1 pourront être lancés sur la Switch 2, nous ne parlons pas encore des jeux Switch 2, pour cela il faudra passer probablement par une nouvelle version du dumper, ou au moins de sa mise à jour firmware, mais là aussi il faudra être patient. \n \n \n\n \n \n \nL'article officiel est disponible sur leur site ici : \n \nhttps://migflash.com/\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207444/in-switch-migflash-fonctionnel-sur-switch-2-avec-les-jeux-switch-1-1.png"
        }
    },
    "news_17": {
        "title": "[PS5] Itemzflow v1.11 disponible",
        "content": " \nCe n'est pas tout, Itemzflow a été également mis à jour en v1.11, le gestionnaire de jeu, ou game manager, spécifique à la PS5 arrive avec toutes les nouveautés qui en font une mouture indispensable.\n \n \n\n \n \n \nLes nouveautés de cette version 1.11 : \n \n- Ajout de l'option permettant d'ajouter un raccourci de Cheats, de jeux ou de navigateur personnalisé à la section média\n- IF affiche désormais les fichiers de jeu non signés dans un message pour plus d'informations.\n- Correction de l'affichage de la version d'itemzflow dans l'application\n- Ajout d'une option permettant d'ignorer les messages d'erreur IPC (problème de mode de repos)\n- Limitation de l'affichage des applications PS5 scannées à 10 pour que le message puisse s'afficher correctement\n- Mise à jour du plugin itemzflow xml patches en 1.04 (légères améliorations)\n \n \n\n \n \n \nTéléchargement : Itemzflow v1.11\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207443/in-ps5-itemzflow-v111-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207443/in-ps5-itemzflow-v111-disponible-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS5] etaHEN 2.2b disponible",
        "content": " \nLe développeur LightingMods dévoile une nouvelle version officielle d'etaHEN qui est proposé en v2.2b, cette mise à jour permet d'améliorer une nouvelle fois le payload dans la version PS5.\n \nLes améliorations portent essentiellement sur la désactivation de l'ASLR, qui permet ainsi une compatibilité totale avec les cheats codes PS4. Cette mise à jour comprend de nombreuses améliorations et de nouvelles fonctionnalités, telles que des raccourcis pour la manette, la prise en charge complète des cheats codes pour la PS4, un menu de jeu optimisé et bien plus encore.\n \n \n\n \n\n \n\n \n \n \nChangelog 2.2b \n \nNouveaux ajouts :\n- Toutes les cheats codes PS4 devraient désormais fonctionner maintenant que l'ASLR est désactivé\n- Les debugs settings ont été renommés en boîte à outils etaHEN dans le menu des paramètres et l'icône a été modifiée.\n- Ajout d'un menu de jeu PS5 (nommé d'après webMAN) à la boîte à outils pour ceux qui ne veulent pas utiliser itemzflow\n- Ajout d'un menu de raccourcis de contrôleur avec les raccourcis suivants (avec plus d'une option de combinaison de boutons pour chacun)\n-> Menu des cheats codes\n-> Boîte à outils\n-> Menu des jeux PS5\n-> Basculer Kstuff\n \n- Le menu Utilitaires a été remplacé par le menu Paramètres et se trouve désormais sous le menu Services\n- Correction du vérificateur de correctifs de jeu système pour ne pas mettre à jour automatiquement les jeux avec etaHEN actif\n- Mise à jour du menu Kstuff pour inclure l'option de mettre en pause les systèmes PS5 ou PS4 indépendamment\nl'option de téléchargement des astuces vérifiera désormais si elle est à jour au lieu de toujours retélécharger l'intégralité du dépôt à chaque fois\n- Ajout de la possibilité d'enregistrer les informations de lecture à distance sur une clé USB si une clé est détectée (les identifiants de compte codés et décodés)\n- Ajout de l'option permettant de désactiver le démarrage automatique de la boîte à outils dans les options du mode repos\n \nCorrections et mises à jour\n- Mise à jour de Kstuff vers la version 1.5\n- Mise à jour de PS5Debug vers la version 1.0b4 (prise en charge 6.xx) par@ctn123\n- Correction d'un problème qui provoquait le blocage du démon utilitaire etaHEN si des fichiers cheat .txt mal formés étaient présents\n- etaHEN tentera désormais de redémarrer le menu d'accueil si le chargement de la boîte à outils échoue\nmise à jour du décrypteur automatique itemzflow pour 7.xx\n- Amélioration du temps de démarrage d'etaHEN de 1 à 2 secondes\n- Mode simplifié mis à jour et amélioré\n- Correction d'un problème empêchant les utilisateurs d'activer les astuces après avoir désactivé le mode simplifié\n- Correction d'un problème avec les astuces qui n'affichaient pas la description complète pour les descriptions longues\n- [Dev/TestKits] La bannière d'activation rouge ne disparaîtra désormais que lorsque les correctifs d'activation seront présents\n- [Dev/TestKits] ajout de correctifs d'activation pour DevKit FW 3.21, 4.03, 4.51 et 5.50 et Testkit fw 4.03, 4.51, 6.50, 7.61\n- Suppression des journaux de plantage du démon au démarrage s'ils sont disponibles\n- Mise à jour de la disposition du fichier config.ini pour les nouveaux ajouts\n- Ajout du lien ko-fi au message de démarrage\n \n \n \nTéléchargement : etaHEN 2.2b\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207441/in-ps5-etahen-22b-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1207441/in-ps5-etahen-22b-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1207441/in-ps5-etahen-22b-disponible-3.jpg"
        }
    },
    "news_19": {
        "title": "[Switch2] Un projet pour convertir le port microSD Express en SSD NVMe",
        "content": "Un tout nouveau projet vient de sortir, il faut dire qu'il concerne de la Nintendo Switch 2 donc il ne peut pas être très vieux, mais c'est surtout qu'il met en avant une bonne initiative, le nom de ce projet est NVNT's SDEX2M2, cela consiste à développer un adaptateur qui va se charger de convertir le port microSD Express en port M2.\n \nLes développeurs travaillent sur un composant open source permettant de convertir le signal envoyé par la carte Micro SD Express pour exécuter un SSD NVMe. Le projet est entièrement open source, ce qui signifie que tout le monde peut y contribuer. \n \nL'adaptateur permettra d'utiliser des SSD M.2 2230 NVMe dans la Nintendo Switch 2 via le port MicroSD Express.\n \n \n\n \n \n \nComment est-ce possible ?\n \nCela est possible car l'emplacement MicroSD Express de la Nintendo Switch 2 prend en charge la norme SD Express 7.1, qui exploite une véritable interface PCIe Gen3 x1 et utilise le protocole NVMe pour la communication. Cet adaptateur mappe simplement le port PCIe x1 de l'emplacement MicroSD Express du Switch 2 vers un SSD NVMe M.2 2230 standard. Aucune conversion de protocole n'est requise, car le contrôleur hôte du Switch 2 gère tout.\n \n \n \n\n \n \nPour l'heure, l'équipe développe activement la conception du circuit imprimé et effectue des tests. Il existe toujours la possibilité qu'il y ait des problèmes liés à l'alimentation (c'est-à-dire que la consommation d'énergie des disques M.2 est supérieure à ce que le Switch 2 peut fournir), mais un niveau de filtrage d'alimentation de base a été ajouté pour, espérons-le, aider à établir une connexion.\n \n \n \n\n \n \n\n \n \n \nLe projet se trouve ici : switch2-SDEX2M2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207401/in-switch2-un-projet-pour-convertir-le-port-microsd-express-en-ssd-nvme-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207401/in-switch2-un-projet-pour-convertir-le-port-microsd-express-en-ssd-nvme-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1207401/in-switch2-un-projet-pour-convertir-le-port-microsd-express-en-ssd-nvme-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1207401/in-switch2-un-projet-pour-convertir-le-port-microsd-express-en-ssd-nvme-1.jpg"
        }
    },
    "news_20": {
        "title": "[PS5] PS5Debug, linkdev et offact supportent un panel élargi de firmwares",
        "content": "Le développeur John Tornblom a souhaité élargir le support de l'outil PS5 offline account activation, mais aussi de PS5 link device, le développeur ctn123 quand à lui a mis à jour ps5debug afin qu'il support les firmwares 6.xx. \n \nAinsi PS5 offline account activation et PS5 link device bénéficient désormais du support du dernier SDK, qui intègre les offsets des firmwares 8.xx, 9.xx et 10.0x. ps5debug quand à lui a été testé par kmeps4 et Pharaoh2k pour apporter le support des firmwares 6.xx. \n \n \n \n\n \n \n \nRappelons que PS5 offline account activation permet d'activer un compte hors ligne sans nécessité de la connecter au PlayStation Network, PS5 link est la version homebrew de ps5-remoteplay-get-pin, tandis que ps5debug est un payload qui permet de profiter d'un débogueur, il offre donc de nombreuses possibilités, il conserve d'ailleurs la même API que la version PS4, ce qui fait que la compatibilité est totale avec la bibliothèque libdebug. \n \n \n \nTéléchargement : PS5 offline account activation / PS5 link device / ps5debug\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207373/in-ps5-ps5debug-linkdev-et-offact-supporte-un-panel-elargi-de-firmwares-1.jpg"
        }
    }
}