{
    "news_1": {
        "title": "[PS4] GoldHEN Cheats Manager v1.1.0 disponible",
        "content": "Le développeur Bucanero vient de mettre en ligne une nouvelle version de GoldHEN Cheats Manager, comme vous le savez en plus de pouvoir sélectionner des astuces pour les cheatscodes, il permet d'appliquer des correctifs par exemple ceux créés par illusion0001. Au delà de ça, il permet aussi de convertir les types de cheats codes selon le format (classique par adresse, GoldHEN et SHN).\n \n \n\n \n \nChangelog 1.1.0\n \nAjouté : \n- Possibilité de supprimer les paramètres des patchs\n- Prise en charge des patchs à motifs masqués pour le filtrage\n- Nouveau menu de mise à jour\n- Mise à jour des Cheats depuis le Web, le disque dur, l'USB (@illusion0001)\n- Mise à jour des patchs depuis le Web, le disque dur, l'USB\n- Sauvegarde des fichiers de triche locaux au format .Zip (HDD/USB)\n- Sauvegarde des fichiers de correctifs locaux au format .Zip (HDD/USB)\n \nDivers :\n- Inclut le dernier cheat+patch pack officiel (2023-06-01)\n \n \nTéléchargement : GoldHEN Cheats Manager v1.1.0 \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174707/in-ps4-goldhen-cheats-manager-v110-disponible-1.jpg"
        }
    },
    "news_2": {
        "title": "[Switch] DBI 576",
        "content": "Rashevskyv, le développeur de DBI propose une nouvelle version de son logiciel, la version 576. DBI, pour DB Installer, est un gestionnaire et installateur de fichiers NSP/NSZ/XCI et XCZ via SD, USB. Il fonctionne tout aussi bien en standalone ou bien en créant son propre serveur http local. Il permet aussi de gérer et supprimer les fichiers orphelins les tickets (mise à jours par exemple). Hormis une tendance très minimaliste exacerbée, DBI est apprécié pour ses fonctionnalités et une partie backend de Windows qui permet de faciliter les transferts.\n \nChangelog 576 :\n- Fixed a memory allocation bug for buffers (\"Extra buffers exceeded\"): This addresses a memory management issue where the maximum number of buffers was exceeded.\n- Fixed a visual glitch on the dbibackend standby screen: This presumably refers to a rectification of a visual defect present on the standby screen of the dbibackend system or application (#224)\nImplemented secure password and certificate support for SSH File Transfer Protocol (with keys '/switch/.ssh/id_rsa' and '/switch/.ssh/id_rsa.pub'): This denotes a security improvement where SSH authentication using passwords and certificates has been supported.\n- Updated libnx implementation: This signifies that the implementation of libnx (a library often used in the context of Nintendo Switch homebrew development) has been updated.\nTéléchargement: DBI 576\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174698/in-switch-dbi-576-1.jpg"
        }
    },
    "news_3": {
        "title": "[Switch] L'émulateur Switch Yuzu a été porté sur Android",
        "content": "L'équipe en charge du développement de Yuzu vient d'annoncer que la version Android de Yuzu vient d'être mise en ligne. Il s'agit là d'une nouvelle étape dans l'essor de Yuzu, apportant ainsi une diversité plus large des plates-formes permettant de faire tourner l'émulateur puisque cela ouvre le monde aux tablettes et au smartphones. \n \nForcément cette première version est loin d'égaler la version PC qui court après des années de développement, elle n'a pas de fonctions multi-joueurs, l'idée étant d'abord de se concentrer sur le développement pur et les optimisations avant de s'ouvrir à des modes alternatifs. \n \nIl y a quelques limites à l'utilisation de Yuzu sur Android, il faut obligatoirement utilisé au minimum Android 11 et des extensions de l'API Vulkan. \n \n \n \n\n \n\n \n \n \nLa Team s'exprime sur leur site\n \nPourquoi ?\n \nAu cours de l'année écoulée, nous avons fait des progrès considérables pour améliorer la précision et les performances de Yuzu. Et avec de nombreuses autres améliorations en cours, nous avons compris que plus nous attendions, plus il deviendrait difficile pour nous de supporter une version Android.\n \nA partir de cette version publique, toutes les futures activités de développement de yuzu tiendront compte de la compatibilité des fonctionnalités et de la plateforme pour Android. Cela devrait permettre de faciliter et de rationaliser notre processus de développement afin de mieux atteindre notre objectif d'indépendance vis-à-vis des plateformes.\n \nNous espérons accueillir des développeurs Android désireux de mettre leur expertise au service d'un projet de pointe et de produire de nouvelles fonctionnalités, des optimisations et d'autres améliorations pour yuzu !\n \n \n\n \n\n \n \nExigences matérielles\n \nPour l'instant, yuzu nécessite des appareils équipés de processeurs Qualcomm Snapdragon dotés de GPU Adreno. Les appareils équipés de SoC comme Exynos, Mediatek... ne devraient pas fonctionner du tout en raison de leurs pilotes de GPU \"moins bons qu'Adreno\", du moins dans un avenir proche. De plus, yuzu sur Android a des exigences élevées en matière de mémoire vive, c'est pourquoi les appareils haut de gamme offrent la meilleure expérience (par exemple, SD 865 et 8 Go de mémoire vive ou plus).\n \nyuzu sur Android est livré avec la possibilité d'exécuter des pilotes de GPU personnalisés, tels que les nouveaux pilotes officiels Adreno, ou Turnip utilisant libadrenotools pour améliorer les performances sur les SoC Snapdragon d'ancienne génération. Par ailleurs, il reste encore beaucoup d'optimisations spécifiques à Android à réaliser. Nous avons de nombreuses possibilités d'améliorer les performances, mais cela explique les exigences minimales actuelles du système.\n \nCette version initiale a été délibérément réduite au minimum afin que nous puissions nous concentrer sur l'amélioration des performances et de la stabilité. Comme nous l'avons déjà dit, nous nous engageons à atteindre la parité des fonctionnalités avec nos versions pour PC, mais il faut s'attendre à ce que cela se fasse lentement et pas immédiatement.\n \n \n\n \n \nTout est là : yuzu-emu.org\n \nTéléchargement : play.google.com (la version Early Access est vendue 5.49 euros)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174660/in-switch-lemulateur-switch-yuzu-a-ete-porte-sur-android-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174660/in-switch-lemulateur-switch-yuzu-a-ete-porte-sur-android-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1174660/in-switch-lemulateur-switch-yuzu-a-ete-porte-sur-android-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1174660/in-switch-lemulateur-switch-yuzu-a-ete-porte-sur-android-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1174660/in-switch-lemulateur-switch-yuzu-a-ete-porte-sur-android-5.png"
        }
    },
    "news_4": {
        "title": "[PS4] Sistr0 a ajouté 8 315 symboles au référentiel ps4_symbols",
        "content": "Le développeur Sistr0 vient de mettre à jour le github \"ps4_symbols\", ces fichiers sont très importants pour la scène, ils compilent des informations nécessaires au développement pour les studios PlayStation. \n \n \n\n \n \nLes symboles sont des éléments principaux pour les développeurs, le travail de compilation fourni par Sistr0 est essentiel pour les développeurs qui essaient de comprendre et d'utiliser correctement les symboles et les noms dans leurs projets.\n \nCe sont 8 315 symboles PS4 qui ont été ajoutés au référentiel github (de 42 787 à 51 102), les symbols sont des fonctions qui sont codées dans le firmware, les décrypter, les connaitre, les identifier permet de mieux trouver des changements entre les firmwares. \n \n \n\n \n \n \nPour obtenir la liste des symboles à partir d'un fichier ELF spécifique, vous pouvez utiliser la commande nm suivie du nom du fichier ELF et diriger la sortie vers un fichier texte.\n \nPar exemple, si le nom de votre fichier ELF est nome_elf.elf et que vous souhaitez enregistrer la liste des symboles dans un fichier appelé liste.txt, vous pouvez exécuter la commande suivante : nm nome_elf.elf > liste.txt\n \nEncore mieux depuis 2 heures, il a même ajouté des symbols PS5 avec l'apport de flatz. \n \n \n \nTéléchargement : code source sce_symbols\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174654/in-ps4-sistr0-a-ajoute-plus-de-10-000-symboles-au-referentiel-ps4-symbols-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1174654/in-ps4-sistr0-a-ajoute-plus-de-10-000-symboles-au-referentiel-ps4-symbols-1.png"
        }
    },
    "news_5": {
        "title": "[New2DS/3DS] L'exploit Super-skaterhax supporte le firmware 11.17",
        "content": "L'exploit super-skaterhax vient d'être mis à jour par le développeur zoogie, l'objectif principal étant de prendre en charge le tout dernier firmware 11.17 pour les consoles New2DS et New3DS. Cet exploit Super-skaterhax est le successeur direct de l'exploit New Browserhax XL corrigé dans le firmware 11.4 qui exploitait une vulnérabilité UAF (use-after-free) présente dans le navigateur Web de la console. Il a vu le jour en Mars 2023.\n \n \n \n\n \n \nIl se base sur une attaque UAF qui s'appuie sur un exploit de la mémoire, une corruption de données, et des plantages, qui donne suite à une exécution de code, il prend en charge les firmwares 11.15, 11.16 et 11.17, mais uniquement pour les consoles New 3DS et New 2DS. En utilisant unSAFE_MODE, il est même possible d'installer un firmware personnalisé sans avoir à utiliser seedminer .\n \nAvec cette version 1.1, le support des systèmes américains (US) avec le firmware 11.17 a été rajouté. \n \n \nTéléchargement : super-skaterhax v1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174648/in-new2ds3ds-lexploit-super-skaterhax-supporte-le-firmware-1117-1.jpg"
        }
    },
    "news_6": {
        "title": "[PS4/XBO] Un nouvel exploit SMU AMD sur LM32 dévoilé",
        "content": "Un nouvel exploit sur les SMU AMD vient d'être dévoilé, il est basé sur LM32 version 7 et pourrait affecter les APU de vos consoles, on vous explique tout. \n \nLes CPU, APU et GPU d'AMD sont régulièrement testés et approuvés pour découvrir des failles et des exploits dans leur code, régulièrement des pirates dévoilent ou revendent des failles afin d'en tirer bénéfice, juste pour la gloire, ou pour marquer l'histoire. \n \n \n\n \n \n \nCet exploit qui vient de paraitre se base sur le SMU de votre APU, cependant il concerne l'architecture juste avant Zen, il est basé sur les caractéristiques de l'architecture LM32 alors que Zen et les versions ultérieures ont adopté les noyaux Xtensa pour leurs SMU.\n \nL'ingénieur en sécurité Jevin Sweval a révélé un exploit de sécurité pour les anciens coprocesseurs AMD SMU (pré-Zen) cependant il mentionne qu'il n'a pas été en mesure de faire fonctionner l'exploit sur PS4, bien que cela puisse fonctionner en théorie.\n \n \n \n\n \n \nLes anciens coprocesseurs AMD SMU (y compris celui de la PS4) sont basés sur l' architecture LM32 . Jevin Sweval a mis au point une technique pour extraire la clé de cryptage HMAC du firmware du SMU, permettant de signer son propre firmware personnalisé pour le SMU. \n \nBien entendu ce n'est pas un CFW, mais il permet un contrôle total sur le SMU, et permettrait en théorie d'obtenir les super-privilèges, ou du moins d'en être un point d'entrée. \n \nVoilà ce qu'il rapporte sur Twitter : \n \nIl s'avère qu'AMD a intégré le LM32 si complètement qu'il a conservé sa fonctionnalité de débogage. Depuis le SMU, vous pouvez désactiver les protections SRAM en lecture/écriture et lire le bootrom. Je ne possède pas de Xbox One et je n'y ai pas testé. L'APU/SMU de la PS4 a quelques bizarreries qui empêchent cette attaque dans sa forme actuelle (ou je fais juste une erreur stupide quelque part). Mais nous avons le bootrom et le FW PS4 SMU vidé par d'autres moyens et pouvons l'analyser pour d'autres vulnérabilités qui pourraient permettre l'exécution de code. Je travaille également sur un PCIe MITM comme Marcan l'a fait pour mieux comprendre le processus de démarrage de la PS4 sur PCIe au lieu de la lecture normale à partir du flash SPI.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174611/in-ps4xbo-un-nouvel-exploit-smu-amd-sur-lm32-devoile-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174611/in-ps4xbo-un-nouvel-exploit-smu-amd-sur-lm32-devoile-2.png"
        }
    },
    "news_7": {
        "title": "[Multi] RetroArch victime d'un hack d'une ampleur importante",
        "content": "Sans réellement parler d'une grande ampleur, la Team LibRetro a annoncé avoir été victime d'un piratage assez important, en début d'après-midi LibRetro a annoncé sur son Twitter avoir un \"problème\" avec le site web RetroArch. \n \nPuis l'équipe a commencé à parler d'une défaillance, puis vers 20h00 l'équipe a annoncé avoir été victime d'un \"hack\". Dans ce hack, les liens de téléchargement du site RetroArch.com ont été changés toute personne ayant téléchargé RetroArch via un lien MediaFire lundi peut avoir attrapé un logiciel malveillant.\n \nL'histoire semble se répéter, il y a deux ans, les buildbot et github de LibRetro avaient déjà été compromis. \n \nIl semblerait que les téléchargements renvoyaient vers des liens Mediafire, et que un (ou des membres) d'Evaderz soit impliqué, cependant le responsable de l'équipe Evaderz Discord , dirigée par Ryan , a décidé de prendre la parole pour nier toute implication dans la faille de sécurité de RetroArch et Libretro .\n \n\n \n \nDans une déclaration officielle, Ryan a exprimé sa condamnation de cet acte et a déclaré que la philosophie de leur communauté est basée sur le fair-play, le respect mutuel et la création d'un environnement sûr pour ses membres.\n \nBref, tout cela n'a peut être qu'un seul but, mettre aussi dans une mauvaise situation Evaderz.\n \nEspérons que tout cela soit rapidement colmaté, et que cela ne fragilise aucun des sites.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174604/in-multi-retroarch-victime-dun-hack-dune-ampleur-importante-1.png"
        }
    },
    "news_8": {
        "title": "[Switch] Sys-patch 1.4.2, Tesla Menu 1.2.3 et Status Monitor Overlay 0.9.1",
        "content": "Petit tour de piste pour la scène Nintendo Switch, quelques homebrews à surveiller ont été mis à jour par leur développeur. \n \nEn premier lieu c'est Sys-patch qui a été mis à jour par ITotalJustice, le script qui permet de patcher fs, es, ldr et nifm lors du boot est désormais proposé en version 1.4.2, qui est venue remplacé successivement la 1.4.0 et 1.4.1. \n \n \n\n \n \nAu chapitre des nouveautés, la correction du module système nifm pour le test de connexion afin qu'il fonctionne toujours sur les serveurs bloqués par Nintendo. De plus, les patchs peuvent désormais être désactivés individuellement. Cela signifie que les utilisateurs peuvent choisir d'activer ou de désactiver des correctifs spécifiques en fonction de leurs besoins ou de leurs préférences, ou bien si un correctif pause des problèmes de compatibilités.\n \nChangelog : \n \n- Ajout d'un patch ctest\n- Ajout par bascule de patch\n- Permet de rendre la superposition plus organisée\n- Correction de la détection de l'application du patch nifm ctest (1.4.1)\n- Correction de la non-concordance de la touche \"logging\" des options entre sysmod et overlay (1.4.2)\n \nTéléchargement : Sys-patch 1.4.2\n \n \nLe développeur WerWolv quand à lui propose la mise à jour de Tesla-Menu afin qu'il supporte la dernière mise à jour libtesla. Comme vous le savez Tesla se compose de trois parties individuelles : nx-ovlloader, TeslaMenu et libtesla. TeslaMenu est l'équivalent du menu hbmenu. C'est l'élément initial chargé par nx-ovlloader et qui agit comme un hub pour vous permettre de sélectionner tous les autres overlays.\n \n \n\n \n \nTéléchargement : Tesla-Menu\n \n \n \nEnfin le développeur Masagrator vient lui de mettre en ligne la 0.9.1 de Status Monitor. L'application permet de surveiller la console Switch pendant le jeu en cours en affichant la fréquence du CPU, du GPU et de la RAM, ainsi que la température et le niveau de rotation du ventilateur. L'outil propose à ce titre six modes (profils) différents à choisir dans le menu principal, Complet , Mini , Micro , Compteur FPS , Batterie et Divers, et certaines fonctions permettant de sauvegarder certains registres.\n \n \n\n \n \nChangelog : \n \n- Désormais, le chemin d'accès au fichier pour le mode Micro n'est pas codé en dur, il est récupéré via le menu Tesla.\n- Pour l'utiliser avec un nom de fichier modifié, il est nécessaire de mettre à jour Tesla Menu à la version 1.2.3 au minimum.\n- Sur les versions plus anciennes de Tesla Menu, il se comporte de la même manière que la version 0.9.0.\n \n \nTéléchargement : Status-Monitor-Overlay\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174552/in-switch-sys-patch-142-tesla-menu-123-et-status-monitor-overlay-091-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174552/in-switch-sys-patch-142-tesla-menu-123-et-status-monitor-overlay-091-1.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1174552/in-switch-sys-patch-142-tesla-menu-123-et-status-monitor-overlay-091-2.jpg"
        }
    },
    "news_9": {
        "title": "[Multi] Nintendo a envoyé un DMCA à Valve pour l'émulateur Dolphin",
        "content": "Nintendo ratisse large, le géant japonais vient d'envoyer à Valve une notification DMCA pour l'émulateur Dolphin, de là à dire que l'émulateur est dans le viseur du père de Mario il n'y a qu'un pas que nous pouvons franchir. \n \n \n \n\n \n \n \nL'histoire entre Valve (Steam) et l'émulateur Dolphin n'aura pas duré longtemps, l'équipe Dolphin vient de déposer un billet sur son blog : \n \n \nC'est avec beaucoup de déception que nous devons annoncer que la sortie de Dolphin sur Steam a été reportée sine die. Nous avons été informés par Valve que Nintendo a émis un DMCA contre la page Steam de Dolphin et a supprimé Dolphin de Steam jusqu'à ce que l'affaire soit réglée. Nous étudions actuellement nos options et aurons une réponse plus détaillée dans un proche avenir. Nous apprécions votre patience en attendant.\n \n \nAnnoncée en grande pompe fin Mars 2023, l'arrivée de l'émulateur Dolphin sur Steam n'aura tenu que quelques jours.\n \n \n\n \n \nLes portes paroles de Nintendo sur la raison du DMCA : \n \n \nParce que l'émulateur Dolphin viole les droits de propriété intellectuelle de Nintendo, y compris, mais sans s'y limiter, ses droits en vertu des dispositions anti-contournement et anti-trafic du Digital Millennium Copyright Act (DMCA), nous vous fournissons cet avis de votre obligation pour supprimer l'offre de l'émulateur Dolphin du store Steam.\n \n \nC'est sans appel, Nintendo dispose d'environ deux semaines pour décider de poursuivre ou non. Si ce n'est pas le cas, Dolphin pourrait alors potentiellement être rajouté à Steam.\n \nLes précédents procès en rapport avec l'émulation, intentés par Sony contre Bleem ! et Connectix , tous deux ont constaté que les émulateurs n'avaient pas violé les droits d'auteur avec leur utilisation du BIOS et du firmware PlayStation. Ces poursuites ont longtemps été utilisées comme précédent pour maintenir l'émulation comme légale aux États-Unis, mais c'est un sujet complexe connu comme une zone grise, et le cas de Nintendo ici serait probablement plaidé sur différents fondements juridiques. Pour l'heure, la Team à l'origine de l'émulateur Dolphin n'est pas attaqué par Nintendo, il ne s'agit que du retrait de Steam, mais cela laisse entendre que la firme va tôt ou tard s'en préoccuper. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174489/in-multi-nintendo-a-envoye-un-dmca-a-valve-pour-lemulateur-dolphin-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174489/in-multi-nintendo-a-envoye-un-dmca-a-valve-pour-lemulateur-dolphin-2.png"
        }
    },
    "news_10": {
        "title": "[XB] Cerbios Tool v1.1.1 et Cerbios v2.3.0 Beta disponibles",
        "content": "La Team Resurgent vient de mettre en ligne une nouvelle version de leur solution, pour rappel Cerbios est un firmware personnalisé pour la toute première Xbox originale et qui permet en premier lieu de supporter les disques durs de grande capacité, notamment jusqu'à 8 To, mais aussi 128 Mo de RAM, la lecture de fichiers ISO et les animations de démarrage personnalisées.\n \nIls ont profité de l'occasion pour mettre à jour Cerbios Tool qui est un outil qui vous permettra de personnaliser certaines fonctionnalités de Cerbios. Cerbios Tool vous permet de configurer des options telles que le mode UDMA, l'affichage du logo Cerbios et d'autres paramètres spécifiques. Cet outil offre la possibilité d'ajuster le BIOS à vos préférences et besoins, permettant une plus grande flexibilité et personnalisation de l' expérience Xbox.\n \n \n\n \n \nChangelog Cerbios 2.3.0 Beta :\n \n- Ajout de la possibilité de personnaliser le BIOS via Cerbios Tool sous Windows.\n- Ajout d'une fonction pour créer des thèmes pour le logo Cerbios à l'aide de Cerbios Tool.\n- Ajout de la possibilité de redimensionner ou de masquer complètement le logo Cerbios via l'outil Cerbios.\n- Ajout du mode expérimental UDMA 6, nécessitant l'utilisation de câbles IDE/ATA Ultra DMA (80 conducteurs) et d'adaptateurs Startech.\n- Suppression des clés IGR personnalisées du fichier INI et désormais configurables via Cerbios Tool.\n- Ajout de la possibilité d'utiliser des lettres de lecteur dans les chemins et au format \\Device*.\n- Ajout d'une fonction pour définir les modes UDMA 2-6 via Cerbios Tool.\n- Ajout de la possibilité de définir automatiquement le mode UDMA à l'aide de Cerbios Tool for Startech ou d'adaptateurs Sata vers IDE génériques. Le mode automatique détectera le mode UDMA pris en charge par l'appareil et le réglera en conséquence. Cependant, cette fonctionnalité est expérimentale et le mode UDMA 2 (mode sans échec) peut être lancé en démarrant la console Xbox via l'éjection. Les résultats du mode automatique peuvent être partagés dans la salle Discord dédiée.\n- Ajout du démarrage automatique en mode sans échec si l'erreur 9 ou 13 due à un mode UDMA incompatible est rencontrée.\n- Fichier mis à jour Cerbios.ini pour prendre également en charge les noms de chemin d'accès aux lettres de lecteur.\n- Améliorations générales de la stabilité du système.\n \n\n \n \n \nLe NFO est disponible ici : xboxnfo2472.nfo\n \n \n\n \n \nTéléchargement : Cerbios Tool V1.1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1340560260.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-888423032.png",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-851340870.png"
        }
    },
    "news_11": {
        "title": "[Switch] switch_AIO_LS_pack 4.14.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 4.14.0.Pour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.Le homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables. Depuis cette news les évolutions sont les suivantes:- Changelog pour la version 4.13.0:La luminosité par défaut dans Hekate est réglée à 100%.Mise à jour de Atmosphere, de DBI et de AIO-Switch-Updater vers la dernière version de ceux-ci.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 4.13.0:Ajout de la possibilité, via les fichiers de configuration, d'ajouter des fichiers complémentaires au pack (utile pour ceux souhaitant mettre en place des logos personnalisés par exemple).La luminosité par défaut dans Hekate est réglée à 100%.Correction d'un bug critique dans le système de traduction.Correction d'un bug critique dans le système de chargement des fichiers de configuration du homebrew.Correction d'un bug critique lorsque le homebrew était chargé depuis un autre dossier que son dossier \"switch/AIO_LS_pack_Updater\" (merci à @Cdtthor pour m'avoir beaucoup aidé à identifier le bug); de plus lorsqu'il est chargé depuis un autre emplacement il est déplacé à cet emplacement au lancement du homebrew.Correction d'un bug potentiel dans la vérification du type d'emunand.Notez que beaucoup de bugs critiques ont été corrigés dans le homebrew AIO_LS_pack_Updater, si vous utilisez le homebrew mettez-le impérativement à jour via celui-ci ou manuellement avant tout autre action.- Changelog pour la version 4.14.0:Ajout du module Sys-patch.Mise à jour de DBI, de Tesla-Menu et de Status-Monitor-Overlay vers la dernière version de ceux-ci.Mise à jour des crédits dans la documentation.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 4.14.1:Ajout d'une fonction de vérification d'une mise à jour du homebrew au lancement de celui-ci ou durant le changement de mode dans celui-ci. Si une mise à jour est trouvée il sera proposé à l'utilisateur de l'installer.Si une mise à jour du homebrew existe, celle-ci devra être faite avant d'installer/mettre à jour le pack ou le firmware.Ajout de la vérification du sha256 du fichier zip complémentaire au pack.Compilé avec la dernière version de la Libnx.D'autres changements mineurs dans le code sources.Pour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.N'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues.Si vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-4.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] sys-patch publié, le module patch la Switch au boot",
        "content": "Le développeur ITotalJustice vient de claquer un grand coup sur la table, un nouvel homebrew pour la Switch sous la forme d'un sys-patch. sys-patch est un sysmodule qui va s'exécuter au démarrage de votre Switch et il va corriger automatiquement à la fois le FS et l'ES du firmware, ainsi que le laoder d'Atmosphere pour donner essentiellement le même effet que ce que font les patchs signature, sans avoir besoin de s'appuyer sur la présence des patchs sur la carte SD.\n \nCe sysmodule a de grands avantages, pas besoin de maintenance ou de mise à jour car il effectue automatiquement les correctifs sans s'appuyer sur les hashs de fichiers comme le font les correctifs IPS réels, et s'appuie à la place sur les modèles de code/données réels à corriger.\n \n \n\n \n \nLe développeur l'explique peut être un peu mieux : \n \nL'avantage de sys-patch est qu'il n'a besoin d'être mis à jour que lorsque quelque chose de majeur sera corrigé, la dernière fois que cela s'est produit, c'était avec le firmware 15.0.0.\n \nUn autre avantage est que le patching LDR n'aura (probablement) jamais besoin d'être mis à jour. Dans le passé, si une mise à jour silencieuse d'Atmosphère se produisait, cela brisait les sigpatches (à moins que vous ne les mettiez à jour à nouveau).\n \nsys-patch produit également un journal dans lequel vous pouvez voir quels correctifs ont été appliqués, lesquels ont échoué et d'autres données utiles. Vous pouvez lire manuellement le journal ou utiliser la surcouche, que vous pouvez également utiliser pour modifier la configuration.\n \n \n\n \n \nTotalJustice recommande de garder pour le moment les sys-patch actuels, et considérer cette solution comme une solution alternative, comme une solution de secours au cas où certaines mises à jour rompraient la compatibilité avec sys-patch, mais on peut penser que très bientôt il aura la même stabilité et facultés, tous les avantages en plus. \n \n \nTéléchargement : sys-patch v1.3.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174445/in-switch-sys-patch-publie-le-module-patch-la-switch-au-boot-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174445/in-switch-sys-patch-publie-le-module-patch-la-switch-au-boot-2.png"
        }
    },
    "news_13": {
        "title": "[PS5] Le payload ps5-self-dumper compatible avec les .prx",
        "content": "Le développeur sleirsgoevy vient de mettre à jour il y a quelques heurs son payload ps5-self-dumper afin qu'il supporte désormais le dump des fichiers avec l'extension .prx. \n \nAinsi cela permet de supporter sur PlayStation 5 le dump de fichier .prx, cela signifie que les utilisateurs pourront désormais capturer et enregistrer des fichiers .prx à partir de la PS5, leur permettant de les consulter ou de les utiliser à des fins de modification et de personnalisation.\n \nCette mise à jour étend les fonctionnalités du payload qui permettaient auparavant de télécharger des fichiers eboot.bin et différents modules, encore une fois, cela ne permet pas d'exécuter les fpkgs, mais désormais les jeux sont dumpés en leur totalité. \n \n \n \n \n\n \n \nA noter que sleirsgoevy vient également de mettre à jour ps5-kstuff en ajoutant les macros pour lire les registres de débogage. Bref sleirsgoevy est très en forme et fait évoluer les choses, espérons le dans le bon sens.\n \n \nTout est là : ps5-self-dumper\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174438/in-ps5-le-payload-ps5-self-dumper-compatible-avec-les-prx-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] Une présentation de Specter dans quelques jours sur la PS5",
        "content": "Dans quelques jours, le 02 Juin 2023 pour être précis, le développeur Specter (ou SpecterDev) fera une présentation d'environ 45 minutes lors de la prochaine conférence Hardwear.io. Nous ne présentons plus hardwear.io, il s'agit d'une site spécialisé sur la sécurité informatique, durant laquelle un certain TheFlow avait présenté son exploit Bluray il y a tout juste un an. \n \n \n \n\n \nTheFlow en Juin 2022 \n \n \n \nDans cette présentation, Specter parlera de la sécurité de la PS5, d'ailleurs nous connaissons déjà le titre de la conférence \"Next-Gen Exploitation: Exploring the PS5 Security Landscape\" que l'on pourrait traduire par \"Exploit sur console Next-Gen : Explorez le paysage de la sécurité de la PS5\".\n \n \n\n \n \n\n \n \n \nRésumé :\n \nLa PlayStation 5 (PS5) représente une avancée technologique significative, en particulier en termes de mesures de sécurité, qui ont subi des améliorations substantielles par rapport à son prédécesseur, la PS4. En raison du manque de documentation publique sur les techniques de renforcement de la sécurité, il existe une certaine incompréhension de l'infrastructure de sécurité du système. Cette conférence vise à faire la lumière sur l'architecture du système de la PS5, en se concentrant sur les efforts de Sony pour empêcher l'ingénierie inverse et atténuer l'impact de la corruption de la mémoire du noyau.\n \nCette présentation se penchera sur les subtilités des mécanismes de sécurité de la PS5, en analysant l'évolution de la surface d'attaque et l'introduction de mesures d'atténuation modernes telles que la prévention de l'accès au mode superviseur (SMAP), la protection de l'exécution en mode superviseur (SMEP), l'intégrité du flux de contrôle du noyau (kCFI) et la mémoire eXecute Only Memory (XOM). En outre, nous étudierons le fonctionnement interne de l'hyperviseur du PS5 et analyserons son rôle dans la protection du système contre les attaquants disposant de privilèges élevés. Nous parlerons également de la manière dont ces mesures d'atténuation peuvent être contournées et nous mettrons en évidence quelques pistes et idées pour la recherche future.\n \n \nBiographie de l'orateur :\n \nSpecterDev est un chercheur en sécurité spécialisé dans l'exploitation du kernel sous linux, mobile et console. Il a commencé à faire de la recherche sur les consoles il y a cinq ans sur la PlayStation 4, et s'est récemment concentré sur la PlayStation 5 et l'AMD Secure Processor. Il coanime également un podcast hebdomadaire et un canal média appelé dayzerosec, qui suit et discute de diverses vulnérabilités récentes, d'exploits et de recherches.\n \n \nTout est là : specter.php  /  schedule.php\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174383/in-ps5-une-presentation-de-specter-dans-quelques-jours-sur-la-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174383/in-ps5-une-presentation-de-specter-dans-quelques-jours-sur-la-ps5-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1174383/in-ps5-une-presentation-de-specter-dans-quelques-jours-sur-la-ps5-3.png"
        }
    },
    "news_15": {
        "title": "[PS4] Illusion dévoile un plugin pour forcer le 30 FPS dans tous les jeux",
        "content": "Le développeur Illusion vient de mettre en ligne un nouveau plugin nommé force_30_fps.prx qui a pour mission de forcer l'affichage de n'importe quel jeu en 30 FPS. C'est la mise à jour 1.185 du GoldHEN_Plugins_Repository qui amène cette nouvelle possibilité. \n \nDit comme ça ça n'a l'air de rien, mais cela permet par exemple dans Résident Evil 4 Remake de passer de 25 FPS à 30 FPS en mode résolution sur PS4 Pro, et ainsi profiter de 20 % de performance en plus. Revers de la médaille quand la console peut donner davantage de FPS, le plugin limite aussi à 30 FPS. \n \n \n\n \n \nCela est possible grâce à une option proposée dans le plugin GoldHEN, depuis la version 2.3, il permet en effet de se soustraire à la limite d'affichage, pour être très honnête cela ne sera pas non plus flagrant à ce niveau, ce n'est pas comme si vous activiez un patch 60 FPS. \n \n \n \n\n \n \n \nPour l'installation c'est assez simple, il vous faudra une PS4 jailbreakée bénéficiant de GoldHEN 2.3 (ou supérieur). \nEnsuite aller activer l'option de chargement dans le menu plugins (Enable Plugins Loader).\nDe charger dans /data/GoldHEN/plugins/ le fichier force_30_fps.prx\nDe le lancer.\n \nA noter qu'illusion propose pas mal de plugins permettant de rajouter d'autres options au lancement du jeu, comme AFR (la redirection de fichier d'application), Échange de bouton X et O, forcer l'affichage 1080p, la suppression de taux de rotation, des correctifs de jeux, ou encore la configuration du mappage des boutons L1, L2, R1 et R2.\n \n \n \nTéléchargement : force_30_fps.prx\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174341/in-ps4-illusion-devoile-un-plugin-pour-forcer-le-30-fps-dans-tous-les-jeux-1.png"
        }
    },
    "news_16": {
        "title": "[3DS/2DS] Nintendo sort le firmware 3DS 11.17.0-50 pour patcher bannerbomb3",
        "content": "Décidemment Nintendo ne lâchera jamais rien, la firme japonaise vient de publier un nouveau firmware pour la 3DS et 2DS qui a pour objectif de corrigé le hack bannerbomb3. Cette mise à jour vient appliquer un patch qui corrige  le hack. \n \nOfficiellement il s'agit d'apporter \"D'autres améliorations de la stabilité globale du système et d'autres ajustements mineurs ont été apportés pour améliorer l'expérience utilisateur.\"\n \n \n \n\n \n \n \nIl s'agit là de la toute première mise à jour firmware pour la 3DS de l'année, ce firmware 11.17.0-50 vient donc corriger bannerbomb3, l'exploit s'appuyant sur les paramètres système de la 3DS. Étant donné que les nouveaux logiciels ne peuvent plus être achetés dans l'eShop , d'autres jeux sont également exclus pour ceux qui n'en ont pas encore acheté. \n \nNTRboot lui est toujours fonctionnel via les linkers, et il est encore trop tôt pour dire si super-skaterhax a été patché. S'agissant de boot9strap et Luma3DS, s'ils sont déjà installé sur votre console vous pouvez mettre à jour en toute sécurité et NTR CFW continuera lui aussi à fonctionner, sachant que cette mise à jour vient modifier CVer / NVer , Paramètres système , eShop , Menu d'accueil , 0004001B00018002 (Données du navigateur Web).\n \n \nLes rapports : \n \nhttps://yls8.mtheall.com/ninupdates/reports.php?date=2023-05-23_00-00-33&sys=ctr\n \nhttps://yls8.mtheall.com/ninupdates/reports.php?date=2023-05-23_00-00-41&sys=ktr\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174339/in-3ds2ds-nintendo-sort-le-firmware-3ds-11170-50-pour-patcher-bannerbomb3-1.jpg"
        }
    },
    "news_17": {
        "title": "[Switch] SwitchLayoutEditor 15 disponible",
        "content": "Le développeur exelix11, à l'origine en charge de l'éditeur, vient une nouvelle fois de mettre en ligne une nouvelle mouture de SwitchLayoutEditor. A l'origine proposé par FuryBaguette (qui est à l'origine de son développement), cet outil a pour but de simplifier et de rendre plus accessible la création de thèmes (et de layouts) pour la Nintendo Switch ! Pour rappel, l’application nous permet de modifier et de prévisualiser les fichiers .bflyt et les .bflan utilisés dans l’interface et dans les jeux du Switch.\n \nA noter que SwitchLayoutEditor n'avait pas été mis à jour depuis presque deux ans, déjà par exelix11.\n \n \n\n \n \nChangelog : \n \n- Support expérimental des templates bflan, cela permet d'écrire des templates json qui peuvent être utilisés pour automatiser la création d'éléments dans les fichiers d'animation (bflan).\n- Chaque modèle a un \"manifeste\" json qui définit les propriétés et le nom et un fichier d'implémentation réel, le fichier d'implémentation est défini dans le champ \"FileName\" de ce manifeste, l'implémentation est un json mais les valeurs sont remplacées à l'exécution par les \"macros\" définies dans Parameters dans le manifeste, les valeurs réelles sont sélectionnées à partir d'une interface graphique à l'exécution.\n- Les différentes options ne sont actuellement documentées nulle part, il faut se référer au fichier BflanTemplates.cs dans le code source.\n- Un modèle simple \"Animate color\" est fourni, il est composé d'un fichier .template et d'un descripteur .json\n- Les builds sont maintenant générés avec les actions Github\n \nTéléchargement : SwitchLayoutEditor 15\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174322/in-switch-switchlayouteditor-15-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[Wii/GC] Swiss v0.6r1476 disponible",
        "content": "Le développeur Extrems vient de mettre en ligne il y a quelques heures une nouvelle mouture de son outil Swiss qui est proposé en version v0.6r1476.\n \nComme vous le savez probablement Swiss est le digne successeur de SD-boot, il permet de lancer les homebrews GameCube mais aussi les backups stockés sur carte SD ou un disque dur, SDGecko, WODE, Wiikey Fusion et bien d'autres solutions. \n \n \n\n \n \nChangelog :\n \n- Désactivation de la mise en mémoire tampon pour FTP/SMB.\n- Ajout de quelques fermetures de fichiers manquantes.\n- Accélérer la recherche du deuxième disque lors du défilement en arrière.\n- Ajout d'une option pour aplatir la structure d'un répertoire.\n- Aplatir le répertoire des jeux Nintendont par défaut.\n- Affichage du chemin relatif lors de l'aplatissement.\n- Correction d'une erreur d'alignement de section dans le Wind Waker Randomizer.\n- Prise en compte d'un en-tête de disque malformé dans Bikmin 269.\n- Navigue vers l'entrée la plus récente lorsque la liste récente est entièrement activée.\n- Correction d'une barre oblique manquante.\n- Correction de la navigation vers un répertoire aplati.\n- Rafraîchir le navigateur de fichiers après avoir sauvegardé les paramètres.\n- Amélioration légère de la gestion des fichiers/répertoires courants.\n- Amélioration des performances.\n- Désactivation du débogueur WiiRD lorsque l'USB Gecko n'est pas présent.\n- Faire la même chose pour l'USB Gecko.\n- Lire directement dans le tampon avec FSP.\n- Transmettre de manière asynchrone lorsque c'est possible.\n- Permettre à nouveau un MTU de 2030 octets.\n- Installer l'ISR si nécessaire.\n \n \nTéléchargement : Swiss v0.6r1476\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174321/in-wiigc-swiss-v06r1476-disponible-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS5] Sleirsgoevy dévoile un payload permettant de dumper les jeux PS5 décryptés",
        "content": "Le développeur Sleirsgoevy vient de mettre en ligne \"PS5 4.03 Kernel Exploit Payload.bin Loader Host\", il s'agit là d'un tout nouveau payload qui permet de dumper les jeux PS5 décryptés. \n \nIl existe depuis un bon moment des moyens de dumper les versions cryptées des jeux PS5 notamment via FTP, mais les fichiers binaires sont restent cryptés. Avec ce nouveau payload, il est possible de décrypter les binaires d'un jeu en cours d'exécution et d'en faire ainsi une sauvegarde.\n \nLes personnes souhaitant dumper leurs jeux PS5 utiliseront ce payload pour dumper les fichiers binaires, et le FTP pour dumper les fichiers non chiffrés, comme par exemple les ressources, les images, les musiques, car le FTP est plus rapide. \n \n \n\n \n \nL'utilisation est toujours la même comme nous le rappelle Zecoxao : Démarrez le jeu, minimisez le jeu, accédez au navigateur, lancez l'exploit, puis chargez payload.bin. devrait dumper sur usb iirc.\n \nPour le moment il y aussi quelques restrictions, ainsi le payload n'est compatible qu'au format PLD (.bin) et uniquement sur le firmware 4.03, et surtout cela ne libère pas la possibilité de lire les fpkg. Vous l'aurez donc noté les payloads ELF ne sont pas supportés, et il est possible qu'il soit rapidement adapté aux autres firmwares. \n \nL'implémentation se trouve ici : https://sleirsgoevy.github.io/ps4jb2/ps5-403/index.html\n \nTéléchargement : code source   / dumper (à lancer netcat sur le port 9019)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174262/in-ps5-sleirsgoevy-devoile-un-payload-permettant-de-dumper-les-jeux-ps5-decryptes-1.png"
        }
    },
    "news_20": {
        "title": "[Switch] AIO-switch-updater v2.22.0 disponible",
        "content": "HamletDuFromage propose une nouvelle version d'AIO-switch-updater qui débarque en v2.22.0. Pour rappel, cet outil permet de profiter d'options très utiles comme mettre des DNS Lan Play, de mettre à jour Atmosphere ou les sigpatches, ou encore de gérer des cheats codes (via CheatSlips.com).\n \nLe petit homebrew proposé par le français a été mis à jour afin d'améliorer le support des packs personnalisés. \n \n \n\n \n \n \nAmélioration des packs personnalisés :\n \n- Augmentation de la longueur maximale des chaînes de caractères pour le clavier à l'écran\n- Utilisation de la vue web pour afficher le journal des modifications\n- Désactivation de l'invite de téléchargement hekate pour les téléchargements de packs personnalisés dont le nom commence par [PACK]\n- Mise à jour de la traduction chinoise (github.com/qazrfv1234)\n \n \nTéléchargement : AIO-switch-updater v2.22.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174256/in-switch-aio-switch-updater-v2220-disponible-1.jpg"
        }
    }
}