{
    "news_1": {
        "title": "[Switch2] Un projet pour convertir le port microSD Express en SSD NVMe",
        "content": "Un tout nouveau projet vient de sortir, il faut dire qu'il concerne de la Nintendo Switch 2 donc il ne peut pas être très vieux, mais c'est surtout qu'il met en avant une bonne initiative, le nom de ce projet est NVNT's SDEX2M2, cela consiste à développer un adaptateur qui va se charger de convertir le port microSD Express en port M2.\n \nLes développeurs travaillent sur un composant open source permettant de convertir le signal envoyé par la carte Micro SD Express pour exécuter un SSD NVMe. Le projet est entièrement open source, ce qui signifie que tout le monde peut y contribuer. \n \nL'adaptateur permettra d'utiliser des SSD M.2 2230 NVMe dans la Nintendo Switch 2 via le port MicroSD Express.\n \n \n\n \n \n \nComment est-ce possible ?\n \nCela est possible car l'emplacement MicroSD Express de la Nintendo Switch 2 prend en charge la norme SD Express 7.1, qui exploite une véritable interface PCIe Gen3 x1 et utilise le protocole NVMe pour la communication. Cet adaptateur mappe simplement le port PCIe x1 de l'emplacement MicroSD Express du Switch 2 vers un SSD NVMe M.2 2230 standard. Aucune conversion de protocole n'est requise, car le contrôleur hôte du Switch 2 gère tout.\n \n \n \n\n \n \nPour l'heure, l'équipe développe activement la conception du circuit imprimé et effectue des tests. Il existe toujours la possibilité qu'il y ait des problèmes liés à l'alimentation (c'est-à-dire que la consommation d'énergie des disques M.2 est supérieure à ce que le Switch 2 peut fournir), mais un niveau de filtrage d'alimentation de base a été ajouté pour, espérons-le, aider à établir une connexion.\n \n \n \n\n \n \n\n \n \n \nLe projet se trouve ici : switch2-SDEX2M2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207401/in-switch2-un-projet-pour-convertir-le-port-microsd-express-en-ssd-nvme-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207401/in-switch2-un-projet-pour-convertir-le-port-microsd-express-en-ssd-nvme-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1207401/in-switch2-un-projet-pour-convertir-le-port-microsd-express-en-ssd-nvme-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1207401/in-switch2-un-projet-pour-convertir-le-port-microsd-express-en-ssd-nvme-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS5] PS5Debug, linkdev et offact supportent un panel élargi de firmwares",
        "content": "Le développeur John Tornblom a souhaité élargir le support de l'outil PS5 offline account activation, mais aussi de PS5 link device, le développeur ctn123 quand à lui a mis à jour ps5debug afin qu'il support les firmwares 6.xx. \n \nAinsi PS5 offline account activation et PS5 link device bénéficient désormais du support du dernier SDK, qui intègre les offsets des firmwares 8.xx, 9.xx et 10.0x. ps5debug quand à lui a été testé par kmeps4 et Pharaoh2k pour apporter le support des firmwares 6.xx. \n \n \n \n\n \n \n \nRappelons que PS5 offline account activation permet d'activer un compte hors ligne sans nécessité de la connecter au PlayStation Network, PS5 link est la version homebrew de ps5-remoteplay-get-pin, tandis que ps5debug est un payload qui permet de profiter d'un débogueur, il offre donc de nombreuses possibilités, il conserve d'ailleurs la même API que la version PS4, ce qui fait que la compatibilité est totale avec la bibliothèque libdebug. \n \n \n \nTéléchargement : PS5 offline account activation / PS5 link device / ps5debug\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207373/in-ps5-ps5debug-linkdev-et-offact-supporte-un-panel-elargi-de-firmwares-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS5] PS5 BDJB Modified ISOs v1.17 disponible",
        "content": "Le développeur Viktorious-x est de retour et propose une nouvelle version de son outil PS5 BDJB Modified ISOs, presque un mois après la v1.16.\n \nComme à chaque version Umtx1 a gagné en stabilité, et il se lance plus rapidement qu'auparavant, d'une manière générale cette version propose la correction de quelques bugs améliorant ainsi la stabilité générale de l'ensemble de l'utilisation. Les payloads principaux ont également été mis à jour afin de profiter des dernières versions disponibles. \n \n \n\n \n \n \nChangelog v1.17 : \n \n- Umtx1 modifié pour être encore plus rapide et plus stable (généralement 5 à 20 secondes maintenant)\n- Améliorations de la stabilité\n- Corrections de bugs mineurs\n- Mise à jour du chargeur BDJ Hen par BenNoxD\n- Payloads mis à jour :\n      -- Websrv.jar mis à jour avec le dernier websrv.elf et mis à jour par BenNoxD pour être plus stable\n      -- Ftpsrv.jar mis à jour avec le dernier ftpsrv.elf\n      -- Elfloader.jar mis à jour avec le dernier elfldr.elf\n \n \nTéléchargement : PS5 BDJB Modified ISOs v1.17\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207371/in-ps5-ps5-bdjb-modified-isos-v117-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[Switch] uLaunch v1.2.1 disponible",
        "content": " \nLe développeur XorTroll vient de publier une nouvelle version de uLaunch, uLaunch est une alternative personnalisée à l’interface originale de la Nintendo Switch, qlaunch. Développée par XorTroll, elle propose un menu paramétrable mêlant jeux et homebrews, ce qui tranche avec l’austérité de l’interface proposée par Nintendo.\n \nComme XorTroll le précise, cette version 1.2.1 est principalement une mise à jour permettant de corriger des ralentissements que la version précédente avait, et fonctionnant avec la dernière version d'Atmosphère (et le firmware 20.1.0).\n \n \n\n \n \n \nChangelog 1.2.1 : \n \n- Certains changements/correctifs ci-dessous sont encore expérimentaux (en particulier pour les utilisateurs ayant beaucoup de jeux installés), veuillez donc signaler tout problème étrange/nouveau que vous trouvez !\n \n- Recompilé avec le support d'Atmosphère v1.9.1 (20.1.0)\n \n- Introduction d'un nouveau système de mise en cache des icônes de jeu/NACP pour contourner les problèmes de ralentissement du chargement des icônes/NACP 20.x :\n \n- Les données d'icônes et de NACP sont stockées en mémoire dans uSystem, ce qui explique que l'empreinte mémoire d'uSystem augmente de 12MBà environ40MB : cela devrait, en théorie, permettre d'installer jusqu'à 200jeux en cache. Si vous avez installé plus de jeux que cela, n'hésitez pas à ouvrir un ticket pour demander plus de mémoire cache (même si c'est déjà une quantité absurde) 50MB.\n \n- Ne vous inquiétez pas, car cela ne devrait avoir aucun impact : nous utilisons déjà moins de mémoire que le menu HOME de base (qui est d'environ 50MB), même en considérant la taille résultante du binaire uSystem, nous le faisons depuis des années et le faisons toujours, donc (comme toujours) les choses seront les mêmes qu'avec le menu HOME normal, peut-être même plus fluides\n \n- Correction d'un bug provoquant des ralentissements majeurs pour les utilisateurs avec de nombreux jeux (même avec environ, 10c'était perceptible), également lié aux changements 20.x, où une commande donnée était appelée à chaque image (pour chaque application) et faisait ralentir uMenu chaque fois que trop de jeux étaient visibles dans le menu principal (la valeur est maintenant lue une seule fois lorsque les applications sont chargées)\n \n- Correction d'un bug stupide où uMenu essayait uniquement de mettre en cache le thème actif s'il n'était pas encore mis en cache... alors que uSystem effaçait TOUT le cache à chaque redémarrage, donc le thème était mis en cache à chaque démarrage\n \n- Correction d'un bug étrange où parfois le thème par défaut était considéré comme obsolète\n \n \nTéléchargement : uLaunch v1.2.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207370/in-switch-ulaunch-v121-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[Switch 2] Certaines Switch 2 affichent les tests d'usine",
        "content": " \nIl semblerait que dans la précipitation du lancement de la Switch 2, certaines usines ont eu quelques défaillances de contrôles, rien d'étonnant, mais concrètement cela se caractérise par le fait que certaines consoles affichent les tests d'usines.\n \nIl s'agit là de cas très particuliers, comme celui d'un utilisateur de GBATemp qui dévoile que sa Switch 2 est incapable de lancer le moindre jeu, et pour cause, sa console est bloquée sur les tests d'usines. \n \n \n \n\n \n \n \nLe menu principal Home de la console n'est pas installé, et donc la console arrive sur un menu debug, où seuls sont présents quelques fichiers au format JSON, des tests techniques tels que le cycle de vieillissement de la console, le contrôle de charge de la batterie, le redémarrage (Reboot) ou encore l'arrêt (Shutdown), bref pas de quoi sauter au plafond, mais de quoi être mécontent si on souhaite profiter de sa console au lancement. \n \nCela n'a clairement aucun intérêt pour le hack, la console est inutilisable en l'état, un peu comme si aucun firmware n'était installé, mais elle a suscité la curiosité, et AJ l'a revendu à un autre utilisateur, lui permettant de racheter une console utilisable normalement. \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207324/in-switch-2-certaines-switch-2-affichent-les-tests-dusine-1.png"
        }
    },
    "news_6": {
        "title": "[Switch 2] Les protections PAC de la Switch 2 empêchent les attaques",
        "content": "Le point d'entrée potentiellement découvert permettant de lancer l'exploit de chaîne ROP sur la toute nouvelle Nintendo Switch 2 proviendrait d'un jeu Switch 1 permettant de s'appuyer sur le système de sauvegardes. \n \nLe point d'entrée d'un potentiel exploit Switch 2 serait donc pour le moment rendu possible grâce à un jeu Switch 1, mais nous apprenons que les protections implémentées par Nintendo, notamment les protections PAC directement au niveau du hardware, tout en les combinant avec l'ASLR, compliquent encore l'accès des adresses mémoire. \n \n \n \n \n\n \n \n \n \n \nLes protections PAC (Pointer Authentication Code) sont des obstacles techniques qui signent les pointeurs utilisés par le système, empêchant leur modification, leur falsification ou leur signature, peut être même avec les clés privées. Ainsi chaque pointeur est vérifié par le CPU avant son utilisation, si la signature n'est pas valide, alors l'opération est bloquée. L'injection de code est alors impossible. \n \n \n \n \n \n\n \n \n \n \nBasé sur une architecture ARM complexe, la Switch 2 bénéficie donc des protections PAC, limitant voir empêchant le lancement de chaîne ROP, tout cela sans compter l'ASLR.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207323/in-switch-2-les-protections-pac-de-la-switch-2-empechent-les-attaques-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1207323/in-switch-2-les-protections-pac-de-la-switch-2-empechent-les-attaques-1.png"
        }
    },
    "news_7": {
        "title": "[PS4] PSFree Lapse prend en charge les firmwares 7.00 à 9.60 sur PS4",
        "content": " \nLe développeur Al-Azif propose de découvrir une nouvelle version de PSFree Lapse, l'exploit qui fait bouger les lignes sur PS4. De nombreuses évolutions récentes du support de PSFree Lapse permet d'amener officiellement le support des firmwares 7.xx.\n \nAinsi l'exploit est beaucoup plus flexible puisqu'il a introduit le support de la chaîne ROP sur les firmwares 9.00 à 9.60, bien que nécessitant encore quelques ajustements, elle est déjà opérationnelle. \n \nD'autres tests devraient permettre quand à eux d'apporter le support stable des firmwares 8.00 à 8.52.\n \n \n\n \n \nAl-Azif confirme que tous les payloads devraient fonctionner, du firmware 7.00 à 9.60, même si quelques écrans noirs ne sont pas encore résolus. Ces problèmes d'écran noir sont liés à PSFree et/ou à Lapse, et ils n'affectent que certains jeux. Le firmware 8.00 serait assez stable, les évolutions a faire portent surtout sur les 8.50, 9.00 et 9.50.\n \n \nTéléchargement : psfree-lapse\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207319/in-ps4-psfree-lapse-prend-en-charge-les-firmwares-700-a-960-sur-ps4-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch2] Une première chaîne ROP sur Switch 2",
        "content": "David Buchanan, alias retr0id, affirme avoir réussi à lancer un exploit de chaîne ROP sur la Nintendo Switch 2. \n \nIl ne s'agit pas d'un exploit natif mais plutot en contexte userland, il ne dispose pas d'un code natif d'exécution mais cela marquera l'histoire, il s'agit d'un exploit 0-day. \n \nC'est tout de même une surprise, Nintendo annonçait avoir réussi à sécuriser beaucoup plus la Switch 2 que la première version. \n \n \n\n \nDavid Buchaman a dévoilé une vidéo démonstration technique limitée en framebuffer, montrant un carré animé sur le coin de l'écran, inutile mais tellement important. \n \nTant que l'exploit ne sera pas corrigé, David Buchaman ne dévoilera pas comment il a réalisé cette démonstration. Soyons prudent, cela pourrait être un montage vidéo, la vidéo semble réaliste. \n \nTout est là : \n \nhttps://x.com/SwitchTools/status/1930739845338476597\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207268/in-switch2-une-premiere-chaine-rop-sur-switch-2-1.png"
        }
    },
    "news_9": {
        "title": "[PS5] Une mise à jour firmware aussi du côté de la PS5 avec le 25.04-11.40.00",
        "content": "Sony a également publié une mise à jour firmware pour sa PS5, cette mise à jour mineure est la 25.04-11.40.00 et est déployée dans le monde entier, pour ce que nous en savons, il s'agit d'un patch mineur, mais il doit certainement cacher des corrections. \n \n \n\n \n \nIl semblerait qu'il vienne corriger certains messages, et améliorer la convivialité de certains écrans sans que nous ne sachions réellement lesquels. \n \n \nNotes de mise à jour PlayStation 5 (25.04-11.40.00) :\n- Nous avons amélioré les messages et la convivialité sur certains écrans.\n \n \nAvec de tels détails, il est difficile de savoir ce qu'apporte réellement cette mise à jour 25.04-11.40.00. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207195/in-ps5-une-mise-a-jour-firmware-aussi-du-cote-de-la-ps5-avec-le-2504-114000-1.png"
        }
    },
    "news_10": {
        "title": "[Switch] Nintendo déploie le firmware 20.1.1 pour le lancement de la Switch 2",
        "content": "Nintendo lance aujourd'hui 05 Juin 2025 sa Switch 2 dans le monde entier, et ce lancement se fait avec l'arrivée d'un nouveau firmware indispensable à sa bonne utilisation. \n \nComme prévu, le lancement de la Switch 2 est accompagné d'un firmware day-one indispensable à son fonctionnement correct, sans ce firmware la console est dépourvu de nombreuses options qui la rende quasiment inutilisable en l'état. \n \nAvec le firmware 20.1.0 lancé il y a quelques jours la Switch, Nintendo ne faisait que préparait le terrain de l'arrivée de la nouvelle console, il faudra attendre quelques heures pour savoir sous quel firmware la console est livrée, probablement un firmware autour du 20.0.0 lancé il y a un mois, mais sachez que le firmware 20.1.1 est nécessaire pour avoir accès au Nintendo Switch Online, pour bénéficier du GameChat, du GameShare, de la gestion des cartes virtuelles.\n \n \n\n \n \nNiveau hardware, ce firmware 20.1.1 apporte le support des nouvelles cartes microSD Express, d'accéder au contrôle parental, à l'application Nintendo Switch App, et bien d'autres éléments : \n \n- Utilisation de logiciels Nintendo Switch compatibles\n- Nintendo Switch Online\n- GameChat\n- Partage de jeux\n- Transfert de système depuis Nintendo Switch\n- Cartes de jeu virtuelles\n- Nintendo eShop\n- News\n- Téléchargement de captures d'écran et de vidéos sur le serveur\n- L'application Nintendo Switch sur un appareil intelligent est nécessaire pour afficher et télécharger les captures d'écran et les vidéos téléchargées sur le serveur\n- Lien avec les applications pour appareils intelligents Contrôle parental Nintendo Switch et Nintendo Switch App\n \nQuoi faire ? Déjà recevoir sa console, ce qui devrait arriver dans les heures qui viennent si vous l'avez précommandé, ensuite, attendre, car si vous l'avez acheté dans l'objectif de la hacker, vous devez rester sur le firmware le plus bas, nous l'avons vu encore récemment avec le firmware 20.0.0 Nintendo intègre encore des bugs dans ses firmwares, mais si vous l'avez acheté pour en profiter, ce firmware est indispensable pour permettre d'accéder à toutes ces possibilités. \n \n \n\n \n \n\nA noter que le jeu Mario Kart World, a également reçu une mise à jour aujourd’hui, elle débloque le jeu en ligne et modifie plusieurs paramètres, notamment la possibilité de jouer avec davantage de personnages dès le début.\n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2110325459.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207193/in-switch-nintendo-deploie-le-firmware-2011-pour-le-lancement-de-la-switch-2-1.jpg"
        }
    },
    "news_11": {
        "title": "[Switch] switch_AIO_LS_pack 5.18.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.18.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format).\nLe mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.18.0:\nAjout d'un script de nettoyage de la SD pour Linux et Mac.\nLe script de nettoyage ne supprimera plus les modules Sys-patch et Ultrahand durant le nettoyage des modules.\nDernier firmware compatible mis à jour en version 20.1.0.\nMise à jour des patches utilisés pour le logo de démarrage.\nMise à jour des patches utilisés pour les thèmes.\nMise à jour d'Atmosphere, de Hekate, de Sys-patch, de Lockpick-RCM, du module et du homebrew gérant les overlays, de Sphaira, de Status-monitor-overlay, de NXMP, de NXThemeInstaller et de Goldleaf vers la dernière version de ceux-ci.\nsuppression des homebrews AtmoXL-Titel-Installer, Hb-appstore, FTPD, Gamecard_installer-NX, Haze et Payload_Launcher car toutes ces fonctionnalités se retrouvent dans Sphaira.\nSuppression des homebrews Switch_90DNS_tester et Switch-90dns-setter car des fonctions similaires se trouve dans AIO_LS_pack_Updater.\nSuppression du dossier \"payloads\" à la racine de la SD car il n'a maintenant plus aucune utilité.\nMise à jour de la documentation et des crédits.\nMise à jour du homebrew AIO_LS_pack_Updater en version 7.03.01 apportant les changements suivants:\nLes messages des traductions sont maintenant des std::string au lieu de char*, ceci permet d'éviter des problèmes de fuites mémoire qui pouvaient faire planter certaines fonctions.\nMise à jour de certaines traductions pour supprimer des accents.\nLes configurations fss0 de Hekate ont été remplacées par des configurations pkg3 qui ne sont utilisables qu'à partir de Hekate 6.3.0, veillez donc bien à se qu'il soit à jour.\nPlus aucun warnings lors de la compilation.\nCompilé avec la dernière version de la Libnx.\n\nNote: Pour traiter les problèmes particuliers de lancement de la sysnand en firmwares 17.0.0 et supérieurs c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets. Pour cela nous avons mis en place un questionnaire de satisfaction, en plus de pouvoir reporter les problèmes sur Github ou sur le forum vous pouvez utiliser ce questionnaire pour nous donner vos opinions de façon anonyme (pour des problèmes spécifiques il vaut mieux reporter sur Github ou ouvrir un sujet sur le forum, il y aura une réponse bien plus rapide et cela permet de demander plus de détails pour identifier et peut-être résoudre le possible problème.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe et vous avez aussi un tutoriel plus détaillé sur cette page, d'ailleurs ce dernier site contient aussi pas mal de tutoriels notamment sur la Switch. Enfin si vous souhaitez voir le changelog complet du pack il est consultable ici pour la version stable et ici pour la version beta.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_12": {
        "title": "[3DS] Azahar 2122 Alpha 1 disponible",
        "content": "Le développement de l'émulateur 3DS Azahar continue son chemin et ce chemin est truffé de nouveautés, issu d'un fork de Citra développé par PabloMK7 et Lime3DS, Azahar représente une évolution prometteuse dans le monde de l'émulation, surtout après l'arrêt du développement de Citra en mars 2024. Cet arrêt faisait suite à un accord juridique entre les développeurs de Citra (également responsables de l'émulateur Switch Yuzu) et Nintendo. Contrairement à Yuzu, qui a été frappé d'une injonction, Citra n'a pas été directement affecté par des restrictions légales, permettant ainsi à des projets comme Azahar de voir le jour.\n \nCette version Azahar 2122 Alpha 1 n'est pas encore considérée comme stable. Il s'agit d'une version préliminaire de la prochaine mise à jour 2122, dont les fonctionnalités ne sont pas encore complètes. Cette version vise à tester les fonctionnalités à venir afin de garantir leur stabilité. Les premiers utilisateurs sont encouragés à participer aux tests des modifications de cette version afin de détecter d'éventuels problèmes avant leur publication dans une version stable.\n \n \n\n \n\n \n \nSi vous n’êtes pas prêt à tolérer des problèmes potentiels, il serait peut-être préférable d’attendre la version stable, cette mise à jour se distingue par de nombreuses améliorations des performances et de la compatibilité du jeu.\n \nDe plus, pour les périphériques x86_64 (la plupart des ordinateurs de bureau), cette mise à jour nécessite un processeur doté des instructions SSE4.2 , et il est probable que toutes les versions futures auront également cette exigence. Cette fonctionnalité est disponible sur tous les processeurs modernes sortis en 2011 ou après.\n \nLe changelog est impressionnant, il se trouve ici . \n \n \nTéléchargement :  Azahar 2122 Alpha 1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207091/in-3ds-azahar-2122-alpha-1-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1207091/in-3ds-azahar-2122-alpha-1-disponible-2.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] Switchfin 0.7.1 disponible",
        "content": "Le développeur dragonflylee propose une nouvelle version de Switchfin, l'interface tierce dédiée à Jellyfin à destination de la Switch, des PC et de la PS4.  Si vous ne connaissez pas Jellyfin, il s'agit d'un serveur de contenus, un serveur multimédia open source et gratuit, offrant la possibilité de naviguer et lire les flux multimédia de toutes natures :\n \n- conteneurs : mkv, mov, mp4, avi\n- codecs vidéo : H.264, H.265, VP8, VP9, AV1\n- codecs audio : Opus, FLAC, MP3, AAC, AC-3, E-AC-3, TrueHD, DTS, DTS-HD\n- sous-titres : SRT, VTT, SSA/ASS, DVDSUB\n \n \n\n \n \n \nChangelog 0.7.1 : \n \nAjout :\n- Ajout d'un onglet suggestion/genres pour la collection\n \nCorrection :\n- présentation du logo de la série/du film\n- reconstruction de la vue de la collection multimédia\n- chargement d'image pour suggestion de recherche\n \nChangelog 0.7.0 :\n \nAjout :\n- reconstruction de la disposition de la vue de la série\n- ajout de la vue des personnes sur la série/le film\n- ajout de la localisation en portugais brésilien (@brunorossetto)\n- Switch : prise en charge de lecteur externe à l'aide de libusbhsfs\n \nCorrection :\n- capture d'exception sous macOS\n- chargement à distance d'une liste de fichiers volumineux\n- utilisation de mpv watch-later pour la télécommande\n- correction des sous-titres qui ne s'affichaient pas sur Vita\n \n \nTéléchargement : Switchfin 0.7.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207090/in-switch-switchfin-071-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] NXMilk v0.2.0 disponible",
        "content": " \nNXMilk est un lecteur audio pour la Nintendo Switch, il utilise FFMpeg (avec l'aide de quelques bibliothèques) pour le décodage audio et projectM pour le côté visio, l'interface graphique est réalisée avec ImGui.\n \nCe projet a commencé comme une catégorie de test pour un nouveau lecteur audio pour NXMP, NXMilk est codé par proconsule.\n \n \n\n \n \nCaractéristiques\n \n- Prise en charge d'un large format de fichier audio (voir ci-dessous)\n- Vis utilisant la bibliothèque projectM\n- Prise en charge des polices cyrilliques japonaises, chinoises et coréennes\n- Peut lire à partir d'une carte SD, d'un stockage USB, d'une source Newtwork et de fichiers image\n \nFichiers pris en charge (avec ffmpeg)\n \n- Prise en charge MP3 (avec prise en charge des balises ID3)\n- Prise en charge OGG (avec prise en charge des métadonnées si présentes)\n- Prise en charge FLAC (avec prise en charge des métadonnées si présentes)\n- Prise en charge WAV\n- Prise en charge AC3\n- Prise en charge de la CAA\n- Pour de nombreux autres (ffmpeg est génial !), vous pouvez défiltrer les extensions de fichiers avec le fichier de configuration ini\n \nD'autres formats sont supportés par libopenmpt, libgme ou encore libmodplug, et également les formats CD audio (CUE/BIN) et ISO9660 dont le support a été ajouté avec la v0.2.0. Libarchive lui permet le support des formats RAR, ZIP, TAR.GZ et LHA.\n \n \nTéléchargement : NXMilk 0.2.0\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207089/in-switch-nxmilk-v020-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS3] RPCS3 v0.0.37 disponible",
        "content": "Les développeurs de RPCS3 propose une nouvelle version de leur émulateur PS3, il s'agit de la version 0.0.37.  Il y a maintenant 14 ans commencé le développement de RPCS3 avec une petite équipe de programmeurs dirigée par DH et Hykem, aujourd'hui le programme est le meilleur émulateur PS3 supportant DirectX12, Vulkan et OpenGL. \n \nC'est le développeur Nekotekina qui est en charge de RPCS3 mais il n'agit pas seul, il a toute une armée de programmeurs avec lui qui continuent de faire progresser le logiciel. \n \n \nDepuis que la v0.0.36 voici ce qui a changé :\n \n> 263 nouveaux commits\n> 408 fichiers de code source ont été édités\n> 14 455 lignes de code ont été ajoutées et 22 105 supprimées\n> 23 contributeurs au code\n> 62 jours de développement\n \n \nL'énorme changelog se trouve ici : RPCS3\n \n \n \n\n \n \nTéléchargement : RPCS3 v0.0.37\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207088/in-ps3-rpcs3-v0037-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[PS4-PS5] PSP 2 PS4/PS5 V 1.0: Convertir vos jeux PSP pour ps4 et PS5",
        "content": "Promis depuis quelques temps, voici enfin mon convertisseur PSP 2 PS4/PS5 v1.0 qui va vous permettre donc de créer un FPKG d' un jeu PSP afin de le lancer sur PS4 ou PS5.  Vous trouverez dans cette version 1.0 une interface graphique, un switch entre la version PS4 et PS5 (icon PS4 et icon PS5), une option pour créer un son sur le menu et un lecteur AT9 (Merci Darkprogrammer pour le lecteur AT9), comme tous mes autres convertisseurs. Cet outil a été testé et fonctionne sur tous les firmwares jailbreakés PS5 et à partir du 5.05 sur PS4...Vous aurez le choix entre plusieurs émulateurs PSP, à vous de tester et trouver le meilleur pour votre jeu PSP. Attention cette version PSP comporte une obligation dans son fonctionnement. Vous devez OBLIGATOIREMENT rentrer le VRAI ID du jeu PSP et non un ID aléatoire comme mes autres convertisseurs. Sans cela votre jeu converti ne fonctionnera pas... J ai donc ajouté dans l arche un petit script qui vous permettra de trouver le véritable ID de votre PSP à rentrer dans l'onglet Change ID de mon outil. (Voir tuto-vidéo)... Un simple glisser/déposer de votre ISO PSP sur le script Search_ID.py vous donnera cet ID OBLIGATOIRE...(Merci à Link pour l' aide de référencement de tous les ID PSP). Merci aux testeurs: - Arksama  firmware 2.50 et 4.03- New rival firmware 2.50- Ribery95 firmware 4.03- Hyndrid firmware 4.03- Markus95 firmware 4.03 et 6.50- Link firmware 7.61  Pour le fonctionnement et l installation je vous laisse regarder ma vidéo tuto, j' y explique le fonctionnement, ainsi que la mise en place des dépendances OBLIGATOIRES à son bon fonctionnement.  Télécharger PSP 2 PS4/PS5 V1.0 Pour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:https://www.paypal.com/paypalme/markus00095 ",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207085/in-ps4-ps5-psp-2-ps4ps5-v-10-convertir-vos-jeux-psp-pour-ps4-et-ps5-1.png"
        }
    },
    "news_17": {
        "title": "[PS5] PS5 Payload SDK supporte maintenant les firmwares 8.xx, 9.xx et 10.x",
        "content": "Le développeur John Törnblom a mis à jour PS5 Payload SDK en version 0.31. \n \nComme vous le savez, ce SDK a pour ambition de faciliter le portage et le développement de payloads qui pourront s'exécuter sur les consoles bénéficiant du loader ISO BD-JB ELF, mais aussi sur celles utilisant l'exploit \"ipv6 uaf\" basé sur le webkit, mais il bénéficie aussi des dernières trouvailles liées à Parse.\n \nAvec cette mise à jour 0.31, le développeur a introduit des fonctionnalités importantes comme le support des firmwares 8.xx, 9.xx et 10.0x, mais aussi des options plus spécialisés comme l'ajout de l'adresse de structure bus_data_devices telle que défini dans le code source de FreeBSD.\n \n \n\n \n \nChangelog : \n \n- kernel : ajout des offsets des firmwares 8.xx, 9.xx et 10.0x\n- ajout d'une adresse absolue à bus_data_devices\n- suppression du stacktrace automatique sur les signaux fatals\n- ajout de l'implémentation des threads c11 à partir de freebsd 11.4\n- réduction de la taille des fichiers des payloads\n \n \nTéléchargement : PS5 Payload SDK 0.31\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207068/in-ps5-ps5-payload-sdk-supporte-maintenant-les-firmwares-8xx-9xx-et-10x-1.jpg"
        }
    },
    "news_18": {
        "title": "[Switch] MissionControl supporte le dernier firmware 20.1.0",
        "content": "La vingt-huitième version officielle de MissionControl vient d'être mise en ligne par son développeur ndeadly, deux semaines après la version précédente, cette version vient rajouter le support du nouveau type de contrôleur Lic3 Pro, mais surtout le support du tout dernier firmware 20.1.0.\n \nMissionControl pour ceux qui le connaitrait pas est un module système personnalisé qui permet de profiter de contrôleurs Bluetooth tiers qui peuvent être utilisés de manière native sur la Switch, et tout cela sans dongle ni autre matériel externe.\n \n \n\n \n \nCette version 0.13.2 ajoute la prise en charge complète du firmware 20.1.0 et autorise un nouveau type de contrôleur officiel introduit dans le nouveau firmware. \n \n \nTéléchargement : MissionControl 0.13.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207067/in-switch-missioncontrol-supporte-le-dernier-firmware-2010-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS5] etaHEN 2.2B teasé par LightningMods",
        "content": "Le développeur LightningMods propose de découvrir ce que la prochaine version d'etaHEN qui intègrera de nouveaux raccourcis pour améliorer l'expérience utilisateur. Ce plugin est tout simplement similaire à GoldHEN sur PlayStation 4 de SiStr0, il intègre plusieurs fonctionnalités, notamment un serveur FTP, un serveur klog, ou encore PS5-kstuff.\n \nComme le montre LightningMods, une nouvelle fonctionnalité va être déployée, il s'agit de fonctions de raccourcis de contrôleurs, permettant aux utilisateurs un accès rapide aux menus du jeu sans l'interrompre. \n \nCette nouveauté permettra aux utilisateurs d'accéder directement aux menus cheats, Kstuff Toggle, le menu de la Toolbox ou encore aux menu webMAN, sans pour autant sortir des jeux en question.\n \nLe développeur faisant toujours très bien les choses, il propose un post ici ainsi qu'une vidéo de démonstration, en attendant la disponibilité officielle qui interviendra après la phase de tests. \n \n \n\n \n \n \n \n \n",
        "images": {}
    },
    "news_20": {
        "title": "[Switch] hekate v6.3.1 &#38; Nyx v1.7.0 disponibles",
        "content": "Le développeur CTCaer propose de découvrir une nouvelle version d'Hekate et de Nyx, il s'agit clairement d'une version de maintenance qui a pour ambition d'apporter le support du tout dernier firmware 20.1.0. \n \nComme vous le savez, Hekate est un custom bootloader largement utilisé pour la Nintendo Switch, Hekate sert de point d'entrée pour de nombreux utilisateurs souhaitant explorer les capacités personnalisées de leur console Nintendo Switch. Depuis sa création, il a été utilisé pour lancer des homebrews, des backups de jeux, et d'autres logiciels personnalisés, offrant ainsi aux joueurs une expérience différente de celle prévue par Nintendo.\n \n \n\n \n \nSa mise à jour avec l'arrivée du firmware 20.1.0 est toujours nécessaire pour de nombreux homebrews.\n \n \nTéléchargement : hekate v6.3.1 & Nyx v1.7.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206987/in-switch-hekate-v631-nyx-v170-disponibles-1.png"
        }
    }
}