{
    "news_1": {
        "title": "[Switch] Mike Heskin (Hexkyz) donne son avis sur le Mig Switch",
        "content": "Le développeur Mike Heskin connu de la scène 3DS, Wii et Switch sous le pseudonyme Hexkyz a écrit de longs billets sur le Mig Switch, informant ou donnant son avis sur ce nouveau linker. \n \n \n\n \n \nLa première des choses qu'il dit autour de ce linker est qu'il subsiste beaucoup de confusions autour de lui, \" ce qui est compréhensible étant donné à quel point (probablement délibérément) ils sont vagues sur ce qu'il peut ou ne peut pas faire. Ainsi il a essayé de couvrir ici quelques faits connus sur la Gamecard, l’écosystème en général qui peut apporter des réponses. \n \nTout d’abord, il n’est pas possible de modifier de quelque manière que ce soit une image Gamecard (XCI) légitime. Les XCI utilisent un système de fichiers basés sur le hachage dans lequel le contenu de chaque fichier est haché et un hachage de tous leurs hachages est stocké dans l'en-tête de la partition.\n \nPar conséquent, une modification du contenu d'une image nécessite le recalcul des hachages pertinents, ce qui semble assez simple, sauf qu'un hachage de l'en-tête de la partition (qui contient un hachage des hachages de tous les fichiers) est inclus dans la région CardHeader (les 0x200 premiers octets). \n \nCette région est signée (RSA-2048) et sa signature est vérifiée par Lotus ASIC. À moins que vous ne disposiez de la clé privée nécessaire pour re-signer cette région CardHeader, la partie est terminée ici.  \n \nCela va probablement sans dire, mais toutes les clés privées RSA de niveau production ne sont connues que par Nintendo. Vous ne pouvez pas les \"calculer\", ils n'ont pas été divulgués à quelque titre que ce soit et si, d'une manière ou d'une autre, le linker avait réellement la clé, il n'aurait pas du tout besoin de la région InitialData.\n \nCela signifie que la prise en charge du contenu DLC et des mises à jour (sauf si le jeu est légitime) ou des homebrews n'est tout simplement pas possible.\n \n \n\n \n \n \nL’autre grand sujet semble être la détection. Comme prévu, les testeurs ont déjà compris que vous pouvez utiliser le même certificat pour n'importe quelle image XCI, ce qui est clairement le principal argument de vente de ce linker, même si ses créateurs ont pris soin de ne pas le déclarer ouvertement pour éviter les réactions négatives. \n \nNotez que toutes les copies d'un même jeu partagent les mêmes régions CardHeader et InitialData, mais différentes copies du même jeu ont des régions CertArea différentes et, dans l'état actuel des choses, rien ne semble vérifier si un certificat appartient au jeu pour lequel il a été émis. \n \nEn ligne, Nintendo dispose de l'infrastructure nécessaire pour détecter si un certificat donné est utilisé plusieurs fois en même temps. Ils peuvent également détecter si un certificat appartient à une carte de jeu physique à partir du firmware 9.0.0 (ajouté en réponse à l'émulation SX du Lotus ASIC). \n \nQuant à l'utilisation d'un certificat qui ne correspond pas au jeu pour lequel il a été émis, le réseau demande d'authentifier le certificat de la carte de jeu en s'assurant d'inclure l'ID de l'application en cours de lecture afin qu'il soit facilement visible par Nintendo.\n \nIl y a aussi quelques détails supplémentaires dont je n'ai pas encore vu parler. Par exemple, le système d'exploitation enregistre le nombre de fois que vous insérez et retirez une carte de jeu, ce qui pose clairement un problème, car le flashcart vous oblige à l'insérer et à la retirer pour parcourir les jeux. \n \nAvec un CFW, vous avez un certain contrôle sur les données de télémétrie, mais avec un OFW, vous n'en avez aucun. Même si vous bloquez les domaines pour les rapports d'erreurs (qui sont les plus détaillés), vous ne pouvez tout simplement rien faire concernant les rapports système (\"srepo\") qui incluent des informations sur les cartes de jeu.\n \nCela nous amène au dernier point qui concerne le type de détection et de prévention existant *hors ligne*, ce qui est également la raison pour laquelle les créateurs du flashcart sont si prudents avec leur formulation. \n \nPar exemple, seuls 16 des 208 octets de la région cryptée d'un certificat de carte de jeu sont actuellement utilisés (pour dériver la clé de communication). Personne ne sait vraiment si les octets restants ont une corrélation avec les régions InitialData ou CardHeader.\n \nS'il s'avère qu'il existe effectivement une corrélation, alors le scénario actuel consistant à utiliser le même certificat pour différentes images XCI devient patchable hors ligne. Il existe de nombreuses autres façons de détecter et de bloquer ce problème, soit au niveau du système d'exploitation, soit au niveau de Lotus. \n \nIroniquement, le seul cas où le flashcart pourrait ne pas pouvoir être corrigé ou détecté est si vous l'utilisez uniquement pour conserver des copies de jeux légitimes (certificat correspondant au jeu et tout ça) et ne les parcourez pas.\n \nUn sujet supplémentaire que j'ai observé concerne la façon dont cela pourrait affecter la rétrocompatibilité dans une future console. Comme je l'ai mentionné précédemment, il y a toujours eu un deuxième système de sécurité en attente, précisément parce que Nintendo était conscient des faiblesses de la partie gamecart du jeu. \n \nCela signifie que les *futures* cartes de jeu seraient sûres, mais que celles actuelles auront toujours leur système de cryptage matériel brisé. Personnellement, je pense que la rétrocompatibilité sera assurée même au niveau des cartes de jeu (c'est-à-dire le futur matériel capable de lire les cartes de jeu Switch).\n \nIl y a quelques changements récents dans l'écosystème Gamecard/Lotus qui suggèrent que le même matériel allait être utilisé dans une nouvelle console et il semble peu probable que cela change (surtout compte tenu de l'existence d'un deuxième système de sécurité) . \n \nCependant, il est tout à fait possible que le futur matériel vous oblige désormais à vérifier les anciennes cartes de jeu en ligne pour affirmer sa légitimité, par exemple. \" \n \n \nComme vous pouvez le lire c'est un très long billet, presque un writeup sur ce qu'est le Mig Switch à ses yeux, et les notions de sécurité abordées sont intéressantes à plusieurs titres. A suivre. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185999/in-switch-mike-heskin-hexkyz-donne-son-avis-sur-le-mig-switch-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1185999/in-switch-mike-heskin-hexkyz-donne-son-avis-sur-le-mig-switch-2.jpg"
        }
    },
    "news_2": {
        "title": "[PS4/PS5] PS4 Exploit psfree 1.4.0 Bêta disponible",
        "content": "L'exploit PS4 psfree vient d'être mis à jour en version 1.4.0 bêta, et bonne nouvelle cette nouvelle version fait bouger les choses. \n \n \n\n \n \n \n\n \n \n \nChangelog 1.4.0 :\n \n- Ajout d'un payload de correction du kernel pour les firmwares 8.0x\n \nRéparations :\n \n- Suppression du risque de crash lors de l'utilisation des classes string\n- Suppression du risque de crash lors de l'utilisation de make_buffer()\n \nIl semble que les debug settings ne soient plus très loin, au delà du 9.00, mais en dessous du 9.60, et côté PS5 en dessous du firmware 5.50. \n \nNiveau PS4, il semble que le firmware 9.03 et 9.51 sont exploitables, mais que pour le 9.60 ce n'est pas encore le cas. Des tests sont en cours sur le firmware 10.50, même si nous savons que ce sera plus difficile sur ce firmware vu qu'il n'est pas supporté. \n \n \n\n \n \n \nL'un des hosts qui permet de tester en ce moment PS4 Exploit psfree 1.4.0 Bêta : \n \nhttps://nightkinghost.com/psfree/index.html\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-507091331.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1185985/in-ps4ps5-ps4-exploit-psfree-140-beta-disponible-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS4] PS4Profile v2.0 disponible",
        "content": "Le développeur Master-s propose une nouvelle version de PS4Profile qui passe en v2.0. Il a dévoilé en effet une nouvelle mouture de son logiciel qui permet d'éditer le nom de son profil afin d'y apporter des modifications qu'il est impossible de faire dans une configuration standard.\n \n \n\n \n \nChangelog 2.0 :\n \n \n- Ajout de WinSCP Batch\n- Ajout d'un bouton ID permettant d'afficher les utilisateurs\n- Copier le dossier profile0x1 dans le dossier files/backup en utilisant bat\n \nLe fonctionnement de PS4Profile est assez simple, l'outil peut se connecter à une PS4 Jailbreakée compatible avec le FTP, ce qui permet d'enregistrer le profil directement sur la console et de le rafraîchir en temps réel. L'outil permet l'édition de l'avatar, de votre nom / prénom, et l'icône associée à votre profil. \n \n \nTéléchargement : PS4Profile v2.0\n \n \n",
        "images": {
            "image_1": "https://playstation-3.logic-sunrise.com/images/validation/in-1828282143.png"
        }
    },
    "news_4": {
        "title": "[PS5] Le firmware 8.60 disponible pour la PS5",
        "content": "Sony a dévoilé une mise à jour firmware pour la PS5, la firme japonaise a en effet proposé la mise à jour 24.01-08.60.00 pour sa dernière console incluant de nouvelles fonctionnalités notamment audio avec les écouteurs sans fil PULSE Elite et les écouteurs sans fil PULSE Explore.\n \nLa fonction \"Local Effect\" a aussi été introduite, elle consiste à améliorer l'expérience d'écoute des voix dans les chats vocaux.\n \n \n\n \n \n \nVersion : 24.01-08.60.00\n \nPrincipales fonctionnalités de cette mise à jour du logiciel système :\n \n- Nous avons ajouté de nouvelles fonctionnalités aux Partys.\n- Dans l'onglet Partys, vous pouvez désormais voir la liste des Partys que vous avez rejointes par le passé. Vous pouvez facilement redémarrer une Party en la sélectionnant dans la liste [Récent].\n- Nous avons mis à jour le logiciel périphérique du casque-micro sans fil Pulse Elite et des écouteurs sans fil Pulse Explore.\n- Vous pouvez désormais utiliser la fonctionnalité d'égalisation du son.\n- Vous pouvez désormais utiliser la fonctionnalité d'effet local, qui vous permet de mieux entendre votre propre voix pendant un chat vocal.\n- Si un casque-micro sans fil Pulse Elite ou des écouteurs sans fil Pulse Explore se trouvent à proximité, une notification s'affichera pour vous permettre de vous y connecter rapidement. Cette notification vous permettra de basculer la connexion de votre PC vers votre PS5.\n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et l'ergonomie de certains écrans.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185946/in-ps5-le-firmware-860-disponible-pour-la-ps5-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] UpcomingSwitchGames, un nouvel homebrew",
        "content": "Salut la communauté,\n \nEtant banni des services en ligne de la Nintendo Switch, je ne peux pas aller sur l'eShop voir les prochains jeux que la Switch va accueillir. J'ai donc décidé de créer un Homebrew qui permettra de voir quels jeux vont sortir prochainement sur Switch.\n \nSi vous rencontrez des bugs n'hésitez pas à le report\n \n\n \n\n \n \nTéléchargement : UpcomingSwitchGames 1.0.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185927/in-switch-upcomingswitchgames-un-nouvel-homebrew-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1185927/in-switch-upcomingswitchgames-un-nouvel-homebrew-2.jpg"
        }
    },
    "news_6": {
        "title": "[PS4] Itemzflow pour PS4 v1.04 disponible",
        "content": "Le développeur LightningMods nous informe qu'il vient de mettre à disposition une nouvelle version de son manager Itemzflow qui est désormais proposé en v1.04 dans sa version PS4.\n \nLes travaux portent essentiellement sur la PS4, car ils visent à corriger quelques bugs liés aux dumps de DLC et de data, mais aussi à ajouter une option d'installation de PKG pour les répertoires avec plus de 1 PKG. Comme nous pouvons le voir dans le changelog, les améliorations proviennent de la version PS5. \n \n \n \n\n \n \n \nMise à jour 1.04 ( ItemzCore version : 1.4-V-2024-01-23T18:42:41 )\n \n- Correction du dump des DLC et data AC sans données\n- Ajout d'une option Installer tous les PKGs pour les dossiers avec plus d'un PKG\n- L'installation d'un PKG ne vous ramènera plus aux paramètres.\n- Reprise de certaines améliorations de la version PS5 d'Itemflow\n- Remplacement des vecteurs de rég. par des ThreadSafeVectors\n- Ajout des fichiers de langue chinoise\n- Correction d'un bug qui provoquait un blocage du thread Utility\n- Correction d'un bug qui faisait que le démon ne donnait pas de backtrace sur le firmware 9.00\n \nTéléchargement : Itemzflow pour PS4 v1.04\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185903/in-ps4-itemzflow-pour-ps4-v104-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[Switch] uLaunch 0.3.7 avec support Atmosphere 1.6.2 et FW 17.0.1",
        "content": "Le développeur XorTroll vient de dévoiler la toute première version de uLaunch de 2024, rappelons que uLaunch est la ré-implémentation personnalisée et open source de qlaunch (le menu HOME de la console Switch). Orienté homebrew, ULaunch est simplement une ré-implémentation complète, 100% open-source, qui reprend également l'applet eShop, le contrôle parental et le titre du système de flagellation (tous sont pratiquement inutiles avec cette ré-implémentation) pour sa fonctionnalité étendue.\n \nLe développeur a remis à jour le support dans cette version 0.3.7 en proposant le support du firmware 17.0.1 et d'Atmosphere 1.6.2.\n \n \n\n \n \nChangelog 0.3.7 :\n \n- Mise à jour du support pour la 17.0.1 / Atmosphere 1.6.2 : \n- Tout a été compilé avec les dernières bibliothèques, ce qui signifie un bon support d'Atmosphère 1.6.2 / 17.0.1 entre autres choses\n- Gardez à l'esprit que ces versions mineures sont simplement des mises à jour de support, alors que la réécriture profonde de uLaunch est en cours de finition sur une nouvelle version.\n \nTéléchargement : uLaunch 0.3.7\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185899/in-switch-ulaunch-037-avec-support-atmosphere-162-et-fw-1701-1.png"
        }
    },
    "news_8": {
        "title": "[Wii] ModMii v7.0.2 disponible",
        "content": "Le développeur XFlak vient de mettre en ligne une toute nouvelle version de ModMii puisqu'il propose la version 7.0.2. Anciennement connu sous le nom de NUS Auto-Downloader, ModMii est un logiciel qui est capable de télécharger tous les fichiers nécessaires pour modifier une console Wii (4.3U/E/J et 4.2K ou moins). Il peut aussi générer des guides, basés sur les spécifications de votre Wii, et enregistrer les fichiers sur votre carte SD aux emplacements appropriés pour simplifier la gestion hors ligne, mais aussi faciliter la configuration de USB Loader et de SNEEK.\n \nModMii est également capable d'exécuter d'autres fonctions liées au piratage, telles que la configuration d'un loader USB et la création d'une émulation NAND. ModMii a également été le premier installateur officiel de cIOS d2x.\n \n \n \n\n \n \n \n \n \nChangelog 7.0.2 - 2024:01-22 :\n \n- Suppression de l'invite à conserver l'IOS31 corrigé s'il est détecté dans les SysChecks car il n'est plus requis pour RiiConnect24.\n- L'outil de mise à jour des SysChecks vérifie maintenant aussi que le BC est v6.\n- Suppression des slots suivants sur liste blanche de la suggestion de les bloquer optionnellement dans l'assistant de mise à jour du SysCheck (236,240,241,242,243,244,245,246,247).\n- Correction pour les IOS qui étaient ignorés par SysCheck. Auparavant, si \"IOS249 : Skipped\" (par exemple) était contenu dans un SysCheck, ModMii suggérait d'installer à la fois le cIOS249 recommandé ainsi qu'un stub IOS249, mais ModMii ne construisait jamais réellement un stub IOS249.\n- Correction du problème du MIOS updater de SysCheck où un MIOS v10 stock n'était pas installé lorsque \"MIOS v10 (DIOS MIOS Lite)\" était listé dans les syschecks (et l'option cMIOS désactivée).\n- Autres changements mineurs, incluant des références à Fakemote ainsi que la mise à jour des liens wii.guide vers wii.hacks.guide (ou des liens archivés lorsqu'il n'existe pas encore de remplaçant).\n \n \n \n\n \n \n \n \nTéléchargement : ModMii v7.0.2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185896/in-wii-modmii-v702-disponible-1.jpg"
        }
    },
    "news_9": {
        "title": "[Switch] Le firmware 1.0.9 pour le Mig Switch est disponible",
        "content": "L'équipe en charge du développement du Mig Switch vient de mettre en ligne une mise à jour firmware 1.0.9 à destination de leur linker destiné à la Switch. \n \nQuelques jours après avoir proposé la 1.0.8, l'équipe dévoile donc déjà une nouvelle update qui est assez légère, basé sur les premiers retours d'expérience, l'objectif étant de corriger quelques bugs.\n \n \n\n \n \n \nMise à jour de quelques bogues mineurs grâce aux commentaires des testeurs : \n \n- Correction d'un problème lorsque le dossier XCI divisé est placé à la racine (seul le sous-dossier fonctionnait).\n- Ajout de la version actuelle du firmware dans le fichier nxindex.\n \n \n \nTéléchargement : Firmware 1.0.9 pour le Mig Switch\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185863/in-switch-le-firmware-109-pour-le-mig-switch-est-disponible-1.png"
        }
    },
    "news_10": {
        "title": "[PS4] GameBato Store devient payant avec la version 1.3",
        "content": "L'équipe en charge de GameBato vient de prendre une décision de la plus grand importance, celle de proposer en plus de la version gratuite une version payante, jusque là rien d'exceptionnel. Mais là où cela commence mal dans cette analyse, c'est que la version gratuite ne permet plus certaines options qui ne sont accessibles que via la version payante. \n \nTour d'horizon, basé sur le fait que le trafic est en constante augmentation, jusque là cela parrait logique que cela soit le cas, les serveurs sont beaucoup trop sollicités selon la team GameBato. \n \nLa version Premium donne par exemple accès à la possibilité de télécharger des jeux sur un stockage USB, et les fonctions avancées ne seront accessibles que sur cette version abonnement, oui car il s'agit de payer 5 $ par mois, durant les 12 premiers mois, ensuite l'abonnement sera doublé, soit à 10 $ par mois, soit le prix d'un abonnement PSN + Extra durant 12 mois. \n \nAvec cette décision, la solution GameBato prend du plomb dans l'aile, espérons que la team revienne sur la décision.\n \n \n\n \n \nSortie de la version 1.3 !\n \n- Il y a plusieurs mois, une idée a germé dans nos esprits,\nEt si ceux qui ont jailbreaké des consoles sony playstation 4 pouvaient avoir une méthode pour obtenir leurs jeux désirés et y jouer,\nEt si quelqu'un n'avait pas d'ordinateur pour télécharger des jeux,\nEt si quelqu'un ne sait pas comment les transférer sur la console et les installer, ou en a marre de faire ce processus qui prend du temps,\nEt s'il existait un moyen plus simple...\n \n- Et GameBaTo est né...\n \n- Nous avons commencé à travailler en équipe pour concrétiser cette idée.\nDes mois de développement, jour et nuit, enfin la version 1.00 était prête à être publiée.\n- De nombreux bugs ont été signalés par les utilisateurs, au fur et à mesure que nous les recevions un par un, nous avons débogué l'application et corrigé les problèmes dès que possible afin que nos utilisateurs puissent avoir une meilleure expérience de l'utilisation de l'application.\n- Nous avons ajouté de nombreuses nouvelles fonctionnalités demandées par nos utilisateurs, qui n'étaient pas dans notre feuille de route, afin que nos utilisateurs apprécient l'utilisation de l'application.\n- Au fur et à mesure que le nombre de nos utilisateurs augmentait, des ressources supplémentaires étaient nécessaires pour maintenir la convivialité de l'application\nNous avons ajouté de nouveaux serveurs chaque mois afin qu'ils puissent couvrir l'utilisation de la bande passante du réseau par nos utilisateurs.\n \n- Nous nous sommes efforcés de publier une version stable de GameBaTo.\nFinalement, nous y sommes parvenus.\n \n- À l'heure actuelle, les coûts mensuels de maintenance de l'application et des serveurs ont atteint un point tel qu'il est nécessaire de monétiser l'application afin que nous puissions nous permettre de la maintenir en ligne.\nBeaucoup d'entre vous ont utilisé notre application et l'ont appréciée pendant des mois.\n \n- Nous vous demandons sincèrement de soutenir ce projet en passant votre compte en Premium.\n \n- Nous ajouterons également de nouvelles fonctionnalités au fur et à mesure que nous recevrons des revenus de ce projet.\n \n- Nous apprécions également ceux qui ont fait des vidéos sur YouTube à propos de GameBaTo afin que ceux qui n'étaient pas au courant de cette application étonnante puissent se familiariser avec elle.\nPour les remercier, ces youtubers peuvent envoyer un message privé à @gamebatopayment pour que leur compte soit mis à jour sans frais.\n- Les développeurs qui ont aidé la scène ps4 sont également inclus dans le concours de mise à jour gratuite de compte.\n \n \nAjouter un compte Premium aux types d'abonnement\n \nPour passer à un compte Premium, allez dans la section Compte dans le menu de l'application.\nActuellement, nous avons deux méthodes de paiement :\n-Cryptocurrency(Recommandé) :\n- Met instantanément le compte à niveau après réception du paiement.\n- Prend en charge une large gamme de pièces et de jetons dans divers réseaux de blockchain.\n- Plus de réduction sur les plans de paiement.\n- Carte de crédit :\n- Prend 1~6 heures pour que le compte soit mis à niveau après réception du paiement.\n- Les cartes de crédit et de débit suivantes sont actuellement prises en charge : Visa, Mastercard, American Express, Maestro, Troy\n \nChangelog 1.3 : \n \n- Ajout d'un nouvel état de téléchargement appelé \"Vérification du paquet, attente...\"\n- Il s'agit d'un processus de vérification de l'intégrité des données téléchargées afin d'éviter toute corruption du paquet.\n- Correction de quelques problèmes mineurs\n- Vous pouvez toujours utiliser la plupart des fonctionnalités de GameBaTo gratuitement.\n- Utilisez l'option Quitter du menu de l'application ou appuyez sur le bouton CERCLE sur l'écran principal de l'application chaque fois que vous voulez fermer l'application.\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185847/in-ps4-gamebato-store-devient-payant-avec-la-version-13-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] Les backports du firmware 5.00 fonctionnent sur le 4.03",
        "content": "Le développeur Echo Stretch nous informe qu'un premier jeu PS5 a été backporté du firmware 5.00 au firmware 4.03, l'accent est d'ailleurs mis sur ce firmware, mais il rajoute que va être aussi rapidement testé la possibilité de faire tourner le tout sur le firmware 3.00. \n \nC'est une excellente nouvelle, il a pris l'exemple d'Asterix et Obelix xXxL, il a extrait le package de débogage divulgué, qui nécessitait la version 5.00 du firmware. Après cela, il a backporté les fichiers du package vers la version 4.03. Par la suite il a tenté des étapes similaires avec la version 3.00, mais il a rencontré des échecs sans aucun retour en arrière. \n \nIl n'a pas l'intention de backporter des jeux à la pelle, il a juste tenté l'expérience pour savoir si cela était possible, ce qu'il confirme.\n \n \n\n \n \n \n \nTout est là : StretchEcho\n",
        "images": {}
    },
    "news_12": {
        "title": "[PS5] PS5 Temperature v1.00 pour PS5 disponible",
        "content": "Le développeur Lapy le reconnait lui même cet utilitaire n'est fondammentalement utile, mais il propose tout de même PS5 Temperature en version 1.00.\n \nIl tient à remercier Zecoxao et LightningMods et il estime q'un bon nettoyage et de l'entretien régulier sont bien meilleurs.\n \n\n \n \n \nTéléchargement : PS5 Temperature (v1.00)\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185844/in-ps5-ps5-temperature-v100-pour-ps5-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[PS4] PS4 PKG Manager Beta 3 disponible",
        "content": "Le développeur Hippie68 propose un nouveau logiciel depuis quelques jours pour la scène PS4, il s'agit de PS4 PKG Manager qui est proposé en version Bêta 3.\n \nCette application a été conçu pour lire les PKG de PlayStation 4, et elle fonctionne sous Windows, MacOS ou bien Linux, elle sert à créer, lire et gérer les fichiers en stockant les metadonnées dans une base de données. \n \nUne fois stockée, les PKG peuvent être visualisés sans avoir réellement un accès physique, une sorte de prévisualisation, l'utilisateur pouvant sélectionner divers éléments du menu contextuel, pouvant être étendu avec des commandes personnalisées, des actions personnalisées, et il est possible d'intégrer des outils tiers avec des arguments sous forme de commandes. \n \n\n \n\n \n \n \nChangelog : \n \n- Correction de la variable d'action personnalisée %dir% qui ne fonctionne pas dans Windows 11 lorsqu'il s'agit simplement d'un nom de lecteur (par exemple \"C :\").\n- L'ajout récursif de répertoires via le menu Fichier devrait maintenant être une expérience fluide.\n- Sous Windows 11, la boîte de dialogue \"Fermer l'onglet\" est maintenant correctement centrée.\n- Correction de l'impossibilité de supprimer toutes les actions personnalisées.\n- Les actions personnalisées dangereuses peuvent être préfixées par \"CONFIRMER\" pour demander une confirmation à l'utilisateur.\n- Nouvelles entrées du menu \"Édition\" : Inverser la sélection, Sélectionner (non) existant, Sélectionner (non) synchronisé.\n- Ajout de mnémoniques dans le menu.\n- Nouvelles entrées du menu contextuel : \"Copier dans la liste\" et \"Déplacer dans la liste\".\n- Le traitement des données n'est plus interrompu lorsque l'on quitte l'application, sauf si l'utilisateur le souhaite.\n- Les éléments de liste sélectionnés peuvent désormais être supprimés en appuyant sur la touche DEL.\n- Correction de la récursion des répertoires interrompue par des répertoires inaccessibles (par exemple Recycle.bin).\n- Le montage et le démontage des répertoires synchronisés (clés USB) devraient maintenant être détectés.\n- La barre d'état affiche \"Processing...\" si des données PKG sont en cours de traitement.\n- Correction de Ctrl-A qui ne fonctionne pas sur Windows 11.\n- Après l'exécution d'une action personnalisée, les fichiers PKG qui n'existent plus sont supprimés de la liste.\n- Autres petites corrections de bugs et améliorations.\n \n \n \nTéléchargement : PS4 PKG Manager Beta 3 \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185816/in-ps4-ps4-pkg-manager-beta-3-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1185816/in-ps4-ps4-pkg-manager-beta-3-disponible-2.png"
        }
    },
    "news_14": {
        "title": "[PS4] Le firmware 11.50 pourrait combler des failles récentes",
        "content": "Comme vous pouvez vous en doutez des failles importantes ont récemment été recensées auprès de Sony, même si nous ne savons toujours pas ce qu'elles concernent, il se murmure que cela aurait un rapport avec SSL ou TLS, elles ont besoin d'être corrigées par la marque. \n \nL'arrivée d'un nouveau firmware est toujours l'occasion pour les dataminers d'aller chercher ce qui a changé avec le précédent, en ayant accès à la Bêta il est alors possible de commencer l'analyse. \n \nSamet Takao a dévoilé la mise à jour PS4 v11.50 Bêta 1.00 datée du 16 Janvier 2024, mais la paternité du leak aurait été possible grâce à Kat et Raven. \n \n \n\n \n \nMême si cela n'a pas encore été confirmé, il y a bien aussi une version PS5 de cette mise à jour, cela pourrait être le firmware 8.50, mais rien n'est encore sûr . Une chose est certaine, le bug de Theflow doit probablement être corrigé, reste à voir si c'est également le cas de celui de Aapo. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185787/in-ps4-le-firmware-1150-pourrait-combler-des-failles-recentes-1.png"
        }
    },
    "news_15": {
        "title": "[PS5] PS5 Temperature en préparation par Lapy",
        "content": "Le développeur Lapy vient d'informer sur son profil Twitter / X que Zecoxao a insisté pour qu'il prépare une version PS5 de son outil de surveillance et de modification de paramétrage de température, PS4 Temperature mais pour PS5, qu'il a nommé PS5 Temperature. \n \nD'après Lapy l'outil PS5 Temperature n'est pas encore très utile, du fait que tous les paramètres ne sont pas encore débloqués et aussi probablement que son impact n'est pas très flagrant ou convaincant. \n \n \n\n \n \nQue cela ne tienne, l'outil est donc proposé en privé pour le moment, il pèse 53.75 MB comme le montre l'image proposé par Lapy, mais il s'agit probablement de la première version Bêta, la version finale pourrait être un peu plus légère comme cela avait été le cas avec PS5 Xplorer. \n \nComme il a pu obtenir cette première version privée, Zecoxao, lui, de son côté, a dévoilé un premier screenshot de l'utilitaire. \n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185785/in-ps5-ps5-temperature-en-preparation-par-lapy-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1185785/in-ps5-ps5-temperature-en-preparation-par-lapy-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS5] PS5 Xplorer v1.01 disponible",
        "content": "Le développeur Lapy continue de nous régaler sur PlayStation 5, et offre une première mise à jour officielle à son outil PS5 Xplorer qui est désormais livré en v1.01. \n \nComme vous le savez PS5 Xplorer est l'un des meilleurs manager/utilitaire créé sous Unity et qui permet d'effectuer diverses opérations comme couper, copier, coller, renommer, supprimer des fichiers ou des dossiers, ou encore d'explorer le stockage de la console. \n \nAvec cette nouvelle version 1.01, le développeur vient corriger des problèmes liés aux traductions et prend en charge les avatars. \n \n \n\n \nChangelog PS5-Xplorer 1.01 :\n \n- Correction du support des traductions (uniquement en mode root).\n- Prise en charge des avatars (à partir des fichiers Avatar Maker).\n- Merci crump_youtube pour le test bêta \n \n \n \nTéléchargement : PS5 Xplorer v1.01\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185784/in-ps5-ps5-xplorer-v101-disponible-1.jpg"
        }
    },
    "news_17": {
        "title": "[3DS] Citra v2.0 avec mode multijoueur en ligne",
        "content": "L'équipe en charge du développement du fork de Citra, essentiellement représentée par PabloMK7, est de retour avec une grosse annonce concernant leur émulateur, vous le savez peut être mais ce fork de Citra permet de profiter du mode multijoueur en ligne via l'un des meilleurs émulateurs de Nintendo 3DS actuellement supporté. \n \nPabloMK7 dévoile donc la version 2.0 de son fork avec au passage le mode multijoueur avec de gros changements. Pour l'instant, il n'est possible de se connecter qu'au Nintendo Network, mais la prise en charge du Pretendo Network est prévue pour bientôt. La plupart des fonctionnalités en ligne ne fonctionnent pas encore correctement sur Android.\n\n \nChangelog de la version v2.0 :\n \n- Retravaillée avec les derniers changements de Citra, ce qui inclut de nombreuses améliorations de stabilité et une meilleure interface Android.\n- Correction de plantages dans de nombreux jeux lors de la mise en ligne (affectant certains jeux Monster Hunter et autres).\n- Implémentation de fonctionnalités manquantes nécessaires à certains jeux (Zelda : Tri Force Heroes et autres).\n- Ajout de la prise en charge de CTCert.bin, qui :\n- Permet de lier et d'utiliser un Nintendo Network ID.\n- Permet d'utiliser les serveurs de remplacement Miiverse (tels que rverse et Juxtaposition).\n- Permet de lancer l'eShop (uniquement si les données de sauvegarde NIM sont extraites d'une vraie console).\n- Permet d'utiliser le Nintendo Badge Arcade.\n- Nombreuses améliorations des services SpotPass, en permettant l'utilisation de LLE BOSS.\n \nMise à jour depuis la version 1.0 :\n \n- Quelques sections des instructions d'installation ont été mises à jour et doivent être refaites si vous avez utilisé cette fourche dans le passé :\n- Section II : Télécharger les fichiers système depuis les serveurs Nintendo\n- Section IV. Dump Console Unique Secure Data (CTCert.bin)\n- Section V. Activation des modules système LLE.\n \n \nPourquoi cela ne figure-t-il pas dans les versions officielles de Citra ?\n \n- L'équipe Citra est actuellement en pourparlers avec des avocats pour savoir s'ils veulent supporter le multijoueur en ligne dans leur émulateur (que ce soit Nintendo ou Pretendo). En attendant, PabloMK7 a décidé de fournir un fork avec le support du multijoueur en ligne. \n- Une fois que le support en ligne sera ajouté à la version officielle de Citra, ce fork sera abandonné.\n \n \nTéléchargement : Citra v2.0 avec mode multijoueur en ligne\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185715/in-3ds-citra-v20-avec-mode-multijoueur-en-ligne-1.png"
        }
    },
    "news_18": {
        "title": "[Wii] Le Wii Shop est de retour sur Wii hackée avec RiiShop",
        "content": "Connu à l'origine sous le nom de projet \"LaunchShop\", RiiShop marque le retour d'une solution de type WiiShop et elle est plutôt belle et bien construite. \n \nNintendo a suspendu l'accès aux nouveaux titres le 30 Janvier 2019, le Wii Shop ne laissant que la possibilité de retélécharger les jeux précédemment achetés. \n \nLancé il y a quelques jours, le 08 Janvier 2024, RiiShop permet de profiter sous une Wii hackée d'une boutique Wii, et ainsi de parcourir la console virtuelle, de profiter à nouveaux des WiiWare, mais aussi des chaînes Wii originales. \n \nPour pouvoir disposer de RiiShop, il vous faut installer un fichier au format Wadd installable à partir d'une Wii hackée. \n \n \n\n \n \n \nPour l'heure, RiiShop conserve le statut de Bêta, il est donc probable que vous découvriez ou subissiez quelques bugs liés à l'utilisation, ou comme nous pouvons le voir quelques lenteurs. \n \n \n\n \n \n \nPour en profiter il convient d'accéder au téléchargement par https://discord.com/invite/WQVNuGhzfc et d'aller dans la section Download et ainsi de profiter du fichier new_vps_shop.wad de 24.84 MB. Une fois la phase de Bêta passée, RiiShop sera livré au grand public.  \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185711/in-wii-le-wii-shop-est-de-retour-sur-wii-hackee-avec-riishop-1.jpg"
        }
    },
    "news_19": {
        "title": "[Switch] Le Mig Switch sera-t-il rapidement soumis à reverse engineering",
        "content": "A la réception des premiers échantillons tests, les détenteurs de Mig Switch ont ouvert le linker, il faut avouer que c'est tentant car une simple vis qui se trouve en haut du dispositif renferme l'ensemble. Il ne demande qu'à être ouvert.\n \nQuoiqu'il en soit dès l'ouverture quelque chose se remarque c'est que les deux puces présentent ont été grossièrement effacées. Nous pourrions penser que c'est soit pour s'assurer auprès du fournisseur un stock sans contrainte, soit c'est pour éviter, ou du moins retarder, le reverse enginering de la solution proposée par Mig Switch. \n \n \n\n \n \n\n \nL'identification des deux puces principales du Mig Switch sont \"effacées\" par grattage\n \n \nOn peut déjà penser que certains ont l'intention d'exploiter le Mig Switch, soit pour proposer une puce directement fonctionnelle et intégrable dans la console, soit pour casser les sécurités de la solution, pour en exploiter le code, ou bien pour en comprendre le fonctionnement. \n \nD'autres pourraient aussi être intéressé du reverse engineering afin de copier le Mig Switch ou bien pour en créer des clones. \n \n \n \n\n \n \n\n \n \n \nBien entendu, comme vous pouvez vous en douter, la solution est bien entendu protégée que ce soit au niveau du hardware ou du software, et c'est exactement la même chose pour le dumper de cartouches de jeux.  \n \nSans réelle surprise le Mig Switch a été sécurisé au niveau de ses logiciels, et comme nous en informe Mike Heskin (Hexkyz) \" Sans surprise, les binaires de mise à jour sont cryptés, il faudra donc dumper tout ce qui s'exécute sur les puces réelles (qui sont très probablement un FPGA à faible coût pour émuler le LSI de la carte de jeu et un MCU pour les tâches de gestion générale).\n \nProposé à 60 euros, la solution sera copiée tôt ou tard, car cela va rapidement attiré des convoitises, car facile à vendre et à mettre en oeuvre. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185690/in-switch-le-mig-switch-sera-t-il-rapidement-soumis-a-reverse-engineering-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1185690/in-switch-le-mig-switch-sera-t-il-rapidement-soumis-a-reverse-engineering-1.png"
        }
    },
    "news_20": {
        "title": "[Switch] Le premier rapport de RyuJinx de 2024",
        "content": "Les développeurs de l'émulateur RyuJinx publient leur premier rapport de 2024, cela fait plaisir car nous attendions cela depuis 2 mois car en Décembre 2023 il n'y a eu aucun rapport. \n \nDes correctifs graphiques, des optimisations sur les appareils sur batterie, une amélioration des performances ou encore un élargissement de la compatibilité.\n \n \n \n\n \n \n \nOnt été ajouté plus de 700 jeux à la liste de compatibilité en 2023, ce qui porte le total des jeux testés (et signalés) sur Ryujinx à 4255. Plus de 83 % d' entre eux n'auraient aucun problème graphique, technique ou de stabilité , avec 12 autres. % de titres ayant au moins un problème. Cette catégorie est principalement remplie de titres présentant des problèmes graphiques mineurs ou des problèmes de stabilité. Dans d'autres systèmes de marquage, ils peuvent également être considérés comme jouables. Les 4,5% de titres restants ne progressent que jusqu'aux menus, voire pas du tout.\n \n \n \n\n \n \n \n \nEn ce qui concerne les performances, nous avons enregistré une amélioration moyenne de 36 % sur un an dans notre propre suite de jeux habituelle. Comme d'habitude, cela dépend fortement du jeu et du matériel.\n \nTout est là : blog.ryujink.org\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185675/in-switch-le-premier-rapport-de-ryujinx-de-2024-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1185675/in-switch-le-premier-rapport-de-ryujinx-de-2024-2.png"
        }
    }
}