{
    "news_1": {
        "title": "[3DS] Mise à jour importante de l'émulateur Azahar 3DS",
        "content": "L'émulateur Azahar vient de recevoir une mise à jour importante, ce projet, issu d'un fork de Citra développé par PabloMK7 et Lime3DS, avait été annoncé pour la première fois en novembre 2024. Azahar représente une évolution prometteuse dans le monde de l'émulation, surtout après l'arrêt du développement de Citra en mars 2024. Cet arrêt faisait suite à un accord juridique entre les développeurs de Citra (également responsables de l'émulateur Switch Yuzu) et Nintendo. Contrairement à Yuzu, qui a été frappé d'une injonction, Citra n'a pas été directement affecté par des restrictions légales, permettant ainsi à des projets comme Azahar de voir le jour.\n \nQuoiqu'il en soit, la mise à jour 2120.3 apporte davantage de stabilité, elle vise à résoudre certains problèmes issus de la version initiale, et se permet également d'améliorer la convivialité de certains menus. Il semblerait que cette version soit la dernière avant la prochaine version majeure qui appartiendra à la branche 2121 (annoncée ici) \n \n \n\n \n\n \n\n \n \n \nChangelog \n \nAndroid : \n- Ajout d'une nouvelle invite pour les utilisateurs qui auraient pu sélectionner par inadvertance un répertoire utilisateur différent après la mise à niveau depuis Lime3DS, ce qui donne l'impression que des données telles que des sauvegardes ont pu être perdues. \n- Cette nouvelle invite permet aux utilisateurs de choisir entre continuer à utiliser leur nouveau répertoire utilisateur ou restaurer leur ancien.\n- La nécessité de resélectionner le répertoire utilisateur après la mise à niveau n'était pas intentionnelle et était le résultat d'un bug.\n- Nous nous excusons si vous avez été affecté par ce problème et que vous pensiez avoir perdu des données.\n \nToutes les versions : \n- Correction d'un problème où les systèmes 3DS coréens, chinois et taïwanais ne pouvaient pas démarrer une application utilisant la police système en raison du remplacement de police open source manquant (cela incluait l'outil de configuration du système). \n- Pour l'instant, la police EUR/USA/JPN sera utilisée, mais la plupart des glyphes seront remplacés par des points d'interrogation.\n- Cela permet de terminer le processus de configuration, même sans pouvoir lire le texte.\n- Une police avec les glyphes manquants pourra être ajoutée ultérieurement.\n- Correction d'un problème où les consoles dont les régions avaient été modifiées via un micrologiciel personnalisé ne pouvaient pas démarrer le processus de configuration du système via l'outil de configuration Azahar Artic.  \n \nDesktop : \n- Version SDL2 groupée mise à jour pour résoudre un problème où les contrôleurs Xbox devaient être réappairés à chaque fois qu'ils étaient éteints.  \n- L'application Azahar définit désormais explicitement sa propre icône de Windows  \n- Pour la plupart des plateformes, cela ne devrait rien changer, mais sous Linux, cela est connu pour résoudre certains problèmes d'icônes d'application.\n \nTechnique :\n- Correction de l'échec de compilation lors de la tentative de construction à l'aide de Qt 6.9.0 ou version ultérieure.  \n- Correction de l'échec de compilation lors de la tentative de création pour le bureau avec la prise en charge de Discord activée lors de l'utilisation de CMake 4.0 ou version ultérieure. \n- Les avertissements MSVC C4711 et C5045 ont été désactivés pour rendre les journaux de compilation moins désagréables à consulter. \n- Aucun de ces avertissements n’est important.\n- La version de NSIS que nous utilisons pour créer nos installateurs Windows est passée de 3.10 à 3.11.\n \n \n \nTéléchargement : Azahar 3DS 2120.3\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205466/in-3ds-mise-a-jour-importante-de-lemulateur-azahar-3ds-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205466/in-3ds-mise-a-jour-importante-de-lemulateur-azahar-3ds-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1205466/in-3ds-mise-a-jour-importante-de-lemulateur-azahar-3ds-3.jpg"
        }
    },
    "news_2": {
        "title": "[Switch 2] Sera-t-elle crackée plus rapidement que la Switch ?",
        "content": "Si nous revenons un peu en arrière la Switch de première génération a été rapidement hackée du fait de la présence de la puce nVidia qui a été utilisée. \n \nA l'origine la Switch de première génération était censé disposer de commandes au travers de l'USB, permettant ainsi une ouverture de la mémoire tampon, puis Fusée-Gelée a été découvert, il s'est avéré que cette commande tampon ne vérifiait pas la taille, et donc le hack de cette mémoire a pu être mis en place, puis l'utilisation de l'eMMC a pu être accessible, permettant de souder des puces directement dans les consoles, des opérations rendues plus difficile avec les modèles OLED et Lite. \n \nSur la Switch 2, il est certain que Nintendo va avoir appris de ces erreurs,  on se souviendra tous que la Switch a été hacké grâce à un trombone moins d'un an après sa sortie ! Notamment avec le mode RCM, un Tegra X1 peu sécurisé, et un exploit fail0verflow.\n \nLancée en Mars 2017, la Switch a été intégralement hackée en pas moins de 8 mois, et tout a été dévoilé en Avril 2018. \n \n \n\n \n\n \n\n \n \n \nSur la Switch 2, on imagine que Nintendo va apprendre, et masquera les connexions les plus courantes de DAT0, RST, CPU, CMD à CLK... pour perturber les fabricants de puces mod. Ils pourraient facilement cacher les lignes cmd, clk et dat0 dans une troisième couche d'une carte à 4 ou 5 couches. Ils pourraient laisser des traces juste en dessous, sur une autre couche. \n \nLa sortie de la MIG Switch les a effrayés et les a poussés à retarder la sortie de cette console pour des raisons de sécurité. Ils feront tout leur possible pour empêcher les puces de mods de fonctionner. \n \n \n\n \n \n \nDes rumeurs suggèrent également que des parties du bootroom ont été réécrites. On trouve des traces d'instructions de verrouillage. Ils utilisent également quatre BCT plus petits au lieu d'un seul comme sur la Switch.\n \nQue dire des exploits Nereba et Caffeine qui ont enchanté les pocesseurs de la première heure, du firmware 1.0.0 au 4.0.0, dès lors faut-il acheter ou précommander une Switch 2 dès maintenant pour bénéficier du firmware le plus bas, probablement, mais cela signifiera une console hors-ligne, et donc très partiellement utilisable. \n \n \n\n \n \n \nLe problème est toujours le même, comme Sony sur la PS5, Nintendo a besoin de menu debug, debug settings ou autre service de maintenance, mais il est vrai que le hack Nintendo se base davantage sur les bootrooms ou les procédures de démarrages. \n \nL'espoir réside dans le fait que Nintendo a du faire évoluer sa console que ce soit en terme d'ouverture, notamment avec l'arrivée du port USB, de caméra, et de toute la nouvelle architecture, qui en conséquence amèneraient de nouvelles possibilités. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1205431/in-switch-2-sera-t-elle-crackee-plus-rapidement-que-la-switch-1.jpg"
        }
    },
    "news_3": {
        "title": "[Vita] Ps Vita RetroFlow Launcher v7.2.2 disponible",
        "content": "Le développeur jimbob4000 propose la mise à jour de PS Vita RetroFlow Launcher, il est toujours intéressant de mettre à jour cet utilitaire s'il est installé sur votre console portable afin de bénéficier des dernières corrections. \n \nPour rappel, RetroFlow-Launcher est une jolie petite interface graphique permettant de parcourir et de lancer vos jeux Retro sur la PS Vita, et est à l'origine un fork de HexFlow-Launcher par VitaHEX.\n \n \n\n \n \nIl s'agit d'une version modifiée de HexFlow Launcher, un coverflow 3D comme un lanceur pour PS Vita. Cette version comprend des catégories de jeux rétro qui peuvent être lancées sans bulles pour RetroArch, DaedalusX64 et Flycast. Les jeux Playstation et PSP peuvent également être lancés sans avoir à créer de bulles pour chaque jeu. Vous l'aurez compris RetroFlow remplacera le Menu Bull avec le plus bel effet. \n \n \n\n \n \nChangelog : \n \n- Correction d'un bug de la vue Liste où certains jeux ne se lançaient pas\n- Correction d'un bug PSTV où l'application de lien PS4 n'était pas incluse dans les applications système \n- Correction d'une erreur de script 533 catégorie valeur nulle\n- Traductions allemandes mises à jour (remerciement à Andiweli)\n \nLe guide d'installation se trouve ici : RetroFlow-Launcher/installation  \n \n \nTéléchargement : Ps Vita RetroFlow Launcher v7.2.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205430/in-vita-ps-vita-retroflow-launcher-v722-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205430/in-vita-ps-vita-retroflow-launcher-v722-disponible-2.png"
        }
    },
    "news_4": {
        "title": "[XB/XB360] XCAT v1.05 disponible",
        "content": "Les spécialistes de la préservation de la Xbox et de la Xbox360 ont travaillé d'arrache-pied au développement de XCAT, un outil automatisé gratuit permettant aux propriétaires de Xbox de rechercher sur leurs consoles du contenu Xbox perdu et de le télécharger dans le cadre d'un effort collaboratif d'archivage de DLC, de mises à jour de titres, de contenus maison (applications, skins...). Grâce à cet outil, la communauté peut unir ses efforts pour archiver le contenu Xbox perdu qui pourrait subsister sur les consoles Xbox et le préserver pour le bien de tous. \n \nCompatible avec les consoles Xbox softmoddées et hardmoddées, cet utilitaire est très léger, moins de 4 mo,  ce qui lui permet de tenir sur une carte mémoire, ceci est particulièrement utile pour les utilisateurs qui ne souhaitent pas modder leur console, mais qui souhaitent néanmoins contribuer au projet XCAT pour la préservation du contenu potentiellement perdu de leur Xbox.\n \n \n \n\n \n\n \n\n \n \n \nXCAT analysera le disque dur de l'utilisateur, en recherchant ces chemins :\n \nC:\\\nE:\\\nF:\\apps\\\nF:\\jeux\\\nG:\\apps\\\nG:\\jeux\\\nX:\\\nY:\\\nZ:\\\n \nXCAT calcule une somme de contrôle unique pour chaque fichier trouvé. La liste des sommes de contrôle est ensuite envoyée aux serveurs XCAT pour analyse. Si un fichier est nouveau et non encore archivé, il est placé dans une file d'attente et téléchargé directement depuis la console de l'utilisateur. Si un fichier est déjà présent sur les serveurs XCAT, il ne sera pas téléchargé à nouveau. Cette méthode évite également les doublons dus à des schémas de nommage différents, car chaque fichier est haché.\n \n \n \n\n \n \n \nLa récupération du contenu perdu n'est qu'une étape du processus de préservation. L'étape suivante consiste à partager tout contenu perdu pertinent avec l'ensemble de la communauté. Cela se fait de différentes manières. Le contenu récupéré, utile ou pertinent pour jouer à des jeux sur Insignia (le remplaçant moderne du Xbox Live), est partagé avec l'équipe Insignia et est mis à disposition sous forme de mises à jour du jeu concerné.\n \nD'autres contenus, tels que des applications homebrew perdues, des jeux, des skins... sont mis à disposition sur les canaux concernés.\n \n \nChangelog v1.00 : \n \n- Version initiale\n \nChangelog v1.01 : \n \n- Correction d'une erreur de chargement d'image pouvant survenir en cas de corruption de fichiers sur le disque dur\n- Ajout d'une option pour réinitialiser la configuration réseau en cas d'échec d'accès à Internet\n- Correction d'un écran noir sur les systèmes équipés de modchips Stellar\n- Suppression du temps total écoulé à l'écran de fin, car souvent incorrect. Ce point sera corrigé dans une future version.\n \nChangelog v1.02 : \n \n- Amélioration majeure de la vitesse de traitement des fichiers\n- Gestion améliorée des erreurs réseau\n- Ajout d'un système de mise à jour automatique\n- Affichage des fichiers traités récemment pendant le traitement\n \nChangelog v1.02b : \n \n- Ajout des composants manquants pour l'écran de fin\n \nChangelog v1.03 :\n \n- Ajout d'un assombrissement de l'écran après 5 minutes sans interaction avec la manette\n \nChangelog v1.04 :\n \n- Réduction du temps de démarrage\n- Stockage des fichiers multimédias dans une sauvegarde de jeu appropriée pour éviter l'affichage d'une sauvegarde corrompue sur le tableau de bord Xbox\n \nChangelog v1.05 :\n \n- Ajout d'un contrôle plus agressif du ventilateur pour éviter la surchauffe des consoles plus anciennes\n \n \n \nL'équipe XCAT reconnaît que les consoles Xbox modifiées peuvent être utilisées à des fins diverses, au-delà du simple jeu. C'est pourquoi XCAT évite volontairement les répertoires susceptibles de contenir des données potentiellement sensibles, telles que l'historique de lecture multimédia et les caches de vignettes générés par XBMC. XCAT est également conçu pour ignorer l'analyse des répertoires DEVKIT afin que les développeurs travaillant sur des projets ne téléchargent pas par inadvertance leurs logiciels inédits.\n \nCeci dit, les utilisateurs doivent savoir que cet outil analyse une grande partie du disque dur de leur Xbox. Si votre console est équipée d'une distribution Linux, XCAT ne la recherchera pas intentionnellement, mais il vous conseille de prendre des mesures pour protéger toute information personnelle que vous ne souhaitez pas partager, si elle existe sur votre console. Si de tels contenus personnels existent, vous pouvez éviter leur téléchargement en les déplaçant simplement hors de l'un des répertoires analysés (listés plus haut dans cet article).\n \nTéléchargement : XCAT 1.05\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205403/in-xbxb360-xcat-v105-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205403/in-xbxb360-xcat-v105-disponible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1205403/in-xbxb360-xcat-v105-disponible-3.png"
        }
    },
    "news_5": {
        "title": "[3DS/Switch] Checkpoint v3.9.0 disponible",
        "content": "La dernière version de Checkpoint (3.9.0) vient d'être publiée, apportant des correctifs essentiels et des optimisations, notamment pour résoudre le problème de crash au démarrage qui affectait les utilisateurs depuis la version 3.8.0. Le développeur Bernardo Giordano propose en effet une nouvelle version de Checkpoint à destination de la 3DS et de la Switch. Pour rappel, CheckPoint permet de gérer vos sauvegardes sur 3DS et sur Switch, mais aussi bien de faire des backups que des restaurations de vos sauvegardes.\n \n \n\n \n \n\n \n \n \n \nChangelog \n \n- Correctifs majeurs :\n \nRésolution du crash au démarrage présent depuis la 3.8.0, grâce à l'aide précieuse de achinech sur Discord.\n \nOptimisation du scan des cartouches : désormais effectué sur un thread séparé (2 fois par seconde), améliorant ainsi les performances.\n \nMeilleure gestion des fichiers de configuration et synchronisation des threads.\n \nAjout de blocs try-catch pour éviter les plantages liés à des exceptions non gérées.\n \n- Nouvelles fonctionnalités :\n \nSupport réseau et serveur HTTP intégré : permet d’accéder aux logs en temps réel via :\n \nhttp://adresse-IP-3ds:8000/logs/memory (logs actuels) \n \nhttp://adresse-IP-3ds:8000/logs/file (logs du jour) \n \nSystème de logs amélioré (stockés dans /3ds/Checkpoint/logs).\n \nOptimisations du compilateur (passage à O3 et LTO).\n \n- Améliorations générales :\n \nMises à jour graphiques.\n \nDocumentation mise à jour avec de nouvelles captures d’écran.\n \nStabilité globale renforcée pour une meilleure expérience utilisateur.\n \n- Prochaines étapes :\n \nL’équipe reconnaît que le code source a besoin d’être restructuré, et les futures versions se concentreront sur le nettoyage et l’optimisation. Un grand merci à la communauté pour son soutien ! Les contributions (pull requests) sont les bienvenues.\n \n \n \nTéléchargement : Checkpoint 3.9.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205401/in-3dsswitch-checkpoint-v390-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1205401/in-3dsswitch-checkpoint-v390-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[PS5] Streets of rage MOD adapté pour PS5 4.xx, 5.xx et 6.xx",
        "content": "Voici une petite mise à jour de mon homebrew fétiche Streets of rage MOD afin qu' il fonctionne sur PS5.\n \n\n \nEn effet cet homebrew sortis de base sur PS3 en version Paintown, a été réécrit pour fonctionner sur PS4 grâce à OpenBOR et aujourd'hui adapter pour PS5.\n \nIl a été testé sur PS5 4.03, 5.10, 6.00, 6.50 et fonctionne parfaitement.\n \n\n \nTélécharger  Streets of rage MOD PS5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205395/in-ps5-streets-of-rage-mod-adapte-pour-ps5-4xx-5xx-et-6xx-1.png"
        }
    },
    "news_7": {
        "title": "[PS5] Les performances d'UMTX2 largement améliorées",
        "content": " \nLe développeur idlesauce a largement optimisé le lancement de son jailbreak PS5 UMTX2, et pas qu'un peu, l'exploit désormais se lance entre 1 à 3 secondes là où avant il fallait entre 10 à 60 secondes. \n \n \n\n \n \nLe projet UMTX2 est le fruit du travail de plusieurs développeurs et chercheurs en sécurité informatique, qui ont fait le choix de mettre en commun leurs connaissances, UMTX2 est un nouvel outil de jailbreak qui exploite la vulnérabilité UMTX pour permettre l'exécution de code non autorisé sur la console PS5 de Sony, le code d'exploitation est largement basé sur l'implémentation Lua développée par les développeurs Shahrilnet et n0llptr, disponible dans le référentiel remote_lua_loader.\n \nAvec cette mise à jour les performances sont justes extraordinaires. \n \n \n \n\n \n \n \n \nChangelog : \n \n- Performances et taux de réussite améliorés\n- Latence des appels réduite de ~6 ms à ~0,2 ms.\n- Ne pas céder avant la destruction de l'umtx.\n- L'exploit se termine désormais souvent en 1 à 3 secondes (au lieu de 10 à 60 secondes)\n- Prend en charge le firmware PS5 1.00-5.50\n- Utilise PSFree 150b par abc (un exploit webkit connu pour exécuter des exploits sur PS5 de manière stable)\n- Payloads mis à jour avec un menu spécifique\n \n \nTout est là : https://github.com/idlesauce/umtx2\n \nWeb Host : https://umtx2.pages.dev/\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205378/in-ps5-les-performances-dumtx2-largement-ameliorees-1.jpg"
        }
    },
    "news_8": {
        "title": "[WiiU] WiiUDownloader voit une mise à jour depuis 10 mois",
        "content": "Voilà la première mise à jour de WiiUDownloader depuis 10 mois, la dernière, la v2.60 avait été proposée le 20 juin 2024, voilà donc que débarque la v2.61.\n \nPour rappel, WiiUDownloader est une application développée en langage Go et qui permet de télécharger des jeux Wii U directement depuis les serveurs Nintendo. Disposant d'une interface graphique du plus bel effet, déployée grâce à GTK, elle permet de parcourir les fichiers présents sur la Wii U.\n \n \n\n \n \n \nLe logiciel prend en charge le décryptage du contenu téléchargé, le rendant utilisable directement sur la console Wii U. La possibilité de rechercher les jeux, les mises à jour, les DLC, des démos, il intègre aussi la gestion d'une file d'attente, selon le téléchargement, en positionnant des options de cryptages. \n \nDes sections de classement par ID, par non, ou bien par région, le programme intègre des outils pour décrypter, télécharger, déprotéger le contenu sans autorisation, sachant que WiiUDownloader est proposé sous licence GPLV3, et il s'appuie sur des bibliothèques qui doivent parfois être mise à jour. \n \nC'est le cas de cette mise à jour qui apporte : \n \n- La mise à jour des dépendances\n- Résolution du problème de blocage lors du décryptage alors qu'il est réellement terminé\n- Cette version augmente la version minimale de MacOS à MacOS 13 Ventura\n \n \n \nTéléchargement : WiiuUDownloader v2.61\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205376/in-wiiu-wiiudownloader-voit-une-mise-a-jour-depuis-10-mois-1.png"
        }
    },
    "news_9": {
        "title": "[Wii/WiiU] Enorme mise à jour pour ModMii qui est proposé en v8.0.1",
        "content": " \nLe développeur XFlak propose une mise à jour importante de ModMii, l'outil est un utilitaire PC qui vous guide étape par étape dans le processus de modding de votre Wii, Wii U ou encore de son mode Wii. \n \nAvec ModMii, la configuration des loaders USB ou SNEEK est beaucoup plus facile et intuitive. \n \nCette nouvelle version propose un \"Nettoyage de fichiers\" avec des options plus poussés permettant d'exclure certains fichiers. La page de téléchargements avancés de ModMii Classic a été entièrement repensée, et il est possible de s'appuyer sur le générateur de transfert de téléchargement pour créer des chaînes cachées. \n \nS'agissant d'une version importante, la version incluse du d2x-cIOS a été mise à jour vers la v11 beta3, tout un programme qui se retrouve dans l'énorme changelog proposé par Xflak.\n \n \n \n\n \n \n \nChangelog 8.0.1 :\n \nPrincipaux changements : \n- Ajout d'une option permettant d'ignorer les fichiers de la fonction Nettoyage de fichiers de ModMii, afin de pouvoir sélectionner précisément ceux à nettoyer/supprimer. Des fichiers supplémentaires ont également été ajoutés à la liste de nettoyage de fichiers de ModMii.\n- La page des Téléchargements Avancés de ModMii Classic a été radicalement modifiée et améliorée. Les utilisateurs peuvent désormais créer plusieurs versions différentes de cIOS d2x dans la même file d'attente. L'ajout de téléchargements cIOS avancés à une file d'attente est beaucoup plus rapide et demande moins d'invites. Une option permettant de supprimer le dernier téléchargement avancé de la file d'attente en cas d'erreur a été ajoutée. Les emplacements de téléchargement cIOS avancés sont désormais limités à 200-253 ; cela signifie qu'il n'y a aucun risque de blocage des téléchargements avancés de ModMii (SAUF pour les téléchargements personnalisés définis par l'utilisateur, qui peuvent néanmoins être dangereux si vous ne savez pas comment les utiliser).\nLes files d'attente de téléchargement sont chargées différemment pour les files d'attente créées avec ModMii 8.0.0 ou une version antérieure, et pour les versions 8.0.1 et suivantes. Les files d'attente 8.0.1 et suivantes fonctionneront normalement et prendront en charge plusieurs versions de d2x dans la même file. Les anciennes files d'attente 8.0.0 ou une version antérieure (créées pour une seule version de d2x) continueront d'être synchronisées avec la version de d2x sélectionnée dans les options de ModMii.\nTous les IOS ont été supprimés de la page Téléchargements avancés ; ceux-ci peuvent toujours être récupérés à l'aide de l'option de téléchargement personnalisé défini par l'utilisateur de ModMii.\n- Lors de l'exécution d'un assistant incluant des cIOS d2x, ModMii demandera désormais aux utilisateurs s'ils souhaitent utiliser le dernier cIOS d2x « recommandé » plutôt que le cIOS « fourni ». La version recommandée de d2x peut désormais être modifiée en saisissant « R » dans la page des options de d2x. La restauration des paramètres par défaut activera également la version recommandée de d2x si elle diffère de la version fournie et en informera l'utilisateur.\nModMii ne recherche les autres versions de D2X disponibles en ligne qu'une seule fois par session. Cela permet de changer plusieurs fois de version de D2X au cours d'une même session beaucoup plus rapidement.\nAu démarrage, mais pas plus d'une fois par jour, ModMii vérifiera/confirmera silencieusement la dernière version « recommandée » du cIOS d2x.\n- Le générateur de redirecteurs de téléchargements avancés de ModMii permet désormais de créer des WAD de redirection de chaînes masqués (non applicable aux redirecteurs d'ID de chaîne, car cela serait redondant). Ceci est particulièrement utile pour les utilisateurs WiiU qui démarrent des homebrews ou des jeux Wii directement depuis des redirecteurs WUHB, mais qui ne souhaitent pas que les chaînes soient visibles ou occupent de l'espace dans le menu Wii.\n- Lanceur d'applications ModMii amélioré avec prise en charge des fichiers wuhb, rpx et wps pour pouvoir télécharger ces types de fichiers depuis votre PC vers votre WiiU via Internet (nécessite le plugin Wiiload).\n- Ajout des plugins Wiiload et FTPiiU pour WiiU\\Aroma à la page de téléchargement 5 et aux vérifications de l'application de mise à jour.\n- Version groupée mise à jour de d2x cIOS vers v11 beta3 .\n \nOptions : \n- Toutes les options sont désormais enregistrées automatiquement lorsqu'elles sont modifiées et l'option d'enregistrement des paramètres dédiée a été supprimée.\n- Lors de la définition de la lettre (ou du chemin) du lecteur SD ou USB HDD via le menu des options, ModMii vous demandera désormais si vous souhaitez analyser le lecteur pour rechercher des applications à mettre à jour ou à nettoyer (uniquement après une rapide vérification des applications ou du dossier WiiU). La même procédure est effectuée dans ModMii Skin, mais l'utilisateur sera averti même si rien n'est trouvé, car il s'agit de la seule option de nettoyage de fichiers et de mise à jour d'applications dans ModMii Skin.\n- Les opérations de nettoyage de fichiers et de mise à jour d'applications ne modifieront plus le paramètre Lecteur/Chemin de la carte SD enregistré.\n- Ajout du menu contextuel, des informations sur la barre d'outils du Launchpad et du programme d'installation/de désinstallation aux options de ModMii Classic (en plus du menu « F = ouvrir un fichier ou un dossier »). Consultez le journal des modifications de la version 7.0.0 pour plus d'informations.\n \nGuide : \n- Des étapes ont été ajoutées aux guides applicables pour vérifier/modifier le style de partition MBR des cartes SD (en plus des disques durs USB) car de nos jours, elles ne sont pas toujours nécessairement vendues en tant que MBR par défaut.\nÉtapes Priiloader améliorées dans les guides indiquant comment gérer les erreurs potentielles « cIOSPAGHETTI ».\n- Lors du téléchargement de yawmME UNIQUEMENT dans le cadre d'un assistant/guide de mise à jour SysCheck, ModMii garantit que \\WAD\\wm_config.txt est désactivé pour garantir qu'aucun paramètre de configuration personnalisé ne provoque de problèmes comme celui-ci .\n \nCorrections de bugs mineurs et améliorations :\n- ModMii ajoute désormais une barre oblique (/) au début des chemins dol du forwarder v14. La plupart des homebrews n'y prêtent pas attention, et c'est donc passé inaperçu pendant longtemps. Le forwarder USBLoader(s) v14 de ModMii a également été mis à jour, mais il ne devrait pas être nécessaire de le faire depuis l'ancienne version.\n- Correction d'un bug dans l'assistant de mise à jour vWii SysCheck où vIOS80 et Priiloader étaient toujours considérés comme nécessitant des mises à jour.\n- Correction d'un bug mineur où l'assistant ModMii Skin vWii permettait aux utilisateurs de continuer avec des versions d2x personnalisées activées qui ne prennent pas en charge l'IOS 38 de base de vWii, tant que les trois autres IOS de base de vWii étaient pris en charge. Dans ce cas, un cIOS vWii avec l'IOS 38 de base aurait été exclu des téléchargements/guides.\n- Correction d'un bug où le chargement d'une file d'attente de téléchargement, puis le retour en arrière et le chargement d'une deuxième file d'attente entraînaient le basculement des éléments de la première file d'attente.\n- Correction d'un bug où ModMii plantait parfois lors du téléchargement d'applications depuis oscwii.org si le site était inaccessible ou si le PC était hors ligne. Désormais, si aucun accès à oscwii.org n'est disponible, ModMii considérera la version en cache de son dossier temporaire comme la dernière version disponible (le cas échéant). Dans le cas contraire, le téléchargement sera signalé comme manquant.\n- Correction de l'impossibilité pour le lanceur d'applications de ModMii de récupérer correctement les arguments des fichiers meta.xml contenant des octets nuls ou des commentaires sur une seule ligne avant chaque argument (les commentaires de bloc étaient corrects). L'analyse des arguments meta.xml a également été ajustée pour exclure les arguments contenus dans les balises disabled_arguments (une fonctionnalité récemment introduite par USB Loader GX dans la version r1282).\n- Correction d'un bug lors de l'affichage des options pour les thèmes d2x ou skin où des options supplémentaires non valides étaient affichées ; cela était inoffensif car elles ne pouvaient pas être basculées.\n- Correction de l'erreur bénigne « Impossible de trouver C:\\ModMii\\temp\\DLgotos.txt » qui s'affichait parfois lors de la création d'émunands. Même si cette erreur avait été rencontrée, les résultats auraient été corrects.\n- Correction d'un bug mineur qui se produisait si ModMii Classic était exécuté en tant qu'administrateur et qu'une des pages de téléchargement était lancée, ce qui faisait que la fenêtre de la console ModMii restait ouverte au lieu d'être masquée.\n- Si ModMii Classic est exécuté en tant qu'administrateur, les instructions à l'écran informant les utilisateurs qu'ils peuvent glisser-déposer des fichiers dans la fenêtre de la console sans avoir à saisir le chemin d'accès ne s'affichent plus (car cette fonctionnalité est désactivée en mode administrateur). Notez qu'il n'a jamais été nécessaire d'exécuter ModMii en tant qu'administrateur, sauf si vous choisissez de l'installer ou d'écrire dans un dossier protégé.\n- Les lanceurs de raccourcis mis à jour (ModMii.exe, ModMiiSkin.exe et ModMii_32bit.exe) détectent également les instances de ModMii si elles sont exécutées en tant qu'administrateur (par exemple « Administrateur : ModMii ») afin de mieux avertir les utilisateurs contre l'exécution de plusieurs instances de ModMii.\n- Le skin ModMii et le fichier ModMii.bat basculeront vers la version 32 bits de ModMii.exe sur les anciennes versions de Windows non prises en charge, même s'il s'agit d'un système d'exploitation 64 bits. La version 32 bits de ModMii.exe ne permettra pas automatiquement à ModMii de fonctionner pleinement avec les anciennes versions de Windows, mais elle améliorera légèrement la situation.\n- Mise à jour de l'effet optionnel « Tourner » lors de l'application des thèmes. Cette modification visait simplement à redimensionner le contour du canal, comme décrit ici .\n- Mise à jour de la version de wiiload utilisée par ModMii vers la version v0.5.3-1 et suppression de la vérification de la taille des fichiers du lanceur d'applications (validée sur le récepteur)\n- Pour votre protection, le modificateur WAD IOS de ModMii empêche désormais les utilisateurs de modifier l'emplacement d'un stub IOS en un emplacement utilisé par les menus système.\n- Autres changements mineurs.\n \nedit 15.04.25 : \n \nTéléchargement : ModMii v8.0.2\n \n \n \n",
        "images": {}
    },
    "news_10": {
        "title": "[PS3] Apollo Save Tool s'améliore sur PS3 avec des options cloud",
        "content": "Le développeur Damian Parrino, connu sous le pseudonyme Bucanero, vient de mettre en ligne une mise à jour d'Apollo Save Tool dans sa version d'origine, c'est à dire celle déployée pour la PS3. \n \nPour rappel, Apollo Save Tool est un outil qui permet avant tout d'archiver ses sauvegardes de jeux et de les restaurer en cas de disfonctionnement de votre espace de stockage. Mais il ne sert pas qu'à ça, il a su évoluer avec le temps et offrir des possibilités beaucoup plus étendues. \n \nLes capacités d'Apollo Save Tool sont intéressantes et en plus elles sont accessibles puisque l'outil peut être lancé sur custom firmware mais aussi sur PS3HEN, l'application peut donc fonctionner sur FAT, Slim et Superslim. \n \nAvec cette mise à jour, la version 2.2.0 sur PS3, le développeur a souhaité rendre possible la possibilité de sauvegarder et de restaurer les sauvegardes PS1/PS2 et PS3 sur le cloud, si vous avez un serveur FTP (comme un NAS, un serveur local ou un hébergement type web host..). Un guide à d'ailleurs été mis en oeuvre : Apollo-FTP-Guide.\n \n \n \n\n \n \n \nChangelog\n \nAjout :\n- Prise en charge du serveur FTP (enregistrement de la sauvegarde dans le cloud)\n-- Compressez, téléchargez et sauvegardez les enregistrements sur un serveur FTP défini par l'utilisateur\n-- Répertorier, télécharger et restaurer les sauvegardes à partir d'un serveur FTP défini par l'utilisateur\n-- Sauvegarde des sauvegardes PS1, PS2 et PS3\n- Copie vers HDDO : ption améliorée\nMenu Paramètres :\n- FTP Server URL : Option ajoutée\n- Ajout de l'option de sélection ( FTP/Online DB) pour les téléchargements de sauvegardes\n- USB Source : Option de sélection ajoutée\n- Debug log : Option persistante\n- Save Owner : Option supprimée\nDivers :\n- Mise à jour du moteur de correctifs Apollo vers la version 1.3.0\n- Ajout djb2une fonction de hachage\n- Ajout la prise en charge des balises pour les options sélectionnées par l'utilisateur sur .savepatchles fichiers\n- Prise en charge de SaveWizard et des codes BSD avec plusieurs options\n \n \nTéléchargement : Apollo Save Tool 2.2.0\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205366/in-ps3-apollo-save-tool-sameliore-sur-ps3-avec-des-options-cloud-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] MigFlash un nouveau firmware, et un enthousiasme pour la Switch 2",
        "content": "Après quelques jours d'inactivité de son site internet, voir même d'information depuis presque 2 mois, la team MigFlash sort du silence et propose une mise à jour firmware pour sa solution de contournement, de sauvegardes, pour son linker.\n \nElle propose en effet depuis hier la mise à jour firmware 1.1.9 qui a pour ambition de corriger un problème pour les utilisateurs Mac. Des fichiers XCI cachés, commençant par un point, étaient créés par inadvertance par le système d'exploitation Mac OS. Dans ce cas, un appui long sur un bouton pouvait empêcher le chargement de la ROM. Ce problème est désormais résolu. \n \n \n\n \n \n \n \nAutre chose, la team sur son site se dit prête à accueillir avec impatience la nouvelle Switch 2, faut-il y voir déjà une sorte de provocation ou un avertissement à Nintendo, le port cartouche étant identique, il sera intéressant de voir si la MigFlash sera \"compatible\" avec la Switch 2, même si on se doute que Nintendo a du changer pas mal de choses au niveau sécurité de sa nouvelle console. \n \n \nTéléchargement : Firmware MigFlash 1.1.9\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205325/in-switch-migflash-un-nouveau-firmware-et-un-enthousiasme-pour-la-switch-2-1.png"
        }
    },
    "news_12": {
        "title": "[WiiU] Bloopair améliore la gestion des Dual Shock 4 et des contrôleurs Switch",
        "content": "Le développeur GaryOderNichts propose depuis quelques jours une nouvelle version de Bloopair qui est maintenant proposé en v1.0.3, pour rappel, il s'agit d'un homebrew qui donne le pouvoir d'utiliser divers contrôleurs Bluetooth directement sur la Wii U en tant que contrôleur Wii U Pro sans logiciel ou matériel supplémentaire. \n \nBloopair se charge de patcher temporairement le module IOS-PAD et s'assure qu'il accepte tous les contrôleurs Bluetooth. De plus, il convertit les requêtes HID reçues (boutons, etc.) en conséquence. Jusqu'à quatre contrôleurs peuvent être connectés, les vibrations et l'indicateur de batterie fonctionnent.\n \nDans cette nouvelle version, le développeur à améliorer la gestion des Dual Shock 4 tierces, mais aussi celle des contrôleurs Switch ainsi que les plages de mappages et d'étalonnage des joystick des contrôleurs Switch. \n \n \n\n \n \nChangelog : \n \n- Ajout de la prise en charge des contrôleurs DualShock 4 tiers qui n'envoient pas de rapports complets (toutes les valeurs).\nNotez que ces contrôleurs ne prennent pas en charge les niveaux de batterie et s'affichent toujours comme ayant une batterie pleine.\n- Améliore la gestion des contrôleurs Switch qui ne contiennent pas de calibrage complet du stick.\n- Améliore les plages de joystick pour les contrôleurs Switch sans données d'étalonnage.\n \n \n \nTéléchargement : Bloopair 1.0.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205323/in-wiiu-bloopair-ameliore-la-gestion-des-dual-shock-4-et-des-controleurs-switch-1.jpg"
        }
    },
    "news_13": {
        "title": "[XB360] BadBuilder sort du statut de Beta avec la v0.3",
        "content": " \nBadBuilder est un outil qui automatise la création d'une clé USB BadUpdate pour la Xbox 360. Proposé par le développeur Pdawg-bytes, BadBuilder est maintenant updaté en v0.3.\n \nIl s'agit de la première version qui sort du statut d'Alpha, faisant de cette version 0.3, la toute première version stable. BadBuilder va permettre de simplifier la création d'une clé USB compatible avec l'exploit BadUpdate, ainsi vous pourrez exécuter du code non signé et des applications homebrews sur votre Xbox 360 si vous disposez de tout ce qu'exige BadUpdate.\n \nBadBuilder va formater la clé USB, il va créer les dossiers, télécharger les fichiers nécessaires, ou les mettre à jour, enfin l'outil permet de spécifier manuellement les chemins de fichiers dynamiquement. \n \n \n\n \n \nChangelog 0.3 : \n \n- Première version hors alpha !\n- Lien modifié pour l'archive Rock Band Blitz : téléchargement plus rapide\n- Les programmes Homebrew précédemment décrits comme « non pris en charge » sont désormais entièrement pris en charge, et un nouvel outil d'exploitation a été ajouté en option ! Tout le reste est conservé depuis la version précédente : si vous rencontrez des problèmes, veuillez les signaler en créant un nouveau ticket. Le programme est fourni sous forme de build à fichier unique, mais assurez-vous que .NET 8.0 Desktop Runtime est installé avant de l'exécuter.\n- Ajout d'une option permettant de choisir entre les outils d'exploitation « FreeMyXe » et « XeUnshackle ».\n- Ajout de la prise en charge des homebrews « non pris en charge » ; les utilisateurs peuvent désormais rechercher le point d'entrée s'il n'est pas trouvé.\n- Ajout d'une journalisation des erreurs plus détaillée pour les correctifs XeX et le formatage natif.\n \n \nTéléchargement : BadBuilder v0.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205321/in-xb360-badbuilder-sort-du-statut-de-beta-avec-la-v03-1.png"
        }
    },
    "news_14": {
        "title": "[Portal] Mise à jour firmware pour le PS Portal",
        "content": "Sony vient de mettre en ligne un nouveau firmware pour le PlayStation Portal, l'objectif est d'améliorer l'expérience utilisateur du service cloud Game Streaming qui est toujours proposé en Bêta, qui est disponible pour les abonnées PlayStation Plus Premium. \n \nCette update firmware ajoute de nouvelles fonctionnalités qui visent à rendre l'utilisation plus fluide et personnalisable, en bénéficiant de l'expérience et des retours des utilisateurs. \n \nPar exemple, il est possible de trier les jeux du catalogue de streaming cloud, un bouton a été ajouté en haut à gauche de l'interface, il organise les titres selon 3 critères : récemment ajoutés, ordre alphabétique ou date de sortie. \n \n \n \n\n \n \n \nIl est possible de capturer des screenshots et d'enregistrer des clips avec le bouton Create du PlayStation Portal. \n \nUne file d'attente a été intégrée pour accéder aux serveurs de streaming lorsqu'ils sont pleins, une fonction de pause automatique et des notifications d'inactivité après 10 minutes sans interaction ont été ajoutées.\n \nPour finir un écran de feedback utilisateur a été introduit à la fin des sessions de streaming, permettant ainsi d'évaluer la qualité de l'expérience, permettant aux développeurs d'améliorer le service. \n \nDu reste, cette mise ne corrige pas de faille, vu que plus aucune n'a été trouvée depuis le firmware 2.01.\n \n \nTout est là : blog.playstation.com\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205303/in-portal-mise-a-jour-firmware-pour-le-ps-portal-1.png"
        }
    },
    "news_15": {
        "title": "[PS3] RPCS3 sous Android ne sera plus officiellement développé",
        "content": " \nIl y a un peu moins de deux nous vous informions que suite à un problème de respect de licence, le développeur DH avait décidé de se lancer dans le développement de la version officielle de RPCS3 pour Android.\n \nCependant de l'eau semble avoir déjà coulé sous les ponts, et nous sommes au regret de constater que cette version officielle a été archivée par son développeur. Archivé cela signifie qu'elle sera plus développée, la dernière version disponible est l'Alpha-7 disponible ici.\n \n \n\n \n \nPour se consoler, il faut savoir que des forks existent, notamment RPCSX-UI-Android, mais il ne s'agit pas d'une version officielle, et cela reste une version expérimentale. \n \nTéléchargement : rpcsx-ui-android\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205298/in-ps3-rpcs3-sous-android-ne-sera-plus-officiellement-developpe-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS5] La puce A53io aurait livrée certains secrets",
        "content": "Comme vous le savez la sécurité de la PS5 a été largement renforcée depuis la PS4, que ce soit du côté software avec un Hyperviseur et une architecture beaucoup plus contraignante, et des sécurités eXecute Only Memory ou \"XOM\" accrue qui permet de limiter l'exécution de code non signé. \n \nIl existe en plus de ces deux éléments, la problématique du processeur principal a53io qui gère séparément les packages PS5 (PKG) sur PS5, et il faut là aussi casser ses protections ou trouver un moyen de le contourner pour lancer les fPKG, et cela sans compter les évolutions qui ont pu être opérées par Sony au fil des firmwares, notamment à partir du 3.00, et du 7.xx. \n \n \n\n \nLa puce a53_io hackée ? \n \n \n \nDes étapes importantes doivent donc être franchies avant de pouvoir exécuter librement des fPKG sur PS5, mais il semblerait que l'une d'entre elle, celle de la puce a53io a été passée. C'est ce que semble confirmer Zecoxao avec un screen et un commentaire non équivoque sur son profil X, reste à savoir cela que cela va permettre réellement et sur quel firmware. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205278/in-ps4ps5-la-puce-a53io-auraient-livree-certains-secrets-1.png"
        }
    },
    "news_17": {
        "title": "[PS4/PS5] LightningMods prépare et tease etaHEN 2.1B",
        "content": "Il est temps de passer à la suite, nous apprenons que le développeur LightningMods prépare la prochaine version d'etaHEN, la mouture estampillée 2.1B apporte des évolutions intéressantes. \n \nCette mise à jour d'etaHEN 2.1B amène une nouvelle option qui permet de \"Recharger les Cheats\" dans le menu des cheats ! Désormais, les créateurs de cheats codes n'auront plus besoin de modifier manuellement les fichiers shn/json/mc4.txt dans le dossier des cheats ou de redémarrer l'application après avoir ajouté de nouveaux codes.\n \n \n \n\n \n \n \nCette fonctionnalité simplifie grandement le processus de test pour les développeurs de cheats codes, leur permettant de voir leurs modifications instantanément sans interruption. Un gain de temps précieux pour la communauté des cheat makers !\n \nSi un cheat code ne fonctionne pas, le problème vient du code lui même, parfois cela provient des offsets utilisés, ou bien les codes fonctionnent sur PS4 mais pas sur PS5. \n \n \n \n \n",
        "images": {}
    },
    "news_18": {
        "title": "[Multi] EasyRPG Player 0.8.1 disponible",
        "content": " \nEasyRPG Player est de retour, l'arrivée d'une version stable de ce logiciel est toujours un évènement, de quoi maintenir toutes les fonctionnalités de la conception originale RPG Maker 2000 et RPG Maker 2003.\n \nComme toutes les plates-formes sont concernées, notamment PC et Linux, il est bon de rappeler que pour nos consoles ce programme concerne les Nintendo Switch, la Nintendo 3DS et ses dérivées, la Nintendo Wii, et la PlayStation Vita.\n \n \n\n \n\n \n \nAvec cette mise à jour, les jeux peuvent désormais être chargés à partir des archives LZH , comme annoncé avec le portage Wii U.\n \nIl y a eu plusieurs ajustements spécifiquement pour la Wii : Le portage fonctionne à nouveau grâce à l'utilisation du bon ordre des octets. Le passage à SDL2 permet une résolution de rendu plus élevée , mais s'accompagne d'une légère perte de performances d'environ cinq FPS. Pour éviter d'autres ralentissements, V-Sync est désactivé par défaut. Un nouveau backend audio plus puissant est également utilisé. Les plantages lors du démarrage à partir d'une clé USB sans carte SD appartiennent au passé et la journalisation a été supprimée pour protéger le système de fichiers en cas de plantage.\n \nLes couleurs des captures d'écran ont été corrigées sur Wii et Wii U.\n \nDeux problèmes ont été corrigés sur la 3DS : le chargement des sauvegardes ne provoque plus de crash et les transitions d'écran s'affichent correctement sans dominante bleue.\n \nEnfin et surtout, la version Switch ne se bloque plus après avoir quitté le mode veille.\n \n \nTéléchargement : EasyRPG Player 0.8.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205242/in-multi-easyrpg-player-081-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205242/in-multi-easyrpg-player-081-disponible-2.png"
        }
    },
    "news_19": {
        "title": "[PS4] OrbisPro Beta v0.3.1 disponible",
        "content": " \nLe développeur SvenGDK propose une nouvelle version d'OrbisPro Beta, la dernière mise à jour d’OrbisPro Beta, la version v0.3.1, apporte son lot d’optimisations et de corrections, renforçant ainsi la stabilité et l’expérience utilisateur. \n \n \n\n \n \nOrbisPro est une plateforme en développement visant à centraliser et optimiser la gestion des jeux et applications sur PC, avec une interface intuitive et des fonctionnalités avancées.\n \nVoici les principaux changements de cette version :\n \nModifications Internes :\n \n- Amélioration de la stabilité du lecteur ISO : Une légère optimisation a été apportée pour une expérience plus fluide.\n \n- Optimisation de la recherche : Le système ne parcourt plus qu’une seule liste d’alias de jeux pour trouver les icônes et arrière-plans, améliorant ainsi les performances.\n \n- Chargement de l’accueil (\"Home\") revu :\n \n- Correction du mauvais placement des applications/jeux lors du chargement ou rechargement de l’accueil.\n \n- Désactivation des entrées utilisateur jusqu’à ce que l’accueil soit entièrement chargé.\n \n- Détection des jeux améliorée : Meilleure prise en charge des jeux situés sur le disque C:. Une future mise à jour permettra d’ajouter des jeux depuis d’autres lecteurs.\n \n- Rappel : La détection automatique fonctionne actuellement uniquement dans C:\\Program Files (x86) et C:\\Games.\n \nListe d’exclusion mise à jour : Exclusion des outils comme les rapporteurs d’erreurs, lanceurs (GOG Galaxy, REDlauncher, etc.) pour une détection plus propre.\n \nAjouts :\n- 19 nouvelles icônes et 17 arrière-plans pour personnaliser davantage votre interface.\n \n- Prise en charge préliminaire des modèles Asus ROG Ally X & MSI Claw en vue de futures fonctionnalités.\n \nCorrectifs :\n- Résolution de plantages dans l’explorateur de fichiers.\n \n- Correction de l’animation d’arrière-plan lors de la navigation vers une application sans asset dédié.\n \nAutres Modifications :\n- Suppression de l’application \"Media\" : Jugée inutile, elle laisse place à l’utilisation de l’explorateur de fichiers.\n \n- Cette mise à jour, bien que mineure, prépare le terrain pour des évolutions plus importantes, notamment l’ajout de jeux depuis d’autres disques. \n \n \nTélécharger : OrbisPro Beta v0.3.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205234/in-ps4-orbispro-beta-v031-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[XB/XB360] La XB360 se dote de XDON v1",
        "content": "Le développeur Eaton Z. vient de mettre en ligne la tout première version d'une application serveur XDON conçue pour fonctionner sur les Xbox Orginales et sur les Xbox 360.\n \nXDON, qui signifie Xbox Disk Over Network, a pour ambition d'offrir un accès direct aux périphériques de stockage de la console via le réseau, permettant ainsi de se passer de devoir retirer physiquement le disque dur afin de le connecter à un PC. \n \n \n\n \n \nLe logiciel utilise un protocole personnalisé pour permettre des opérations d'entrée / sortie de bas niveau, permettant de bénéficier d'une rapidité et d'une aisance de l'accès à distance. \n \nCette fonction XDON est arrivée dans la dernière version de l'outil FATXplorer, ce qui est probablement en liant avec XDON v1, les partitions pourront être montées et utilisées simplement depuis le réseau local. \n \n \n\n \n \nXDON – Xbox Disk Over Network est en développement depuis décembre et il est enfin prêt. Voici de quoi il s'agit et pourquoi vous devriez l'essayer, XDON est un exécutable de serveur de socket qui s'exécute comme un titre de jeu sur la Xbox originale et la Xbox 360. Les clients, comme FATXplorer, s'y connectent pour demander des données de disque sur le réseau à l'aide d'un protocole personnalisé. Pour transférer des fichiers sur votre Xbox, vous pouvez utiliser FTP, ou retirer le disque dur, le connecter à votre PC et utiliser FATXplorer. Lorsque XDON est en cours d'exécution, il fournit une liste des périphériques disponibles et FATXplorer vous permettra de les monter, comme si ces lecteurs étaient physiquement connectés à votre PC.\n \nXDON a été conçu à l'origine comme un module complémentaire de FATXplorer, mais d'autres utilisateurs pourront l'intégrer grâce au SDK C# (bientôt disponible). XDON prend également en charge le dump des disques de jeu, la lecture/écriture de la mémoire NAND et les commandes ATA.\n \n \n \n \nTout est là : XDON - Xbox Disk Over Network  /  XDON Xbox 360 / XDON XB Originale\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1205225/in-xbxb360-la-xb360-se-dote-de-xdon-v1-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1205225/in-xbxb360-la-xb360-se-dote-de-xdon-v1-2.png"
        }
    }
}