{
    "news_1": {
        "title": "[Switch] sys-clk v1.0.3 disponible",
        "content": "L'équipe de développement Retronx vient de dévoiler une nouvelle version de son sysmodule sys-CLK, le développeur p-sam avec la contribution du développeur alula vient en effet de mettre en ligne la v1.0.3, la version précédente datant de plus d'une année puisqu'elle avait été publiée en Mars 2022. sys-clk est un module système qui vous permet de configurer l’horloge CPU / GPU et Mémoire en fonction de l’application en cours d’exécution et de l’état docké ou pas, d’accélérer les temps de chargement si votre console regorge de jeux, et donc de profiter des possibilités offertes par l'overclock.\n \n \n\n \n \nCette mise à jour vient corriger des crashs, des bugs, optimiser le programme par rapport aux firmwares supérieurs au 16.0.0. En effet cette mise à jour mineure corrige le problème de superposition qui ne fonctionne pas sur HOS >= 16.0.0 en mettant à jour libtesla et libnx vers la dernière version.\n \n \nTéléchargement : sys-clk v1.0.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172607/in-switch-sys-clk-v103-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[XboxOne] RetroPass v1.7.1 disponible",
        "content": "RetroPass est une interface RetroArch et RetriX Gold développée par Retropassdev exclusivement pour la Xbox One. \n \nAttention s'agissant d'un homebrew un peu particulier, le programme nécessite un accès au mode développeur, donc il se destine à un public averti. Retro Pass est une interface frontale pour RetroArch, RetriX Gold, Dolphin, XBSX2 et Xenia Canary fonctionnant sur Xbox.\n \nCette interface est spécialement conçue pour la console Xbox et devrait être familière aux utilisateurs de la Xbox.\n \n \n\n \n \nCes derniers jours les versions se sont un peu succédées, puisque le logiciel est passé de v1.6.0, à 1.6.1, puis 1.7.0, et 1.7.1.\n \n \nChangelog : \n \n- Correction du numéro de version dans les paramètres et le manifeste\n- Lors de l'utilisation de LaunchBox, les jeux dans les plateformes peuvent être réordonnés en utilisant le paramètre \"Sort Title\".\n- Correction : Les listes de lecture générées automatiquement par LaunchBox Arcade ne se chargeaient pas correctement et empêchaient les autres plateformes et listes de lecture de se charger.\n- Ajout du support pour les sources de données multiples et les stockages externes multiples.\n- Le numéro de version de RetroPass est visible sur la page Paramètres.\n \nA noter que RetroPass devient également compatible avec l'émulateur Xenia pour UWP.\n \n \nTéléchargement : RetroPass v1.7.1\n \n",
        "images": {}
    },
    "news_3": {
        "title": "[Switch] MissionControl v0.9.1 disponible",
        "content": "Le développeur ndeadly vient de mettre en ligne une nouvelle version de MissionControl, il s'agit de la version 0.9.1 qui apporte pas mal de nouveautés. \n \nAvant d'aborder les nouveautés de cette dix-huitième version officielle, rappelons que MissionControl pour ceux qui le connaitrait pas est un module système personnalisé qui permet de profiter de contrôleurs Bluetooth tiers qui peuvent être utilisés de manière native sur la Switch, et tout cela sans dongle ni autre matériel externe.\n \n \n\n \n \nLe support de la Dualshock 3 : \n \nCette nouvelle version apporte le support des manettes Dualshock 3 ! L'appairage des manettes Dualshock 3 fonctionne un peu différemment des manettes Bluetooth ordinaires, car il nécessite l'utilisation d'un câble USB.\nPour appairer la manette, vous devez être sur l'écran Change Grip/Order comme d'habitude.\nConnectez la manette à la console via un câble USB (vous aurez besoin d'un adaptateur USB-C OTG si vous êtes en mode portable).\nUne fois que les LED rouges du joueur commencent à clignoter, retirez le câble USB et appuyez sur le bouton PS. Attendez quelques secondes et vous devriez voir apparaître la notification habituelle Paired indiquant que la manette est désormais appariée à la console.\nVous pouvez désormais vous reconnecter à la console en appuyant simplement sur le bouton PS.\nCette version apporte également quelques modifications aux paramètres du fichier de configuration missioncontrol.ini. \n \nQuelques changements structurels :\n \n- Ajout du paramètre dualshock3_led_mode pour choisir entre les modèles de LED des joueurs de style Switch et PS3.\n- Ajout dualshock4_polling_rate pour modifier le taux d'interrogation utilisé par les contrôleurs Dualshock 4.\n- enable_dualshock4_lightbar -> dualshock4_lightbar_brightness\n- enable_dualsense_lightbar -> dualsense_lightbar_brightness\n- Ces deux paramètres ont été modifiés, passant d'un booléen permettant d'activer/désactiver la barre lumineuse à LED à une valeur entière contrôlant la luminosité.\n- Renommé enable_dualsense_player_leds -> dualsense_enable_player_leds pour être cohérent avec les autres noms de paramètres.\n \nChangelog :\n \n- Ajout de la prise en charge de la manette Sony Dualshock 3.\n- Ajout du support pour la manette Mocute 053.\n- Ajout d'une option de configuration .ini pour sélectionner le modèle préféré de LED du lecteur Dualshock 3.\n- Ajout d'une option de configuration .ini pour contrôler le taux d'interrogation utilisé par les contrôleurs Dualshock 4.\n- Remplacement de l'option de configuration .ini pour activer/désactiver la barre lumineuse LED sur les contrôleurs Sony par un paramètre de contrôle de la luminosité.\n- Renommé quelques autres options de configuration .ini.\n- Le dpad de la Wiimote est maintenant mappé sur le stick analogique gauche en orientation horizontale pour améliorer la compatibilité avec les jeux qui n'autorisent pas les entrées dpad pour les mouvements.\n \nTéléchargement : MissionControl v0.9.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172536/in-switch-missioncontrol-v091-disponible-1.jpg"
        }
    },
    "news_4": {
        "title": "[PS5] Le firmware PS5 07.20.00 disponible",
        "content": "Sony vient de mettre en ligne un nouveau firmware à destination de la PlayStation 5, il s'agit de la mise à jour officielle 07.20.00 qui porte la référence 23.01-07.20.00.05-00.00.00.0.0.\n \nUn peu moins d'un mois après la sortie du firmware 7.01.01 pour la PS5 , la première mise à jour après les débuts de Discord sur la console de salon Sony et l'introduction du support VRR 1440p. Cette mise à jour 23.01-07.20.00 pour PlayStation 5 semble inclure une série d'améliorations purement liées à la stabilité du système d'exploitation et à certaines de ses fonctionnalités.\n \n \n\n \n \nVoici le changelog officiel de ce firmware 7.20 provenant de la page officielle de Sony :\n \nChangelog version 23.01-07.20.00\n \n- Dernière mise à jour du logiciel système pour les consoles PS5\n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et la convivialité de certains écrans.\n- Nous avons mis à jour le logiciel du contrôleur sans fil DualSense Edge pour en améliorer la stabilité.\n \nLe bot est PS5Bot\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172535/in-ps5-le-firmware-ps5-072000-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS4] L'émulation Saturn en natif sur PS4",
        "content": "Le développeur CyB1k que l'on ne présente plus vient d'informer la scène PlayStation 4 qu'il a réussi à backporter l'émulation Saturn sur la PS4 et PS4 Pro.\n \nLe développeur nous informe en effet qu'il a réussi à backporter pas moins de 3 émulateurs, bien qu'il ne sache pas réellement s'il y a de réelles différences entre les 3.\n \n \n\n \n\n \n \nA noter que vous devez utiliser GoldHen 2.3 pour les jeux Saturn sur le firmware 5.05 !\n \n \n\n \n Crédit image : Markus95\n \nNe vous inquiétez pas, vous le savez on peut déjà compter sur notre ami Markus95 qui nous l'espérons va proposer un script aux petits oignons ! \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172486/in-ps4-lemulation-saturn-en-natif-sur-ps4-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1172486/in-ps4-lemulation-saturn-en-natif-sur-ps4-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1172486/in-ps4-lemulation-saturn-en-natif-sur-ps4-3.jpg"
        }
    },
    "news_6": {
        "title": "[Multi] Gary Bowser va être libéré de prison",
        "content": "Nous venons d'apprendre que Gary Bowser, le célèbre membre de l'équipe Team Xecuter (Gateway 3DS, le Stargate, le Trueblue Mini, le Classic2Magic, le SX OS, le SX OS Pro, SX Lite et SX Core), va être libéré dans les jours qui viennent.\n \nIl avait été condamné à 40 mois de prison, mais il avait demandé une libération pour le mois de Mars 2023 invoquant des problèmes de santé, et bien entendu une \"bonne conduite\". \n \nBien entendu tout n'est pas tout rose pour Gary Bowser comme en atteste son interview avec Nick Moses de Février dernier. \n \nIl doit toujours payer les 10 millions de $ de dommages et intérêts à Nintendo, et pour cela Nintendo a été autorisé à saisir 25 à 30 % des revenus de Bowser. \n \nIl va sortir dans les prochains jours, il va être ramené au Canada avec un nouveau passeport comme il l'explique dans une nouvelle interview avec Nick Moses. \n \n \n \n\n \n \n \nIl a commencé le processus de remboursement alors qu'il était encore en prison; comme de nombreux détenus américains, Bowser a pu travailler derrière les barreaux, et au cours de son séjour au centre de détention fédéral SeaTac à Washington, il a pu rembourser 175 $.\n \nIl a en fait avoué être le « vendeur » de l'entreprise et aurait gagné 320 000 $ en sept ans de travail, le plus riche étant le français Max Louarn.\n \nTout est là : kotaku.com\n \n",
        "images": {}
    },
    "news_7": {
        "title": "[Switch] Atmosphere 1.5.2 disponible",
        "content": "SciresM vient déjà de réagir et propose la version 1.5.2 d'Atmosphere. \n \nPour notre plus grand plaisir il dévoile en effet une nouvelle version de sa solution Atmosphere qui est donc depuis 2 heures proposées en version 1.5.2, qui est la  soixante et onzième version officielle d'Atmosphère.\n\n \nAssurez-vous de mettre à jour fusee lors de la mise à jour vers la version 1.5.2. Grâce au travail de l'équipe de Switchbrew, Atmosphère 1.5.2 est fourni avec hbl 2.4.3, et hbmenu 3.5.1.\n \n \n\n \n \nChangelog 1.5.2 : \n \n- Une application homebrew (haze) a été ajoutée pour effectuer des transferts de fichiers USB (SciresM tient à remercier liamwhite pour la conception et l'implémentation).\n- haze est inclus avec Atmosphère, et permet d'accéder à la carte SD via le protocole PTP/MTP.\n- A noter que haze apparaîtra dans le menu homebrew sous le nom de \"USB File Transfer\".\n- Atmosphère ne peut pas être mis à jour en cours d'exécution, et tenter d'installer une mise à jour d'Atmosphère via haze échouera comme d'habitude.\n- Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur.\n\n \n \nTéléchargement : Atmosphere 1.5.2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1299795438.png"
        }
    },
    "news_8": {
        "title": "[Switch] Le firmware officiel 16.0.2 disponible",
        "content": "Nintendo vient de mettre en ligne un tout nouveau firmware, il s'agit du firmware 16.0.2 qui vient d'être publié. Cette mise à jour concerne toutes les zones, comme l'Europe, les USA, le japon mais également la Chine. \n \nCette mise à jour vise à corriger une faille de sécurité, et également propose des \"Améliorations générales de la stabilité du système pour améliorer l'expérience de l'utilisateur\" . \n \n \n\n \n \n \nLe wiki a déjà été mis à jour : https://switchbrew.org/wiki/16.0.2#ssl\n \nLa liste des gros mots et le module SSL (qui permet d'établir des connexions sécurisées avec les serveurs) ont été mis à jour.\n \nLe mot \"adhd\" a été ajouté à la liste des gros mots en japonais. Aucune autre langue n'a été affectée.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172446/in-switch-le-firmware-officiel-1602-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[Retro] Un dock rétro lite CM4 AIO pour la CM4",
        "content": "Le développeur StonedEdge avance sur sa Retro Lite CM4 AIO Docking Station, un dock destiné à sa console CM4, même si actuellement, le code affiche l'écran d'accueil et passe à l'affichage des statistiques Pi sur la détection d'un port COM. Il y a encore beaucoup de bogues, et le développeur ne recommanderait pas de l'utiliser pour l'instant.\n \nSi un jeu est lancé par l'utilisateur, Pi stats se fermera et affichera une image binaire combinée du jeu en cours. Il s'agit donc d'une station d'accueil basique conçue pour être utilisée avec la console de jeu Retro Lite CM4. \n \n \n\n \n \nLa Retro Lite CM4 est un projet commun entre Dmcke5 et StonedEdge. La console est alimentée par une batterie Li-Po de 4000mAh et est conçue pour fonctionner avec différentes images logicielles, y compris mais non limité à RetroPie, Lakka ou Batocera, directement à partir d'une carte SD ou via un stockage eMMC. Le boîtier du projet a été inspiré par une Nintendo Switch Lite, mais ne correspond pas à 100% à l'original. Le CM4 ne peut actuellement pas émuler la plupart des consoles 32/64 bits sorties après la PSP ou la Dreamcast. Cela signifie que la GameCube, la Wii et la 3DS sont actuellement injouables jusqu'à ce que la fondation sorte une nouvelle version.\n \n \n \n\n \n \n \nLes principales caractéristiques de ce projet dock sont les suivantes\n \n- Un écran couleur 16 bits de 1,5\" 128x128 piloté par SPI et entièrement intégré.\n- Écran d'accueil configurable par l'utilisateur au démarrage de la machine\n- 3 ports USB 2.0 externes à utiliser pour le clavier, la souris et d'autres périphériques en mode bureau.\n- Chargement USB-C\n- Sortie vidéo HDMI\n- Bouton poussoir multifonction\n \nLes modes actuellement prévus sont :\n \n- Écran d'affichage jusqu'à ce que le port COM soit détecté\n- Pi Stats - Affiche les statistiques matérielles de base du système\n- Métadonnées du jeu au démarrage (visuels)\n- Métadonnées du jeu au démarrage (texte)\n- Statistiques du jeu (temps de jeu)\n \nCode disponible ici : Retro-Lite-CM4-Dock\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172443/in-retro-un-dock-retro-lite-cm4-aio-pour-la-cm4-1.jpg"
        }
    },
    "news_10": {
        "title": "[XBS/XBX] L'émulation Xbox 360 via Xenia en UWP disponible en 1.1.2",
        "content": "Le développeur SirMangler vient de mettre en ligne une mise à jour de son adaptation de l'émulateur Xenia sur Xbox Series X et Xbox Series S. Xenia est un émulateur expérimental de la console Xbox 360. Bien connu pour avoir réussi à porter l'émulateur Dolphin sur les consoles Xbox One et Xbox Series X/S, le développeur SirMangler a mis à jour son application.\n \nN'oubliez pas de configurer Xenia en mode jeu, et non en mode application, sinon Xenia ne fonctionnera pas !\n \n \n\n \n \nChangelog 1.1.2 :\n \n- Ajout d'un bouton 'Installer le contenu additionnel...'.\n- Ajout d'un bouton \"Ouvrir un fichier...\".\n- Ajout d'une option cl\n- Amélioration de la boîte de dialogue du clavier dans le jeu\n- Ajout d'une fenêtre d'avertissement lorsqu'un utilisateur sélectionne un dossier avec des permissions incorrectes.\n- Mise à jour avec la dernière version de Xenia Canary en date du 17 avril. (1f86dc0)\n- Merci à TRW pour le test !\n \nProblèmes connus :\n \n- Si votre dossier de jeu contient des milliers de fichiers détachés, le frontend peut sembler figé jusqu'à ce qu'ils soient traités.\n \n \nTéléchargement : Xenia 1.1.2 en UWP\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172439/in-xbsxbx-lemulation-xbox-360-via-xenia-en-uwp-disponible-en-112-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] Hekate Toolbox v4.0.3 disponible",
        "content": "Le développeur tumGER vient de mettre en ligne la version 4.0.3 de la Hekate-Toolbox qui supporte officiellement la banche firmware 16.\n \nLa Hekate Toolbox permet à l'utilisateur de modifier les paramètres du loader (nécessite une version modifiée). Elle a été développée à l'origine pour être utilisée avec les SDFiles de tomGER (plus tard Kosmos d'AtlasNX), mais fonctionne entièrement avec les configurations CFW basées sur Hekate.\n \n \n\n \n \n \nChangelog :\n \n- Recompilé en utilisant les bibliothèques les plus récentes afin de supporter les firmwares les plus récents\n- Testé fonctionnant sur FW 16 \n- Remerciement à Hax4dazy pour avoir compilé et testé cette version \n \n \nTéléchargement : Hekate Toolbox v4.0.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172438/in-switch-hekate-toolbox-v403-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] Haku33 5.5 disponible",
        "content": "Voilà plus d'un mois que la version 5.2 de Haku33 était sortie rendant compatible l'utilisation de ce dernier sur les switchs ayant le firmware 16.0.0\nMais voilà que l'équipe StarDustCFW revient dessus avec plusieurs nouveauté, entre temps Haku33 a eu le droit a deux nouvelles mises à jour.\n \nPour rappel, Haku33 permet de réinitialiser la Nintendo Switch pour qu'elle soit le plus clean possible lors de sont utilisation en ligne ou pour de la revente d'occasion. En effet ce programme open source a pour fonction d'éliminer les fichiers critiques de la console pour effectuer une réinitialisation de la NAND console, ne laissant que l'essentiel pour démarrer.\n \n \n\nC'est deux nouvelles versions apporte le support complet sur les Nintendo Switch OLED et apporte une compatibilité béta a toute les types de puce sur les switchs patcher existant, notamment les puces incontournable hwfly et sxcore mais aussi la nouvelle puce qui doit encore faire c'est preuve le picofly.\nIl apporte également la compatibilité complète du firmware 16.0.1Changelog 5.4 :\n \n\n- Support Switch OLED\n\nChangelog 5.5 :\n \n\n- Support pour mariko (hwfly,picofly,sxcore,etc) en beta\n- Correction pour les modèles Erista bloqués sur l'écran initial\n- Prise en charge de la version 16.0.1\n\nLien de téléchargement : Haku33\n",
        "images": {
            "image_1": "https://user-images.githubusercontent.com/2240909/101447359-0b0d5980-3960-11eb-93fd-a1c191946814.jpg"
        }
    },
    "news_13": {
        "title": "[PS3] Le CFW Evinat Custom Firmware 4.90.2 en bêta 3",
        "content": "Le développeur Nathan Martin vient de publier un post informant que l'envoi d'une troisième bêta de son Custom Firmware Evilnat 4.90.2 pour la console PlayStation 3 vient d'être effectué à certains testeurs privilégiés.\n \nEnfin privilégiés, le Custom Firmware sera envoyé à tous ceux qui en auront fait la demande dans un précédent tweet, à noter qu'il est souhaitable de disposer d'une solution de flash hardware, type E3 flasher.\n \nLes nouvelles options du Custom Firmware devraient vous permettre d'installer un vrai firmware DEX original sur une console PlayStation 3 convertie .\n \n \n\n \n \nLe développeur rappelle que la version la plus sûre d'OFW DEX à installer est la 3.55, l'installation d'une version inférieure peut être dangereuse car elle dépend de la version minimale de la PS3.\n \nAttention si vous avez accès à cette bêta, l'activation de la prise en charge du DEX OFW créera un dump de 0x200 octets de la section EID0 sur un périphérique USB connecté, surtout ne supprimez pas ce fichier car vous ne pouvez désactiver le DEX qu'avec lui !\n \nIl y a un mois, la Bêta 2 avait été annoncée mais finalement elle ne sera pas proposée au grand public, espérons que cette version arrive rapidement.\n \nTout est là : twitter.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172404/in-ps3-le-cfw-evinat-custom-firmware-4902-en-beta-3-1.png"
        }
    },
    "news_14": {
        "title": "[PS4] Apollo Save Tool PS4 v1.4.0 disponible",
        "content": "C'est au tour de la version PS4 d'Apollo Save Tool d'être proposée par Damián Parrino, aussi connu sous le pseudonyme de Bucanero, il livre une grosse mise à jour pour la PlayStation 4. \n \nLa mise à jour ajoute un éditeur hexadécimal pour l'édition interne des données de sauvegarde et améliore le serveur Web interne avec prise en charge de la base de données en ligne. Il est désormais possible de personnaliser l'activation du compte d'identification en ligne grâce à un clavier à l'écran plus confortable.\n \n \n\n \n \nChangelog 1.4.0 : \n \nAjout :\n- Outils réseau\n- Outil de téléchargement d'URL (téléchargement de liens http/https/ftp/ftps)\n- Serveur Web local simple (accès complet aux lecteurs de la console)\n- Désactivation de l'historique du navigateur Web\n- Éditeur hexadécimal pour les fichiers de sauvegarde\n- Clavier à l'écran (pour la saisie de texte)\n- Activation des comptes hors ligne avec des identifiants de compte définis par l'utilisateur (clavier à l'écran)\n- Serveur Web interne amélioré (prise en charge de la base de données en ligne)\n- URL de la base de données en ligne définie par l'utilisateur (paramètres)\n- Reconstruction DLC améliorée (lecture des détails du contenu du fichier .pkg)\n- Vérification explicite du micrologiciel lors de l'importation de sauvegardes cryptées\n \nDivers\n- Mise à jour du moteur de patch Apollo v0.4.1\n- Saut de la recherche si le motif n'a pas été trouvé\n- Amélioration des types de code 9, B, D\n- Ajout de la prise en charge de la soustraction de valeur (BSD)\n \n \nTéléchargement : Apollo Save Tool PS4 v1.4.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172399/in-ps4-apollo-save-tool-ps4-v140-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] Un guide PicoFly pour toutes les Switch",
        "content": "Les informations sont nombreuses sur PicoFly, la solution basée sur un RP2040 qui permet de profiter au mieux des capacités de votre Switch. \n \nPour y voir plus clair, lightninjay a rassemblé l'ensemble de ces informations, du moins les plus importantes, afin d'établir un PDF qui regroupe dans un seul document les principales données sur PicoFly. \n \n \n \n \n\n \n \n \nCela passe par la partie hardware, avec les bases de configuration de la puce, et précisant comment installer la puce, quel matériel il est préférable d'utiliser et surtout cela concerne tous les modèles de Switch, et tous les firmwares. \n \nComme la plupart des solutions, PicoFly est un modchip basé sur un microcontrôleur RP2040 qui, s'il est installé, vous permettra d'effectuer un bug sur le CPU, en chargeant un loader avant le démarrage du logiciel Nintendo.\n \n \n \n \n\n \n \n \nLe PDF fait la part belle également aux vidéos d'installation disponibles sur Youtube avec notamment pas mal de référence à l'installation de HWFLY. \n \n \n\n \n \nTout cela commence à se structurer ici sur le forum GBAtemp.net.\n \nLien vers le PDF : A definitive PicoFly install guide V.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172351/in-switch-un-guide-picofly-pour-toutes-les-switch-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1172351/in-switch-un-guide-picofly-pour-toutes-les-switch-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1172351/in-switch-un-guide-picofly-pour-toutes-les-switch-3.png"
        }
    },
    "news_16": {
        "title": "[PS4] GoldHEN payload v2.4b13 disponible",
        "content": "Le développeur SiSTRo a enchainé les versions de son payload GoldHen, imaginez ce sont pas moins de 8 versions qui se sont succédées depuis la précédente. \n \nAu programme, de nouvelles fonctionnalités, avec un support serveur FTP intégré, les correctifs de illusion0002. Taillé pour la plupart des firmwares sensibles de la PS4, le payload a été particulièrement mis à jour pour les 5.05, 6.72 et 9.00 avec notamment les GoldHEN_Plugins_SDK et un dépôt liés aux GoldHEN Plugins. \n \nUne mise à jour qui récupère quelques correctifs également adressés lors des bêta 10, 11 et 12, cela signifie que trois versions bêta ont été réalisées en plus de cette dernière version.\n \nIl y a deux nouvelles entrées dans le menu de Debug Settings, Search Subdirectories et Show Package Path. Il existe également plusieurs améliorations dans l'analyseur XML/SHN, la fonctionnalité de source de package récemment introduite dans la version bêta 11 et le décryptage automatique FTP.\n \n \n\n \n \nChangelog v2.4b13\n \n- Analyseur xml/shn amélioré.\n- Le répertoire /discet le fichier $RECYCLE.BIN sont désormais ignorés lors de la recherche de sous-répertoires de pkg.\n \nJournal des modifications v2.4b12\n- Correction du chemin de sous-répertoire USB.\n \nChangelog v2.4b11\n \n- Correction de la fonction \"Rechercher dans les sous-répertoires\".\n- Amélioration de la fonction \"Source du paquet\".\n \nChangelog v2.4b10\n \n- Amélioration de l'auto-déchiffrement FTP.\n- Correction de la navigation de triche après le mode repos.\n- Ajout des fonctionnalités \"Rechercher dans les sous-répertoires\" et \"Afficher le chemin du package\" dans les paramètres de débogage.\n \n \nPour avoir le loisir de profiter de cette nouvelle version il suffit de supporter le développeur ci-dessous.\n \nTout est là : https://ko-fi.com/s/82e3cab517\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172347/in-ps4-goldhen-payload-v24b13-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[Switch] SysDVR 5.5 disponible",
        "content": "Exelix11 reviens aujourd'hui avec une nouvelle version de sysdvr pour notre plus grand plaisir. Pour rappel sysdvr permet de streamer l'écran directement sur son ordi via le wifi ou via un cable. Il est possible d'utiliser sysdvr sur windows, linux et macos.\nVoici un guide de comment l'utiliser : Wiki\n \n\n \n \nChangelog v5.5 :\n \n\n \n\nCompletely fixed USB mode crashes and stuck in \"switching modes\" issues, for real this time.\nThe communication protocol changed, make sure to update both the client on your pc and the sysmodule on your console.\nAfter copying the sysmodule reboot your console.\nOn Windows now we use a new WinUSB driver signed by Google.\nSysDVR will appear as an android device using standard ADB drivers\nIn practice this won't change anything except that now installing drivers is much more streamlined and they come from a more trusted source.\nMemory usage of the full version of SysDVR has been substantially reduced.\nIn general this means SysDVR should cause less crashes when used with other sysmodules\nIf you were using the usb only version due to memory concerns give the full version another chance.\nNow SysDVR-Client is also distributed as a flatpak, this should make installing it on linux much easier solving all dependency issues\nFor the time being flatpak support is considered experimental due to limited testing, let me know of any issues\nInstructions to install the flatpak version have been added to the guide\nFix connection issues when in TCP Bridge mode\nFix libusb errors on arm macs\nMinor bug fixes\n\n \n\n \n \nEn clair, vous aurez (normalement) plus de crash avec le mode usb. Les drivers sur windows ne sont plus les même, il faut donc les reinstaller pour cette version. Sysdvr utilisera moins de mémoire, Sysdvr-client est maintenant distribué sous forme de flatpak pour linux (c'est encore expérimental). Et quelques bugs on été corrigés\nTéléchargement : Sysdvr 5.5\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172306/in-switch-sysdvr-55-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[Vita] SMB2SE Vita v1.0 disponible",
        "content": "Les jeux et homebrews PlayStation Vita continuent de sortir, même si la console n'a pas connue un succès énormissime, il s'est vendue environ 18 millions de consoles, ce qui n'est pas rien non plus. \n \nC'est surtout grâce à sa communauté de développeurs que la PlayStation Vita se démarque, ils sont toujours actifs 12 ans après le lancement de la console, comme Rinnegatamante, un italien qui n'a de cesse de proposer des nouveautés, des utilitaires, des homebrews ou des jeux. \n \nEn voilà un nouveau, Super Monkey Ball 2 Sakura Edition,  il s'agit d'un nouveau portage Android \"direct to Vita\" utilisant le wrapper de TheFlow. Comme vous le savez la solution proposée par TheFlow a permi de proposer de nombreux portages comme The Conduit , Mass Effect Infiltrator , Dead Space , Fahrenheit , Thimbleweed Park , Bully et GTA San Andreas ou encore certains Final Fantasy. \n \n \n\n \n \nSMB2SE Vita v1.0 est un wrapper/portage de Super Monkey Ball 2 : Sakura Edition pour la PlayStation Vita. Le portage fonctionne en chargeant l'exécutable officiel Android ARMv7 en mémoire, en résolvant ses importations avec des fonctions natives et en le patchant pour qu'il fonctionne correctement. En faisant cela, c'est comme si nous émulions un environnement Android minimaliste dans lequel nous exécutons nativement l'exécutable tel quel.\n \n \nTéléchargement : SMB2SE Vita v1.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172285/in-vita-smb2se-vita-v10-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[Wii U] Une puce en développement pour la Wii U",
        "content": "Développer une solution hardware, de type puce, pour la Nintendo Wii U, cela peut paraitre étrange, mais c'est choix qui a été fait par le développeur shinyquagsire23.\n \nLe projet est open-source, heureusement, et permet d'ouvrir l'exécution de boot1 avec un glitch juste après le démarrage de la console, mais avant qu'elle ne commence à exécuter du code. \n \nPour expliquer l'histoire de la puce, il s'agit de la de_Fuse qui a vue le jour sur la Wii Mini, une console qui contrairement à la Wii n'avait pas de hack lors de son arrivée sur le marché. \n \nQuelques semaines après le lancement de la de_Fuse, le développeur a confirmé que son fonctionnement de base était aussi possible sur la console Wii U, avec cependant quelques limites, comme l'impossibilité de réaliser les dumps OTP. \n \n \n\n \n \nMalgré cela la puce permettrait de démarrer directement sur la carte SD, sans passer par l'eMMC interne à la console, une bonne aubaine pour ceux qui aujourd'hui subissent la mort prématurée de leur console. \n \n \n\n \n \nPour le moment, la puce est en développement le développeur s'appuie sur un FPGA pour y arriver, mais cela n'est en rien le design final de la puce, qui pourrait tourner autour des 25 à 35 euros, de toute façon au delà de ce prix, il n'est pas certain qu'elle suscite un grand engouement. \n \n\n \n \n \nLe Github est disponible ici : wii_u_modchip\n \n \n \n\n \n \n \nL'article est disponible ici : defuse-the-one-true-pwn\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172254/in-wii-u-une-puce-en-developpement-pour-la-wii-u-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1172254/in-wii-u-une-puce-en-developpement-pour-la-wii-u-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1172254/in-wii-u-une-puce-en-developpement-pour-la-wii-u-3.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] Ls-News 1.0.0 disponible",
        "content": "Salut à tous, aujourd'hui je vous annonce la sortie de mon nouvel homebrew qui vous permettra de consulter les dernières news de logic-sunrise. Celui-ci est restreint aux 20 dernières news du site car le flux rss du site ne permet pas plus\n \n \nSi vous avez des bugs/recommandations veuillez les mettre ici\n \nTéléchargement : Ls-News 1.0.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172229/in-switch-ls-news-100-disponible-1.jpg"
        }
    }
}