{
    "news_1": {
        "title": "[GC] Swiss v0.6r1622 disponible",
        "content": "Swiss est un utilitaire homebrew tout-en-un pour la Gamecube qui permet la lecture de Carte SDSC / SDHC / SDXC via SDGecko ou SD2SP2, la lecture de DVD (- / + R) ou disques GameCube originaux via le lecteur de disque, de lire une Mémoire flash Qoob Pro, de faire du Stockage de fichiers à distance via USB Gecko, d'émuler des cartes mémoire et bien plus encore.\nIl peu lire des documents texte, lancer des homebrews, lancer de la musique ou même lancer des jeux.\n \n\n \n\nChangelog : \n \n\n\n- Activer l'émulation de l'adaptateur large bande pour IDE-EXI et M.2 Loader.\n- Optimisations désespérées de l'hyperviseur pour faire tenir les choses.\n- Correction d'une désélection accidentelle de périphérique EXI.\n- Activation de l'émulation de l'adaptateur large bande pour le chargeur GC et l'adaptateur de carte SD.\n- Ajout du logo ETH2GC.\n- Mise à jour de l'infobulle.\n- Éviter les fins de lecture inutiles.\n- N'activer le GC Loader que s'il est éligible en tant que dispositif de correction.\n- Forcer l'utilisation de GC Loader en tant que dispositif de correction si les fonctionnalités activées l'exigent.\n- Éviter de masquer inutilement l'interruption de débogage PI.\n\n \n\nHash : ef5dce210277237b83fd66ffe9c639d147793810029908fc1a7ab11e2ee227989 swiss_r1622 .7z              \nLien de téléchargement : swiss_r1622.7z\n \n\n \n",
        "images": {
            "image_1": "https://user-images.githubusercontent.com/19207074/82130697-c475c900-979b-11ea-917d-197198b22a0f.jpg"
        }
    },
    "news_2": {
        "title": "[Switch] Flycast 2.3 pour Switch et Vita disponible",
        "content": " \nLe meilleur émulateur de Sega Dreamcast, de Sega Naomi et d'Atomiswave est de retour dans une nouvelle version, en effet Flycast est désormais proposé en v2.3.\n \nFork de Reicast, Flycast est un émulateur efficace qui continue d'être maintenu, les fonctionnalités sont nombreuses et la qualité de restitution font de cet émulateur l'un des meilleurs, que ce soit sur Nintendo Switch ou sur PlayStation Vita. \n \n \n\n \n \nNouveautés :\n- Prise en charge du câble de combat\n- Jeux SystemSP hopper : kingyo, manpuku, shateki, magicpop, unomedal, puyomedal, ochaken et westdmrg\n- Prise en charge du lecteur de cartes Club Kart\n- Réglages de la zone morte et de la saturation du gamepad\n- Switch : prise en charge du grondement de l'écran tactile et du joycon, corrections de bugs, améliorations des performances\n- Prise en charge du lecteur de code-barres HID pour les jeux de cartes (Mushi King, Dinosaur King, Love & Berry)\n \nJeux corrigés :\n- Initial D v2/v3\n- Melty Blood : Act Cadenza\n- Mission confidentielle\n- Le labyrinthe des rois\n- Spikers Battle\n- NBA Showtime\n- NHL 2K2\n- Ready 2 Rumble Boxing\n- Monkey Ball\n- Crackin'DJ 1 et 2\n- F355 (Naomi)\n- Samurai Shodown VI\n- Shenmue\n- Test Drive Le Mans\n- Sakura Taisen 3\n- Death Crimson 2\n- Force Five\n- NHL 2K2\n- Shakatto Tambourine\n- Xtreme Sports\n- Blue Stinger\n- RevolveR\n- Kaen Seibo\n- Nittere Shiki ! Mirai Yosou Studio\n- Shakatto Tambourine Arcade\n \n \nTéléchargement : flycast\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188152/in-switch-flycast-23-pour-switch-et-vita-disponible-1.png"
        }
    },
    "news_3": {
        "title": "[PS3] PS3HEN 3.3.0 et HFW 4.91 de Team PS3Xploit disponibles",
        "content": "La Team PS3Xploit est de retour, depuis la sortie du firmware 4.91, l'équipe travaille dur pour proposer la mise à jour de leur solution.\n \nVoici donc la mise à jour du PS3HEN en v3.3.0 avec de nouveaux changements proposés par esc0rtd3w et Joonie, mais aussi la disponibilité du HFW 4.91 de Joonie.\n \n \n \n\n\n \n \n\nPS3HEN 3.3.0 Changelog:\n \nHEN Global Changes\n- Added support for 4.91 CEX firmware (HFW) (thanks @Joonie )​\n \nHEN Plugin Changes\n- Fixed early reboot problem with HEN_UPD.PKG for Emergency USB Recovery​\n \nPayload Changes\n- Fixed issue with PSP Launcher (thanks @aldostools , @LuanTeles )​\n \nResource Changes\n- Added *Toggle 99 Percent Package Install/Delete* option in HFW Tools->Maintenance (thanks @zmod )\n- Updated download_list.xml to use updated paths on dev_hdd0 (thanks @LuanTeles , @DeViL303 )\n- Added support for PS Home Catalogue path in download_list.xml (thanks @DeViL303 , @LuanTeles , @aldostools )\n- Added support for dev_usb002 - dev_usb007 in package manager (thanks @LuanTeles )​\n \n \nOfficial HFW 4.91.1 is available (thanks @Joonie )\nhttp://ps3xploit.me/firmware/hfw/HFW_4.91.1_PS3UPDAT.PUP​\nMD5: C2717C377EB4F0FF458B8819B1E53D50\n \nThanks to everyone for their patience, and extra thanks to @aldostools, @LuanTeles, @bguerville, @Joonie, @MrMario2011, @Coro, @littlebalup, @DeViL303 for help with testing everything, suggestions, firmware, and advice\n \n\n \n\n \nTout est là : ps3xploit.me\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188151/in-ps3-ps3hen-330-et-hfw-491-de-team-ps3xploit-disponibles-1.jpg"
        }
    },
    "news_4": {
        "title": "[Switch] Nintendo continue la sauvegarde de ses intérêts sur les patchs signatures",
        "content": "Il fallait s'y attendre, ce sont désormais tous les homebrews qui sont visés par Nintendo, mais au délà de ça, ce sont maintenant toutes les modifications considérées comme violant tout copyright qui sont visées. \n \nNintendo vient désormais de se pencher sur les patchs signatures, notamment sur l'homebrew sigpatch-updater proposé par iTotalJustice, et bien entendu tous les forks et autres versions dérivées qui peuvent être librement proposées. \n \n \n \n\n \n \n \n \n \n \nAvant de désactiver tout contenu en rapport avec cet avis de retrait, GitHub\n- a contacté les propriétaires des dépôts concernés pour leur donner la possibilité de [faire des changements] \n- a fourni des informations sur la manière de [soumettre un contre-avis DMCA]  \n- proposé de mettre les propriétaires des dépôts concernés en contact avec [des ressources juridiques] dans le cadre de notre engagement à défendre les développeurs.\n \nPour savoir quand et pourquoi GitHub peut traiter certains avis de cette manière, veuillez consulter notre [Readme].\n \nLa console Nintendo Switch contient des mesures technologiques qui vérifient chaque jeu joué sur la Nintendo Switch (les \" MTP du jeu \"). Les MTP du jeu utilisent le cryptage et la vérification des signatures, comme décrit plus en détail ci-dessous. La console Nintendo Switch permet aux utilisateurs soit de jouer à des jeux sur des cartouches physiques qui sont insérées dans la console, soit de jouer à des jeux téléchargés numériquement à partir du serveur de Nintendo. Les deux formats sont protégés par les mesures technologiques de Nintendo ; en particulier, les jeux numériques téléchargés sont protégés par le cryptage, y compris les clés de titre cryptées, ou \"signatures\", qui sont vérifiées par les MTP du jeu lorsqu'un jeu téléchargé est lancé sur la console Nintendo Switch. Nintendo détient ou contrôle exclusivement de nombreux droits d'auteur sur des logiciels et des jeux qui sont protégés contre l'accès et la copie illicites par le fonctionnement de ces Mesures Technologiques. Dans le cadre de leur fonctionnement normal, les Mesures Technologiques requièrent l'application d'informations et d'un processus (sous la forme des contrôles de signature décrits ci-dessus), avec l'autorité de Nintendo, pour obtenir l'accès aux œuvres protégées par le droit d'auteur de Nintendo, et ainsi contrôler efficacement l'accès aux œuvres protégées par le droit d'auteur de Nintendo et la copie de celles-ci.  \n \nNintendo a précédemment soumis un avis de contournement à GitHub concernant la mise à disposition de SigPatches par l'utilisateur [private]. L'avis précédent a été soumis le 23 juillet 2022, pour un contenu posté sur [private], qui contenait des SigPatches. GitHub a supprimé le contenu signalé en réponse à la notification de juillet 2022. Plusieurs des dépôts (forks) mentionnés dans la présente notification contiennent également des SigPatches dans les fichiers postés sur GitHub.  \n \nAvec le dépôt iTotalJustice signalé dans la présente notification, iTotalJustice tente d'échapper aux efforts de mise en œuvre de Nintendo en fournissant des SigPatches via un lien vers un site web tiers ([private]), plutôt que d'inclure des SigPatches dans le dépôt lui-même. Le lien est accompagné de la mention \"Les patchs sont téléchargés à partir d'un nouvel hôte. Un grand merci à eux !\" Plusieurs des forks signalés dans le présent avis renvoient également au site web tiers [private] pour fournir des SigPatches. L'établissement d'un lien vers un logiciel de contournement est considéré comme un \"trafic\" en violation du DMCA lorsque, comme c'est le cas ici, la partie responsable du lien sait que le matériel incriminé se trouve sur le site lié, il sait que le matériel lié est une technologie de contournement et il maintient le lien dans le but de disséminer cette technologie. Le dépôt signalé viole donc le DMCA et les droits de Nintendo. \n \n \n \nCe n'est pas une première pour iTotalJustice, cela avait déjà été le cas en 2022 avec sipatches, ses applications permettaient de mettre à jour les patchs signatures directement depuis la Nintendo Switch. \n \nL'outil a été retiré du référentiel GitHub pour DMCA, mais il va réapparaitre probablement par ailleurs comme les autres, cependant cela met un coup d'arrêt direct à son développement ou ses mises à jour. \n \nDe plus, cela ne fait que grossir la liste qui s'allonge de jour en jour, Incognito_RCM, kezplez-nx, Lockpick_RCM et donc désormais sigpatch-updater, à qui le tour ?\n \n \nTout est là : github.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188099/in-switch-nintendo-continue-la-sauvegarde-de-ses-interets-sur-les-patchs-signatures-1.png"
        }
    },
    "news_5": {
        "title": "[PS4/PS5] Un second émulateur PSX fonctionnel sur la PS5",
        "content": "Il semblerait qu'un nouvel émulateur soit fonctionnel sur PS5, jusqu'à présent avait été tiré du jeu Syphon Filter un émulateur surnommé \"syphonfilter v2\" et qui permettait de faire tourner les jeux PSX sur PS4 et PS5. \n \nLes liens de cet émulateur commence à tourner, et une captation d'une vidéo de Casper Friends Around the World tournant sur PlayStation 5 a été réalisée par un utilisateur répondant au nom de megadjx13.\n \n \n\n \n \nComme le montre la vidéo, l'émulateur dispose de nombreuses options, de paramétrage visuel, vidéos, gestion des controleurs, d'options de changements de disques ou de régions. \n \nLes paramètres vidéos permettent par exemple de géré le 4:3 en 16:10, le 4:3 en 16:9, les pixels square ou encore un affichage par un zoom permettant restituant le format wide. \n \nL'émulateur intègre aussi des prévisualisations visuelles (des profils) qui permettent d'ajuster la luminosité et les éclairages (mode modern, classic arcade, et modern arcade). \n \nBien entendu pour le moment il faut faire quelques conversions, et cela reste expérimental pour la PS4 et la PS5, mais l'émulateur semble provenir de Oddworld Abe's Oddysee. \n \n \n \n\n \n \n \nPour y parvenir, les développeurs partent d'un jeu PSX proposé via une offre PS Plus Premium, qui permet de télécharger le jeu et l'émulateur permettant ainsi de proposer des jeux convertis PSX to PS4 ou PS5. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188086/in-ps4ps5-un-second-emulateur-psx-fonctionnel-sur-la-ps5-1.png"
        }
    },
    "news_6": {
        "title": "[PS4/PS5] Les firmwares 9.00 pour la PS5 et 11.50 pour la PS4",
        "content": "Sony dévoile de nouveaux firmwares que ce soit pour la PS4 que la PS5, pour la PS4 d'abord Sony livre après 4 bêtas le firmware 11.50. \n \nIl se murmure que ces firmwares visent aussi à corriger les récentes failles rapportées par TheFlow. Ce n'est pas tout ces firmwares pourraient aussi corriger la faille rapportée par Aapo Oksman, celle qui lui avait permis d'obtenir la prime de 50 000 $ sur HackerOne. \n \n \n\n \n \n \nFirmware PS4 version 11.50 :\n \n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et l'ergonomie de certains écrans.\n \nFirmware PS5 version 9.00 : \n \nListe des fonctionnalités de la version 9.00 du logiciel système PS5\n \n- Nous avons mis à jour le logiciel système des manettes sans fil DualSense et DualSense Edge pour améliorer leurs fonctionnalités sonores.\n- Le haut-parleur de la manette offre désormais un volume plus élevé, qui vous permet de distinguer plus clairement les sons et voix dans les jeux.\n- La qualité de capture du micro sur ces manettes a été améliorée par un nouveau modèle de machine-learning basé sur une IA. Le bruit de fond généré par les pressions sur les touches et l'audio du jeu est supprimé, ce qui améliore l'expérience de chat vocal.\n- Vous pouvez désormais régler la luminosité de l'indicateur d'alimentation de votre PS5.\n- Accédez à Paramètres > Système > Signal sonore et luminosité, puis sélectionnez Luminosité.\n- Nous avons ajouté de nouvelles fonctionnalités aux Partys et à la fonction Partage d’écran.\n- Les joueurs qui observent une session de Partage d'écran peuvent désormais utiliser des curseurs et des emojis pour interagir avec la session de jeu de l'hôte.\n- Les spectateurs peuvent utiliser un curseur ou indiquer un emplacement spécifique de l'écran de jeu en émettant un ping.\n- Les spectateurs peuvent également envoyer des réactions par emojis.\n- Cette fonctionnalité est disponible lorsque l'hôte active l'option - Interactions des spectateurs dans les paramètres de la fonction Partage d'écran.\n- L'ensemble d'emojis Unicode 15.1 est pris en charge. Vous pouvez désormais les utiliser dans les messages.\n- Nous avons mis à jour les logiciels système des manettes sans fil DualSense et DualSense Edge, du casque PlayStation VR2, des manettes PlayStation VR2 Sense et de la manette Access afin d'améliorer leur stabilité.\n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et l'ergonomie de certains écrans.\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1188040/in-ps4ps5-les-firmwares-900-pour-la-ps5-et-1150-pour-la-ps4-1.png"
        }
    },
    "news_7": {
        "title": "[PS4] PSX 2 PS4 V1.6: Vos backups Ps1 sur PS4.",
        "content": "Voici enfin la version 1.6 de PSX 2 PS4, afin de convertir vos backups ps1 pour vos PS4 jailbreakées.\n \nArrivé en retard par rapport à la version PS5, cette version PS4 comprend quelques correctifs plutôt important comparé à celui de sa petite soeur, ce qui explique son retard...\n \nEn effet, après plusieurs retours, j' ai corrigé l' erreur \"serkus95\" qui survenait quand le framework 5.0 était soit pas installé, soit corrompu, fixé également les erreurs liés au format des .png qui donnait une erreur lors de la construction du FPKG et supprimé l' utilisation obligatoire du framework 5.0.\n \n\n \nCette version 1.6 comprend quelques nouveautés comme les liens vers mon tweeter (icon Markus95), mon Paypal (icon trophé), ma vidéo tuto (logo youtube) et pour finir le plus important, les codes LibCrypt (icon PSN+).\n \nCe dernier lien (PSN+) pointe donc vers les codes LibCrypt qui vont vous permettre de débloquer certains jeux comme Dino Crisis ou Resident Evil 3 Nemesis (explications dans ma vidéo tuto ci dessous).\n \n\n \nVous trouverez également Merge_bin.bat dans le .rar de cette new. Ce petit batch vous servira à fusionner vos .bins en un seul .bin afin d'utiliser ensuite PSX 2 PS4 v1.6  mais également de créer le .toc.\n \nCe dernier fichier (.toc)  est important pour certains jeux comme Tekken, sans ce fichier votre jeu fonctionnera mais sans musique, d' où son utilité.\n \n\n \n \nTélécharger PSX 2 PS4 V1.6\n \nSi vous voulez me supporter dans mes futurs travaux, un petit don fait tjs plaisir  : https://www.paypal.com/paypalme/markus00095\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187972/in-ps4-psx-2-ps4-v16-vos-backups-ps1-sur-ps4-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1187972/in-ps4-psx-2-ps4-v16-vos-backups-ps1-sur-ps4-2.png",
            "image_3": "https://www.logic-sunrise.com/forums/public/style_emoticons/default/wink.gif"
        }
    },
    "news_8": {
        "title": "[XBO] Un modchip Raspberry Pi Pico faisant tourner Cerbios sur Xbox",
        "content": "Le développeur Shalx dévoile son nouveau projet, il s'agit d'un modchip basé sur un Raspberry Pi Pico sur une Xbox originale faisant tourner Cerbios. \n \n \n\n \n \nContre environ 5 euros, le développeur propose donc de remplacer une puce qui coûte plus cher, et pour prouver sa démonstration il fait tourner Cerbios comme preuve de concept (Poc). \n \n \n \n\n \n \n \nBien entendu, le tout sera open-source, il sera possible d'imaginer pas mal d'évolutions par la suite comme la mise en place d'un petit écran LCD ou d'autres périphériques de contrôles.\n \n \nTéléchargement : Discord.gg/xbox-scene\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187966/in-xbo-un-modchip-raspberry-pi-pico-faisant-tourner-cerbios-sur-xbox-1.png"
        }
    },
    "news_9": {
        "title": "[PS5] Console Service Tool 1.0.5 pour PS3, PS4 et PS5",
        "content": "Le développeur amoamare propose une nouvelle version de Console Service Tool qui passe en v1.05 et qui se destine à la PS3, PS4 et plus récemment à la PS5, mais aussi à la Switch. \n \nConsole Service Tool (C.S.T.) est un outil complet en W.I.P. conçu pour aider les utilisateurs à diagnostiquer et à entretenir leurs consoles de jeu. Axé sur la PlayStation (PS3, PS4, PS5) et la Nintendo Switch, C.S.T. vise à consolider les différents outils de diagnostic et d'entretien en une seule plateforme conviviale.\n \nCette nouvelle version 1.05 vise à corriger l'interface utilisateur, à ajouter du code et l'optimiser, et aussi à ajouter TSB.\n \n \n\n \nCette version intègre une mise à jour de \" PS5 NOR Patching \" qui vise à ajouter des correctifs, à utiliser avec précautions. Ainsi le correctif vise à intégrer des numéros de série de cartes mères, du type de consoles ou encore l'ID de la carte ou encore l'adresse MAC. \n \n \n\n \n\n \n \n \nFAQ \n \nQ : Pourquoi le CST affiche-t-il plus de 10 codes d'erreur ?\nR : Le CST affiche tous les codes d'erreur jusqu'à ce que la réponse \"Aucun code d'erreur\" provienne de la console. La raison en est de donner à l'utilisateur une meilleure idée de ce qui s'est passé à l'origine. Il est facile pour un utilisateur final de remplir les 10 emplacements d'erreur précédents avec seulement quelques codes tels que l'arrêt ou le gel de l'APU, l'arrêt inattendu, etc.\n \nQ : Puis-je utiliser cet outil pour lire les codes UART d'un PS5 ?\nR : Oui ! Téléchargez et lancez l'outil, sélectionnez l'onglet Playstation 5 > UART Tools et l'opération Read Codes. Vous devez être connecté via UART pour lire les codes de la Playstation 5.\n \nQ : Je reçois constamment le message \"Operation Cancelled\".\nA : Réponse courte, si tout est connecté correctement, alors vous avez peut-être un southbridge mort car le southbridge doit fonctionner pour que l'UART fonctionne.\n \nR : Réponse longue, consultez la section Dépannage.\n \nQ : Je dois convertir la console de mon lecteur de disque en numérique. Cet outil peut-il le faire ?\nR : Oui ! Ouvrez CST sous PlayStation 5 NOR tools, sélectionnez browse et ouvrez le dump NOR de votre console de lecteur de disque. Passez de Disk à Digtal, puis sauvegardez votre NOR patché. Flashez le NOR patché sur votre console. Votre console démarrera alors en mode numérique.\n \nQ : Ai-je besoin d'un dump NOR numérique pour convertir ma console à lecteur de disque en console numérique ?\nR : Non. Vous pouvez faire un dump NOR de votre console directement et la convertir en numérique à l'aide de cet outil.\n \n \nTéléchargement : Console Service Tool 1.0.5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187941/in-ps5-console-service-tool-105-pour-ps3-ps4-et-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1187941/in-ps5-console-service-tool-105-pour-ps3-ps4-et-ps5-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1187941/in-ps5-console-service-tool-105-pour-ps3-ps4-et-ps5-3.png"
        }
    },
    "news_10": {
        "title": "[Switch] Accord signé pour Yuzu, Suyu va plus loin avec Qlauncher",
        "content": "Voilà s'en est donc bel et bien terminé pour Yuzu (et Citra), le juge McConnel vient de signer l'accord entre Nintendo et Tropic Haze LLC mettant ainsi une conclusion à l'affaire qui s'est donc terminée comme un éclair. \n \n \n \n\n \n \n \nIl est donc temps pour nous de passer à des propositions alternatives comme Ryujinx, qui pour l'heure n'est pas encore totalement inquiété (mais cela viendra), ou bien de passer sur un fork de Yuzu, et l'un qui tire vraiment son épingle du jeu est bel et bien Suyu. \n \n \n\n \n \nPour preuve, les développeurs de l'émulateur Suyu commence à proposer des évolutions importantes, à commencer par implémenter le menu d'acceuil de la Nintendo Switch. \n \nCe célèbre menu d'accueil, Qlauncher, est le code que la team Yuzu a laissé mais n'avait jamais implémenté, vous pouvez donc désormais exécuter des jeux, les fermer ou accéder aux paramètres et tout le reste comme vous pouvez le faire sur la console. \n \nBien entendu pour faire tourner l'ensemble il faut utiliser le firmware 17.0.0 de Nintendo.\n \n \n \n\n \n \n \n \nSuyu a clairement pris la relève de Yuzu, reste à voir combien de temps cela sera possible. \n \nTout est là : Suyu\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187882/in-switch-accord-signe-pour-yuzu-suyu-va-plus-loin-avec-qlauncher-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1187882/in-switch-accord-signe-pour-yuzu-suyu-va-plus-loin-avec-qlauncher-2.png"
        }
    },
    "news_11": {
        "title": "[Switch/PC/Android] Nouvelle version disponible de NooDS (rolling release)",
        "content": "Le développeur Hydr8gon vient de sortir une nouvelle version de son émulateur NooDS\nL'objectif de NooDS est d'être un émulateur Nintendo DS rapide et portable. Ce n'est pas tout à fait là en terme de vitesse, mais il offre la plupart des autres fonctionnalités que vous pouvez attendre d'un émulateur DS. Il prend même en charge la rétrocompatibilité GBA !\n \n\nJe fais ça pour le plaisir et comme expérience d'apprentissage, et aussi parce que je suis un grand fan de la DS. Ce n'est peut-être pas encore un concurrent digne des autres émulateurs DS, mais je pense que je pourrai y arriver un jour. Sinon c'est bien aussi ; comme je l'ai dit, je m'amuse juste !\n\n \nCe projet n'a donc pas de changelog à chaque mis à jour, mais au bout de plusieurs versions consécutives des nouvelles seront données pour rappeler l'existence du projet et ainsi pousser les utilisateurs à tester ce dernier et faire des retours au développeur.\n\nLes dernières modifications :\n \n- Porter l'interface utilisateur de la Switch sur la Wii U et la Vita\n \nNooDS est disponible pour Linux, macOS, Windows, Switch, Vita et Android.\nLes builds automatiques sont fournis via GitHub Actions:\nVous pouvez les télécharger à partir de la page des versions\n",
        "images": {
            "image_1": "https://d1eh9yux7w8iql.cloudfront.net/product_images/1525772372.19.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] Haku33 7.0 disponible",
        "content": "L'équipe StarDustCFW vient de mettre en ligne la v7.0 de Haku33, pour rappel Haku33 permet de réinitialiser la Nintendo Switch pour qu'elle soit le plus clean possible lors de sont utilisation en ligne ou pour de la revente d'occasion.\nEn effet ce programme open source a pour fonction d'éliminer les fichiers critiques de la console pour effectuer une réinitialisation matérielle, ne laissant que l'essentiel pour démarrer.\n\n\n\nChangelog : \n \n-Réparation de l'écran noir sur le firmware 17.X:\nNous avons trouvé 3 solutions à ce problème\n->1: Exécuter l'atmosphère sur Sysnand \n->2: Supprimer system:/saves/8000000000000120 en utilisant tegra explorer.bin\nEt ensuite lancer atmosphere pour reconstruire la base de données\n->3: Supprimer complètement system:/saves en utilisant tegra explorer.bin et lancer atmosphere (cela fera un redémarrage complet de l'usine)\n\nLien de téléchargement : Haku33 7.0\n",
        "images": {
            "image_1": "https://user-images.githubusercontent.com/2240909/101447359-0b0d5980-3960-11eb-93fd-a1c191946814.jpg"
        }
    },
    "news_13": {
        "title": "[DSi] GodMode9i version 3.5.3 disponible",
        "content": "RocketRobz le développeur de GodMode9i à dévoilé la version 3.5.3 de GodMode9i, la deuxième version TWL Summer (mise à jour de l'été).\nPour rappel, GodMode9i est un navigateur de fichiers à accès complet pour les consoles Nintendo DS et DSi modifié via l'exploit unlaunch / memory pit.\n \n    \n\nChangelog\n \n-Correction d'un cas où le démarrage d'un fichier .nds provoquait l'apparition d'une erreur de méditation Guru.\n-Correction d'un bogue négligé qui provoquait le plantage de la vidange du jeu.\n\nLien de téléchargement : GodMode9i 3.5.3\n",
        "images": {
            "image_1": "https://github.com/DS-Homebrew/GodMode9i/raw/master/resources/screenshots/drive-menu.png",
            "image_2": "https://github.com/DS-Homebrew/GodMode9i/raw/master/resources/screenshots/file-list.png",
            "image_3": "https://github.com/DS-Homebrew/GodMode9i/raw/master/resources/screenshots/nds-file-menu.png"
        }
    },
    "news_14": {
        "title": "[DS/2DS/3DS] TWiLight Menu++ v26.7.0 et nds-bootstrap v1.3.1 disponibles",
        "content": "Le développeur RocketRobz est de retour avec de nouvelles versions de TWiLight Menu++ et de nds-bootstrap, et comme d'habitude avec le développeur RocketRobz les changements sont nombreux. TWiLightMenu++ est pour rappel est un menu alternatif, open source et personnalisable pour lancer des homebrews DS, jeux et roms DS, GBA, BD via la DS, 3DS ou 2DS.\n \n \n\n \n \nChangelog TWiLight Menu++ : \n \n- Mise à jour du correctif AP pour Pokémon : Refined Gold Overhaul (v3.2).\n- Déplacement des tables de mode de couleur de NitroFS vers sd:/_nds/colorLut/. Cela signifie que des tables personnalisées peuvent maintenant être ajoutées (ex. redshift), ainsi que vos propres homebrew supportant les modes de couleurs !\n- Pour l'implémenter dans votre homebrew, voyez ce code pour charger le fichier LUT : https://github.com/RocketRobz/SuperPhotoStudio/blob/master/nds/arm9/source/gui.cpp#L142\n- Ajoutez quelque chose comme palette[i] = colorTable[palette[i]] ; dans le code de chargement de votre palette et/ou de votre image 16 bits pour que la LUT de couleur prenne effet.\n- Divers : Mise à jour des traductions et ajout de la langue galicienne (non testée) !\n- Les ROMs SEGA Genesis/Mega Drive avec l'extension .md sont maintenant supportées !\n- Les ROMs Genesis/Mega Drive et SNES ne sont plus affichées sur les flashcards, car les émulateurs (à l'exception des nouvelles versions de SNEmulDS) qui les exécutent ne supportent pas les arguments.\n- Si GBARunner3 est configuré pour être utilisé, le message du BIOS est maintenant affiché pour tous les jeux GBA.\n- Les titres DSiWare avec le TID NTRJ se lancent maintenant sur les flashcards, qu'ils soient compatibles ou non.\n- Implémenté à cause de certains prototypes DSiWare utilisant ce TID, ainsi que certains étant supportés par nds-bootstrap.\n- Sur DSi/3DS, NDMA est maintenant utilisé pour vider la RAM un peu plus rapidement lors de la transition entre les modes d'écran TWLMenu++, ainsi que lors du chargement des fichiers .nds.\n- La chaîne SCSD est maintenant vérifiée dans le nom DLDI pour le support de la SuperCard MiniSD.\n- Changement de la palette de polices des boutons désactivés dans le DS Classic Menu. (#2358)\n- Ajout d'un paramètre pour cacher le logo Rocket Robz.\n- Comme les ROMs peuvent être placées n'importe où sur la carte SD (sauf dans les dossiers commençant par _), le dossier roms a été supprimé.\n \nCorrections de bugs :\n \n- Correction des jeux GBA Fire Emblem ne démarrant pas lors de l'utilisation du mode GBA natif.\n- Correction de la série Classic NES bloquée sur un écran blanc lors de l'utilisation du mode GBA natif.\n- Seuls les premiers jeux Famicom Mini et la collection iQue sont connus pour démarrer correctement.\n- Correction du freeze de Iridion II lors de l'utilisation du mode GBA natif. (Patch par @Dartz150)\n- Les pressions rapides fonctionnent à nouveau dans le thème 3DS !\n \n \nChangelog nds-bootstrap : \n \n- Ajout de la prise en charge de la construction de disques RAM contenant des ROMs Genesis/Mega Drive avec l'extension .md.\n \n \nTéléchargement : TWiLight Menu++ v26.7.0 et nds-bootstrap v1.3.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187871/in-ds2ds3ds-twilight-menu-v2670-et-nds-bootstrap-v131-disponibles-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS3] CFW 4.91 Evilnat Cobra 8.4 disponible",
        "content": " \nLe développeur Nathan Martin, connu sous le pseudonyme d'Evilnat, propose le tout premier custom firmware basé sur le firmware officiel 4.91 dévoilé il y a quelques jours par Sony pour la PlayStation 3. \n \nSon CFW nommé CFW 4.91 Evilnat intègre les fonctions Cobra 8.4 sachant que d'autres versions du CFW seront proposés par la suite, notamment des versions Overclocking, noBT, noBD, mais les fonctions Cobra sont déjà très utiles, puisqu'elles permettent par exemple de charger des plugins en arrière-plan, la prise en charge des ISO, entre autres fonctionnalités que l'on ne trouve pas directement sur un CFW standard.\n \n \n \n\n \n \n \n \n \nTesté sur les modèles suivants : \n \nCECH-2000A\nCECH-2000B\nCECH-2001A\nCECH-2002B\nCECH-2003A\nCECH-2004A\nCECH-2004B\nCECH-2012A\nCECH-2104B\nCECH-2500A\nCECH-2501A\nCECH-2504A\nCECH-2511A\nCECH-2511B\nCECH-L04\nCECHA01\nCECHE01\nCECHB01\nCECHC04\nCECHG01\nCECHP01\nCECHM\n \nCaractéristiques :\nConstruit à partir du OFW (CEX) 4.91\nNoyau porté et certains modules d'OFW 4.84 DEX\nFabriqué manuellement sans outils automatiques\nPSN/SEN activé\nCorrection des dispositions 272/480 à partir de l'OFW 4.90\nSuppression désactivée des fichiers act.dat et .rif non signés\nFichiers act.dat et .rif non signés autorisés\nExécution autorisée d'applications non signées\nCompatibilité avec FSELF\nDéverrouillage des démos C00\nVérification de la licence LIC.EDAT désactivée\nPeut être installé sur OFW 3.55\nPeut être installé sur +3,56 OFW (avec le toolset de bguerville)\nPeut être installé sur n’importe quel CFW CEX\nLes fonctions Cobra 8.4 ajoutées et activées par défaut\nCompatibilité complète des jeux PS2\nPossibilité de downgrade à partir de n'importe quel CFW avec des QA flags actifs\nQA flags actifs s'ils ont été précédemment activés\nMessage d'épilepsie désactivé au démarrage\nCompatibilité avec les jeux PSX/PSP/PS2 en ISO\nCompatibilité avec les jeux PS3 au format dossier ISO/JB\nCompatibilité avec ReactPSN\nAffichage des températures dans XMB In-Game sur les jeux PS2\nContournement d'écran RSOD\nContournement d'écran BSOD\nPS3_GAME/app_home\nCapture d'écran du jeu XMB\nGestionnaire de packages ajouté\nCoreOS Hash Check corrigé pour empêcher Brick sur les consoles de mise à niveau non déhachées\nPatché pour supprimer la protection LV2\nPeek and Poke (LV2)\nPeek and Poke (LV1)\nProtection CINAVIA désactivée\nPossibilité de trier les jeux par nom et date\nAutoriser l'utilisation d'un contrôleur tiers dans le menu de récupération\nCompatibilité avec d'autres systèmes d'exploitation\nMise à jour désactivée depuis OFW PUP en mode de récupération\nCompatible double démarrage\nInstallation autorisée du PKG de vente au détail sur DEX\nAutorisé à installer un PKG pseudo-retail\nActivation des options [★Déverrouiller], [★Verrouillage] et [★Supprimer] dans les trophées\nCompatibilité avec la lecture à distance\nGameboot_multi.ac3 ajouté\ngameboot_stereo.ac3 et coldboot_stereo.ac3 supprimés\nRemplacez \"Dissocier\" par \"Supprimer le dossier\" dans XMB\nErreur de diffusion PAL contournée sur les films BD/DVD\nContournement de tous les codes d'erreur sur les films BD/DVD\nActivation du menu Debug dans les jeux PS2 (ps2_netemu.self)\nProblème CBOMB corrigé\nTarget Manager corrigé pour afficher la version 4.9.1\n \nCobra8.4 : \nFailsafe Cobra stage2 (par bguerville/aldo)\nRestaurer les appels système CFW sans redémarrer en entrant simplement dans « Paramètres > Mise à jour du système » sur XMB (par aldo)\nFAN à contrôle dynamique intégré (pour contrôler le ventilateur lorsque webMAN est déchargé) (par aldo/Evilnat)\nPrise en charge de l'intégration de l'interface graphique photo avec webMAN MOD (monter des jeux à partir de la colonne « Photo ») (par aldo/DeViL303)\nObtenir/Définir la vitesse du VENTILATEUR (par aldo)\nActiver/désactiver les fonctionnalités : interface graphique photo, restauration des appels système (par aldo)\nOpcode pour créer des Syscalls CFW (6, 7, 8, 9, 10, 11, 15, 35) (par aldo)\nOpcode pour créer une licence (RIF) (par Evilnat)\nMise à jour de ps3mapi_load_process_modules pour charger des modules personnalisés et des modules système (par haxxxen)\nAjout de ps3mapi_get_process_module_info\nAugmentation de 24 à 32 le nombre maximum de chemins de carte (par aldo)\nAjout du patch sm_get_temperature dans le noyau (par Evilnat)\nAjout du patch sm_get_fan_policy dans le noyau (par Evilnat)\nAjout du patch sm_set_fan_policy dans le noyau (par Evilnat)\nAjout de la prise en charge du décryptage des ISO REDUMP à la volée (par Evilnat)\nOpcode pour basculer l'animation de démarrage à froid (par Evilnat)\nOpcode pour basculer l'avertissement d'épilepsie (par Evilnat)\nOpcode pour basculer l'animation et le son du gameboot (par Evilnat)\nOpcode pour basculer les informations cachées sur les trophées (par Evilnat)\nCorrectif de Target Manager pour DEX (par haxxxen)\nCorrection de la charge utile Control FAN, évite de charger le mode précédent (par Evilnat)\nDésactivez stage2.bin pendant que le menu de récupération est chargé (par haxxxen)\nCorrection de la vitesse maximale du VENTILATEUR après l'arrêt (par Evilnat)\nCorrection d'un écran noir dans les jeux convertis CFW2OFW (par Evilnat)\nAjout de sm_ring_buzzer avec single_beep, double_beep et triple_beep (par Evilnat)\nIgnorer la création de la licence (rif) si elle existe déjà (par aldo)\nOpcode pour basculer l'icône PS2 (ISO/BIN.ENC) dans XMB (par Evilnat)\nAjout du symbole cellFsMkdir (par Evilnat)\nAjout d'une vitesse de ventilateur constante lors du lancement d'un ISO PS2 (par Evilnat)\nCréation d'un faux act.dat lors du lancement d'un jeu PSN (par Evilnat)\nBloquer la connexion sur PSN/SEN lorsque les appels système CFW sont activés (par DeViL303)\nActiver le mode OFW au démarrage (par aldostools et Evilnat)\nBlocage des lanceurs PSP si un PSPISO n'a pas été monté (par aldostools)\nPetites optimisations (Par aldostools)\nCode \"inutile\" supprimé (par aldostools)\nOpcode pour basculer le démarrage du jeu (par Evilnat)\nOpcode pour basculer le démarrage à froid et le son (Par Evilnat)\nOpcode pour basculer l'avertissement d'épilepsie (Par Evilnat)\nCellUsb000_mount_symbol ajouté (par haxxxen)\nAjout des drapeaux usb_flag et no_cobra (par aldostools et Evilnat)\nChargez le stage2 externe et les plugins depuis /dev_usb000 (par aldostools, haxxxen et Evilnat)\n \nTraductions\nPortugais : @jcorrea et @LuanTeles\nPolonais : @KcrPLo et @Agrippa et HackZy01\nItalien : @Sheireen\nEspagnol : Evilnat\nChinois traditionnel/simplifié : @xiaoyang\nJaponais : @Kyan_dudl\nRusse : @MrYadro\nFrançais : @EimGdt et @Chronoss09\nAllemand : @FadedHD3\n \n \nLes versions proposées sont les versions CEX, D-PEX, DEX et PEX\n \n \nTéléchargement :  CFW Evilnat 4.91 Cobra 8.4 [PEX] [CEX][DEX] et [D-PEX]\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187870/in-ps3-cfw-491-evilnat-cobra-84-disponible-1.jpg"
        }
    },
    "news_16": {
        "title": "[WiiU] ExZap continue d'améliorer Cemu qui passe en 2.0-68",
        "content": "Le développeur ExZap a travaillé hier sur une nouvelle version de son émulateur de Nintendo Wii U, Cemu, qui passe en version 2.0-68. Les nouvelles fonctionnalités qui ont été ajoutées concernent surtout Vulkan, afin d'utiliser VK_KHR_synchronization2, mais ce n'est pas tout le développeur a retiré des instructions d'impression superflues dans nsyshid, et apporter l'ajout du package llvm pour Fedora. \n \nConcernant Vulkan, ce sont réellement plusieurs optimisations qui ont été apportées, avec la suppression de certains index tampons inutiles comme ceux qui concernent les calls de bakcbuffer drawcall, des corrections de bugs, ou encore des optimisations sur le filtre MSAA.\n \nCes nombreux changements ne sont pas sans conséquences, il y a eu de nombreux rapports d'utilisateurs qui se sont vus bloqués avec des pilotes Vulkan de 2019, ceux de Kepler par exemple, donc pour le moment, ExZap a fait le choix de limiter voir de reporter les changements à la future version stable. \n \n\n \nChangelog entre 2.0-66 et 2.0-68 : \n \nBUILD.md: Add llvm package for Fedora (#1101)\n \nnsyshid: remove stray print statements (#1106)\n \nVulkan: Update some code to use VK_KHR_synchronization2\n \nVulkan: Remove unnecessary index buffer for backbuffer drawcall\n \nVulkan: Avoid calling vkCmdClearColorImage() on compressed textures \n \nVulkan: For MSAA surface copies make the target MSAA too \n \nREADME.md: Fix minor ambiguity\n \nRevert \"Vulkan: Update some code to use VK_KHR_synchronization2\" \n \n \n \nComme toujours Cemu est proposé pour Windows x86 et x64, MacOS, Ubuntu et AppImage\n \nTéléchargement : Cemu\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187858/in-wiiu-exzap-continue-dameliorer-cemu-qui-passe-en-20-68-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] Une nouvelle version de l'émulateur PS4 psOff publiée",
        "content": "Le développement des émulateurs PS4 est toujours intéressant car la difficulté réside dans la puissance nécessaire à déployer. La PS4 est encore une console récente, et l'émuler n'est pas simple, la console intéresse de plus en plus les développeurs. \n \nAprès fpPS4 et RPCSX, qui sont des projets réellement solides, un nouveau arrive, il s'agit de psOff. Pour le moment, cet émulateur se concentre sur la restitution sur PC Windows, et sur les GPU AMD, bref, c'est plutôt restrictif puisqu'aucun pilote n'a pour l'heure était déployé pour les cartes nVidia. \n \nComme tous les émulateurs PS4, psOff exécute une couche qui permet aux logiciels de s'exécuter en traduisant les API et les systemcalls de la console. \n \n\n \n\n \n \nInstallation :\n \nPour tester, téléchargez simplement la dernière version. Et installez le SDK Vulkan\n \nPour le développement, définissez CMAKE_INSTALL_PREFIX sur le dossier des émulateurs téléchargés.\n \n \n\n \n \nTéléchargement : psOff\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187854/in-ps4-une-nouvelle-version-de-lemulateur-ps4-psoff-publiee-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1187854/in-ps4-une-nouvelle-version-de-lemulateur-ps4-psoff-publiee-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1187854/in-ps4-une-nouvelle-version-de-lemulateur-ps4-psoff-publiee-3.png"
        }
    },
    "news_18": {
        "title": "[PS4] Le store GameBato est disponible en 1.70",
        "content": "L'équipe en charge du store de téléchargement GameBato propose depuis quelques heures une nouvelle version de leur proposition. \n \nCe sont plus de 2000 jeux qui sont directement proposés sur la PlayStation 4 et PlayStation 4 Pro, avec les DLC et les mises à jour, et tout cela d'un simple clic. \n \nLes optimisations portent dans cette version 1.70 sur la vitesse d'exploration et de navigation des applications qui augmente de 900 %, la vitesse de téléchargement a elle progressée de 25 % pour tous les utilisateurs qu'ils soient Premium ou gratuits. \n \nAvec cette nouvelle version vous pouvez ajouter des packages pour différentes version de jeu et modifier le nombre de téléchargements autorisés. Sur ce point, il est possible aux membres gratuits de télécharger jusqu'à 2 fichiers/jeux/DLC/mise à jour tandis que ce nombre passe à 8 simultanément pour les membres Premium. \n \nL'équipe a aussi optimisé la stabilité de la solution puisque le risque de kernel panic ou d'arrêt de la console a été réduit de 85%, sans compter les corrections des problèmes liés au blocage des processus d'installation. \n \n \n\n \n \nVersion 1.70 disponible !\n \nExpérience utilisateur :\n- Augmentation de la vitesse d'exploration et de navigation dans l'application de 900%.\n \nVitesse de téléchargement :\n- Augmentation de la vitesse de téléchargement dans l'application de 25%.\n- Ceci s'applique à tous les utilisateurs, y compris les utilisateurs Premium et Free.\n \nInstallation et téléchargements multilignes :\n- Ajouter des paquets pour différentes versions de jeux. Par exemple, des titres différents et des langues différentes comme l'arabe, le portugais....\n \n- Modifier le nombre de téléchargements dans le Gestionnaire de téléchargements :\n- Mode GameBaTo :\n      Membres gratuits : 2 téléchargements\n      Membres Premium : 8 téléchargements\n- Mode console :\n      Membres gratuits : NaN\n      Membres Premium : 8 téléchargements\n \n- Réduit de 85 % les risques de panique du noyau et d'arrêt de la console.\n- Corrige l'erreur \"Package Installation Busy\".\n- Corrige le problème de blocage du processus d'installation.\n- Correction de quelques problèmes mineurs.\n \n \nTéléchargement : gamebatops4\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187806/in-ps4-le-store-gamebato-est-disponible-en-170-1.png"
        }
    },
    "news_19": {
        "title": "[3DS] Lime, le fork de Citra qui prend la relève",
        "content": "Le projet Lime est un fork de Citra, et il faut avouer qu'il a de l'ambition suite au retrait de la scène de son grand frère. \n \nAvec la disparition de Citra, il est clair que Lime a désormais de l'avenir, il s'agit d'un fork qui s'appuie sur de nombreuses parties de Citra. \n \n \n\n \nDerrière Lime, il y a eu un temps le développeur GPUCode, et c'est désormais Neobrain, auteur de l'émulateur Mikage pour la 3DS, mais d'autres comme ShyVortex ou encore RyzenDew sont très actifs. \n \n \nTéléchargement : Lime-3DS-Emulator\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187792/in-3ds-lime-le-fork-de-citra-qui-prend-la-releve-1.png"
        }
    },
    "news_20": {
        "title": "[PS4] Ajouter des mods Dragon Ball Fighter Z très facilement",
        "content": "En cette triste journée du 8 mars 2024 et suite au décès de MR Akira Toriyama, je publie la version beta 0.9 de mon Modder DBFZ, afin de lui rendre hommage.\n \nE effet, comme précisé juste au dessus, il s' agit d une version Beta, normalement pas destiné à être publié car finie à environ 50/60%, vous pourrez donc rencontrer quelques bugs mineurs (mods non présent ou non fonctionnel sur la ps4) mais rien de grave le plus gros du code étant terminé.\n \n\n \nGrâce à ce script Python, il vous sera très facile de modder votre jeu PS4 en quelques clics. Vous devez posséder le jeu de base CUSA09072 et sa mise à jour correspondante au format FPKG.\n \nCela fonctionne sur toutes les PS4 Jailbreakées, 5.05 à 9.00...\n \nVous trouverez donc dans l archive accompagnant cette new, mon script python, ainsi qu' une vingtaine de MODs PC convertis pour PS4, mais également un fichier.bat (Install pillow.bat) à lancer en premier et qu' une seule fois, afin d' installer les dépendances pour le bon fonctionnement de mon Moddeur.\n \nJe profite de cette new également pour exprimer toutes mes condoléances à la famille de MR Toriyama, notre papa de coeur àtous  bon fan de Dragon Ball, qu 'il repose en paix et un GRAND MERCI à lui pour tous ce qu' il a apporté...\n \n \nVideo tuto:\n \n\n \n \nTélécharger DBFZ Modder BETA V0.9\n \nUn petit Don pour ceux qui veulent continuer à me supporter fais toujours plaisir: https://www.paypal.com/paypalme/markus00095\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187789/in-ps4-ajouter-des-mods-dragon-ball-fighter-z-tres-facilement-1.png"
        }
    }
}