{
    "news_1": {
        "title": "[PS5] AirPSX v0.09 disponible",
        "content": "Une mise à jour du plugin AirPSX vient d'être dévoilée, comme vous le savez certainement il s'agit d'un payload ELF développé par barisyild pour PS5 et qui est un peu similaire à webMAN sur PS3 et qui permet de prendre en charge les jeux PS4.\n \nAprès une version 0.08 qui met à jour le package avec le SDK 0.27, tandis que la version 0.09 qui vient d'être mise en ligne vient corriger un bug dans l'app, et permet l'exécution payload dans la gestionnaire de fichiers. \n \n \n\n \n \nChangelog 0.09 : \n \n- Correction d'un bug dans l'application « Applications » qui affichait de manière incorrecte le lancement de l'application.\n- Ajout de « Exécuter le payload » au gestionnaire de fichiers.\n \nTéléchargement : AirPSX v0.09\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204237/in-ps5-airpsx-v009-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PS5] ps5-payload-sdk v0.27 disponible",
        "content": "John Tornblom dévoile une nouvelle version de PS5 Payload SDK qui est proposé en v0.27 désormais, la toolbox évolue donc une nouvelle fois sous les traits du développeur.\n \nComme vous le savez, ce SDK a pour ambition de faciliter le portage et le développement de payloads qui pourront s'exécuter sur les consoles bénéficiant du loader ISO BD-JB ELF, mais aussi sur celles utilisant l'exploit \"ipv6 uaf\" basé sur le webkit. Les corrections en question portent sur les offsets et certaines erreurs spécifiques.\n \n \n\n \n \n \nChangelog v0.27 : \n \n- crt : correction des offsets affectant les firmwares 1.xx, 4.02, 5.xx, 6.xx\n- crt : activation uniquement de la pile par défaut pour les signaux sans gestionnaires\n- libc : définition d'un numéro d'erreur si kernel_mprotect échoue dans mmap ou mprotect\n \n \nTéléchargement : ps5-payload-sdk v0.27\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204207/in-ps5-ps5-payload-sdk-v027-disponible-1.png"
        }
    },
    "news_3": {
        "title": "[PS5] PS5 Jar Loader v4.1.1 disponible",
        "content": "Le développeur Hammer-83 propose une mise à jour intéressante de PS5 Jar Loader, et les nouveautés sont très intéressantes !\n \nComme vous le savez, l'utilisation de l'exploit BD-J permet d'accéder à des possibilités qui ne sont pas directement accessible à l'exploit webkit, du fait de sa sécurité accrue. \n \n \n\n \n \nChangelog 4.1.1 : \n \nNouvelles fonctionnalités notables :\n- Ajout d'utilitaires de redirection stdio. Inspiré du travail de John Törnblom, iakdev et CryoNumb.\n- Ajout de mappages SDK supplémentaires.\n \nCorrections notables :\n- Corrections des offset pour 5.xx+.\n- Correction de quelques bugs dans le SDK.\n- Correction du problème de serveur FTP qui ne lit pas les fichiers de l'appareil. Un grand merci à CryoNumb pour le correctif.\n \nRemarques :\n- Consultez les journaux de validation pour obtenir la liste complète des modifications.\n- Les payloads sont compatibles avec la version 4.1.0. Cependant, le nouveau UMTX doit être exécuté à l'aide du chargeur distant et non à l'aide de celui du disque complet pour obtenir la lecture/écriture du noyau.\n- L'ISO complet inclut un menu et tous les fichiers JAR de cette version. L'ISO réduit inclut uniquement le chargeur JAR distant, les payloads doivent être envoyées via le réseau.\n \n \nTéléchargement : PS5 Jar Loader v4.1.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204198/in-ps5-ps5-jar-loader-v411-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[Multi] Zentool la suite d'outils pour modifier les Zen 1 à Zen 4",
        "content": "Notre ami sunriseur rim-k06 nous rappelle que l'équipe Google Security Research s'était engagée à publier des détails et des outils le 05 mars 2025 sur les failles de sécurité découvertes sur les CPU Zen 1 à Zen 4. \n \nCette information vous avez été publié dans une news du 04 février 2025, mais désormais l'équipe a dévoilé son outil Zentool.\n \nSous ce nom se cache une nouvelle suite d'outils qui vient de faire son apparition dans le paysage de la sécurité et de l'optimisation matérielle. Conçue pour les processeurs AMD Zen, cette suite d'outils permet d'analyser, de manipuler et de générer des patches firmware, offrant ainsi aux utilisateurs avancés un contrôle sans précédent sur le comportement de leurs processeurs.\n \n \n\n \n \n \nZentool est une interface utilisateur qui regroupe plusieurs utilitaires spécialisés dans la manipulation de firmware des processeurs AMD Zen. Parmi ces outils, on trouve mcas, un assembleur simple, et mcop, un désassembleur tout aussi accessible. Ces outils permettent aux utilisateurs de modifier le firmware, de vérifier les signatures, et même de charger des patches directement sur le processeur, grâce à des exemples richement documentés. \n \n \n \nAnalyse du firmware : Zentool permet d'examiner en détail les fichiers de mise à jour du frimware, en affichant des informations telles que la date, la révision, les checksums, et bien plus encore.\n \nModification du firmware : Grâce à la commande edit, les utilisateurs peuvent modifier des éléments spécifiques du microcode, comme le numéro de révision, et sauvegarder ces modifications dans un nouveau fichier.\n \nVérification et Signature : Après modification, Zentool peut vérifier l'intégrité du microcode et le resigner pour garantir sa validité.\n \nChargement du firmware : Les utilisateurs peuvent charger directement les patches de microcode sur leur processeur, bien que cela nécessite des privilèges root.\n \nZentool est le fruit du travail de membres de l'équipe de sécurité matérielle de Google, notamment Josh Eads, Matteo Rizzo, Kristoffer Janke, Eduardo Vela Nava, Tavis Ormandy, Sophie Schmieg, et d'autres. Leur travail s'est inspiré de recherches académiques, notamment celles de l'Université de la Ruhr à Bochum, ainsi que du livre \"Anatomy of a High Performance Microprocessor\".\n \nEn conclusion, nous pourrions dire que Zentool représente une avancée significative pour les professionnels de la sécurité et les passionnés de matériel, offrant des outils puissants pour manipuler et optimiser le firmware des processeurs AMD Zen. Cependant, son utilisation requiert une compréhension approfondie des architectures matérielles et des risques potentiels associés à la modification.\n \nTéléchargement : Zentool\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204191/in-multi-zentool-la-suite-doutils-pour-modifier-les-zen-1-a-zen-4-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS3] Sony sort le firmware 4.92 pour la PS3 !",
        "content": "Le 27 février 2023, Sony dévoilait le firmware 4.90 pour la PS3, le 28 février 2024, la firme japonaise lançait le firmware 4.91, et bien hier, Sony a lancé le firmware 4.92 sans réelle surprise. Nous pourrions même anticiper que l'année prochaine à la même époque soit lancé le firmware 4.93 ? \n \nLe changelog officiel ne fait état d'aucune modification, mais il semblerait que ce soit les clés blu-ray qui ont été mises à jour, rien de très transcendant mais assez pour nécessité une mise à jour. \n \nRappelons au passage que Sony a annoncé l'arrêt de la production de blu-ray enregistrable, lancé aux débuts des années 2000 comme le successeur du DVD, le blu-ray bénéficiant initialement d'une capacité de 25 Go est extensible à 50 Go sur les versions double couche. C'est quoi la suite, la fin du support physique, un nouveau support de 10 Go commence à sortir du lot. \n \n \n\n \n \nPour le firmware 4.92, cela s'organise déjà, notamment sur Psx-Place.com où la plupart des développeurs se mettent au travail pour proposer leur solution. \n \nC'est le cas de esc0rtd3w qui montre déjà quelques screens de son travail ici : psx-place.com\n \n \n\n \n \nLes structures sécuritaires n'ayant pas réellement évolués, il y a fort à parier que les HFW, CFW et autres HEN arriveront rapidement. \n \n \nMerci à notre ami sunriseur littlebalup pour l'information. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204187/in-ps3-sony-sort-le-firmware-492-pour-la-ps3-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1204187/in-ps3-sony-sort-le-firmware-492-pour-la-ps3-2.png"
        }
    },
    "news_6": {
        "title": "[PS4] Un portage de ShadPS4 sur Android démarre",
        "content": "Le développeur Tersonous se donne environ 15 jours pour tenter de porter l'émulateur ShadPS4 sur Android. \n \nL'émulation sur Android risque une nouvelle fois d'avancer avec la réalisation d'un compilateur Just-In-Time (JIT) capable de traduire du code arm64 en amd64. Ce projet, baptisé ShandroidPS4, vise à permettre l'exécution d'applications .apk conçues pour l'architecture aarch64 sur des systèmes x86_64, ouvrant ainsi de nouvelles perspectives pour les développeurs et les utilisateurs de ShadPS4.\n \n \n\n \n \nUne partie importante du travail actuel consiste à affiner les calls de bibliothèque pour garantir une compatibilité maximale. Le développeur se concentre sur l'adaptation des fonctions système et des bibliothèques partagées pour qu'elles fonctionnent de manière transparente entre les deux architectures. Cela inclut la gestion des différences dans les conventions d'appel, les alignements mémoire et les instructions spécifiques à chaque architecture.\n \nTersonous commence à réfléchir à la conception d'API de haut et de bas niveau. Ces API permettront aux développeurs d'applications d'interagir avec l'émulateur de manière plus flexible, tout en offrant un contrôle précis sur les ressources système. L'objectif est de fournir une plateforme polyvalente qui puisse être utilisée aussi bien pour le développement que pour le test d'applications Android.\n \nLe projet se trouve ici : shandroidPS4\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204148/in-ps4-un-portage-de-shadps4-sur-android-demarre-1.png"
        }
    },
    "news_7": {
        "title": "[XB360] La partie 2 de l'exploit &#34;Bad Update&#34; est là",
        "content": " \nAu delà de la disponibilité de l'exploit dont nous vous avons donné l'information lors d'une news précédente, son développeur, Ryan Miceli, nous explique en nous dévoilant la seconde partie de son article, comment il a réussi à pirater l'hyperviseur de la Xbox 360. Dans cette seconde partie, il explique comment il a trouvé et exploité des bugs dans l'hyperviseur Xbox 360 pour obtenir une exécution complète du code et créer l'exploit « Bad Update ». Si vous ne l'avez pas déjà fait, il vous conseille de lire (ou au moins de parcourir) la première partie , car ce second article fera référence à une grande partie du contenu qui y est abordé.\n \n \n \n \n\n \n \n \n \nComme il l'a mentionné dans la première partie, il considère l'hyperviseur de la Xbox 360 comme l'un des éléments de code les plus sécurisés que Microsoft ait jamais écrit, avec un seul bug logiciel à ce jour qui était probablement le résultat d'un problème de compilateur.\n \nIl dit avoir passé beaucoup de temps dans le passé à rechercher des vulnérabilités dans l'hyperviseur, mais il n'a jamais rien trouvé d'important. Depuis lors, il a passé 7 ans à travailler en tant qu'ingénieur en sécurité professionnelle et il a développé un tout nouvel état d'esprit pour analyser les cibles et trouver les bugs. \n \nIl a été très motivé à mettre ses nouvelles compétences à l'épreuve et à voir s'il pouvait enfin pirater l'hyperviseur de la Xbox 360. C'est ce qu'il considère comme « le boss final » de son parcours en tant que hacker de console de jeu.\n \n \n\n \n \nIl a fallu environ deux mois et demi pour rechercher, développer et terminer cet exploit, mais ça lui a semblé une éternité. À de nombreuses reprises, il se pensait dans une impasse, la découverte et le développement de cet exploit ont mis à profit ses capacités de chercheur en sécurité, de la compréhension du fonctionnement de la console à la recherche de moyens de créer une surface d'attaque.\n \n\n \n \n \nMaintenant qu'il a terminé cet exploit, il a décidé de se retirer du piratage de consoles de jeu (du moins dans un avenir proche). Pour tous ceux qui souhaitent en savoir plus sur le fonctionnement interne de la Xbox 360, il prévoit d'écrire une troisième partie dans laquelle il couvrira (brièvement) certaines de ses tentatives ratées d'exploitation de la console, ainsi que d'autres comportements/techniques intéressants, cependant cette partie ne sera pas écrite avant plusieurs mois, alors ne comptez pas dessus de sitôt.\n \n \nL'article (seconde partie) est disponible ici : https://icode4.coffee/?p=1081\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204147/in-xb360-la-partie-2-de-lexploit-bad-update-est-la-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1204147/in-xb360-la-partie-2-de-lexploit-bad-update-est-la-2.png"
        }
    },
    "news_8": {
        "title": "[3DS] Luma3DS v13.3.1 la mise à jour",
        "content": "Luma3DS, le Custom Firmware (CFW) le plus populaire pour la Nintendo 3DS, vient de recevoir une nouvelle mise à jour : la version v13.3.1. Cette version apporte des améliorations notables, notamment en ce qui concerne la gestion des sauvegardes automatiques.\n \nL'une des fonctionnalités clés de cette mise à jour est la modification du système de sauvegarde automatique. Désormais, les sauvegardes des fichiers essentiels, qui sont créées à chaque démarrage d'une nouvelle version de Luma3DS, sont stockées dans un dossier spécifique à chaque console. Ces sauvegardes sont enregistrées dans le répertoire suivant :\n/luma/backups/<8-chiffres-hexadécimaux-DeviceId>\n \n \n\n \n \nCette modification permet d'éviter que les sauvegardes ne soient écrasées lorsque la carte SD est utilisée sur une autre console Nintendo 3DS. Ainsi, les utilisateurs qui échangent régulièrement leurs cartes SD entre plusieurs appareils peuvent désormais profiter d'une gestion plus sécurisée de leurs données.\n \nLa gestion des sauvegardes est un aspect crucial pour les utilisateurs de Custom Firmware, car elle permet de prévenir la perte de données en cas de problème lors de la mise à jour ou de l'utilisation du système. Avec cette nouvelle version, Luma3DS renforce la sécurité des données et offre une expérience utilisateur plus fluide.\n \nL'on doit ce travail au développeur TuxSH qui continue de maintenir Luma3DS, même en 2025. \n \n \nTéléchargement : Luma3DS v13.3.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204144/in-3ds-luma3ds-v1331-la-mise-a-jour-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS4] PSsocat v2.0 proposé par Master-S",
        "content": "Le développeur Master-s a compris que l'arrivée potentielle du hack complet sur le firmware 6.50 allait se jouer avec Socat. \n \nSocat est un outil en ligne de commande qui permet de rediriger des flux de données entre deux points, souvent utilises pour le transfert de données entre des sockets, des fichiers, des processus, etc. Sur une PS4 et PS5, Socat est parfois utilise par les développeurs ou les passionnes de homebrew pour faciliter des opérations comme le débogage, le transfert de données entre la console et un PC, ou pour des manipulations liées au jailbreak.\n \n \n \n\n \n \n \nUtilisations courantes de Socat sur PS4 :\n \nDébogage : Rediriger les flux de données pour analyser les communications réseau ou les erreurs système.\n \nTransfert de fichiers : Faciliter le transfert de fichiers entre la PS4 et un ordinateur via le réseau.\n \nJailbreak et homebrew : Aider a exploiter des vulnérabilités ou a exécuter des logiciels non officiels.\n \n \nAinsi Master-S a proposé plusieurs version de PS socat, la dernière étant le 2.0, dans cette dernière version il est possible d'envoyer des payloads à partir du navigteur. \n \n \nTéléchargement : PSsocat v2.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204104/in-ps4-pssocat-v20-propose-par-master-s-1.png"
        }
    },
    "news_10": {
        "title": "[PS4] Avatar Changer v1.02 pour PS4 de Lapy disponible",
        "content": "Le développeur Lapy propose déjà la v1.02 de son outil Avatar Changer pour les PS4 et PS4 Pro disposant d'un jailbreak. \n \n \n\n \n\n \n \nChangelog 1.01 : \n \n- Correction pour les personnes dont la version 1.00 ne fonctionnait pas, merci à AlhyanyA91108 et à Wr0zen pour l'avoir testé\n \n- Quelques corrections graphiques mineures détectées par Anubis_Qz\n \n- Prise en charge du chargement de xavatars depuis une clé USB (créez un dossier AVATARS sur votre clé USB)\n \n \nChangelog 1.02 : \n \n-Correction d'un bug qui ne permettait pas de supprimer les avatars de certains utilisateurs, rapporté par PajiloeT\n \n-Ajout d'une option permettant de passer plus rapidement d'une page à l'autre en maintenant L2 enfoncé testé par DouglasSampaioz\n \n \n \nTéléchargement : Avatar Changer v1.02\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204103/in-ps4-avatar-changer-v102-pour-ps4-de-lapy-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1204103/in-ps4-avatar-changer-v102-pour-ps4-de-lapy-disponible-2.jpg"
        }
    },
    "news_11": {
        "title": "[Wii/GC] Swiss v0.6r1823 disponible",
        "content": " \nLe développeur Extrems vient de mettre en ligne une version importante de son outil Swiss, et il faut avouer qu'il n'a pas fait semblant, les nouveautés sont très nombreuses. \n \nLa dernière version a été proposée comme un cadeau le 24 décembre 2024, et déjà les améliorations et optimisations étaient nombreuses, mais voici encore de nombreuses corrections. \n \n \n\n \n \n \nChangelog v0.6r1823 :\n \n- Ajout des signatures VI pour le programme de mise à jour Berry.\n- Mise à jour de XZ Embedded.\n- L'année est 2025.\n- Activer LTO dans l'empaqueteur exécutable.\n- Lecture des attributs FAT à partir de FlippyDrive.\n- Ajout d'une option pour désactiver l'hyperviseur.\n- Correction de l'installation sur FlippyDrive.\n- Permettre le montage d'une image disque avec un exécutable.\n- Définir un type de fichier inconnu et gérer les conséquences.\n- Transmettre le chemin d'accès à l'image disque pour une utilisation ultérieure.\n- Analyse de l'enregistrement de démarrage El Torito.\n- Emuler vaguement statFile sur FlippyDrive.\n- Commencer à utiliser statFile plus largement.\n- Correction de la régression 2c2d27d.\n- Correction du redémarrage sur FlippyDrive avec des périphériques non-DI.\n- Utilisation de data.iso pour les applications.\n- Correction du retour au chargeur sur GC Loader avec data.iso présent.\n- Afficher le mode de vitesse du bus.\n- Rendre « compatible avec GC Loader » plus évident.\n- Ajout de mram.bin et mram_cached.bin.\n- Détecter la configuration MRAM définie par BS1.\n- Transmettre la configuration aux applications.\n- Remplir le type de console et le code du périphérique.\n- Ne pas demander la mise à jour de FlippyDrive sur le matériel de développement.\n- Détecter WODE en utilisant l'ID du disque ExtCFG.\n- Mettre à jour la base de données Redump.\n- Ajustement pour les changements de libogc2.\n- Détecter le lecteur de disque plus rapidement à partir d'un coldboot. \n- Sauvegarde du code de l'appareil dans la SRAM.\n- Signaler le type de lecteur de disque.\n- Conserver le code de périphérique précédent avec FlippyDrive.\n- Signaler le type de lecteur de disque sous FlippyDrive.\n- Sonder le dispositif DI lorsque la dernière tentative a échoué.\n- Interrompre un transfert en cours au moment du démarrage.\n \nTéléchargement : Swiss v0.6r1823\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204087/in-wiigc-swiss-v06r1823-disponible-1.jpg"
        }
    },
    "news_12": {
        "title": "[XB360] L'exploit Hyperviseur Xbox 360 est là !",
        "content": " \nLe nouveau logiciel de déblocage pour Xbox 360 est là ! En utilisant une vulnérabilité dans l'hyperviseur, dans la version 17559 du dashboard, il est possible de déverrouiller la console, pour cela le jeu Tony Hawk's American Wasteland (NTSC) est utilisé.\n \nLe déverrouillage n'est pas persistant, c'est-à-dire que si vous éteignez la console, il sera annulé. \n \n \nComme prévu, le développeur Grimdoomer vient de publier son exploit hyperviseur, nommé Bad Update ! \n \nBad Update est un programme d'exploitation non persistant pour l'hyperviseur de la Xbox 360 qui fonctionne sur la dernière version du logiciel (17559). Ce dépôt contient les fichiers d'exploitation qui peuvent être utilisés sur une console Xbox 360 pour exécuter du code non signé. Cet exploit peut être déclenché en utilisant l'un des jeux suivants :\n \n \nTony Hawk's American Wasteland (NTSC)\n \n\n \n \nVotre console ne sera piratée (capable d'exécuter du code homebrew/non signé) que tant qu'elle restera allumée. Une fois que vous aurez redémarré ou éteint votre console, vous devrez relancer l'exploit. L'exploit ne peut pas être rendu persistant, du moins pas en l'état. \n \nBien que l'exploit puisse être porté sur n'importe quelle version du logiciel système, il n'a été construit que pour la version 17559 du dashboard.\n \nComme nous vous l'avons déjà dit l'exploit a un taux de réussite faible, de l'ordre de 30 %, et il peut prendre jusqu'à 20 minutes.\n \nProcédure : \n \n- Téléchargez le fichier Xbox360BadUpdate-Retail-USB.zip depuis la section releases et extrayez les fichiers.\n- Formatez une clé USB en FAT32.\n- Copiez le contenu du dossier correspondant au jeu que vous voulez utiliser pour l'exploit à la racine de la clé USB. Ex : si vous utilisez Tony Hawk's American Wasteland, copiez le contenu du dossier Tony Hawk's American Wasteland à la racine de la clé USB. La racine de la clé USB doit contenir les fichiers/dossiers suivants : BadUpdatePayload, Content, name.txt.\n- Placez l'exécutable non signé que vous souhaitez exécuter lorsque l'exploit se déclenche dans le dossier BadUpdatePayload de la clé USB et nommez-le « default.xex » (remplacez tout fichier existant dans le dossier). Ce fichier xex doit être au format retail et toutes les restrictions doivent être supprimées (voir le wiki pour savoir comment faire).\n- Insérez la clé USB dans votre console Xbox 360 et allumez-la.\n- Connectez-vous au profil du joueur 1 et lancez le jeu que vous utilisez pour déclencher l'exploit.\n- Suivez les instructions du jeu que vous avez choisi pour charger le fichier de sauvegarde du jeu piraté et commencer le processus d'exploitation.\n- L'anneau lumineux de la console clignotera de différentes couleurs/segments au cours du processus d'exploitation pour indiquer la progression. Pour plus d'informations sur la signification des différentes valeurs, voir la section « LED Patterns and Meanings » du wiki.\n- Une fois que l'exploit s'est déclenché avec succès, l'anneau lumineux devrait être entièrement allumé en vert. L'hyperviseur a maintenant été corrigé pour exécuter des exécutables non signés et votre fichier default.xex non signé sera exécuté.\n- L'exploit a un taux de réussite de 30 % et peut prendre jusqu'à 20 minutes pour se déclencher avec succès. Si, au bout de 20 minutes, l'exploit ne s'est pas déclenché, vous devrez éteindre votre console Xbox 360 et répéter le processus à partir de l'étape 5.\n \n \n \n\n \n \n \nQ : Pourquoi dois-je réexécuter l'exploit à chaque fois que j'allume ma console ?\nR : L'exploit n'est pas persistant, il ne fonctionne que tant que la console reste allumée. Une fois la console éteinte ou redémarrée, vous devrez à nouveau exécuter l'exploit.\n \nQ : Qu'est-ce que cet exploit apporte de plus que le RGH Hack / devrais-je l'utiliser à la place du RGH ?\nR : Il s'agit d'un exploit logiciel qui ne nécessite pas d'ouvrir la console ou de faire des soudures pour l'utiliser. En dehors de cela, il est inférieur à l'exploit du RGH à tous points de vue et doit être considéré comme une « preuve de concept » et non comme quelque chose à utiliser à la place du RGH.\n \nQ : Est-ce que cela peut être transformé en softmod ?\nR : Non, la chaîne de démarrage de la Xbox 360 est très sûre et ne présente aucune surface d'attaque. Il n'existera jamais d'exploit de type « softmod » permettant de passer d'un état de démarrage à un état de piratage par le biais d'un logiciel uniquement.\n \nQ : Cela fonctionne-t-il sur les consoles Winchester ?\nR : Je ne l'ai pas testé personnellement, mais je ne vois aucune raison pour qu'il ne fonctionne pas. Rien dans l'exploit n'est spécifique au matériel.\n \nQ : J'ai lancé l'exploit et rien ne s'est passé ?\nR : L'exploit a un taux de réussite de 30 %. Si, après 20 minutes d'exécution, l'exploit ne s'est pas déclenché, vous devrez redémarrer votre console et réessayer.\n \nQ : Pourquoi l'exploit n'exécute-t-il qu'un seul xex non signé ?\nR : Mon but était de pirater l'hyperviseur, pas de développer une solution robuste tout-en-un. Quelqu'un d'autre devra développer un exécutable post-exploit qui corrige toutes les choses de qualité de vie que vous obtiendriez avec quelque chose comme l'exploit RGH.\n \nQ : Pourquoi l'exploit met-il autant de temps à se déclencher et pourquoi son taux de réussite est-il si élevé ?\nR : L'exploit est une condition de course qui nécessite un timing précis et plusieurs autres conditions pour qu'il se déclenche avec succès. Cela peut donc prendre un certain temps avant que cela ne se produise.\n \n \n \nTout est là : Xbox360BadUpdate\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-778542166.png"
        }
    },
    "news_13": {
        "title": "[XB360] XenonRecomp l'outil de recompilation Xbox 360",
        "content": "XenonRecomp, un outil innovant conçu pour convertir les exécutables Xbox 360 en code C++ recompilable, pourrait bientôt étendre son support à d'autres plateformes. Actuellement, l'outil ne supporte que les plateformes x86 en raison de l'utilisation intrinsèque x86, mais les développeurs explorent des solutions pour élargir sa compatibilité.\n \nInspiré par le projet N64 : Recompiled, qui permet de recompiler des exécutables N64, XenonRecomp vise à faire de même pour les jeux et applications Xbox 360. L'outil convertit les instructions PowerPC (PPC) de la Xbox 360 en code C++, permettant ainsi une recompilation pour d'autres architectures. Cependant, le code généré n'est pas optimisé pour la lisibilité humaine, car les instructions sont converties de manière directe sans restructuration.\n \nXenonRecomp fonctionne en passant l'état du CPU (y compris les registres PPC) comme argument à chaque fonction PPC. Les instructions sont implémentées pour fonctionner en little-endian, bien que la Xbox 360 soit une machine big-endian. Cela nécessite des ajustements pour les opérations de mémoire et les registres vectoriels, où l'ordre des éléments est inversé.\n \nLes instructions vectorielles (VMX) sont actuellement implémentées en x86, mais les développeurs envisagent d'utiliser des bibliothèques comme SIMD Everywhere pour permettre une compatibilité multi-architecture. Cependant, certaines fonctionnalités, comme le MMIO (Memory-Mapped I/O), utilisé pour des opérations matérielles spécifiques comme le décodage XMA, ne sont pas encore implémentées.\n \n \n\n \n \nXenonRecomp utilise une table de hachage parfaite pour résoudre les appels de fonctions virtuelles, une amélioration par rapport à une précédente méthode qui nécessitait une allocation mémoire excessive. Pour les tables de saut, l'outil s'appuie sur des motifs d'assemblage prévisibles, bien que des ajustements soient nécessaires pour les jeux plus récents en raison des évolutions du compilateur Xbox 360.\n \nL'analyse des limites des fonctions est également prise en charge, bien que les fonctions contenant des tables de saut posent encore des défis. Les utilisateurs peuvent définir manuellement les limites des fonctions dans un fichier de configuration TOML.\n \nXenonRecomp propose plusieurs optimisations pour améliorer les performances, notamment en supprimant les calls superflus aux registres et en convertissant certains registres en variables locales. Ces optimisations peuvent réduire la taille des exécutables de plusieurs mégaoctets et améliorer les temps de rendu. De plus, l'outil permet de patcher facilement les fonctions PPC, offrant aux utilisateurs la possibilité de remplacer des fonctions par des implémentations personnalisées tout en conservant l'accès aux fonctions d'origine.\n \nMalgré ses avancées, XenonRecomp ne supporte pas encore les exceptions, un défi technique lié à l'utilisation du registre de lien (link register) et à la nature imprévisible des gestionnaires d'exceptions. De plus, certaines instructions PPC, notamment celles liées aux opérations D3D, ne sont pas entièrement implémentées.\n \nLe développeur principal de XenonRecomp, blueskythlikesclouds, dévoile des compilations ici si le projet vous intéresse : XenonRecomp\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204040/in-xb360-xenonrecomp-loutil-de-recompilation-xbox-360-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] Le firmware 5.50 est désormais totalement hacké",
        "content": "Et voilà, il aura fallu attendre quelques jours, mais c'est désormais fait, le firmware 5.50 vient de tomber et dispose désormais de son propre kstuff. \n \nLe kstuff 5.50 a été proposé en test par StretchEcho, et il est désormais intégré dans toutes les bonnes crèmeries. \n \n \n\n \n \nL'équipe en question continue de travailler sur les autres firmwares, notamment le 6.50 et jusqu'au 7.61, mais comme vous le savez le webkit exploit n'est plus accessible à compter du 6.00, juste les Debug Settings via l'exploit BD-J.\n \n \n\n \n \nLe développeur informe qu'il cherches des testeurs pour porter l'exploit sur les firmwares 5.00 et 5.02, il faut avoir des connaissances sur les klogs et Socat pour l'aider dans cette démarche. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204038/in-ps5-le-firmware-550-est-desormais-totalement-hacke-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1204038/in-ps5-le-firmware-550-est-desormais-totalement-hacke-2.png"
        }
    },
    "news_15": {
        "title": "[Multi] La mise à jour d'ezRemote Client s'invite sur toutes les consoles",
        "content": "Le développeur cy33hc propose une nouvelle version d'ezRemote pour quasiment toutes les consoles, la version Linux, la version PS5, la version Vita, la version Switch, la version PS3 et PS4 ont toutes été mises à jour, toutes n'ont pas le même avancement dans les numérotations, mais principalement il s'agit de la version 1.12, ou bien encore la 1.35 sur PS4. \n \nLa principale nouveauté est l'ajout de la prise en charge de la navigation et du téléchargement des versions à partir des dépôts GitHub. Sous le serveur, entrez simplement le dépôt Git du homebrew.\n \n \n\n \n \n \nTéléchargement : ezRemote PS3 / ezRemote PS4 / ezRemote Vita / ezRemote Switch / ezRemote PS5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204023/in-multi-la-mise-a-jour-dezremote-client-sinvite-sur-toutes-les-consoles-1.png"
        }
    },
    "news_16": {
        "title": "[PS4/PS5] Al-Azif propose un script pour afficher l'IDPS sur PS4 et PS5",
        "content": "Le célèbre développeur Al-Azif, connu pour ses contributions à la scène du jailbreak sur les consoles PlayStation, a récemment publié un nouvel outil, introduisant une nouvelle fonctionnalité permettant d'afficher des informations système partielles sur les PS4 et PS5. \n \nAprès une première version 0.9.0 dévoilée hier, qui était la version initiale, il propose aujourd'hui la version 1.0.0b qui inclut notamment la capacité de notifier l'utilisateur de l'IDPS partiel (Identification de la PlayStation) lorsque la console dispose d'un jailbreak.\n \n \n\n \n \n \nChangelog 1.0.0b : \n \n- Nettoyage du code.\n- Ajout de commentaires pour une meilleure compréhension.\n- Publication du code source.\n- Ajout du support pour la PS5.\n \n \nFonctionnalités principales de l'outil : \n \nAffichage du Partial IDPS : Si la console dispose d'un jailbreak (ou si le payload de jailbreak a réussi), une notification affichera l'IDPS partiel.\n \nInformations supplémentaires : En cas de jailbreak réussi, le Partial Serial (numéro de série partiel) et le Model (modèle de la console) seront également affichés.\n \nSauvegarde des données : Si un périphérique USB est connecté, les données seront automatiquement sauvegardées dans un fichier data.txt à la racine du périphérique. Ce fichier est préformaté pour une utilisation facile sur des forums ou des plateformes de partage.\n \nCompatibilité : L'outil fonctionne en mode userland sur la PS5, mais se limite à l'affichage du Partial IDPS dans les notifications.\n \n \nTéléchargement : Info dumer payload for PS4/PS5 1.0.0b\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203990/in-ps4ps5-al-azif-propose-un-script-pour-afficher-lidps-sur-ps4-et-ps5-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS3] RPCS3 v0.0.35 Alpha disponible",
        "content": "L'équipe de développement de RPCS3, l'émulateur open-source de PlayStation 3, a annoncé la sortie de la version 0.0.35 Alpha. Bien que cette version ne soit pas une build stable, elle apporte une multitude de corrections, d'optimisations et de nouvelles fonctionnalités qui continuent de faire de RPCS3 le meilleur émulateur PS3. .\n \nComme le souligne l'équipe, RPCS3 est un logiciel en \"rolling release\", ce qui signifie qu'il n'existe pas de version stable officielle. Les versions Alpha, comme la 0.0.35, sont des jalons qui regroupent des améliorations significatives, mais elles ne sont pas destinées à un usage grand public en raison de leur nature expérimentale. Les utilisateurs sont invités à toujours télécharger la dernière build disponible sur le site officiel : rpcs3.net/download.\n \n \n\n \n \nLes Principales Améliorations de la Version 0.0.35 \n \nCette nouvelle version introduit une série de correctifs et d'optimisations, notamment :\n \n- Améliorations des performances SPU : Plusieurs optimisations ont été apportées au niveau des réservations SPU, avec des corrections pour la gestion de la mémoire et des notifications.\n \n- Support amélioré pour les contrôleurs PS Move : L'émulateur intègre désormais un meilleur support pour les contrôleurs PS Move, avec des améliorations dans la gestion de l'orientation, du gyroscope et de la calibration.\n \n- Mises à jour des bibliothèques : Des bibliothèques essentielles comme Qt, curl, et wolfssl ont été mises à jour pour améliorer la stabilité et les performances.\n \n- Corrections graphiques : Des problèmes liés au cache des shaders et à la gestion de la mémoire graphique ont été résolus, notamment pour les utilisateurs de Vulkan.\n \n- Améliorations de l'interface utilisateur : L'interface a été enrichie avec de nouvelles fonctionnalités, comme un indicateur d'autosauvegarde, un menu récent pour les sauvegardes, et des dialogues de bienvenue améliorés.\n \n- Support audio et vidéo : Des corrections ont été apportées pour les décodages audio (cellAdec) et vidéo (cellVdec), avec une meilleure gestion des flux multimédias.\n \nNouveautés pour les Développeurs\n \nLes développeurs travaillant sur RPCS3 ou souhaitant contribuer au projet trouveront également des améliorations notables :\n \n- Optimisations LLVM : Des améliorations ont été apportées pour réduire la consommation mémoire et optimiser les performances des recompilateurs PPU et SPU.\n \n- Support pour ARM64 : Les builds pour les processeurs ARM64 sont désormais mieux supportés, avec des correctifs spécifiques pour les plateformes comme macOS et Linux.\n \n- Intégration continue : L'équipe a amélioré les pipelines CI (Continuous Integration) pour garantir une meilleure stabilité des builds futures.\n \n \nChangelog complet ici : RPCS3 v0.0.35 Alpha\n \n \nUn Projet en Évolution Constante\n \nRPCS3 continue de progresser à un rythme impressionnant, avec une communauté active et des contributeurs dévoués. Cette version 0.0.35 Alpha témoigne de l'engagement de l'équipe à améliorer l'émulateur, que ce soit pour les joueurs souhaitant revivre leurs classiques PS3 ou pour les développeurs cherchant à explorer les entrailles de la console de Sony.\n \n \nTéléchargement : RPCS3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203989/in-ps3-rpcs3-v0035-alpha-disponible-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS5] Le développeur Bucanero ne développe pas Apollo Save Tool sur PS5",
        "content": "Nous venons d'apprendre que le développeur Bucanero vient de débuter le développement d'Apollo Save Tool sur la PS5, un projet de développement lié à la PlayStation 5, spécifiquement une version PS5 d'Apollo Save Tool, l'outil de sauvegarde et de gestion de fichiers pour consoles PlayStation. Le développeur, connu sous le pseudonyme Bucanero (Damian Parrino), travaille sur ce projet, et les commits initiaux sur GitHub montrent une activité récente.\n \n \n \n\n \n \n \nCependant, à notre connaissance, pour l'heure le développeur n'a pas encore annoncé cette nouvelle version, les développeurs de ce type d'outils travaillent souvent de manière discrète, en raison des implications légales et techniques liées au modding et à la manipulation des consoles. Si vous souhaitez suivre l'évolution du projet, vous pouvez consulter régulièrement le dépôt GitHub : Apollo PS5 sur GitHub. \n \nLe hack PS5 évolue rapidement depuis quelques semaines, et le portage de jeux PS4 s'accentue, ce sofwt permettra de porter les sauvegardes de PS4 vers la PS5, ou bien de les resigner, et de les archiver.\n \n \nEdit 01/03/2025 : Après avoir vu que de nombreuses personnes reprenaient le github (fort logiquement) comme un commencement de développement (nous avions d'ailleurs préciser qu'il n'avait pas confirmé ou annoncé le dév) le développeur a confirmé qu'il ne développe pas actuellement la version PS5, dès lors pourquoi créer un github, à priori pour regrouper un certain nombres de requêtes peut être. Donc pour l'heure le développement de la version PS5 d'Apollo Save n'est pas une réalité. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203972/in-ps5-le-developpeur-bucanero-commence-le-developpement-dapollo-save-tool-sur-ps5-1.png"
        }
    },
    "news_19": {
        "title": "[Switch] SysDVR v6.2 avec support Android 32 bits et de nouvelles fonctions",
        "content": "La communauté des utilisateurs de SysDVR a de quoi se réjouir avec l'arrivée de la version 6.2, qui apporte des améliorations significatives et des corrections attendues depuis plusieurs mois. Pour rappel, sysDVR permet de diffuser l'écran de la Nintendo Switch via USB ou via Réseau en 720p 30 FPS sur un PC.\n \n \n\n \n \n \nChangelog SysDVR 6.2\n \nPrincipales modifications :\n- Support d'Android ARM 32 bits (armeabi-v7a)\nLa version 6.2 introduit le support des appareils Android 32 bits, une avancée majeure qui permet à SysDVR d'être compatible avec une plus large gamme d'appareils, y compris les modèles plus anciens ou économiques. Cependant, les développeurs mettent en garde : bien que l'application puisse désormais fonctionner sur ces appareils, leurs performances matérielles limitées pourraient ne pas offrir une expérience optimale.\n \n- Correction de l'enregistrement vidéo\nUn bug frustrant lors de l'enregistrement de deux vidéos consécutives a été résolu, garantissant désormais une capture vidéo sans interruption.\n \n- Option pour désactiver les entrées du contrôleur sur PC\nUne nouvelle fonctionnalité permet de désactiver les entrées du contrôleur lors de la lecture sur un PC, répondant à une demande récurrente de la communauté.\n \n- Améliorations des entrées de contrôleur/télécommande sur Android\nLa prise en charge des contrôleurs et télécommandes sur Android a été optimisée pour une meilleure réactivité et une expérience plus intuitive.\n \n- Améliorations pour Flatpak\nLes utilisateurs de Flatpak bénéficient de plusieurs corrections et optimisations, rendant l'installation et l'utilisation de SysDVR plus stables sur cette plateforme.\n \n- Ajout de nouvelles langues\nLa version 6.2 accueille deux nouvelles langues : l'espagnol, grâce à la contribution de @unaigonzalezz, et le portugais brésilien, ajouté par @discollizard.\n \n- Infrastructure de débogage améliorée\nUne nouvelle infrastructure de débogage a été mise en place pour fournir des détails plus précis en cas d'erreur, notamment lorsque la journalisation détaillée est activée. Cela facilitera le diagnostic des problèmes pour les utilisateurs et les développeurs.\n \nLa version 6.2 de SysDVR démontre l'engagement continu des développeurs à répondre aux besoins de la communauté. Avec des améliorations de compatibilité, des corrections de bugs et de nouvelles fonctionnalités, cette mise à jour renforce la position de SysDVR comme un outil essentiel pour les passionnés de jeux vidéo. Les utilisateurs sont invités à mettre à jour leur application pour profiter de ces nouveautés et à partager leurs retours pour contribuer à l'amélioration continue du projet.\n \nTéléchargement : SysDVR 6.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203969/in-switch-sysdvr-v62-avec-support-android-32-bits-et-de-nouvelles-fonctions-1.png"
        }
    },
    "news_20": {
        "title": "[Switch] MigFlash dévoile le firmware 1.1.8",
        "content": "L'équipe en charge du développement du MigFlash vient de mettre en ligne un article pour proposer un tout nouveau firmware à destination de leur solution.\n \nLe firmware 1.1.8 est affichée comme une mise à jour rapide, la version 1.1.8 corrige un problème dans le Mig Dumper où le dump de certains types de cartes de jeu s'arrêtait prématurément et chutait à une vitesse de transfert nulle.\n \n \n\n \n \n \n \n \nD'autres travaux sont en cours, mais l'équipe a souhaité proposer cette petite mise à jour car plusieurs utilisateurs ont rapporté ce problème et cela coinçait lors de la sauvegarde de certains de leurs jeux préférés !\n \n \nTéléchargement : firmware 1.1.8 MigFlash\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203946/in-switch-migflash-devoile-le-firmware-118-1.png"
        }
    }
}