{
    "news_1": {
        "title": "[Switch] Non, Ryujinx ne permet pas d'émuler la Switch 2",
        "content": "De nombreuses rumeurs font état que la Switch 2 peut désormais être émulée, il n'en n'est rien, cela fait écho à une vidéo qui montre une fausse émulation de Donkey Kong Bananza, mais cela pourrait être le cas de la trentaine de jeux Switch 2.\n \nD'une part la Switch 2 n'est pas émulée, pas hackée, mais d'autre part pour le moment du moins, les jeux ne sont pas dumpés. Il faut avoir en tête que Ryujinx ne permet pas de lancer les dernières mises à jour BOTW ou de TOTK, donc comment est-ce que l'émulateur pourrait simuler une Switch 2. \n \n \n \n\n \n \n \nSi vous regardez attentivement la vidéo, le terminal affichant les journaux de l'émulateur ne fait rien. Le seul changement se produit pendant le crash, mais il y a toujours une opération de chargement du cache ppt et un chargement du modloader. Pour le moment il est impossible de dumper un jeu via l'e-shop car la structure de données des jeux Switch 2 n'est pas la même que celle de la Switch 1, bee pour la Switch 2 et hac pour la Switch 1, les clés ne sont pas encore connues, et la ROM resterait cryptée quand bien même elle serait disponible, et donc elle ne se lancerait pas. \n \n \n\n \n\n \n \nQuoiqu'il en soit, cette vidéo représente certainement ce qui se passera dans quelques mois, voir quelques années, le jeu qui est en fait émulé est Splatoon 2. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208462/in-switch-non-ryujinx-ne-permet-pas-demuler-la-switch-2-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1208462/in-switch-non-ryujinx-ne-permet-pas-demuler-la-switch-2-2.png"
        }
    },
    "news_2": {
        "title": "[Switch] MigFlash propose le firmware 1.2.2",
        "content": "La Team MigFlash vient de mettre en ligne un nouveau firmware à destination de sa solution, le firmware 1.2.2 proposé grâce au soutien d'un utilisateur, qui souhaite rester anonyme, améliore MigFlash. \n \nCela passe par une amélioration de la vitesse de lecture sur les ROMs trimmées, mais aussi la Team MigFlash parle d'une amélioration de la stabilité. Enfin, la Team explique avoir commencé à distribuer des récompenses, à hauteur de 0.2 ETH, soit 440 euros pour des problèmes signalés et qui ont été corrigés dans cette mise à jour. \n \n \n\n \n \n \nChangelog : \n \n- Vitesse de lecture hors bande améliorée dans les ROMs trimmées\n- Stabilité améliorée\n \n \nTéléchargement : Firmware 1.2.2 MigFlash\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208460/in-switch-migflash-propose-le-firmware-122-1.png"
        }
    },
    "news_3": {
        "title": "[PS4] Sony sort le firmware 12.52 et il est plutôt inoffensif",
        "content": "Sony vient de mettre en ligne le nouveau firmware 12.52 pour la PS4, il s'agit là d'un firmware mettant à jour la sécurité de la console puisqu'aucun changelog n'est publié. \n \n \n\n \n \n \n \nCette mise à jour 12.52 propose des corrections sur la sécurisation, le changelog n'est pas très détaillé :  - Nous avons apporté quelques correctifs de sécurité au logiciel système.\n \n \nCompte tenu des évolutions apportées, le développeur Al-Azif propose déjà la mise à jour du PS4-HEN avec le support de ce nouveau firmware 12.52 ! \n \nLe développeur Zecoxao nous informe que ce firmware ne patche pas le syscon, il semble cependant selon lui corrige un élément qu'il n'arrive pas à définir. \n \nPetit détail amusant, le loader n'est pas encore à jour, il est donc impossible de s'en servir. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208451/in-ps4-sony-sort-le-firmware-1252-et-il-est-plutot-inoffensif-1.jpg"
        }
    },
    "news_4": {
        "title": "[PS5] PS5 BDJB Modified ISOs v1.19 disponible",
        "content": "Le développeur Viktorious-x est de retour et propose une nouvelle version de son outil PS5 BDJB Modified ISOs, plus d'un mois après la v1.18 qui n'avait juste qu'apporté la mise à jour d'etaHEN en 2.2.\n \nComme à chaque version Umtx1 a gagné en stabilité, il propose des corrections de bugs, et de nombreuses modifications liés aux payloads. Le changelog est assez détaillé ce qui est plutôt une bonne nouvelle pour connaitre les changements apportés à cette version.\n \n \n\n \n \n \n \nNouvelles fonctionnalités/modifications :\n \n- Stabilité accrue\n \n- Corrections de bugs\n \n- Les délais entre les charges utiles dans tous les pipelines ont été réduits pour des temps plus rapides, mais sans diminuer la stabilité\n \n- Numéro de version (v19) inclus sur la vignette et sur le texte rebondissant dans le menu\n \n- Les noms des pipelines ont été modifiés pour un son un peu meilleur\n \n- Modifications de conception des icônes du loader de pipeline, du loader de disque jar, du loader USB jar, de l'ELF, du loader bin et du loader de jar distant pour ressembler davantage aux icônes de l'application du menu d'accueil de la PS5.\n \n \n \nModifications des payloads :\n \n- airpsx.elf ajouté par barisyild compilé dans un JAR nommé 9.airpsx.jar\n \n- ftpsrv.jar mis à jour avec la dernière version de ftpsrv.elf par John Tornblom et recompilé pour de meilleures performances/stabilité\n \n- websrv.jar mis à jour avec la dernière version de websrv.elf par John Tornblom\n \n- elfldr.jar mis à jour avec la dernière version de elfldr.elf par John Tornblom et a été également mis à jour le code source : pom.xml et JAR ajouté pour la compilation du fork de BD-J Elf Loader de cryonumb\n \n- Loader HEN BD-J par@BenNoxXD mis à jour vers la version 2.2B , ce qui augmente considérablement la stabilité !\n \n- 8.CloseDisk.jar par@BenNoxXD mis à jour et renommé en !.Closedisk.jar, il s'agit donc du premier payload parmi tous les payloads JAR du disque\n \n \nTéléchargement : PS5 BDJB Modified ISOs v1.19\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208427/in-ps5-ps5-bdjb-modified-isos-v119-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS4] shadps4 v0.10.0 nom de code &#34;The Last LNDF&#34;",
        "content": " \nSurprise, personne n'attendez une telle sortie, mais les développeurs de shadps4 propose une nouvelle branche 0.10.0 de leur émulateur, même si cette version se destine et est dédiée à l'un de nos développeurs, LNDF, responsable d'une grande partie du nouveau code GPU, notamment de l'implémentation de l'accès direct à la mémoire (ADM) pour la mémoire vidéo, elle a été rendue publique. \n \nCe n'est pas un projet solo, mais le reste de l'équipe a également apporté bien d'autres mises à jour à l'émulateur, améliorant la compatibilité avec des titres connus comme PT, Driveclub, inFAMOUS, Bloodborne, The Last Guardian, Shadow of the Colossus (même si celui-ci ne démarre toujours pas sans quelques modifications supplémentaires) et bien d'autres.\n \nLa grande nouveauté de cette version est la fonction de lecture différée (readbacks), qui émule la mémoire partagée de la PS4 en lisant la mémoire modifiée du GPU vers le CPU. Cela permet à beaucoup plus de jeux de fonctionner correctement, corrige les explosions de vertex dans Bloodborne et des jeux similaires, corrige presque entièrement l'upscaling de Trico dans The Last Guardian, et bien plus encore. Cette fonctionnalité n'est cependant pas activée par défaut, vous devrez l'activer manuellement dans le fichier de configuration, car elle est encore très expérimentale et peut perturber certains jeux. De plus, elle a un impact non négligeable sur les performances.\n \n \n\n \n \n \nChangelog 0.10.0\n \nCore :\n- devtools : Ajout une visionneuse de modules\n- equeue : correction de l'assertion WaitEqueue sur nullptr et déplacement de la petite vérification du minuteur vers WaitForEvents\n- Nettoyage et correctifs de la mémoire (beaucoup)\n- Corrections d'affinité Pthread\n- Émuler le comportement d'initialisation de libSceGnmDriver\n- equeue : correction de la transmission des données utilisateur dans les événements de file d'attente déclenchés par l'utilisateur\n- mémoire : réduire le seuil de blocage à 2 Mo\n- Journalisation sceKernelMapNamedFlexibleMemory améliorée et ajout de diverses exportations de fonctions\n- cpu_patches : correctif movntss et movntsd\n- equeue : correctifs HrTimer\n- système de fichiers : correctifs pour posix_rename et write\n- entrée : désactiver les mappages de raccourcis clavier non mappés et ajouter des palettes XBox\n- entrée : Remplacer le comportement du bouton Retour par une solution réattribuable pour le pavé tactile gauche, droit et centre\n- entrée : émuler les commandes de mouvement avec une souris\n- entrée : nettoyage du code et de la documentation\n- noyau : vérifier le module renvoyé dans sceKernelGetModuleInfoFromAddr\n- bit_array : supprimer l'opérateur non constant~\n- paramètres : mettre à jour les fichiers de configuration obsolètes au démarrage\n \nLibrairies :\n- Ajout des stubs libSceCompanionUtil et libSceVoice\n- net : sceNetInetNtop implémenté\n- pad : corrige la gestion du pavé tactile et modifie le calcul du gyroscope\n- np_manager : ajout d'une option permettant à un faux utilisateur de se connecter au PSN\n- zlib : corriger les files d'attente de requêtes\n- video_out : correction du comportement d'erreur sceVideoOutGetResolutionStatus\n- videodec2 : mettre à jour les structures pour correspondre aux nouveaux firmwares\n- np_trophy : modifier le contexte initial et gérer les valeurs\n- np_trophy : correction d'un crash potentiel hors limites\n- noyau : stub out SetGPO et GetGPI\n- ngs2 : initialiser le handle système dans la bibliothèque HLE Ngs2\n- video_out : ajouter des chemins de code alternatifs pour gérer le comportement des structures héritées dans sceVideodec2GetPictureInfo\n \nRecompilateur de shaders\n- Correction du type de flottant incorrect sur FPRecip64\n- Opcodes implémentés : V_CVT_F64_U32, V_RCP_LEGACY_F32, S_FLBIT_I32_B64, BUFFER_ATOMIC_CMPSWAP, DS_READ_U16, DS_WRITE_B16, DS_ADD_U64, BUFFER_ATOMIC_SMAX_X2, BUFFER_ATOMIC_<U|S><MAX|MIN>_X2 et V_CMP_EQ_U64\n- Corrections diverses d'opcodes\n- Gérer le bit R128 dans les instructions MIMG\n- Fournir une couleur de bordure personnalisée aux échantillonneurs\n- Mettre en œuvre un mélange de sources doubles\n- Implémenter la prise en charge de l'interpolation linéaire\n- Meilleure gestion du scénario de shader géométrique G\n- Patcher le walker SRT sur l'erreur de segmentation\n- Gestion des attributs de fragment de nettoyage\n- Divers correctifs pour la mémoire partagée et les atomiques\n- Réduire les cas où le passage de la mémoire partagée au tampon est nécessaire\n- Corriger la définition de la mémoire partagée lorsqu'un seul type est utilisé\n- Gérer les échantillonneurs en ligne immédiats\n- Corriger certains accès à la mémoire partagée lorsque la structure du groupe de travail est omise\n- Implémenter les instructions atomiques fmin/fmax du tampon\n- Correction de la gestion de l'image de profondeur non liée\n- Optimiser le cas général d'adressage de tampon\n- Marquer l'image comme écrite lorsqu'elle est utilisée avec des éléments atomiques\n \nGPU\n- video_core : implémenter l'accès direct à la mémoire\n- Correction de l'étendue de l'image dans la copie tampon vers l'image\n- texture_cache : gérer le chevauchement avec une adresse égale et un mode de mosaïque différent\n- Liverpool : Opcodes PM4 0x8E (GetLodStats) et 0x20 (SetPredication)\n- Liverpool : implémentation du code d'opération PM4 0x22 (CondExec)\n- texture_cache : correction du comportement d'ExpandImage\n- buffer_cache : meilleure recherche d'images pour la validation des tampons\n- texture_cache : gérer les vues compressées des images non compressées\n- buffer_cache : données en ligne vers le processeur, sauf si le processeur graphique est modifié\n- tile_manager : rétrograder l'assertion en erreur\n- texture_cache : gestion de base des images partiellement résidentes\n- Liverpool : gérer les PM4 de type 2 dans l'ACB\n- Vulkan : correction de deux erreurs de validation introduites par des modifications de mémoire partagée\n- texture_cache : implémenter des copies couleur<->profondeur\n- buffer_cache : Augmenter la taille du tampon de transfert local du périphérique\n- texture_cache : implémenter la couleur dans le passage blit à profondeur multi-échantillonnée\n- vulkan : activer sampleRateShading\n- vulkan : enregistrer les utilisations de formats d'image incorrects\n- video_core : optimisation du gestionnaire de pages/gestionnaire de régions\n- video_core : améliorations du gestionnaire de pages et du suivi de la mémoire\n- vk_rasterizer : utiliser shared_first_mutex\n- vector_alu : améliorer la gestion des modèles d'ajout/consommation mbcnt\n- buffer_cache : correction de divers problèmes de threads lors du téléchargement et de l'invalidation des données\n \nGUI (interface graphique) :\n- Un certain nombre de mises à jour de Crowdin\n- auto_update : correction d'une erreur du journal des modifications\n- game_list : définir la taille minimale de la liste des icônes sur 48\n- qt : mise à jour vers la version 6.9.1\n- qt : enregistrer les paramètres de l'interface graphique dans un fichier séparé\n- remapping_gui : si des entrées uniques en double sont trouvées, afficher les boutons qui ont des doublons\n- remapping_gui : mettre à jour l'interface graphique avec de nouvelles entrées du pavé tactile\n- game_list : favoris dans la liste des jeux\n- remapping_gui : réécriture du menu Contrôleur et ajout de correctifs mineurs à celui du clavier et de la souris\n \nDivers :\n- fork_detection : réparer les liens distants SSH\n- Build : ajouter la dépendance manquante pour Fedora\n- lancement : lancez les jeux en fournissant leur dossier au lieu du chemin eboot\n- lancement : ajouter une option pour ignorer le correctif du jeu\n- Build : le nom du paquet a été modifié en openal-soft-devel, reflétant le changement de nom du paquet Fedora\n- ci : contournement du problème Qt sur le nouveau Xcode\n- Build : ajouter CMakePresets.json et augmenter le nombre de configurations\n- Build : Note de mise à jour sur le clonage récursif\n- Build : Détection automatique du chemin d'installation de Qt sous Windows\n \n \n \nTéléchargement : shadps4 v0.10.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208425/in-ps4-shadps4-v0100-nom-de-code-the-last-lndf-1.jpg"
        }
    },
    "news_6": {
        "title": "[Vita] AutoPlugin II v2.16 disponible",
        "content": "L'équipe ONElua vient de publier une nouvelle version d'AutoPlugin II qui est maintenant proposé en v2.16. Pour rappel, il s'agit d'un programme phare destiné à la PlayStation TV et à la PSTV, AutoPlugin II qui passe désormais en version 2.00.\n \nComme vous le savez, le logiciel AutoPlugin a été l'homebrew le plus téléchargés de la scène PlayStation Vita développé par theheroGAC et qui permettait d’installer facilement des plugins. L'équipe Onelua a ensuite repris le flambeau dans cette version II qui ajoute encore des caractéristiques plus complètes. De temps en temps une nouvelle version d'Autoplugin II est proposée, là il s'agit de la v2.16 qui succède à la v2.15. \n \n \n\n \n \nAutoPlugin II v2.15 :\n \nChangelog 2.15 : \n- Police pvf par défaut pour le polonais.\n- Ajout du mod PSVshell par RaanGi.\n- Ajout du mod NoPspEmuDrm par Kethen.\n \nChangelog 2.16 : \n- Erreur corrigée sur le portugais\n \nTéléchargement : AutoPlugin II v2.16\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208414/in-vita-autoplugin-ii-v216-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[PS5] EchoStretch travaille sur le support du firmware 8.20 pour Kstuff",
        "content": " \nLe développeur EchoStretch a dévoilé par erreur une version de test du payload Kstuff, rapidement retiré désormais. Cette version, qui est un fork de la version de LightningMods, est une mise à jour de Kstuff. Jusqu'à présent Kstuff supporte l'intégralité des firmwares compris entre le 3.00 et le 7.61, mais pas au dessus. \n \n \n\n \n \nCette version en work in progress a été retirée par EchoStretch car dévoilée trop tôt, elle est arrivée avec un changelog .. \n \n- Support 3.00 à 8.20 sur PS5 pour lancer les FPKG PS4 et certains homebrews. \n- Contruit avec la dernière version du SDK \n- Mise à jour de Kstuff vers la nouvelle source \n \nVoilà le message qu'EchoStretch vient de dévoiler sur X :\n \n \nDésolé tout le monde ! Je pensais que le dépôt était privé. La version 8.xx n'est pas encore terminée, car j'ai rencontré un problème. Je travaille actuellement dessus en solo, donc la progression est un peu lente. De plus, le code de Sleirsgoevy n'est pas très facile à comprendre, ce qui complique encore la tâche.\n \n \nNous le voyons et cela le prouve une nouvelle fois que la scène bouge grâce à quelques développeurs qui passent leur temps à chercher les offsets, ou des solutions pour apporter le hack sur des firmwares plus récents, nous ne pouvons que les remercier. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208402/in-ps5-echostretch-travaille-sur-le-support-du-firmware-820-pour-kstuff-1.png"
        }
    },
    "news_8": {
        "title": "[Wii] NUSGET v1.4.2 disponible",
        "content": "Le développeur NinjaCheetah propose une nouvelle version de NUSGET qui est maintenant proposé en v1.4.2, il s'agit de la cinquième version de 2025 de cet outil qui permet de télécharger des contenus Nintendo. \n \nS'appuyant sur Python et Qt6, NUSGET s'emploie avec des bibliothèques libWiiPy et libTWLPy afin de proposer une solution moderne. NUSGet est écrit en Python et fonctionne sous Windows, MacOS, ou Linux, contrairement à NUS Downloader qui ne fonctionne que sous Windows, et surtout il comporte moins de bugs. NUSGet peut aussi vous permettre d'accéder à des titres vWii, de regrouper des titres DSi sous le nom de TAD. \n \n \n \n\n \n \n \nDans cette nouvelle version, le développeur a rajouté de nouvelles options de personnalisation, comme pour le thème graphique et la langue de l'interface qui sont désormais accessible depuis le menu \"options\". \n \nLes fichiers de configuration macOS ont vu leur chemin d'enregistrement changer conformément aux conventions de l'OS d'Apple. \n \nA noter enfin que la traduction française a été corrigée par rougets, un grand merci à lui. \n \nChangelog : \n \n\n- NUSGet affiche désormais une barre de progression sous le texte du journal indiquant la progression du téléchargement du TMD, du ticket et de chaque contenu individuellement.\n- Veuillez noter qu'actuellement cette fonctionnalité n'est prise en charge que pour les titres Wii/vWii, car elle dépend de fonctionnalités de libWiiPy qui ne sont pas présentes dans libTWLPy pour le moment.\n- Grâce à l'affichage visuel de la progression du téléchargement, la zone de texte du journal a été légèrement raccourcie, car dans la plupart des cas, vous n'avez pas besoin de pouvoir voir très loin en arrière.\n- Vous pouvez désormais définir manuellement le jeu de couleurs de NUSGet via Options -> Thème dans la barre de menus.\n- Vous pouvez désormais définir manuellement la langue de NUSGet via Options -> Langue dans la barre de menus.\n- NUSGet stocke désormais son fichier de configuration dans ~/Library/Application --Support/NUSGet/macOS, au lieu de ~/.config/NUSGet/.\n\n \n \nTéléchargement : NUSGET v1.4.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208401/in-wii-nusget-v142-disponible-1.jpg"
        }
    },
    "news_9": {
        "title": "[Vita] Vita Moonlight 0.12.1 disponible",
        "content": "Le développeur AorsiniYT nous propose de découvrir une nouvelle version de Vita Moonlight. Comme vous le savez Moonlight permet de streamer votre pc sur l'écran de votre onsole. Pour rappel, ce logiciel est basé sur nVidia Gamestreams.\n \nS'agissant d'un homebrew vous aurez besoin d'une PlayStation Vita avec HENkaku et VitaShell d'installés, d'un client FTP et surtout votre ordinateur devra être sous Windows et être équipé d'une carte graphique nVidia (minimum GTX 650).\n \n \n\n \n \nChangelog 0.12.1 : \n \nPrincipales caractéristiques :\n- Correction du couplage automatique\n- Couplage fiable directement depuis Vita via « Rechercher un appareil » - aucune étape manuelle requise\n- Prise en charge tactile absolue (bêta)\n- Commandes tactiles expérimentales pour un gameplay amélioré\n- Gyroscope d'intégration de commandes de mouvement visant des expériences de mouvement immersives\n- Clavier flottant surélevé : Le clavier superpose désormais le contenu sans masquer l'écran (voir capture d'écran ci-dessous)\n \nGestion améliorée des hôtes :\n- Indicateurs d'état : En ligne (vert), Hors ligne (rouge), Mise à jour IP nécessaire (jaune)\n- Détection automatique de changement d'IP avec boîte de dialogue de confirmation\n- Actualisation manuelle via le bouton triangle dans les menus\n \nOptimisation du réseau :\n- Nouveau sniffer mDNS modulaire pour une découverte plus rapide des appareils\n- Bibliothèques mises à jour : moonlight-common-c, enet, inih\n \nAméliorations de l'interface utilisateur et de l'expérience utilisateur\n- Gestion robuste des champs hôtes manquants/vides\n- Changelog de débogage et gestion des erreurs améliorées\n \nSous le capot :\n- Nombreuses corrections de bugs et améliorations de stabilité\n- Nettoyage et optimisation complets du code\n \nTéléchargement : Vita Moonlight 0.12.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208400/in-vita-vita-moonlight-0121-disponible-1.png"
        }
    },
    "news_10": {
        "title": "[Wii/vWii] USB Laoder GX v4.0 r1283 disponible",
        "content": "L'un des loaders le plus célèbre de la scène Nintendo Wii est de retour, voici que débarque la version r1283 de la v4.0 d'USB Loader GX.\n \nCette mise à jour corrige plusieurs problèmes de la dernière mise à jour majeure . Parmi ceux-ci figurent des plantages lors du chargement des partitions NTFS et un problème de détection des partitions sur les disques durs. Le calcul de la taille des partitions et la réactivité de l'interface ont également été améliorés.\n \n \n\n \n \n \nChangelog \n \nAmélioration / Nouveautés :\n- Amélioration de la façon dont les tailles de partition sont calculées et actualisées\n- Amélioration de la réactivité de l'interface graphique en ajustant le moment où le cache est chargé\n- Amélioration de la façon dont un patch régional est appliqué pour les jeux GameCube japonais\n- Mise à jour de la traduction coréenne (merci à DDinghoya)\n- Amélioration de GitHub CI\n \nCorrections : \n- Correction des plantages lors de l'utilisation de partitions NTFS\n- Correction de certains problèmes de détection de partition\n \nTéléchargement : USB Laoder GX v4.0 r1283\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208380/in-wiivwii-usb-laoder-gx-v40-r1283-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[PSP/Vita] PSP ARK-4 Rev 186 : Revival",
        "content": "Certains d'entre vous ont peut-être déjà entendu parler de PSP ARK-4, comme vous le savez la principale différence entre ARK et Adrenaline sur les consoles PlayStation Vita et PlayStation TV est qu'il ne nécessite pas l'exécution de l'exploit HENkaku. ARK est un portage du PRO CFW, il s'agit plutôt d'un eCFW (Custom Firmware de la PSP sur Playstation Vita), tout comme TN-C il peut démarrer les homebrews et les jeux de la première PSP et PSX, mais il ne peut faire tourner d'homebrews sur Vita, il faudra obligatoirement passer pour cela par HENkaku.\n \n \n \n\n \n \n \nChangelog : \n \n- Amélioration de la stabilité de Extra RAM pour Adrenaline et pour la version Standalone.\n- NoPspEmuDrm a été mis à jour.\n- Nouveau cIPL qui est maintenant par défaut.\n- Implémentation dans l'API CFW API de la fonction sctrlHENSetMemory\n- Amélioration des patchs de changement de région UMD\n \n \nTéléchargement : PSP ARK-4 Rev 185\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208379/in-pspvita-psp-ark-4-rev-186-revival-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] MigFlash dévoile son bounty program et son firmware 1.2.1",
        "content": " \nAssez critiqué mais jamais à terre, l'équipe MigFlash vient de publier un nouvel article sur son site officiel. L'équipe présente un tout nouveau firmware 1.2.1 qui vient donc succéder au 1.2.0 proposé il y a 15 jours. \n \nIl y a dans ce firmware à priori 3 améliorations : \n \n- Une logique améliorée pour que le MigFlash se comporte encore plus comme une carte de jeu officielle\n- Une logique améliorée pour MigFlash v1\n- Une meilleure prise en charge des ROMs trimées (découpées)\n \nL'équipe tient à remercier TotalJustice pour son aide à l'amélioration de MigFlash, et affirme avoir poussé de nombreux tests avec ce firmware 1.2.1 pour s'assurer que le linker soit quasiment identique à une vraie carte de jeu, et donc indétectable par Nintendo. \n \n \n\n \n \n \n \nDans son message, l'équipe MigFlash semble faire une sorte de méa culpa : \n \n \nMais nous ne sommes pas parfaits, c'est pourquoi nous avons décidé de mettre en place une prime pour tous les membres de cette formidable communauté qui peuvent la saisir s'ils parviennent à détecter MigFlash et nous aider à améliorer notre produit.\n \nSi vous pensez être capable d'améliorer MigFlash, veuillez nous envoyer une preuve et des détails vérifiables par e-mail : contact AT migflash DOT com ou en utilisant notre formulaire de contact.\n \nVous pouvez demander à rester anonyme ou nous indiquer le nom/alias que nous pourrons citer dans la prochaine mise à jour de notre firmware.\n \nÀ notre discrétion et selon la gravité du problème, nous vous offrirons jusqu'à 1 (un) Ethereum à créditer sur le portefeuille que vous nous fournissez (NDLR : soit environ 2 180 euros à l'heure où l'article est écrit), en guise de remerciement pour votre contribution, au nom de tous les utilisateurs de MigFlash.\n \nAvertissement : Bien que nous soyons certains qu'aucun utilisateur légitime de MigFlash ne sera banni s'il utilise notre produit conformément à nos conditions comme périphérique de sauvegarde/confort et de préservation de jeu, nous ne pouvons offrir aucune garantie contre le bannissement. Nous déclinons toute responsabilité et n'offrirons aucune compensation ni remboursement en cas de bannissement, quelles que soient les preuves fournies par l'utilisateur.\n \n \n \nBref, comme nous pouvons le voir, ce bounty program est avant tout pour reconnaitre que les bans existent et que la team est impuissante contre cela, malgré tous les efforts mis en place, il semblerait que ce message soit un coup d'épée dans l'eau. Cela signifie quoi, qu'il faut mettre à jour en 1.2.1 pour être sur un espace un peu plus sécurisé que le 1.2.0 qui ne l'était finalement pas ? La mise en place de ce bounty program est aussi la preuve que la solution reste à améliorer et que la prochaine version sera encore plus safe que ne le sera la 1.2.1. \n \n \nTéléchargement : Firmware 1.2.1 MigFlash\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208312/in-switch-migflash-devoile-son-bounty-program-et-son-firmware-121-1.png"
        }
    },
    "news_13": {
        "title": "[PS4] ItemzFlow mis à jour en v1.07",
        "content": "Décidemment il n'y en a que pour la PS4 ce matin, le développeur LightningMods propose lui aussi la mise à jour d'une de ces célèbres propositions, ItemzFlow qui profiter lui aussi des dernières évolutions de la scène PS4. \n \nComme souvent avec le développeur LightningMods, les choses ne sont pas faites à moitié, les changements ne se limitent pas au seul support des firmwares 11.xx et 12.xx, bien que nous devons ces évolutions à notre ami BestPig.\n \n \n\n \n \n \nChangelog 1.07 :\n \n- Ajout de l'option permettant de copier depuis la sandbox au lieu de copier depuis l'image PFS\n- Offsets FUSE mis à jour pour 11.xx et 12.xx par BestPig\n- Correction d'un problème provoquant un décalage d'itemzflow avec les thèmes personnalisés (tentative de chargement des images d'interface utilisateur à partir des thèmes)\n- Ajout de la prise en charge de la langue ukrainienne (pas encore traduite)\n- Ajout d'un message « Ne demandez plus » au message de couverture du démarrage\n- Remplacement du paramètre avancé du message de couverture par une option permettant de tuer le démon à la fermeture de l'application (principalement pour le mode repos)\n- Ajout d'une police par défaut afin qu'elle cesse d'utiliser la police intégrée sur les anciens micrologiciels\n- Détection de correctif PKG mise à jour pour le programme d'installation PKG\n- Correction d'un problème avec le contrôle de version d'itemzflow\n \n \n\n \n\n \n \n\n \nTéléchargement : ItemzFlow 1.07 (version ItemzCore : 1.07-V-2025-07-02T16:39:59)\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208311/in-ps4-itemzflow-mis-a-jour-en-v107-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1208311/in-ps4-itemzflow-mis-a-jour-en-v107-1.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1078261875.jpg"
        }
    },
    "news_14": {
        "title": "[PS4] PS4-HEN supporte désormais le firmware 12.50",
        "content": "La scène PS4 est en pleine effervescence, il faut dire que les avancées récentes du hack sur les derniers firmwares fait bien bouger les choses, le développeur Al-Azif nous le prouve en intégrant le support du dernier firmware 12.50 dans la proposition collective PS4-HEN.\n \nAprès avoir ajouté le support des firmwares 8.xx et réalisé quelques ajustements techniques, notamment dans la structure des chemins et des offsets pour améliorer le support sur 5.05 et firmware inférieurs au 6.50, le développeur a donc travaillé sur l'intégration du support du firmware 12.50.\n \n \n\n \n \nTéléchargement : PS4-HEN\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208310/in-ps4-ps4-hen-supporte-desormais-le-firmware-1250-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS4] GoldHEN v2.4b18.4 de SiSTRo disponible",
        "content": "Le développeur SiSTRo dévoile une nouvelle version de son payload magique GoldHEN qui est désormais  proposé en v2.4b18.4. \n \nEncore et toujours GoldHEN est le must-have de la PS4, cette version est cependant une pre-release considérée comme une Bêta, le développeur s'excuse car il a été très occupé ces dernières semaines, comme tout un chacun. \n\n \n \nCette nouvelle version apporte le support des firmwares 12.00 et 12.02, il annonce aussi que la  prochaine version ajoutera de nouvelles fonctionnalités (encore en test) et le support de nouveaux firmwares ! Comme toujours, il tient à remercier ses amis ctn et kameleon pour leur soutien continu, pas seulement technique mais aussi à tout ceux qui ont soutenu le projet sur kofi ! \n \n \n\n \n \nChangelog 2.4b18.4 : \n \n- Ajout du support pour le firmware 12.00 \n- Ajout du support pour le firmware 12.02 \n \nComme toujours, gardez en tête qu'il s'agit d'une version bêta et que malgré les vérifications minutieuses et celles des testeurs, des bugs peuvent apparaître.\n \n \nTéléchargement : GoldHEN v2.4b18.4\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208309/in-ps4-goldhen-v24b184-de-sistro-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1208309/in-ps4-goldhen-v24b184-de-sistro-disponible-2.png"
        }
    },
    "news_16": {
        "title": "[3DS/WiiU/Switch] Le rapport sur la vulnérabilité dévoilé 7 ans après son signalement",
        "content": "Sept années après son signalement, le rapport sur un bug remonté en 2018 vient d'être dévoilé, ce bug portait sur les Nintendo 3DS, Wii U et Switch. \n \nLe chercheur en sécurité, Kinnay, avait envoyer au bug bounty program HackerOne, un rapport portant le numéro 469997 et qui fournissait une vulnérabilité au coeur du matchmaking sur les serveurs de Nintendo. \n \nCe bug, aujourd'hui résolu, a suscité un certain intérêt à l'époque, s'appuyant sur une fonction nommée UnicodeToUtf8 qui convertissait les adresses IP au format spécifique UTF-8 pendant le processus de mise en correspondance. \n \n \n\n \n \nLe bug en question présent dans la gestion des entrées IP provoquait une corruption de mémoire, et ainsi ouvrait la voie à des exploits potentiels.\n \nSur 3DS et Switch, le plantage lié au bug permettait d'obtenir l'exécution RCE en contournant les protections ASLR, tandis que sur Wii U, l'exécution du code aurait été directe du fait du manque d'ASLR, il aurait été facile de mettre en oeuvre une chaîne ROP.\n \nSi l'histoire vous intéresse, le rapport se trouve ici : hackerone\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208150/in-3dswiiuswitch-le-rapport-sur-la-vulnerabilite-devoile-7-ans-apres-son-signalement-1.png"
        }
    },
    "news_17": {
        "title": "[PS4] PS4HEN repris par Al Azif compatible avec les firmwares 5.05 à 12.02",
        "content": "Le développeur Al Azif a repris l'hébergement du PS4HEN, le PS4HEN est l'une des plus belles histoires de la PS4, engageant de nombreux développeurs comme SisTr0, EchoStrech, qwertyoruiopz, SpecterDev, zecoxao, Joonie et c'est désormais Al Azif qui a décidé de l'améliorer et de l'héberger. \n \nAinsi PS4HEN est désormais hébergé sur le dépôt collectif qui permet à l'ensemble des développeurs d'apporter leur amélioration. Ce gitbuh collectif contient la version 2.1.5 de PS4HEN , compatible avec les firmwares entre 5.05 et 12.02, tout en incluant de nombreuses fonctionnalités avancées, notamment la prise en charge des homebrews, des plugins, des disques durs externes, de la VR, de l'installation de packages à distance et du contournement de la vérification du firmware.\n \n \n\n \n \n \nCertains modules ont été améliorés, comme des modules PRX dans ScePartyDaemon, ou encore il y a la présence d'un serveur FTP, la journalisation du kernel et des options de débogage. \n \nDe nouvelles contributions comme celle d'illusion0001 ou d'EchoStrech vont encore améliorer le projet qui se trouve désormais ici : ps4-hen\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208148/in-ps4-ps4hen-repris-par-al-azif-compatible-avec-les-firmwares-505-a-1202-1.jpg"
        }
    },
    "news_18": {
        "title": "[XB360] Une mise à jour disponible pour la Xbox 360",
        "content": "Les constructeurs nous surprendrons toujours, Microsoft vient de mettre en ligne une mise à jour firmware pour la Xbox 360. Nous la pensions tranquille, mise au repos des mises à jour, mais il n'en est rien, Microsoft a publié une mise à jour pour la Xbox 360 qui a pour ambition d'améliorer l'interface de la console ainsi que l'écran d'accueil.\n \nAprès la fermeture de la boutique officielle il y a un an, en Juillet 2024, le Dashboard a été réduit à l'essentiel, cependant quelques vignettes de jeux ont été déformées ou manquantes. Comme vous pouvez vous en doutez, Microsoft n'a pas changé ou fait évoluer le kernel ou les sécurités de la console, cette mise à jour est purement esthétique. \n \n \n\n \n \nLa firme de Redmond a simplement modifié un fichier XML fourni directement par le serveur Xbox Live, qui gère l'affichage du contenu sur l'écran d'accueil. Grâce à ce changement, les aperçus des titres s'affichent à nouveau correctement. L'écran d'accueil présente également deux grandes bannières publicitaires dédiées aux consoles Xbox Series X|S , qui occupent une part importante de l'espace visuel.\n \nIl s'agit davantage d'un petit restilage dynamique du Dashboard, l'information provient d'un utilisateur de Reddit, il affirme que la page d'accueil affiche désormais quelques publicités pour les consoles Xbox Series X|S et affiche correctement les vignettes des jeux, qui étaient auparavant étranges. De nombreux autres utilisateurs de la Xbox 360 signalent également ce changement.\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208113/in-xb360-une-mise-a-jour-disponible-pour-la-xbox-360-1.jpeg"
        }
    },
    "news_19": {
        "title": "[Switch] Le projet SDEX2M2 porte sur 3 solutions",
        "content": "Le projet SDEX2M2, celui qui a pour ambition d'exploiter le port microSD Express de la Nintendo Swutch 2, a quelque peu évolué. Au départ le projet consistait a proposer les plans pour construire un PCB pour y coupler un NVMe de type SSD ou mémoire flash.\n \n \n \n\n \n \nDésormais ce sont 3 solutions qui sont portées par SDEX2M2, à savoir la création d'une carte de sortie, appelée \"la clé\" (\"The Key\"), il s'agit d'une carte de dérivation du signal microSD Express. \n \n \n\n \n \nLa seconde solution est un PCB qui permet de coupler un NVMe de type SSD de format M2. \n \n \n\n \n \nEnfin la troisième est un PCB permettant de coupler une carte SD Express, ayant pour avantage ses grandes capacités et des lectures rapides selon les classes.\n \n \n\n \n \nIl s'agit donc là d'un adaptateur MicroSD Express vers SD Express pleine taille, extrêmement expérimental. Il permet d'insérer des cartes SD Express de pleine taille dans la Nintendo Switch 2, allant jusqu'à 128 TB de capacité de stockage, reste à savoir si la console acceptera cette capacité. Veuillez noter que ce produit n'a pas été testé, il reste possible que le signal soit probablement un problème dû à un manque de mise à la terre. \n \n \nTout est là : SDEX2M2\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208087/in-switch-le-projet-sdex2m2-porte-sur-3-solutions-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1208087/in-switch-le-projet-sdex2m2-porte-sur-3-solutions-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1208087/in-switch-le-projet-sdex2m2-porte-sur-3-solutions-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1208087/in-switch-le-projet-sdex2m2-porte-sur-3-solutions-4.png"
        }
    },
    "news_20": {
        "title": "[PS4] PlaySon 3.7.27 Beta disponible",
        "content": "Le développeur Sondio propose la version 3.7.27 de PlaySon, une application Android distribuée sous format APK afin de lancer le hack facilement sur PlayStation 4 sous tous les firmwares exploitables de la console. \n \n \n\n \n \nPrise en charge d'Android à partir de l'API 19, avec/sans accès root :\n \n- Serveur local\n- Expéditeur de la charge utile\n- Installer/mettre à jour les Pkg/Cheats/Patches\n- Affichage des paquets\n- Prise en charge du thème/Dlc/App/jeu pour l'installation/désinstallation/vérification\n- Modifier/sauvegarder/restaurer le nom/avatar du profil de l'utilisateur PS4\n- (avec root) Créer/Formater une clé USB avec goldhen.bin ou exfathax_pico.img\n- Activer/désactiver les patchs GoldHEN\n- Visionneuse de klog de GoldHEN\n- Supporte la dernière version de GoldHEN 2.4b18\n- Support de deux types de JB : \navec accès Root et adaptateur OTG-LAN -> exploit PPPwn et bloqueur DNS avec les derniers stage1 et stage2 (1.03 par SISTR0) pour :\nFW 7.00 / 7.01 / 7.02\nFW 7.50 / 7.51 / 7.55\nFW 8.00 / 8.01 / 8.03\nFW 8.50 / 8.52\nFW 9.00\nFW 9.03 / 9.04\nFW 9.50 / 9.51 / 9.60\nFW 10.00 / 10.01\nFW 10.50 / 10.70 / 10.71\nFW 11.00\n \nsans accès Root -> psfree uniquement (pour l'instant) :\nFW 7.00 au 9.60 désormais\n \n \nLe changelog du 25 Juin 2025 fait état de ce changement important. \n \nChangelog : \n \n- Ajout de lapse porté sur PS4 FW 7.00 <> 9.60 par Al Azif (ATTENTION : peut causer des problèmes avec certains jeux/applications comme un écran noir ou des sauvegardes corrompues. Pas 100 % stable.) \n- Ajout du support pour le jailbreak hors ligne \n \n \nTéléchargement : PlaySon 3.7.27 Beta\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208079/in-ps4-playson-3727-beta-disponible-1.png"
        }
    }
}