{
    "news_1": {
        "title": "[PS5] Specter dévoile les slides de sa présentation",
        "content": "Le développeur Specter l'avait promis, il a réussi a cassé l'hyperviseur sur PS5, du moins une partie de celui-ci car comme nous avons vu son exploit basé sur deux vulnérabilités ne s'appuie que sur un coeur sur lequel la chaine ROP va tourner, l'hyperviseur étant toujours actif sur les autres coeurs.\n \n \n\n \n\n \n\n \n\n \n\n \n\n \n \nSon avancée, il l'a doit aussi à quelques autres développeurs, il tient à remercier ChendoChap pour la chaine ROP et le bug, Flatz pour les dumps de Kernel dumps et ses connaissances, Fail0verflow pour l'implémentation de l'exploit kernel UMTX et Kiwidog, Tihmstar, HardPwn pour leur contribution notamment pour le stuff des démos.\n \n \n\n \n\n \n \n\nAinsi comme promis il dévoile les slides de sa présentation, qui tiennent sur 94 pages, en réalité une trentaine, qui montre comment il a mis en application le contournement de l'hyperviseur sur le firmware 2.50.\n \n \n\n \n\n \n \nTous les slides de cette présentation en PDF se trouvent ici, ce que l'on peut dire c'est qu'encore une fois c'est grâce au concours de plusieurs personnes que ses avancées se font, et non pas grâce aux travaux d'une seule. \n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-5.png",
            "image_6": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-6.png",
            "image_7": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-7.png",
            "image_8": "https://www.logic-sunrise.com/images/news/1197803/in-ps5-specter-devoile-les-slides-de-sa-presentation-10.png",
            "image_9": "https://www.logic-sunrise.com/images/validation/in-285635555.png",
            "image_10": "https://www.logic-sunrise.com/images/validation/in-1799444927.png"
        }
    },
    "news_2": {
        "title": "[PS5] Specter publie son exploit Byepervisor &#34; Hypervisor &#34;",
        "content": " \nL'un des meilleurs développeurs, Specter, a présenté hier ses travaux sur l'hyperviseur de la PS5 sur les premiers modèles, il faut disposer d'un firmware 1.xx ou 2.xx pour profiter de ces avancées. \n \nActuellement il n'est utile que sur ces firmwares 1.xx et 2.xx, mais peut être que cela permettra de faire avancer le hack sur des firmwares plus récents. \n \nSpecter livre un fichier byepervisor.elf qui doit être chargé après UMTX, que ce soit via le webkit ou via l'exploit BD-J, ensemble la console va passer en mode repos, et redémarrer. \n \n \n \n\n \n \n \nL'idée dans le futur est : \n \n- Supporter plus de firmwares (offsets)\n- Faire en sorte que byepervisor.elf ne soit envoyé qu'une seule fois\n- Suspendre automatiquement le système \n- Patch vmcbs avec QA flags exploit pour dumper les données de l'hyperviseur.\n \n \n\n \n \nComme Specter l'a expliqué lors de sa présentation, ce sont deux vulnérabilités qui sont utilisées, elles sont indépendantes l'une de l'autre et l'une ou l'autre peut être utilisée. Un exploit est fourni principalement pour la préservation (/_old_jump_table_exploit), seule la chaîne d'exploitation principale doit être utilisée (QA flags exploit).\n \nLe premier exploit utilise une vulnérabilité où les tables de saut du code de l'hyperviseur sont partagées avec le kernel invité, et est contenu dans /_old_jump_table_exploit/. En détournant l'entrée de la table de saut pour l'hypercall VMMCALL_HV_SET_CPUID_PS4, l'exécution de code dans l'hyperviseur peut être réalisée. Nous exécutons une chaîne ROP qui désactive Nested Paging (NPT) et Guest Mode Execute Trap (GMET), ce qui nous permet de désactiver eXecute Only Memory (XOM) aka xotext dans les Page Table Entries (PTE) du kernel pour les dumper, ainsi que d'activer l'écriture dans les PTE pour hooker/patcher le kernel également.\n \nCette méthode nécessite un bon nombre de gadgets et de décalages d'offsets, ce qui est la principale raison pour laquelle cet exploit n'est pas le principal. De plus, il ne casse actuellement l'hyperviseur que sur le coeur sur lequel la chaîne ROP tourne, l'hyperviseur est toujours actif sur les autres coeurs et devrait être désactivé.\n \n \nTous les travaux sont ici :  Byepervisor\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197763/in-ps5-specter-publie-son-exploit-byepervisor-hypervisor-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197763/in-ps5-specter-publie-son-exploit-byepervisor-hypervisor-2.jpg"
        }
    },
    "news_3": {
        "title": "[Switch] NeXT 3.31 disponible",
        "content": "Le développeur Vampitech propose une nouvelle version de NeXT qui est désormais proposé en v3.31. Cette version semble davantage semble que la 3.30 Pre-release qui n'était pas une version finale contrairement à la 3.31. \n \nD'ailleurs avec la 3.31 Tinfoil et les Forwarders fonctionnent correctement, le firmware 19.0.0 ayant modifié le keyset il est possible que d'autres éléments soient instables. \n \n \n\n \n \nChangelog 3.31 : \n \nSys-con > 1.4.3\nSigmapatches > 19.0.0 v2\n \nMerci Vampitech ! \n \n \nTéléchargement : NeXT 3.31\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197757/in-switch-next-331-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[Switch] SwitchWave v1.0.0 disponible",
        "content": " \nLe développeur averne, à qui nous devons déjà Fizeau, Fuse-NX, ou encore un fork de FFmpeg, nous propose un tout nouveau lecteur vidéo intégrant l'accélération matérielle s'appuyant sur une restitution en utilisant le codec FFmpeg ainsi que mpv. \n \n \n\n \n\n \n\n \n\n \n \nChangelog : \n \n- Accélération matérielle personnalisée pour FFmpeg, avec mise à l'échelle dynamique de la fréquence. Les codecs suivants peuvent être décodés :\n         - MPEG1/2/4\n         - VC1\n         - H.264/AVC (10+ bit non supporté par le matériel)\n         - H.265/HEVC (12+ bit non supporté par le matériel)\n         - VP8\n         - VP9 (10+ bit non supporté par le matériel)\n- Support graphique personnalisé pour mpv utilisant deko3d, supportant :\n         - Lecture à 4k60fps\n         - Rendu direct (décodage logiciel plus rapide)\n         - Shaders de post-traitement personnalisés\n- Backend audio personnalisé pour le mpv utilisant les API natives de Nintendo, supportant des dispositions jusqu'à 5.1 surround\n- Lecture en réseau via Samba, NFS ou SFTP\n- Prise en charge des lecteurs externes à l'aide de libusbhsfs  \n- Interface utilisateur riche et réactive, même sous charge\n \n \nInstructions : \n \n- Téléchargez la dernière version, et extrayez-la à la racine de votre carte sd (faites attention à fusionner les dossiers et à ne pas les écraser).\n- Les partages réseau peuvent être configurés via l'application, tout comme les paramètres mpv via l'éditeur intégré.\n- La plupart des paramètres d'exécution pertinents peuvent être ajustés dynamiquement pendant la lecture via le menu, ou à défaut, la console (manuel)\n \n \nTéléchargement : SwitchWave v1.0.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197737/in-switch-switchwave-v100-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197737/in-switch-switchwave-v100-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1197737/in-switch-switchwave-v100-disponible-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1197737/in-switch-switchwave-v100-disponible-4.jpg"
        }
    },
    "news_5": {
        "title": "[PS5] La puce EMC analysée par Shuffle2 au Security Analyst Summit",
        "content": "Le développeur Shuffle2 a présenté ses travaux lors du Security Analyst Summit, en amont il avait annoncé qu'il rendrait à dispositions certains documents utiles lors de ses recherches. \n \nSes travaux, comme nous en informe le site Wololo.net, se sont portés sur la puce EMC de la PS5, après sa présentation il a mis à disposition sur les réseaux sociaux un dump décrypté du firmware de cette puce, pour plusieurs révisions du firmware. \n \n \n\n \n \n \nLa conférence donnera un aperçu général de l'architecture système de la console Playstation 5, en mettant l'accent sur les puces efc/eap (« titania ») et emc (« salina »). Les exploits permettant l'exécution de code sur salina et titania seront détaillés, ainsi que la publication d'un outil qui implémente les exploits. Le processus d'exploration/découverte initiale sera également brièvement abordé.\n \nDu point de vue d'un chercheur en sécurité, les exploits sont intéressants car ils couvrent un bug difficile à repérer dans une machine d'état du micrologiciel et exploitent une mauvaise configuration matérielle pour contourner les mesures de protection de la mémoire. Les exploits/outils permettent de poursuivre les recherches sur le système.\n \n \n \nPirater la puce EMC de la PS5 ne donnera pas accès à un hack de la console, l'EMC est un processeur qui est utilisé pour les diagnostics, les débogages ou encore le contrôle des périphériques. \n \nL'EMC sur la PS4 était appelé MediaCon, il s'agit d'une puce qui gère l'interface de débogage via l'UART qui ne dépend pas du Syscon, de plus cette puce utilise son propre kernel FreeBSD. \nPour la forme, Zecoxao a republié quelques fichiers dumps ici.\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197701/in-ps5-la-puce-emc-analysee-par-shuffle2-au-security-analyst-summit-1.png"
        }
    },
    "news_6": {
        "title": "[XB360] J-Runner avec Extras v3.3.0 r4 disponible",
        "content": "Le développeur Octal450 vient de mettre à jour J-Runner en version v3.3.0 r4 avec notamment la correction de plusieurs problèmes mais aussi l'amélioration de l'interface utilisateur. Ainsi cette mise à jour inclut plusieurs améliorations et corrections de bugs pour améliorer l’expérience utilisateur. \n \n \n\n \n \nVoici quelques-unes des nouveautés :\n \n- Amélioration de la commande “Nouvelle session” : Cette fonctionnalité a été optimisée pour une meilleure performance.\n- Mise à jour du patch XL HDD : Des correctifs ont été apportés pour les disques durs XL.\n- Correction de la détection d’image pour le modèle Corona 4GB : Un problème de détection d’image a été résolu pour ce modèle spécifique.\n \nEn plus de cela, une nouvelle interface a été introduite pour la génération de clés GPU simplifiant le processus pour de nombreux utilisateurs. \n \nPour télécharger cette mise à jour, il est recommandé de ne pas utiliser le fichier JR-Auto-Update-Delta.zip, mais plutôt de télécharger et d’extraire J-Runner-with-Extras.zip pour obtenir l’exécutable.\n \n \nTéléchargement : J-Runner avec Extras v3.3.0 r4\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197699/in-xb360-j-runner-avec-extras-v330-r4-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[Multi] Flycast v2.4 supporte RetroAchievements (Android, Xbox et Switch)",
        "content": " \nLe meilleur émulateur de Sega Dreamcast, de Sega Naomi et d'Atomiswave est de retour dans une nouvelle version, en effet Flycast est désormais proposé en v2.4.\n \nFork de Reicast, Flycast est un émulateur efficace qui continue d'être maintenu, les fonctionnalités sont nombreuses et la qualité de restitution font de cet émulateur l'un des meilleurs, que ce soit sur Nintendo Switch, PlayStation Vita, Android ou Xbox.\n \nLa nouvelle version 2.4 prend en charge RetroAchievements et des miniatures sont désormais affichées pour les états de sauvegarde. De plus, Force Feedback a été implémenté pour certains jeux d'arcade. En bas du changelog, vous trouverez également des jeux qui fonctionnent désormais.\n \n \n\n \n \n \nChangelog : \n \n- Prise en charge de RetroAchievements\n- Améliorations de l'interface utilisateur avec les miniatures de l'état de sauvegarde\n- Prise en charge du retour de force pour certains jeux d'arcade (F355, 18 Wheeler, Maximum Speed, Faster Than Speed, Initial D, Club Kart, King of Route 66, Tokyo Bus Guide, Sega Driving Simulator)\n- Discord Rich Présence (Windows, macOS, Linux)\n- Android : vibrations de la manette de jeu, pilotes Adreno personnalisés et de nombreuses corrections de bugs et améliorations\n- Optimisations Vulkan par Wunkolo\n- Divers correctifs par vkedwardli\n- De nombreuses améliorations par scribam\n \nJeux nouvellement supportées :\n \n- Beach Spikers\n- Capcom vs SNK 2000 Pro\n- Irides: Master of blocks\n- Mars TV\n- Metropolis Street Racer\n- Mortal Kombat\n- Quake III\n- Red Dog Superior Firepower\n- Shin Nihon Pro Wrestling\n- Soul Surfer\n- Virtua Cop 2\n \n \nTéléchargement : Flycast v2.4\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197687/in-multi-flycast-v24-supporte-retroachievements-android-xbox-et-switch-1.png"
        }
    },
    "news_8": {
        "title": "[PS5] La conférence de Specter nommée Byepervisor se tiendra demain",
        "content": "Le planning d'intervention de la convention Hardwear.io a été dévoilé, après 3 jours de trainings qui viennent de s'écouler, voilà désormais les deux journées de conférence qui auront lieu demain et vendredi. \n \n \n \n\n \n \n \n \nEt bien vu que nous avons le planning, nous pouvons voir que la conférence Byepervisor se tiendra demain, présenté par le célèbre développeur Specter, son intervention est prévue entre 15h30 et 16h10, soit une présentation assez rapide sur \"Comment nous avons cassé l'hyperviseur de la PS5\". \n \n \n \n\n \n \n \n \nTout est là : hardwear.io\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197680/in-ps5-la-conference-de-specter-nomme-byepervisor-se-tiendra-demain-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197680/in-ps5-la-conference-de-specter-nomme-byepervisor-se-tiendra-demain-1.png"
        }
    },
    "news_9": {
        "title": "[PS5] Sony dévoile le firmware officiel 10.20 pour la PS5",
        "content": " \nSony vient de dévoiler un nouveau firmware pour la PS5, la firme japonaise a en effet mis en ligne la version 10.20 de la mise à jour système de la dernière console de salon.\n \nCette mise à jour s'intéresse autant à la PS5 FAT que la Slim ou la toute proche PS5 Pro.\n \nLes changements opérés par Sony portent sur la gestion des activités, désormais affichées comme \"En cours\", \"Non démarrées\" ou \"Terminées\" selon l'avancement. \n \nLes spoilers potentiels continueront d'être cachées, et la convivialité de certains écrans ont été améliorés. Accessoirement Sony parle d'une amélioration de performances et de stabilité, mais nous savons bien ce que cela signifie, la correction éventuelle de failles reportées ou découvertes récemment. \n \n \n\n \n \n \nVersion : 24.07-10.20.00 :\n \n- Les activités portent désormais la mention En cours, Non commencée ou Terminée, selon que vous avez lancé ou terminé l'activité.\n- Les éventuels spoilers resteront cachés.\n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et l'ergonomie de certains écrans.\n \n \nTout est là : playstation.com\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197678/in-ps5-sony-devoile-le-firmware-officiel-1020-pour-la-ps5-1.jpg"
        }
    },
    "news_10": {
        "title": "[3DS] Dead Simple EULA Set v1.2 disponible",
        "content": "Si vous disposez d'une 3DS, et que celle-ci soit hors ligne pour des raisons qui vous sont propres, comme ne pas vouloir installer notamment le dernier firmware afin de disposer d'un firmware facilement hackable, il ne vous est pas possible de vous connecter en ligne en raison de la non acceptation du CLUF (le contrat de licence utilisateur final). \n \nCertains outils sont cependant conçu pour fonctionner avec le cluf accepté, c'est le cas pour jouer en ligne ou pour Streetpass par exemple, et c'est là que Dead Simple Eula Set entre en jeu puisque cet outil permet de contourner la procédure manuelle d'acceptation du cluf en rendant le processus rapide et sans complexité. \n \nLors de la lecture de jeux 3DS en dehors de la région d'origine, la console nécessite l'acceptation du Cluf spécifique qui permet d'accéder aux services en ligne. Dead Simple EULA Set va donc se charger de gérer les Clufs, en acceptant ou rejetant le Cluf. \n \n \n \n\n \n \n \nChangelog v1.2 :\n \n- Correction d'un bug où la fonction CFG_UpdateConfigSavegame n'était pas appelée, ce qui provoquait l'expiration d'un CLUF défini à moins qu'il ne soit maintenu (par exemple en changeant la luminosité de l'écran). \n- Le code est à nouveau compilable avec la dernière version de libctru (2.4.0).\n \n \nTéléchargement : Dead Simple EULA Set v1.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197661/in-3ds-dead-simple-eula-set-v12-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] PS5-Jar-Loader v4.0.0 de Master-s disponible",
        "content": "Le développeur Master-s vient tout juste, il y a quelques minutes, de dévoiler la version 4.0.0 de sa version fork de PS5-jar-loader qui comme vous le savez il personnalise avec quelques ajouts spécifiques. \n \nAinsi il a rajouté quelques fichiers bin et quelques fichiers elf permettant d'augmenter encore les possibilités offertes par le logiciel sur PS5. \n \n \n\n \n \nps5-jar-loader v4.0.0 : \n \n- Ajout du fichier test de chargement .jat et .bin \n- Ajout des Payload PS5 5.xx : ftpsrv.elf.bin, hello_world.elf et elfldr.elf\n \n \nTéléchargement : ps5-jar-loader v4.0.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197622/in-ps5-ps5-jar-loader-v400-de-master-s-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] Les Pokemon leakés sont désormais crackés sur PC",
        "content": "Récemment, Game Freak, le studio derrière la franchise Pokémon, a été victime d’une cyberattaque massive. Cette attaque a entraîné la fuite de nombreuses informations sensibles, y compris des données sur des jeux passés, présents et futurs, notamment les codes de certains jeux Pokemon, comme Pokemon Legends : Arceus, Pokemon Brilliant Diamond, et Pokemon Shining Pearl. \n \nCes 3 jeux ont été crackés et sont désormais jouables sur PC sans qu'aucun émulateur ne soit nécessaire, ce leak nommé \"Teraleak\" est probablement l'un des plus importants de l'histoire des jeux vidéo, dévoilant également des données personnelles de nombreux employés de Game Freak. \n \n \n\n \n \nIl semblerait que des problèmes de compatibilité avec les cartes nVidia limitent l'expérience utilisateur, des pilotes graphiques spécifiques devant être déployés.\n \nLes versions de Pokémon BD et SP semblent être proches des versions de débogage finales, et Pokémon Legends Arceus est un prototype très précoce. Ces éditions sont loin d'être les versions finales des jeux, probablement des test builds ou des versions alpha, mais tout ceci n'a de cesse d'exaspérer Game Freak et Nintendo. \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197621/in-switch-les-pokemon-leakes-sont-desormais-crackes-sur-pc-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS5] PS Multi Tools v14.5.4 disponible",
        "content": "Le développeur SvenGDK propose également une nouvelle version de son outil PS Multi Tools qu'il propose en version 14.5.4. \n \nComme vous le savez probablement cet utilitaire s'adresse à tout ceux qui dispose d'une console Sony, de la PSP à la PS5 en passant par toutes les générations. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n\n \n \n \nCette nouvelle version n'a pas été compilée, il vous faudra le faire, elle apporte quelques corrections mineures, et la mise à jour du lecteur des PKG PS5. \n \nChangelog :\n \n- Mise à jour du lecteur des PKG PS5 et autres changements mineurs\n \nParcourir les fichiers :\n \n- Sauvegarde de la configuration du package XML\n- Exportation du param.json\n- Sauvegarde de l'icône icon0 et de l'arrière-plan pic0\n- Correction d'un crash possible lors de l'ouverture du 'PS5 Game Patches Downloader'.\n \n \nTéléchargement : PS Multi Tools v14.5.4\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197612/in-ps5-ps-multi-tools-v1454-disponible-1.jpg"
        }
    },
    "news_14": {
        "title": "[Switch] NeXT 3.30 pré-version disponible",
        "content": "Le développeur Vampitech propose une nouvelle version de son all-in-one NeXT, comme vous le savez le code a été retiré de Github, mais le développeur continue de proposer son travail sur Codeberg.\n \n \n\n \n\n \n\n \n \nChangelog : \n \nMise à jour de :\n- Atmosphere > 1.8.0 Pre-Release\n- Hekate > 6.2.2\n- NeXT Updater > 2.0.1\n- Sigmapatches > 19.0.0\n- MissionControl > 0.12.0\n \nAjout :\n- Tinfoil AutoInstaller pour 19.0.0 (Bravo à Kronos2308)\n \nEn raison de certaines modifications apportées au Keyset 19.0.0, certaines redirections ne fonctionneront pas. Il est prévu que cela soit corrigé dans la version finale d'Atmosphere 1.8.0\n \nTéléchargement : NeXT 3.30\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197607/in-switch-next-330-pre-version-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197607/in-switch-next-330-pre-version-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1197607/in-switch-next-330-pre-version-disponible-3.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] NX-Activity-Log et EdiZon Overlay à jour",
        "content": "Les programmes NX-Activity-Log et EdiZon ont été mis à jour, le programme EdiZon Overlay propose à l'origine par WerWolv a été repris par proferabg, il tient à remercier ppkantorski pour cette mise à jour. \n \nEdiZon est une application dédiée à la gestion des sauvegardes d'état sur Switch et qui intègre également un éditeur très utile, cette nouvelle version de nombreuses optimisations. \n \n \n\n \n \nChangelog : \n \n- Mise à jour de libnx.\n- Utilise maintenant libtesla (Ultrahand) et libultra.\n- Prise en charge des fonds d'écran / thèmes personnalisés.\n- Les utilisateurs peuvent remplacer le fond d'écran / thème du système avec  sdmc:/config/edizon/wallpaper.rgba et sdmc:/config/edizon/theme.ini.\n- Ouverture plus rapide / détection des jeux.\n- Correction des appels IP locaux.\n- Les relevés de température sont maintenant effectués par i2c.\n \nTéléchargement : EdiZon-Overlay\n \n \n \nLe programme NX-Activity-Log quand à lui proposé à l'origine par tallbl0nde, a été repris par zdm65477730, Damien Zhao. Il a rajouté le support du firmware 19.0.0.\n \n \n\n \n \nTéléchargement : NX-Activity-Log\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197602/in-switch-nx-activity-log-et-edizon-overlay-a-jour-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1197602/in-switch-nx-activity-log-et-edizon-overlay-a-jour-2.jpg"
        }
    },
    "news_16": {
        "title": "[PS5] PS5 PKG Passcode Finder v1 disponible",
        "content": "Le développeur SvenGDK propose un outil nommé PKG Passcode Finder qui est un logiciel de force brute qui permet de retrouver ou recouvrer un mot de passe perdu sur des PKG PS5. \n \nL'outil fourni de façon indépendante va probablement être intégré dans sa suite de solution  PS Multi Tools, mais en attendant il est possible de le télécharger seul. \n \n \n \n\n \n \n \nTutoriel : \n \n- Entrée PS5 PKG\n- Sélectionner un chemin de sortie temporaire\n- Attendre qu'un code d'accès soit trouvé\n \n \nTéléchargement : PKG Passcode Finder v1\n \n \n \n",
        "images": {}
    },
    "news_17": {
        "title": "[PS5] PS5 Jar Loader v2.1.0 disponible",
        "content": "Le développeur Hammer-83 propose la mise à jour de son outil PS5 Jar Loader, il s'agit de la version 2.1.0 qui apporte pas mal de nouveautés, notamment une tentative d'amélioration de la synchronisation lorsque plusieurs threads tentent d'afficher des messages de débogage à l'écran et dans le journal distant.\n \nA noter que cette version est rétrocompatible avec la v2.0.0. Les JARs construits pour la v2.1.0 devraient être compatibles avec la v2.0.0.\n \n \n \n\n \n \nLes étapes à suivre :\n \n- Compilez le projet et gravez le contenu de assembly/target/assembly-2.1.0 sur un disque BD-RE. L'ISO précompilé est également fourni. Compilez éventuellement avec -Dloader.logger.host=[IP du serveur d'enregistrement] pour envoyer la sortie à l'écran à un hôte distant.\n- Insérez le disque dans PS5 et exécutez le chargeur JAR.\n- Envoyez un payload : java -jar <payload.jar> <PS5 IP>\n \nTéléchargement : ps5-jar-loader 2.1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197598/in-ps5-ps5-jar-loader-v210-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] John Tornblom propose websrv en version 0.13",
        "content": "Le développeur John Tornblom propose une nouvelle version de son payload websrv pour la PS5, qui y sont sensibles bien entendu. Comme vous le savez, ce payload lorsqu'il est injecté permet d'éxecuter un simple serveur web, cependant il permet beaucoup de choses, puisqu'il permet de lancer des homebrews via le webkit ou bien à distance via un PC, smartphone ou des appareils compatibles.\n \nDans cette nouvelle version 0.13, le développeur a fait évoluer quelques scripts pour améliorer certains aspects de sa proposition. \n \n \n\n \n \n \nChangelog : \n \nhomebrew : remplacer les fichiers bin par des scripts de construction\nci : construire homebrew en utilisant des scripts de construction\nscummvm : commit initial\nfbneo : impression du chemin de configuration sur stdout\nelfldr : rendu cosmétique sur stdout\n \n \nTéléchargement : webserv 0.13\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197547/in-ps5-john-tornblom-propose-websrv-en-version-013-1.jpg"
        }
    },
    "news_19": {
        "title": "[Switch] Sys-con v1.4.3 disponible",
        "content": "Le développeur français o0Zz a pris la suite de Cathery avec Sys-con, et il le fait plutôt bien puisque les versions s'enchainent et ajoutent de nombreuses fonctionnalités. Inspiré du projet sys-con de Cathery, ce nouveau fork a été réalisé pour ajouter le support de toutes les manettes compatibles PC (avec un profil HID). \n \nAvec Sys-Con vous profiter de ses fonctionnalités, telles que le support des joysticks et gamepads avec profil HID, la configuration des touches en fonction du VID/PID de la manette, la gestion de la deadzone et la personnalisation de la couleur des manettes. Le module Sys-Con permet d’utiliser des contrôleurs tiers sur votre console Nintendo Switch en connectant simplement vos manettes via les ports USB du dock ou via le port USB-C avec un adaptateur OTG.\n \n \n\n \n \nCette nouvelle version 1.4.3 ajoute quelques correctifs :\n \n- Correction du bouton de guide XBOXOne qui ne fonctionne pas (régression par rapport à la version 1.4.0)\n- Ajout de la prise en charge de 8BitDo Ultimate 2C (manette XBOXOne)\n- Problème résolu avec les contrôleurs HID qui n'ont pas de profil Joystick/manette de jeu en première position.\n \n \nTéléchargement : Sys-con v1.4.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197545/in-switch-sys-con-v143-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[Wii] cdbackup v1.4.0 disponible",
        "content": "Une nouvelle version de cdbackup a été publiée par Naim2000, il s'agit de la version 1.4.0 qui apporte son lot de nouveautés et de corrections. Pour rappel, cette application homebrew apporte des modifications permanentes à la mémoire NAND du système de la Nintendo Wii. Par conséquent, cette application doit être utilisée avec prudence. \n \n \n\n \n \nElle permet notamment de :\n \n- Sauvegarder/restaurer/exporter les données du tableau de messages Wii.\n- Sauvegardez/restaurez les données du tableau de messages Wii sur cdbackup.vff sur votre carte SD ou clé USB, exportez tous les messages au format texte ou supprimez-les entièrement de la Wii.\n \nEt cette nouvelle version 1.4.0 apporte ces nouveautés : \n \n- Les messages exportés sont désormais convertis en UTF-8 afin qu'ils ne s'affichent pas comme ceci\n \n\n \n- Ajout d'une option d'extraction brute pour cdbackup.vff\n- Correction du bug qui négligeait le périphérique de stockage de masse USB si aucune carte SD n'était insérée\n \n \nTéléchargement : cdbackup v1.4.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1197542/in-wii-cdbackup-v140-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1197542/in-wii-cdbackup-v140-disponible-2.png"
        }
    }
}