{
    "news_1": {
        "title": "[PS4/PS5] Sony publie les firmwares officiels 10.71 (PS4) et 7.61 (PS5)",
        "content": "Le géant japonais a mis en ligne hier de nouveaux firmwares officiels à destination des PlayStation 4 et PlayStation 5, la firme vient en effet de dévoiler les versions 10.71 pour PS4 et 7.61 pour PS5 de ces mises à jour système permettant ainsi de colmater probablement un bug exploitable. \n \nLa mise à disposition simultanée de nouveaux firmwares intermédiaires sans que le moindre changelog ne soit découvert, puisque Sony ne parle que d'amélioration de performances du système, laisse à penser que le géant japonais à corriger un problème de sécurité. \n \n \n\n \n \nZecoxao précise que le kernel du firmware 10.71 est identique à celui du firmware 10.70 pour la PS4, il est donc possible que les changements ont été effectués sur le navigateur, colmatant ainsi un point d'entrée (webkit exploit). \n \nLien vers le bot PS5 : FwPs5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176872/in-ps4ps5-sony-publie-les-firmwares-officiels-1071-ps4-et-761-ps5-1.png"
        }
    },
    "news_2": {
        "title": "[PS5] Ps Multi Tools bénéficie de nouvelles fonctions pour la PS5",
        "content": "La dernière version de PS Multi Tools débarque avec toute une panoplie d'outils destinés à la PlayStation 5, il faut dire que cela commence sérieusement à bouger. \n \nPS Multi Tools est un outil regroupant notamment un gestionnaire de sauvegarde pour PS1, PS2, PSX, PS3, PS4, PS5, PSP et PS Vita.\n \nCet outil vous permettra, en outre, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n \n\n \n \n \nChangelog 13.0.5 :\n \n- Nouvelles fonctionnalités pour la PS5\n- Ajout du navigateur Internet au menu d'accueil pour chaque profil en 1 clic (nécessite peut-être un redémarrage de la console), cela ne nécessite pas d'accès à system_ex\n- Possibilité d'extraire le contenu des disques par FTP\n- Possibilité de graver des images .iso BR sur des disques Blu Ray\n- Le navigateur FTP fonctionne maintenant avec FTPS5\n- Supporte maintenant le chargement d'infos de jeux et d'applications par FTP\n- Possibilité de définir votre IP:PORT dans les paramètres\n \n \nTéléchargement : Ps Multi Tools 13.0.5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176794/in-ps5-ps-multi-tools-beneficie-de-nouvelles-fonctions-pour-la-ps5-1.png"
        }
    },
    "news_3": {
        "title": "[PS5] Vous pouvez mettre à jour les PKG avec les dernières updates",
        "content": "Comme vous le savez certainement, l'une des limites du fait de ne pas pouvoir installer le dernier firmware est de ne pas pouvoir bénéficier des mises à jour des jeux, ils sont le plus souvent proposé en v1.00 et il a fallu attendre très longtemps pour pouvoir profiter des dernières updates. \n \nParfois c'est même impossible du fait que le firmware ne dispose pas des mêmes clés que les mises à jour qui ont été encodées avec un firmware plus récent. \n \nEt bien avec c'est déjà de l'histoire ancienne sur PS5 puisqu'il est possible de mettre à jour les jeux, mais bien entendu il n'ai pas encore possible de les lancer car il manque les licences. \n \n \n\n \n \nA titre d'exemple il est possible d'installer Astro's Playroom en PKG PS5 et de le lancer vu qu'il ne dispose pas de licence (ou plutôt elle est libre), ainsi sur Astro il sera possible de passer de la version 1.0 ou 1.2 à la 1.6.\n \nTéléchargement : Astro V1.600 PKG\n \n \n\n \n\n \nPour le reste il est donc tout à fait possible d'avoir déjà installé des PKG, de ne pas avoir mis à jour sa console, et donc de mettre à jour les PKG pour disposer de la dernière mise à jour. \n \n \n \n\n \n \n \nCela fonctionne sur tous les PKG avec licences, qu'il vous sera possible de faire tourner, par contre cela fonctionne aussi sur les FPKG mais vous ne pourrez pas les lancer ceux là.\n \n \n\n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176777/in-ps5-vous-pouvez-mettre-a-jour-les-pkg-avec-les-dernieres-mises-a-jour-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176777/in-ps5-vous-pouvez-mettre-a-jour-les-pkg-avec-les-dernieres-mises-a-jour-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1176777/in-ps5-vous-pouvez-mettre-a-jour-les-pkg-avec-les-dernieres-mises-a-jour-2.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1176777/in-ps5-vous-pouvez-mettre-a-jour-les-pkg-avec-les-dernieres-mises-a-jour-3.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1176777/in-ps5-vous-pouvez-mettre-a-jour-les-pkg-avec-les-dernieres-mises-a-jour-4.jpg"
        }
    },
    "news_4": {
        "title": "[Switch] switch_AIO_LS_pack 5.2.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.2.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.2.0:\nMise à jour de AIO-Switch-Updater et de DBI vers la dernière version de ceux-ci.\nMise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.10.01:\nAjout de la possibilité d'installer un forwarder pour l'application, individuellement ou durant l'installation du pack (aussi configurable dans l'auto-configuration).\nUne valeur non configurée dans le fichier d'auto-configuration est maintenant considérée comme étant non active au lieu d'annuler l'auto-configuration.\n\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\nSauf pour la correction de bugs je pense que le homebrew AIO_LS_pack_Updater est arrivé plus ou moins à sa version final, cependant si vous avez des idées pour l'améliorer autres qu'une interface graphique n'hésitez pas à m'en faire part (consultez le readme du Github du projet pour voir les choses que je voudrais faire mais que je n'arrive pas à faire pour l'instant ou les choses que je pourrais faire mais la flemme, c'est dans la todo list), si vous êtes développeur et que vous voulez proposer des pull requests elles seront les bienvenues si elles respectent l'esprit du projet (du C si le C++ n'est pas indispensable, par exemple on évitera de faire appel à des modules en C++ pour la traduction que j'aimerai d'ailleurs faire en pur C car là elle utilise un vecteur qui est du C++ se qui me plaît déjà moyennement).\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_5": {
        "title": "[PS5] Les FPKG s'invitent sur PS5 avec firmware 3.xx et 4.xx",
        "content": "Enorme accélération cette nuit avec l'arrivée de l'installation de FPKG sur la PlayStation 5 sous firmware 3.xx et 4.xx, ceux qui disposent à date du kernel exploit. \n \n \n \n\n \n \n \nCela fonctionne que ce soit des FPKG PS4 que des FPKG PS5, cela donne suite à des modifications apportés à l'exploit kernel et au webkit exploit.\n \n \n\n \n \n \nLes modifications qui ont été apportées ici à l'exploit kernel il y a 4 heures : \n \nhttps://github.com/EchoStretch/PS5-IPV6-Kernel-Exploit/commit/0151d7a350b206264a718b8255bbf08af39ef3d1\n \n \nhttps://github.com/EchoStretch/PS5-IPV6-Kernel-Exploit/commit/e1b3ea29fea2b725d8da62b8a91f884f25c3b9db\n \n \nPour pouvoir en profiter, il faut donc s'appuyer sur un host qui intègre ces modifications, soyez assurer que tous vont rapidement être mis à jour. \n \n \n\n \n \nPour le moment l'utilité est limitée dans le sens où il vous faudra disposer un compte avec la licence, le seul cas où cela fonctionnerait est si vous installez un PKG pour lequel votre compte possède la licence, ce qu'Echo Stretch démontre et explique dans la vidéo.\n \n \n \n\n \n\n \n \nBref, c'est assez \"simple\" désormais, ce n'est plus qu'un problème de licence pour parvenir à faire tourner les FPKG. \n \nPour rappel, les firmwares exploitables : 3.00, 3.10, 3.20, 3.21, 4.00, 4.02, 4.03, 4.50 et 4.51 sur lesquels il est désormais possible d'installer les FPKG mais pas encore de les exécuter sans que le compte ne dispose de la licence du PKG. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-104200319.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-42548268.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1923863581.jpg"
        }
    },
    "news_6": {
        "title": "[PS5] Mast1c0re supporte le firmware 4.03 et partiellement les 6.50 à 7.60",
        "content": "Il y a quelques jours le support du firmware officiel 4.03 a été ajouté dans l'exploit Mast1c0re par le développeur McCaulay Hudson, quelques modifications ont été apportés notamment pour ouvrir les offsets du firmware, et ainsi il est possible de lancer le payload pour dumper les fichiers système. \n \n \n\n \n \nMais désormais le monde accessible à Mast1c0re s'élargit puisque de nombreux firmwares beaucoup plus récents font leur apparition : \n \n- v6.50\n- v7.00\n- v7.01\n- v7.20\n- v7.40\n- v7.60\n \n \nAttention, cela ne signifie pas que l'exploit complet Mast1c0re fonctionnera d'emblée sur ces firmwares, du moins jusqu'à ce que les bons offsets soient découverts pour ces derniers. Comme le dit McCaulay :\n \n \nCela signifie-t-il que nous pouvons exécuter le loader sur PS5 7.xx ?\n \nPotentiellement, bien que le code ne le prenne pas en charge actuellement, il y a un problème avec le loader ELF qui est probablement dû à des changements dans l'agencement de la mémoire. Certaines fonctionnalités (par exemple, les dialogues) ne fonctionneraient pas non plus et seraient donc cachées.\n \n \nCe n'est donc qu'un support partiel qui est proposé car le loader ELF n'est pas encore opérationnel, mais c'est encore une belle évolution pour Mast1c0re. \n \nL'annonce de McCaulay Hudson se trouve ici : Twitter.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176692/in-ps5-mast1c0re-supporte-le-firmware-403-et-partiellement-les-650-a-760-1.png"
        }
    },
    "news_7": {
        "title": "[Switch/3DS/WiiU] Nintendo aura mis 5 mois pour trouver la solution à ENLBufferPwn",
        "content": "En Décembre 2022, les développeurs PabloMK7, Rambo6Glaz et Fishguy6564 dévoilaient conjointement un bug qui se retrouve dans de nombreux jeux Nintendo, qu'ils soient sur 3DS, Wii U ou encore sur la Switch.\n \nENLBufferPwn est une vulnérabilité dans le code réseau présent dans plusieurs jeux Nintendo first party depuis la Nintendo 3DS jusqu'à la Switch qui permet à quelqu'un de mal intentionné d'exécuter du code à distance dans la console de la victime en jouant simplement à une partie en ligne avec elle (exécution de code à distance). Il a été découvert par plusieurs personnes indépendamment en 2021 et a été signalé à Nintendo en 2021 et 2022. Depuis le rapport initial, Nintendo a corrigé la vulnérabilité dans de nombreux jeux vulnérables. \n \nIl aura fallu attendre 3 mois, Mars 2023, pour avoir enfin une réaction, sur Mario Kart 8 et Splatoon, en retirant les accès en ligne sur ces deux jeux sur Nintendo Wii U.\n \nEt puis plus rien depuis 5 mois, mais ça y est, Nintendo annonce que les jeux Mario Kart 8 et Splatoon seront retour en ligne dès aujourd'hui, le 03 Août 2023.\n \n \n\n \n \n \nVoilà le message publié par le géant japonais : \n \n \n\" En mars 2023, Nintendo a suspendu les services réseau pour les jeux Wii U Splatoon et Mario Kart 8 afin de remédier à une vulnérabilité liée au jeu en ligne. Le problème a maintenant été résolu et nous reprendrons donc le jeu en ligne pour ces jeux en fonction du calendrier ci-dessous. Veuillez accepter nos sincères excuses pour la période d'attente prolongée \".\n \n \nCependant, une mise à jour pour chaque jeu doit être téléchargée au préalable . Nintendo s'excuse également pour la longue maintenance. S'il y a des problèmes pour jouer à nouveau en ligne, Nintendo se réserve le droit d'arrêter le jeu à court terme.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176671/in-switch3dswiiu-nintendo-aura-mis-5-mois-pour-trouver-la-solution-a-enlbufferpwn-1.jpg"
        }
    },
    "news_8": {
        "title": "[WiiU] L'émualtion Amiibo s'améliore avec re_nfpii v0.3.0",
        "content": "Le développeur GaryOderNichts dévoile une nouvelle version de son réimplémentation de la bibliothèque nn_nfp pour la Wii U, pour rappel cela permet d'émuler des Amiibo. \n \nSon fonctionnement est assez simple, déplacez le module et le plugin sur la carte SD dans votre répertoire Aroma, vos dumps amiibo cryptés vers \" SD://wiiu/re_nfpii/\" et sélectionnez l'amiibo à émuler dans le menu WUPS Config. L'amiibo peut également être automatiquement retiré après un certain temps !\n \n \n\n \n\n \n \nCette nouvelle version 0.3 améliore déjà cet outil très utile, sachant que le développeur propose une vidéo de présentation de cette v0.3.\n \n \n \n\n \n \n \nLes figurines Amiibo peuvent désormais être sauvegardées sur la carte SD via l'option \" Dump amiibo \". De plus, les Amiibo peuvent désormais être marqués comme favoris, soit globalement, soit par titre. Vous pouvez ensuite passer d'un favori à l'autre à l'aide d'une combinaison de touches réglable.\n \n \nTéléchargement : re_nfpii v0.3.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176664/in-wiiu-lemualtion-amiibo-sameliore-avec-re-nfpii-v030-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1176664/in-wiiu-lemualtion-amiibo-sameliore-avec-re-nfpii-v030-2.png"
        }
    },
    "news_9": {
        "title": "[PS4] PS4 Syscon Tools v1.5 et PS4 Syscon Flasher v2.00 d'Abkarino &#38; EgyCnq",
        "content": "En Juin dernier le développeur Abkarino bien connu de la scène PS3 faisait une annonce fracassante pour la scène PS4, l'intention de proposer une solution alternative et gratuite à tous les outils de dumps.\n \nAvec son ami EgyCnq, le développeur s'est mis en tête de faire autant voir mieux que les solutions payantes, de là sont nés PS4 Syscon Tools et PS4 Syscon Flasher, le premier est une solution gratuite (software & hardware) qui vous permet de manipuler la puce Syscon originale de la PlayStation 4 (Renesas RL78/G13). \n \n \n \n\n \n \n \n \nIl se compose de 2 projets :\n \n- PS4 Syscon Tools (client PC vous permettant de contrôler PS4 Syscon Flasher).\n- PS4 Syscon Flasher (Flasher hardware basé actuellement sur les solutions Teensy++ 2.0 - Teensy 4.0 - Teensy 4.1).\n \nLes deux solutions viennent d'être mise à jour après leur lancement en Juin dernier. \n \n \nPS4 Syscon Tools v1.5 changelog\n \n- Ajout de la prise en charge du nouveau firmware PS4 Syscon Flasher v2.00.\n- Ajout d'une option de mode de connexion automatique pour permettre la connexion automatique au matériel PS4 Syscon Flasher au moment du lancement de l'application.\n- Ajout d'une nouvelle option pour activer les fonctions d'effacement (maintenant toutes les fonctions d'effacement sont désactivées par défaut).\n- Ajout d'une nouvelle option pour patcher automatiquement le mode debug s'il n'est pas activé.\n- Ajout d'une nouvelle fonction pour obtenir des informations de dump Syscon en lisant et en validant la partie firmware de Syscon (les données nvs/snvs suivront).\n- Ajout d'une nouvelle méthode d'écriture plus sûre et plus rapide que l'ancienne (nous effacerons automatiquement le bloc avant d'y écrire des données s'il ne s'agit pas d'un bloc vierge, grâce à la fonction de vérification du bloc vierge qui a été ajoutée à notre firmware flasher).\n- Ajout d'une fonction de vérification automatique après l'écriture dans le syscon.\n- Ajout d'une fonction pour demander à l'utilisateur de patcher le mode debug s'il n'est pas patché dans le dump syscon sélectionné à écrire.\n- Ajout de la possibilité d'afficher la version du firmware du flasheur PS4 Syscon dans la barre d'état.\n- Ajout d'informations sur le sujet.\n- Nettoyage du code.\n- Restructuration du projet.\n \n========================================================================\n \n \nPS4 Syscon Flasher v2.00 changelog \n \n- Ajout d'une nouvelle méthode d'écriture de bloc améliorée et plus sûre, qui minimise le risque en particulier lors de la manipulation des blocs Boot0 (bloc 0 à bloc 3).\n- Ajout d'une méthode pour vérifier si le bloc est vide ou non.\n- Ajout d'une méthode pour obtenir des informations sur la puce.\n- Ajout du support pour Teensy 4.1.\n- Nettoyage du code.\n \n \n \n\n \n \n \n \nTéléchargement : PS4 Syscon Tools v1.5 et PS4 Syscon Flasher v2.00\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176655/in-ps4-ps4-syscon-tools-v15-dabkarino-et-syscon-flasher-v200-dabkarino-egycnq-1.png"
        }
    },
    "news_10": {
        "title": "[PS5] SiSTR0 met à jour FTPS5 avec support d'écriture sur system/system_ex",
        "content": "Le développeur SiSTR0 vient tout juste de mettre à jour son outil FTPS5 qui passe en version v1.3, la mouture précédente avait été proposée le 08 Décembre 2022, c'était donc il y a 8 mois. \n \nGrosse nouveauté, le support de la possibilité d'écrire directement dans les partitions /system et /system_ex avec un accès en lecture-écriture.\n \n \n\n \n \nCommandes personnalisées :\n \nMTRW : Remonter les partitions /system et /system_ex avec un accès en lecture-écriture\n \nProblème connu :\n- Le processus dans le webkit provoque un kernel panic lorsque la console est éteinte.\n- Construire avec make PERSIST=0 pour l'éviter mais la persistance sera alors perdue.\n \n \nPour rappel, FTPS5 fonctionne sur le webkit des firmwares 4.03, 4.50 et 4.51.\n \n \nTéléchargement : FTPS5 v1.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176647/in-ps5-sistr0-met-a-jour-ftps5-avec-support-decriture-sur-systemsystem-ex-1.jpg"
        }
    },
    "news_11": {
        "title": "[PS5] La bêta du firmware 8.00 dévoile les prochaines options",
        "content": "Sony vient de dévoiler les nouveautés de son tout prochain firmware officiel 8.00 qui a commencé à être proposé à ceux qui se sont inscrit pour participer au programme de beta test. \n \nLes nouveautés vont bien au delà de corriger des failles ou des bugs, ce sont de nouveaux services et de nouvelles options qui sont proposées, et elles sont nombreuses et très intéressantes. \n \n \n \n \n\n \n \n \nCela passe par de nouvelles options d'accessibilité, ou un son 3D alimenté par Tempest3D Audio Tech ou encore le support des SSD M2 de plus grande capacité jusqu'à 8 To.\n \nTout est là : blog.fr.playstation.com\n \n \n\n \nC'est donc bien simple : \n \n- Nouvelles fonctionnalités d’accessibilité grâce à l'utilisation d'une seconde DualSense comme assistance\n- Prise en charge des appareils audios compatibles Dolby Atmos (Tempest 3D AudioTech)\n- Améliorations relatives aux fonctionnalités sociales (Party, partage d'écran, émojis)\n- Retour haptique de l’interface système\n- Fonctionnalités faciles d’utilisation\n- Prise en charge des SSD M.2 de plus grande capacité\n \n \n\n \n \nBien entendu il est bien trop tôt pour parler de capacité de hack, même si Mast1c0re est fonctionnel sous le dernier firmware de la PS4, le 10.70, ce n'est plus le cas sur les firmwares récents de la PS5, au delà du firmware 6.50. Ce n'est qu'une question d'offset, même si cela peut rester surprenant que Sony ne s'attaque pas plus que cela à cette faille. \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176646/in-ps5-la-beta-du-firmware-800-devoile-les-prochaines-options-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176646/in-ps5-la-beta-du-firmware-800-devoile-les-prochaines-options-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1176646/in-ps5-la-beta-du-firmware-800-devoile-les-prochaines-options-3.jpg"
        }
    },
    "news_12": {
        "title": "[Vita] The Four of Us Are Dying Alpha est disponible",
        "content": "Les développeurs Josh Allen et Noradninja propose un tout nouvel homebrew à l'occasion du concours FUHEN. Jusqu'à présent seul des portages avaient été proposés, ils sont actuellement au nombre de 3 puisqu'on a le loisir de retrouver Beat2X, Zik-Zak Vita et Sonic SMS 3 Timelines. \n \nMais là, avec The Four of Us Are Dying Alpha, nous sommes en présence d'un véritable jeu développé pour le concours et pour la console de Sony. \n \nReprenant les codes des survival horror, le jeu s'inspire très largement de Silent Hill 2 ou encore Alan Wake. \n \n \n\n \n\n \n\n \n \nComme nous pouvons le voir sur les images la qualité graphique est poussée à son maximum, c'est d'ailleurs un des objectifs des développeurs, qui proposent donc un jeu proche d'un AAA. \n \n \nTéléchargement : The Four of Us Are Dying Alpha / vitadb.rinnegatamante.it\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176629/in-vita-the-four-of-us-are-dying-alpha-est-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176629/in-vita-the-four-of-us-are-dying-alpha-est-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1176629/in-vita-the-four-of-us-are-dying-alpha-est-disponible-3.jpg"
        }
    },
    "news_13": {
        "title": "[PS5] Un premier jeu en 60 FPS non officiel sur PS5 via un patch illusion",
        "content": "Le développeur illusion vient de commencer à travailler sur la PS5, du moins il montre une vidéo de Gravityrush 2 tournant non officiellement à 60 FPS sur la PlayStation 5. \n \nLe développeur illusion est très connu de la scène PlayStation 4 pour ses patchs permettant de faire tourner la plupart des gros titres AAA à 60 FPS là où les studios de développement ont été trop frileux pour le proposer. \n \n \n\n \n \n \nBien entendu tout ceci n'a rien d'officiel et pour le moment aucun fichier n'est proposé au téléchargement. \n \nEn plus de cette vidéo informative, le développeur illusion nous informe qu'il est désormais possible d'éditer la mémoire, d'exécuter des payloads en externes sans passer par l'exploit webkit/bdjb. \n \nCela signifie donc une énorme avancée, qu'il est donc maintenant possible de modifier les jeux et leur fonctionnement sans point d'entrée au hack. \n \nPour le moment, cela n'est possible que sur un firmware 4.xx, et notez que les fonctionnalités PSN dans l'activation de compte hors ligne ne fonctionnent pas encore, les mots les plus importants étant pas encore. \n \nLe développeur illusion renvoi vers la bibliothèque libhijacker de Astrelsky, un autre développeur qui était à l'origine d'un PoC de fonctionnement des homebrews un peu passé inaperçu sur PS5 en Juin 2023. \n \nA noter que pour confirmer cela le développeur illusion enfonce encore le clou en proposant des images de Uncharted 4 sur PS5 tournant à 60 FPS, la preuve que d'autres titres supportent ses patchs.\n \nPour conclure, il dit que cela peut marcher sur n'importe quel jeu, il suffit juste qu'il dispose du jeu dans sa version disque. \n \n \n\n \n\n \n\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176564/in-ps5-un-premier-jeu-en-60-fps-non-officiel-sur-ps5-via-un-patch-illusion-sans-kexploit-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176564/in-ps5-un-premier-jeu-en-60-fps-non-officiel-sur-ps5-via-un-patch-illusion-sans-kexploit-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1176564/in-ps5-un-premier-jeu-en-60-fps-non-officiel-sur-ps5-via-un-patch-illusion-sans-kexploit-3.jpg"
        }
    },
    "news_14": {
        "title": "[Vita] Le bootrom de la PlayStation Vita a été dumpé",
        "content": "Le développeur Jose Coixao, Zecoxao, nous informe que les développeurs Skgleba et Mathieulh ont réussi à dumper le bootrom de la PlayStation Vita. Cela signifie qu'une copie du firmware de démarrage sécurisé de la console portable a été extraite et décryptée par ces chercheurs spécialisés dans le hacking matériel. Le dump du bootrom est une étape majeure dans le domaine du jailbreaking et du hacking des consoles, car il permet aux développeurs et aux hackers d'accéder au système de la PlayStation Vita de manière beaucoup plus profonde. Avec cette nouvelle avancée, les possibilités pour les joueurs et les développeurs s'ouvrent sur de multiples facettes.\n \nPour les joueurs, cela pourrait signifier la possibilité d'exécuter des homebrews, des émulateurs, et même des jeux non officiels sur leur PlayStation Vita beaucoup plus facilement, du côté des développeurs, le dump du bootrom pourrait stimuler la création de nouvelles applications et de fonctionnalités innovantes pour la PlayStation Vita. Ils pourront explorer plus en profondeur les capacités matérielles de la console, créant ainsi des projets originaux qui repoussent les limites du système.\n \nMathieulh annonce preuve à l'appui avoir réussi à dumper façon matérielle (hardware) une PlayStation Vita avec un glitch, il a réussi à obtenir les Static Keyslot 0x605, et les Perconsole Keyslots, de plus le bootrom complet du modèle commercial a été dumpé. Le tout a été placé sur le Wiki de la console. Le bootrom permet d'obtenir les emplacements de clés 0x605, 0x606 et 0x607 deviennent visibles à ce moment-là.\n \n \n\n \n \nDe son côté SKGleba a travaillé la partie software du dump, la contribution des deux développeurs va permettre probablement de faire progresser encore une fois la scène PlayStation Vita.\n \n \n\n \n \nPour la postérité, le premier glitch PS Vita réussi lors d'une séquence SD Boot :\n \nLe dépôt du first_loader est ici : https://t.co/A4lpaWt8Y3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176514/in-vita-le-bootrom-de-la-playstation-vita-a-ete-dumpe-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176514/in-vita-le-bootrom-de-la-playstation-vita-a-ete-dumpe-2.jpg"
        }
    },
    "news_15": {
        "title": "[XB] Microsoft bannit désormais les consoles retail exécutant des émulateurs",
        "content": "Nous apprenons que Microsoft a décidé de ne plus accepter les consoles ayant téléchargées des émulateurs sur Xbox One ou Xbox Series X ou S.\n \nDans une décision controversée, Microsoft a récemment annoncé qu'il bannit désormais toutes les consoles Xbox exécutant des émulateurs tiers. Cette mesure vise à contrôler l'utilisation non autorisée de logiciels tiers sur ses plates-formes de jeu, mais elle suscite des débats parmi les joueurs et la communauté des passionnés d'émulation. Les émulateurs sont utilisés par les joueurs nostalgiques pour rejouer à d'anciens titres qui ne sont plus disponibles sur les consoles modernes, ou pour profiter de jeux provenant d'autres plateformes. Cependant, l'utilisation d'émulateurs tiers peut également faciliter le piratage de jeux et de logiciels protégés par des droits d'auteur.\n \nFace à une augmentation préoccupante des cas de piratage et de distribution illégale de jeux sur ses consoles, Microsoft a pris la décision radicale d'interdire tous les émulateurs tiers. La société considère que cette mesure est nécessaire pour protéger les intérêts de ses partenaires développeurs et éditeurs de jeux, ainsi que pour maintenir un environnement de jeu équitable et sécurisé pour l'ensemble de sa communauté de joueurs.\n \n \n\n \n \nLa réaction des joueurs et des fans d'émulation est d'exprimer leur mécontentement en soulignant que l'utilisation d'émulateurs peut également servir à des fins légitimes, comme la préservation du patrimoine vidéoludique ou la personnalisation des expériences de jeu. Il convient de noter que Microsoft n'est pas la première entreprise à prendre une telle mesure. D'autres fabricants de consoles de jeu ont également restreint l'utilisation d'émulateurs tiers sur leurs plates-formes pour des raisons similaires.\n \n \n\n \n \n \nMalgré la controverse, Microsoft reste ferme dans sa décision, la firme UWeaPons s'est retrouvée avec une interdiction permanente imposée par Microsoft sur toutes ses consoles, et le développeur gamr13 s'est exprimé à ce sujet : \n \n \nNous allons immédiatement supprimer tout ce qui est lié à notre activité sur notre Discord, et nous vous recommandons fortement de supprimer tous les émulateurs du mode Retail installés sur votre console.\n \nMicrosoft donne désormais des suspensions de 15 jours à quiconque utilise des émulateurs en mode retail.\n \nTRW et SirMangler ont également vu leur console être bannie définitivement (avec possibilité de faire appel). \n \n \n\n \n \nLa Team UWeaPons était à l'origine d'un regroupement \"Root App\" de Xenia, Dolphin et RetroArch, mais désormais la Team recommande de supprimer tout émulateur, sous peine d'être dans un premier temps banni pendant 15 jours par Microsoft ou plus longtemps si la firme l'estime nécessaire. \n \nRien n'est dit pour le mode développeur, mais rappelons que Microsoft perçoit une commission d'activation du mode développeur sur ses consoles. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176511/in-xb-microsoft-bannit-desormais-les-consoles-executant-des-emulateurs-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176511/in-xb-microsoft-bannit-desormais-les-consoles-executant-des-emulateurs-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1176511/in-xb-microsoft-bannit-desormais-les-consoles-executant-des-emulateurs-3.jpg"
        }
    },
    "news_16": {
        "title": "[PS2] La toute première version d'Apollo Save Tool pour la PS2 disponible",
        "content": "Le développeur Damian Parrino connu sous le pseudo Bucanero propose la toute première version d'Apollo Save Tool pour la PS2.\n \nRappelons pour la forme que Apollo Save Tool est une application qui vous permet de gérer les fichiers de sauvegarde de jeu sur PlayStation Vita et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur votre console. \n \nPour la PS2, cela fait un petit moment qu'il nous tease cela, mais enfin voilà la première mouture qui permet notamment d'importer des fichiers de sauvegardes PSU/PSV/MAX/CBS/XPS d'une clé USB directement sur une carte mémoire et d'exporter les sauvegardes sous PSU/PSV/CBS/ZIP.\n \n \n\n \n \nA noter que les utilisateurs de PS3 peuvent utiliser les sauvegardes PSV qui sont interchangeables : vous pouvez désormais échanger facilement des sauvegardes PS2 entre votre PS2 et votre PS3 en utilisant \".PSV\" comme format d'importation/exportation.\n \nExemple : vous pouvez exporter une sauvegarde sur PS2 au format .PSV et importer ce fichier .PSV sur une carte mémoire virtuelle à l'aide du XMB de la PS3.\n \n \nTéléchargement : Apollo Save Tool v0.6.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176496/in-ps2-la-toute-premiere-version-dapollo-save-tool-pour-la-ps2-disponible-1.jpg"
        }
    },
    "news_17": {
        "title": "[3DS] nimdsphax l'alternative à l'exploit unSAFE_MODE pour les 3DS",
        "content": "Le développeur Luigoalma a publié l'exploit nimdsphax, il s'agit d'un nouvel exploit du kernel ARM9 qui peut être considéré comme une alternative satisfaisante à unSAFE_MODE. Attention calmons tout le monde, il ne permet toujours pas d'installer boot9strap sur une Old3DS avec le firmware actuel sans matériel supplémentaire ! nimdsphax est en réalité une version modifiée de nimhax qui permet d'utiliser dsp avec un service ps:ps émulé, de configurer GPUPROT et d'exploiter le kernel.\n \nCependant tous les modèles de 3DS avec les versions de firmware comprises entre la 11.8 et la 11.17 (la dernière en date) sont pris en charge.\n \n \n\n \nSi vous pouvez démarrer dans le lanceur Homebrew, vous pouvez exécuter nimdsphax et vous épargner tout le détour de l'installation de l'emplacement Wi-Fi, comme cela serait nécessaire avec unSAFE_MODE ce qui simplifie la démarche. Sur une New3DS, cela raccourcit considérablement l'installation de boot9strap puisque seul super-skaterhax doit être exécuté. Malheureusement, il n'y a pratiquement pas de gain de temps sur l'Old3DS.\n \nIl reste à voir s'il y aura un moyen facile d'installer boot9strap sur l'Old3DS à l'avenir. Ainsi le développeur récommande sur New3DS de mettre à jour au dernier firmware (le 11.17 actuellement) puis d'installer super-skaterhax avec nimdsphax.\n \n \n \n\n \n \n \n \nPour l'installation : \n \n- Il suffit de placer le dossier nimdsphax dans /3ds/ sur la carte SD, et non son contenu individuel.\n- L'exploit tente de s'exécuter immédiatement après avoir été lancé.\n- Lors de l'exécution de *hax xml takeover, il est possible qu'il ne s'exécute pas sur un écran rouge, il s'agit d'un problème de xml takeover.\n- Malgré l'utilisation de nim:s, une connexion en ligne n'est pas nécessaire.\n \n \nTout est là : nimdsphax\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176475/in-3ds-nimdsphax-laternative-a-lexploit-unsafe-mode-pour-les-3ds-1.jpg"
        }
    },
    "news_18": {
        "title": "[Vita/PSTV] Vita3K Android Release 7 disponible",
        "content": "Vita3K est de retour, comme vous le savez il s'agit du tout premier émulateur open-source pour la PlayStation Vita compatible avec Windows, Linux, macOS et Android. Cet émulateur n'a pas pour but de permettre l'activité illégale mais de restituer au mieux la PlayStation Vita sur PC. \n \nLes versions PC Windows, Linux, macOS et Android, et là nous allons focuser sur la version Android. A noter que les versions PC, Linux et macOS sont générées automatiquement et qu'il est possible de les retrouver ici.\n \n \n\n \n \nCette mise à jour améliore de manière significative le backend audio SDL et contient également de nombreuses autres corrections audio. Si vous mettez à jour depuis une version précédente, le passage à SDL pour l'audio peut résoudre quelques petits problèmes audio restants.\n \n \n\n \n \nChangelog version 7 Android :\n \n- Correction de l'implémentation audio SDL et retour à la valeur par défaut\n- Correction de quelques bugs avec l'implémentation du Double Buffer (j'aime la mémoire non-cohérente)\n- Implémentation de la synchronisation de surface et des requêtes d'occlusion en utilisant le double tampon\n- Désactiver la mise en pause du jeu car elle provoque des blocages de périphériques et des plantages\n- Amélioration de la détection du pilote Turnip, nécessaire pour une solution de contournement du bug du pilote\n- Ajout d'une solution de contournement pour les pilotes Adreno récents (non Turnip)\n- Correction de la version androïde de ffmpeg (des optimisations d'assemblage manquaient)\n- Amélioration des performances de l'upload de textures YUV\n- Marquer Vita3K comme un jeu, ce qui peut aider à certaines optimisations du système d'exploitation\n- Rebase PC (liste non exhaustive) :\n- Macdu : Emule la synchronisation des tuiles des macroblocs, corrige le problème du bloom dans de nombreux jeux (Project Diva, Uncharted, Gravity Rush...)\n- Zangetsu : Permet de naviguer dans l'interface graphique à l'aide d'un contrôleur (fonctionne aussi avec le contrôleur d'incrustation)\n- Zangetsu : Implémenter la texture u3u2u2u8\n- Macdu : Réécriture majeure de NGS (bibliothèque audio PS vita), stub de tous les modules manquants\n- Macdu : NGS decoder fixes, fix audio noise in most games that had this issue\n- bookmist : Implémentation des fonctions kernel manquantes\n- Macdu : Amélioration du support de l'attachement de stencil sans profondeur, correction de l'effet DOF dans Persona 4 Dancing\n- Zangetsu : Correction d'un bug avec le trophée de platine\n- Saturnsky : Nombreuses améliorations avec l'encodeur et le décodeur Jpeg, corrections de nombreux romans visuels\n- Macdu : Corrections multiples des shaders, permet à World of Final Fantasy d'aller dans le jeu\n- slipcounter : Correction de bugs avec la fonction guest printf et la vérification des ngs, correction de crashs dans certains jeux spécifiques\n- Zangetsu : Ajout d'une option pour désactiver la notification des shaders compilés\n- Macdu : Implémentation du verrouillage des shaders (ne concerne que l'utilisation d'un GPU de bureau)\n- Macdu : Implémenter des événements de type timer, permettre à Zanki zero d'aller dans le jeu\n- Zangetsu : Réécrire le gui du dialogue de sauvegarde\n- ExtremeExploit : Corrections multiples\n- Zangetsu : Implémentation d'un gestionnaire de registre\n \n \n \nTéléchargement : Vita3K Android Release 7 / site officiel\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176474/in-vitapstv-vita3k-android-release-7-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176474/in-vitapstv-vita3k-android-release-7-disponible-2.jpg"
        }
    },
    "news_19": {
        "title": "[Switch] TegraExplorer v4.1.0-b1 disponible",
        "content": "Le développeur suchmememanyskill vient de mettre en ligne en cette fin du mois de Juillet 2023 une version correctrice de son superbe outil TegraExplorer comme vous le savez il s'agit d'un programme qui est un gestionnaire de fichiers qui vous permet de naviguer dans la partition système sysnand / sysmmc, de copier, de supprimer ou de créer des fichiers ou des dossiers, et de télécharger le firmware actuel sur la SD. \n \nL'outil n'avait pas été mis à jour depuis Février 2023, cette version apporte le support de la version OLED.\n \n \n\n \n \nChangelog : \n \n- Prise en charge de l'OLED Préversion\n- Cette version ajoute le support de la Switch OLED. Il s'agit d'une version très expérimentale, n'hésitez pas à signaler un problème via l'onglet problèmes ou via Discord. Si possible, utilisez la dernière version stable (v4.0.1).\n- Mise à jour du BDK vers Lockpick-RCM 1.19.10\n- Nouvelle stratégie de keydump, avec l'espoir d'atténuer les hotfixes du pkg1\n- Merci beaucoup à @JeffVi pour m'avoir aidé à porter le BDK Lockpick_RCM sur TegraExplorer !\n \n \n \n\n \n \n \nTéléchargement : TegraExplorer v4.1.0-b1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176473/in-switch-tegraexplorer-v410-b1-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176473/in-switch-tegraexplorer-v410-b1-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] Interview de Flat_z suite au dump du PS5 bootrom PSP (Platform Security Processor)",
        "content": "Le développeur Flat_z hier a répondu à de nombreuses questions sur le discord PS5 sur l'image qu'il a proposé sur Twitter, faisons le tour de ce qu'il a découvert.\n \nNous vous proposons l'interview croisée, un résumé de questions réponses que Flat_Z a tenu sur le discord PS5. \n \n \n\n \n \n \n \nInterview croisée :\n \n \n\n \n \nQ : Cette image \" ROM : FFF0000 \" c'est ce que l'on pense, le dump du PSP (Platform Security Processor) ? \nR (Flat_z) : oui, c'est un dump du Platform Security Processor de la PS5.\n \nQ : Il y a beaucoup de clés importantes, il y a d'autres clés mineures dans le système\nR : Je ne publierai jamais d'informations confidentielles mais je veux essayer de l'implémenter (et divulguer si ça marche) des méthodes ou des trucs comme les fpkgs, comme je l'ai déjà fait pour la PS4.\n \nQ : Il y a des clés seeds dedans ? \nR : Je n'ai aucune idée, je viens de recevoir le dump il y a quelques minutes, mais ce que je sais c'est que le psp est la racine de la confiance, il contient le code du boot system, les key seeds, etc.\n \nQ : Obtenu à partir d'un logiciel comme fail0verflow ?\nR: Oui, c'est vrai\n \nQ : Vous en avez parlé à fail0verflow ?\nR : Oui, nous avons comparé nos dumps aujourd'hui\n \nQ : Le partagerez-vous avec d'autres personnes pour qu'elles puissent également travailler dessus ? Je suppose que non.\nR : L'idée est d'obtenir des clés pour l'IPL, puis des clés pour le SSD, de sorte que je puisse décrypter mon IPL à partir du dump du SSD et faire de la rétro-ingénierie dessus afin d'obtenir des clés, etc.\n \nQ : A quel firmware cela serait-il lié, ou parce que c'est une puce, c'est pertinent pour n'importe quel firmware qui a déjà un accès au kernel ? Ou bien vous concentrez-vous sur les versions 2.30-2.50 ?\nR : il s'agit plus de la révision du matériel que de la version du logiciel. Je ne sais pas si ou quand ils ont corrigé ce problème, mais d'habitude ils changent les clés entre les révisions de matériel, donc je suppose que les dumps de bootrom des révisions plus récentes ont d'autres clés.\n \nLe bug utilisé est d'ordre logiciel, aucun matériel hardware n'a été utilisé, je suis sur que cela fonctionne sur les firmware 2.xx, je suis actuellement sur firmware 2.50. Il dit qu'il a acheté sa PS5 en 2021, certainement un modèle de référence 1015 mais cela n'a que peu d'importance finalement. \n \nQ : C'est ce que j'essaie de comprendre. Il n'y a pas d'autre solution que de faire appel à l'ATM, car il s'agit d'une ATM spécifique au matériel (très probablement).\nR : Le but de cela est d'avoir des clés pour tous les firmwares (clés de tout sauf de l'IPL), l'objectif est aussi de fournir le même niveau de possibilité pour les fpkg. \n \nQ : Si cela est rendu public, cela pourrait-il signifier l'arrivée d'un CFW (custom firmware) ? Ou parce que Sony semble avoir tellement de puces qui ont besoin de se serrer la main, non ? \nR : Je sais pas si l'accès au bootrom pour certains appareils peut nécessairement signifier CFW ,et je ne sais pas si c'est le cas pour le ps5.\nLe problème, c'est qu'il n'y a pas d'autre solution que d'inverser le processus, il faudrait que d'autres vulnérabilités soient trouvées pour exploiter le bootrom. \n \nQ : Tous les bugs sont répertoriés sous https://www.psdevwiki.com/ps5/Bugs_%26_Vulnerabilities il vient de là ? \nR : Aucun de cette liste\n \nQ : Le ou les bugs seront un jour dévoilé(s) ? \nR : Bon, fail0verflow a été le premier à le faire, c'est donc à cette Team de décider de le publier ou non. Je pense que j'ai juste trouvé leur méthode. \n \nQ : Quels modèles sont affectés, il faudra du matériel ?\nR : J'ai un teskit et une PS5 Retail sous le dernier firmware également, cependant pour le dump, je reste sur le fimware 2.50 car j'ai tout implémenté pour elle, mais peut-être que je commencerai à travailler sur des firmwares plus récents à l'avenir, et j'ai aussi des trucs pour les 1.xx\n \nQ : Cela peut être porté sur des firmwares plus récents ? \nR : Qui peut le savoir. nous ne savons pas s'ils ont corrigé les bugs, ou quand ils l'ont fait. Mais avec les firmwares ou les révisions plus récentes ils ont probablement fait quelque chose.\n \nQ : Un CFW (Custom Firmware) ? \nR : Afin de permetre l'exécution de code, la ps4 n'a pas de firmware personnalisé, c'est juste des mods en temps réel, c'est la même chose ici.\n \nQ : Des plans pour SAMU (sur PS4), et donc un CFW sur PS4 ?\nR : Non, j'ai arrêté de travailler sur la ps4 il y a longtemps, j'ai tout ce qu'il y a dessus.\n \nJe suppose que les fpkgs peuvent être mis en oeuvre sur PS5 sans Hyperviseur, mais je n'en suis pas sûr, on ne peut pas savoir tant qu'on n'a pas essayé de l'implémenter.\n \nQ : On parle d'une solution un peu comme Okage ? \nR : Non, mais j'ai utilisé sur PS5 un jeu PS4, tout simplement parce que la ps4 est meilleure parce qu'il n'y a pas de xom userland. \nLe système fonctionne aussi sur la ps4, il est donc facile à déboguer. Je charge une sauvegarde corrompue qui exploite le jeu.\n \nSpecter rajoute à ce sujet : Le cryptage des sauvegardes et l'encrytage et signature sont en partie nécessaires, de même que le fait qu'il faille un très bon bug, car les bugs de type analyseur sont difficiles à exploiter dans les environnements ASLR.\n \nFlatz quand à lui rajoute que l'exploitation de l'hyperviseur peut se faire directement à partir de la sauvegarde, mais de rajouter qu'il s'agit d'un jeu original sur disque PS4. \n \nQ : Un jeu PSN ça marcherait ?\nR : Je ne veux pas utiliser les jeux PSN car ils nécessitent des act.dat ... (entendez par là des licences d'activation), de plus un jeu sur disque pourrait éventuellement marcher sur tous les firmwares si les offsets sont adaptés.\n \nQ : Il y a aussi un point d'entrée pour l'emu de la ps4. Nous ne sommes pas encore sûrs d'avoir besoin d'un exploit kernel pour ça, mais si Flatz n'en a pas besoin pour leur hack PSP, ça devrait être bon.\nR : Vous pouvez utiliser tout le reste, je suppose, Sony peut juste corriger les bugs importants comme dans le kernel/ Hyperviseur, les exploits dans les jeux sont hors de portée, et ceux dans les webkits. \n \n \n \nVoilà c'est tout pour le moment, en espérant que cette interview croisée vous a plu, et que nous en sachions davantage d'ici quelques jours ou semaines. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176427/in-ps5-interview-de-flat-z-suite-au-dump-du-ps5-bootrom-psp-platform-security-processor-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176427/in-ps5-interview-de-flat-z-suite-au-dump-du-ps5-bootrom-psp-platform-security-processor-2.jpg"
        }
    }
}