{
    "news_1": {
        "title": "[PS4] PS4Profile v0.5 de Master_9 disponible",
        "content": "Et bien cela évolue assez vite pour PS4Profile puisque la version 0.5 vient d'être proposé par son développeur Master-s. \n \nIl y a quelques heures, Master_9 a dévoilé en effet une nouvelle mouture de son logiciel qui permet d'éditer le nom de son profil afin d'y apporter des modifications qu'il est impossible de faire dans une configuration standard.\n \n \n\n \n \n \nMaster_9 n'en est pas à son coup d'essai sur PS4, puisque par le passé il a contribué à PS5-PS4Tools, PS5-PS4PKGSender, ou encore PS4-PS5-Mast1c0re-Payloader.\n \n \n\n \n \nLe fonctionnement de PS4Profile est assez simple, l'outil peut se connecter à une PS4 Jailbreakée compatible avec le FTP, ce qui permet d'enregistrer le profil directement sur la console et de le rafraîchir en temps réel. L'outil permet l'édition de l'avatar, de votre nom / prénom, et l'icône associée à votre profil. \n \n \nTéléchargement : PS4Profile v0.5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175068/in-ps4-ps4profile-v05-de-master-9-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PS4] shadPS4 un nouvel émulateur PS4",
        "content": "La liste s'allonge sur les émulateurs PlayStation 4, voilà qu'un nouvel émulateur vient d'entrer dans la ronde et il se nomme shadPS4. \n \nDéveloppé par georgemoralis, qui se fait aussi appeler Shadow, il est à l'origine de nombreux projets à succès comme PCSX, PCSX2, PXSP, JPCSP ou encore arcadeflex.\n \nPour l'heure le projet est assez limité puisqu'il ne prend en charge sur des fichiers PS4 ELF, espérons qu'il progresse rapidement, même si ça seul le temps nous le dira. \n \n \n\n \n \n \n \nTout est encore à construire, vous devez utiliser Visual Studio 2022 pour cela, et il y a déjà des évolutions prévu comme un extracteur PKG, ou encore une interface graphique digne de ce nom utilisant imgui, SDL3 et Vulkan. Le développeur souhaite également mettre en oeuvre un meilleur système de journalisation avec spdlog.\n \nPour tout dire le projet a démarré en Octobre 2022, et il a déjà connu plus de 150 modifications, ce qui est assez important en matière de développement sachant que georgemoralis est seul pour le moment. \n \n \n\n \n \n \n \nTout est là : shadPS4\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175067/in-ps4-shadps4-un-nouvel-emulateur-ps4-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175067/in-ps4-shadps4-un-nouvel-emulateur-ps4-1.png"
        }
    },
    "news_3": {
        "title": "[XB] Dolphin UWP v1.1.6 et XBSX2 v2.0.2 disponibles",
        "content": "Soirée Microsoft Xbox car ce soir une conférence a lieu, mais il n'est pas pour autant question d'oublier les émulateurs déjà proposés, puisque 2 d'entre eux ont été mis à jour. \n \nL'émulateur Dolphin dans sa version UWP vient d'être mise à jour en version 1.1.6, Dolphin nous permet d'émuler les jeux GameCube et Wii sur les consoles Xbox One et Xbox Seies X/S.\n \n \n\n \n\n \n\n \n \nUn nouveau menu de pause dans le jeu avec des onglets de savestate (sauvegardes rapides) et de netplay (jeu en ligne) ont été ajoutés à partir de cette version. L'interface a également été améliorée, avec l'ajout d'un nouveau système d'onglets qui permet d'organiser les jeux par console (Wii, GameCube et WADS/ELF).\n \nCette version ajoute également un nouveau système de thèmes, comprenant deux thèmes par défaut créés par TXF et UR 0WN DAD, et enfin d'autres améliorations incluent la possibilité de déconnecter le contrôleur en sélectionnant l'option \"Aucun\" dans la fenêtre du contrôleur. Enfin des corrections de bugs ont été apportées pour parfaire le tout. \n \n \nTéléchargement : dolphin\n \n \n\n \n \nAutre émulateur proposé par SirMangler, XBSX qui passe en v2.0.2.\n \nCorrectifs : \n \n- Correction du (des) problème(s) visuel(s) avec Gran Turismo/autres jeux.\n- Numéro de version dans le menu principal.\n- Mise à jour vers la dernière révision.\n \nProblèmes connus dans cette version :\n \n- Le fait de définir \"Software\" comme paramètre par jeu provoque un plantage du jeu.\n- La boîte de dialogue d'échelle de l'OSD se ferme parfois de manière aléatoire lors de la saisie manuelle de nombres.\n \n \nTéléchargement : XBSX v2.0.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175015/in-xb-dolphin-uwp-v116-et-xbsx2-v202-disponibles-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175015/in-xb-dolphin-uwp-v116-et-xbsx2-v202-disponibles-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1175015/in-xb-dolphin-uwp-v116-et-xbsx2-v202-disponibles-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1175015/in-xb-dolphin-uwp-v116-et-xbsx2-v202-disponibles-4.png"
        }
    },
    "news_4": {
        "title": "[Switch] Battery Desync Fix NX v1.2.2 disponible",
        "content": "CTCaer vient de dévoilé une nouvelle version de leurs homebrew Battery Desync Fix NX qui passe désormais en version 1.2.2, pour rappel Battery Desync Fix NX est un homebrew permettant de corrigé la désynchronisation de la batterie sur Nintendo Switch.\n \n \n\n \nAvis de non-responsabilité :\nCette application ne bénéficie d'aucune assistance. Utilisez-la à votre propre discrétion.\nCette application ne doit pas être incluse dans les packs, les serveurs d'applications, etc.\nIl s'agit d'une application spécialisée qui ne doit être utilisée que si l'utilisateur a de réels problèmes avec la capacité totale et le pourcentage.\nLa façon la plus simple d'identifier le problème est d'observer des hausses et des baisses aléatoires du pourcentage de la batterie et de constater que la \"capacité actuelle\" ne correspond pas à la tension moyenne/oc.\n \nComment vous en servir ?\nEn supposant que vous commenciez par SYS CFW ou OFW/Stock :\n \n1. Démarrer SYS CFW\n2. Lancer l'application\n3. Appuyer sur le bouton X pour forcer l'init\n4. Quittez l'application correctement (appuyez sur \n5. Si vous voulez le faire pour OFW, redémarrez et démarrez OFW ou Stock.\n6. Effectuez 2 cycles de charge complets (??% -> 100% -> 0% -> 100% -> 0%).\n- Ne redémarrez pas sur autre chose tant que ce n'est pas fait !\n- Lorsque HOS se met en veille parce que la batterie est trop faible, réveillez-le encore et encore jusqu'à ce qu'il affiche l'icône rouge de la batterie.\n- Si HOS est éteint, mettez le chargeur pour accéder à HOS.\n* S'il est bloqué sur l'écran noir et l'icône du chargeur, débranchez/rebranchez après un moment pour pouvoir entrer à l'intérieur.\n* Ne le chargez pas complètement, car le HOS rétablira le contexte précédent de la jauge de carburant.\n \n\n\n \nChangelog :\n \n- Ajout d'une mesure d'atténuation pour les utilisateurs dont les données de sauvegarde du système sont corrompues.\n- Recompilation avec la nouvelle version de libnx\n\n \nLien de téléchargement : Battery Desync Fix NX v1.2.2\n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1160014/in-switch-ctcaer-devoile-le-correctif-de-desynchronisation-de-la-batterie-1.png",
            "image_2": "https://www.logic-sunrise.com/forums/public/style_emoticons/default/cool.gif"
        }
    },
    "news_5": {
        "title": "[PS5] Ca s'accélère pour les homebrews sur PS5 ?",
        "content": "Il semblerait que la PlayStation 5 soit très proches d'accueillir les homebrews, explications. Depuis quelques jours il semble que cela bouge sur PlayStation 5, après les récents progrès de John Törnblom sur l'exploit BD-JB, et la présentation de Specter à la Hardwear.io, ce sont de nombreux messages de Jose Coixao, plus connu sous le pseudonyme de Zecoxao, qui nous laissent penser sans équivoque que les homebrews vont très bientôt être proposés sur PS5.\n \n \n\n \n \nComme nous l'avons compris dans la présentation de Specter, si vous avez lu entre les lignes, un peu comme à la belle époque de la PS3, certains développeurs continuent de travailler dans l'ombre, probablement pour se protéger de Sony. \n \nCependant d'autres développeurs lâchent quelques informations sur les avancées pour notre plus grand plaisir. Tout comme la scène PS4, la scène PS5 est plutôt éclatée et individuelle, là où il y avait peut être un peu plus d'union ou d'équipes sur PS3. Cela ne l'empêche pas de progresser, et le développeur Zecoxao vient de lâcher quelques tweets intéressants. \n \nAinsi il dévoile des offsets kernel, probablement obtenu après des recherches sur des dumps de firmwares après qu'ils aient été décryptés, mais encore mieux, il parle d'un portage sur le firmware 3.10.\n \n \n\n \nUn slide important dans la présentation de Specter est la regression confirmée entre le firmwar 3.00 et 4.51, un bug important impactant la PS4 jusqu'au firmware 7.02, mais celui là nous le connaissions s'agissant du bug IPV6, confirmant ainsi que Sony avait fait une regression avec ces firmwares. \" Par miracle, la réintroduction sur PS5 s'est fait via une régression sur le firmware 3.xx. \n \n \n \n\n \n \n \nClairement le développeur reste assez mystérieux, mais il annonce que les homebrews arrivent sur PS5 entre le firmware 3.xx et 4.xx, qu'il n'y aura pas de possibilité sur les firmwares supérieurs au 5.xx, et qu'il faudra que tout cela soit porté sur les firmwares précédents.\n \n \n \n\n \n \nBien entendu n'espérez pas, du moins pas directement, l'arrivée de fpkg de leur part.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174996/in-ps5-ca-saccelere-pour-les-homebrews-sur-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174996/in-ps5-ca-saccelere-pour-les-homebrews-sur-ps5-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1174996/in-ps5-ca-saccelere-pour-les-homebrews-sur-ps5-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1174996/in-ps5-ca-saccelere-pour-les-homebrews-sur-ps5-4.png"
        }
    },
    "news_6": {
        "title": "[PS5] La présentation de Specter de Hardwear.io disponible",
        "content": "Le développeur Specter a réalisé une présentation lors d'une prise de parole il y a quelques jours pour le site Hardwear.io. Comme toujours, quelques jours après cette présentation, les slides sont exposés indiquant ce qui a fait l'objet d'une présentation. \n \nComme Specter nous l'avait annoncé, il n'est nullement question de dévoiler un nouvel exploit, cependant nous pouvons y trouver de nombreuses pistes sur la manière dont casser la sécurité actuelle de la PlayStation 5, avec le reverse engineering de l'hyperviseur PS5, ainsi que des pistes pour des futures attaques.\n \n \n\n \n\n \n\n \nLa présentation de Specter compare la sécurité de la PS5 à celle de la PS4, et explique aussi comment Sony a réussi à l'améliorer. La présentation démarre en rappelant que les exploits PS4 sont la poignée de grands hommes, qwertyoruiopz (4.50 et 5.05) et theflow (6.72 et 9.00) sur PS4. Il revient aussi sur le fait qu'avoir dévoilé des bugs via le programme bounty permet à Sony de les corriger, comme l'ASLR, le SMAP, ou encore les exécutions ROP qui sont désormais limitées par XOM. \n \n \n\n \n\n \n\n \n\n \n \nSpecter nous confirme que c'est autour du firmware 3.xx que de nombreuses failles critiques ont été corrigées, il préconise donc d'essayer de rester sur un firmware inférieur si c'est possible.\n \nDans ses slides, nous pouvons y voir comment TheFlow a fait pour mettre en place l'exploit kernel actuel, mais aussi nous apprenons que flatz a réussi à accéder au code de l'hyperviseur. \n \n \n\n \n\n \n \nLes 86 slides de présentation sont disponibles ici : exploring-the-PS5-security-landscape\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174981/in-ps5-la-presentation-de-specter-de-hardweario-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174981/in-ps5-la-presentation-de-specter-de-hardweario-disponible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1174981/in-ps5-la-presentation-de-specter-de-hardweario-disponible-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1174981/in-ps5-la-presentation-de-specter-de-hardweario-disponible-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1174981/in-ps5-la-presentation-de-specter-de-hardweario-disponible-5.png",
            "image_6": "https://www.logic-sunrise.com/images/news/1174981/in-ps5-la-presentation-de-specter-de-hardweario-disponible-6.png",
            "image_7": "https://www.logic-sunrise.com/images/news/1174981/in-ps5-la-presentation-de-specter-de-hardweario-disponible-7.png",
            "image_8": "https://www.logic-sunrise.com/images/news/1174981/in-ps5-la-presentation-de-specter-de-hardweario-disponible-8.png",
            "image_9": "https://www.logic-sunrise.com/images/news/1174981/in-ps5-la-presentation-de-specter-de-hardweario-disponible-9.png"
        }
    },
    "news_7": {
        "title": "[PS4] Street Fighter 6, Gollum, et League of Legends Story backportés",
        "content": "Une fois il marquera l'histoire de la PlayStation 4 et PlayStation 4 Pro, le développeur CyB1K vient de mettre en ligne les mises à jour backportées de jeux très attendus, que sont Street Fighter 6, The Lord of The Rings Gollum et Convergence A League of Legends Story. \n \n \n\n \n \nCes trois jeux n'ont pas été facile à backporter, surtout Street Fighter 6, mais il y est parvenu malgré le leak d'une version non finalisée, nous avions déjà connu cela avec Horizon Forbidden West, mais là on touchait directement à CyB1K.\n \n \n \n\n \n \n\n \n \n \nStreet Fighter 6 pèse environ 33 Go avec son update et son DLC, il vous faudra pour The Lord of The Rings Gollum, le pire jeu de l'année, un peu plus de 14 Go, et seulement 4 Go pour Convergence A League of Legends Story. \n \n \n\n \n \n \n \nDiablo IV ? \n \nBref, on passe à la suite, et le développeur s'est penché sur Diablo IV par curiosité, et il pense que celui là il va être très difficile de le faire tourner, car il faut qu'il fonctionne sur des serveurs.\n \nLe développeur s'est d'ailleurs exprimé là dessus, disant que le plus souvent les studios obligent le mode en ligne et avec une mise à jour future, ils le font sauter dans 80 % des cas. Ce n'est pas l'accès au PSN le problème, c'est que le jeu n'a pas de mode hors ligne, il a besoin d'un serveur pour démarrer, et donc il est impossible de faire des sauvegardes de données, les protocoles sont cryptés... \n \n \n\n \n \nCela montre aussi qu'il suffirait que tous les jeux consoles soient obligatoirement en ligne pour arrêter le piratage, heureusement certains studios ne peuvent se permettre de sortir des jeux exclusivement online, un peu comme les studios qui ne proposent que du dématérialisé, et plus de support physique là où d'autres proposent jusqu'à 2 galettes pour un seul jeu. \n \n \nEncore une fois il est interdit de partager des liens en commentaires, nous sommes là pour parler de hack pas pour échanger des liens warez. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174958/in-ps4-street-fighter-6-gollum-et-league-of-legends-story-backportes-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174958/in-ps4-street-fighter-6-gollum-et-league-of-legends-story-backportes-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] hekate v6.0.5 &#38; Nyx v1.5.4 disponibles",
        "content": "Le développeur CTCaer vient de mettre en ligne la version 6.0.5 de Hekate et la version 1.5.4 de Nyx. \n \n \n\n \n \n \nChangelog dans hekate v6.0.5 :\n- L4T : Ajout du support BPMP-FW pour T210 (gestion de l'énergie).\n- L4T : Ajout d'une sélection fine de la tension DRAM via ram_oc_vdd2 et ram_oc_vddq.\n- Plus d'informations seront disponibles dans le readme de la configuration de L4T 5.1.1.\n \nChangelog Nyx :\n- Dumping de l'étalonnage de la manette de jeu Lite\n- Le bouton \"Joycon BT pairing dump\" peut maintenant être utilisé pour récupérer les données de calibration du Lite Gamepad. (Utilisé dans L4T 5.1.1, pas encore publié).\n- Les erreurs eMMC sont désormais toujours signalées dans les informations eMMC, même si l'initialisation eMMC échoue.\n- Mise à jour des informations DRAM pour 2 des 3 nouvelles puces ram (pas encore validées).\n \nChangelog dans BDK :\n- MINERVA : Correction d'un problème où le mauvais nombre de tables pouvait être utilisé.\n- MINERVA : Normalisation de la fréquence sélectionnée. Cela permet à l'utilisateur de ne pas être précis sur la fréquence de la ram pour l4t.\n- MINERVA : Ajout du support pour 1966MHz (1958.4) et 2033MHz (2035.2) pour T210.\n- DRAM : Ajout de la prise en charge du custom dram id 7 pour T210 (7 est facile à graver au dessus de n'importe quel id T210 dans les fusibles). Ceci est valable pour les puces de 8GB.\n- DRAM : Nommez 2 des 3 nouvelles puces de mémoire vive (Pas encore validé, mais une supposition éclairée, puisque toutes les précédentes étaient correctes en fin de compte).\n- DRAM : Correction de l'information SKU sur les puces RAM Hynix en milieu de cycle.\n- PMIC : Réduction de la tension dram maximale autorisée pour le nouveau support de réglage de tension dram L4T afin d'être dans les limites officielles.\n- TIMER : Une nouvelle fonction isleep a été ajoutée qui permet une mise en veille basée sur le temps de l'instruction.\n- SDMMC : Correction d'un problème où la mauvaise raison d'erreur était rapportée pour le pad de calibration pour SD/eMMC.\n \n \nTéléchargement : Hekate 6.0.5 et Nyx 1.5.4\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174953/in-switch-hekate-v605-nyx-v154-disponibles-1.png"
        }
    },
    "news_9": {
        "title": "[PS4/PS5] De nouvelles failles confirmées mais rien du niveau de TheFlow ou Cturt",
        "content": "Le programme bounty de Sony répertorié sur le site hackerone.com vient de mettre en ligne l'information que de nouvelles failles ont été confirmées, c'est ce que confirme le programme qui affiche un bug découvert à 100 $ et une faille un peu plus importante de l'ordre de 1 000 $. \n \n \n\n \n\n \n \nLe premier a été découvert par Monk0x01 alors que la seconde a été trouvée par Corrupted_bytes pour le moment nous ne savons encore à quoi cela correspond, mais bon certainement pas quelque chose de réellement exploitable, surtout quand on a vu passer des 10 000 $ attribués à TheFlow et à Cturt. \n \n \nTout est là : hackerone.com\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174950/in-ps4ps5-de-nouvelles-failles-confirmees-mais-rien-du-niveau-de-theflow-ou-cturt-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174950/in-ps4ps5-de-nouvelles-failles-confirmees-mais-rien-du-niveau-de-theflow-ou-cturt-2.png"
        }
    },
    "news_10": {
        "title": "[Switch] SwitchIdent est de retour après presque 2 ans d'absence",
        "content": "Bonne nouvelle, le développeur Joel16 vient de mettre à jour son utilitaire SwitchIdent, après nous avoir régalé avec 3DSident sur Nintendo 3DS et Vitaident sur Sony PlayStation Vita, nous revient avec une toute nouvelle version de son logiciel d'identification mais celle à destination de la Nintendo Switch.\n \nL'outil comme sur les plates-formes permet d'afficher tout un tas d'informations sur le matériel, à savoir la version du système, du firmware, le numéro de série de la console, la région, la fréquence CPU ou GPU, ou encore les adresses IP utilisées.\n \n \n\n \n \nVoici les éléments qui peuvent être affichés :\n \n- Affiche la version du firmware.\n- Affiche le type de matériel et l'unité.\n- Affiche le numéro de série.\n- Affiche la région.  \n- Affiche les horloges CPU et GPU en fonction de la configuration de performances renvoyée par le service APM.\n- Indique si la Switch est en état dock ou portable.\n \nmais cette version 0.4 apporte beaucoup de nouveaux éléments : \n \nAjout d'un menu joycon pour afficher les informations du joycon.\n- Affichage de la batterie gauche et droite du joycon.\nNe pas initialiser wlan::inf si hosVersion >= 15.0.0 (depuis que ce service a été supprimé).\nMenu séparé pour la batterie et le (nouveau) chargeur.\n- Affichage de l'âge de la batterie (en pourcentage et en pcm).\n- Affichage de la température interne et externe de la batterie.\n- Affichage de la limite de courant d'entrée et de sortie du chargeur de batterie.\n- Affichage de la limite de courant de charge de la batterie.\n- Affichage de la limite de tension de charge de la batterie.\n- Affichage de la capacité (pcm) et de l'âge (pcm) de la batterie.\n- Affichage de la tension moyenne de la batterie.\n- Affichage du type de chargeur de batterie.\n- Affichage de la limite de courant du chargeur de batterie.\n- Affichage de la limite de tension du chargeur de batterie.\n \nTéléchargement : SwitchIdent 0.4\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174949/in-switch-switchident-est-de-retour-apres-presque-2-ans-dabsence-1.jpg"
        }
    },
    "news_11": {
        "title": "[PS4] Drum VR 1.00 Demo PSVR Homebrew de LapyGames",
        "content": "Le développeur Lapy est de retour avec un nouvel homebrew à destination du PlayStation VR sur PlayStation 4 et PlayStation 4 Pro. \n \nIl s'agit d'une démo sous forme d'homebrew nommé Drum VR et il est proposé en version v1.00. Drum VR 1.00 est un jeu musical de batterie pour la VR, mais il a été adapté sur PlayStation VR par Lapy. Jouez sur des batteries emblématiques et jouez dans des scènes épiques ! Grâce à votre rythme entraînant, vous devenez la colonne vertébrale de chaque chanson que vous jouez. \n \n \n\n \n\n \n \nBon le développeur le reconnait lui même il n'est peut être pas aussi amusant que ce qu'il espérait. \n \n \nTéléchargement : Drum VR 1.00 - Lapy.pkg (68 Mo)\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174948/in-ps4-drum-vr-100-demo-psvr-homebrew-de-lapygames-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1174948/in-ps4-drum-vr-100-demo-psvr-homebrew-de-lapygames-2.jpg"
        }
    },
    "news_12": {
        "title": "[PS5] Sony dévoile le firmware officiel 7.40",
        "content": "Le géant japonais vient de publier un nouveau firmware à destination de la PlayStation 5, il s'agit de la mise à jour 23.01-07.40.00, ou le firmware 7.40 si vous préférez.\n \nCette mise à jour contient deux notes, pour une fois, la première rapporte que les performances et la stabilité du système ont été améliorés.\n \nLa seconde information est que certains messages et la convivialité sur certains écrans ont été améliorés. \n \n \n\n \n \nLes messages que Sony véhiculent sont assez particuliers depuis 2 firmwares.\n \nVersion: 23.01-07.40.00 :\n \n- Nous avons amélioré les performances et la stabilité du logiciel système. \n- Nous avons amélioré les messages et l'ergonomie de certains écrans.\n \nCette mise à jour débarque quelques jours après la présentation de Specter à la Hardwear.io 2023, mais clairement il ne faut y voir aucune relation. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174893/in-ps5-sony-devoile-le-firmware-officiel-740-1.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] Amiigo v2.3.2 disponible",
        "content": "Le développeur CompSciOrBust vient de mettre en ligne une nouvelle version d'Amiigo, il s'agit là d'une première mise à jour depuis Aout 2022, soit il y a plus de 10 mois, il est donc important de voir débarquer une mise à jour de ce superbe outil. \n \nPour rappel, il s'agit d'une alternative à Emuiibo GUI et Emutool qui fonctionne directement sur la Switch, il s'agit d'une interface pour Emuibo qui va vous permettre d'émuler un Amiibo depuis un chargement de fichier via la SD. \n \nDans cette version, le développeur a mis l'accent sur le support, ainsi la v2.3.2 supporte Emuiibo 1.0, et de nouveaux paramètres permettent de basculer aléatoirement les UUID. \n \n \n\n \n \n \nChangelog : \n \n- Ajout du support pour Emuiibo 1.0\n- Le menu des paramètres a maintenant une option pour basculer les UUID aléatoires\n- Mise à jour du cache API inclus\n- REMARQUE : les UUID aléatoires ne s'appliqueront qu'aux Amiibos générés lorsque l'option est activée. \n \n \nTéléchargement : Amiigo v2.3.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174877/in-switch-amiigo-v232-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[PS4] Cyb1k ne lâche rien, même The Lord of the Rings : Gollum",
        "content": "Le développeur Cyb1k continue de régaler la scène PlayStation 4 avec désormais le teaser en une image de The Lord of the Rings : Gollum. \n \nAnnoncé il y a 4 ans par Daedalic Entertainment, initialement prévu en Septembre 2022, le titre a largement était retardé, pour être proposé le 25 Mai 2023.\n \n \n\n \n \nDe tous les jeux testés, ce jeu est dernier dans tous les classements, il était très attendu et du coup ce jeu a largement déçu, même les fans de la licence. \n \n \n \n\n \n \nBref, tout ça pour dire que dans quelques heures ou jours, nous allons pouvoir tester le jeu, qui semble être le pire jeu de 2023 sur la console. \n \n \n \nD'un tout autre genre, Street Fighter 6 ! \n \n\n \n\n \nAutre point à souligner le développeur de 32 ans progresse sur Street Fighter 6, il a désormais accès au mode World Tour et Training, il reste encore quelques réglages à faire avant de pouvoir se lancer dans des combats endiablés avec Chun-Li ou Blanka.\n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174842/in-ps4-cyb1k-ne-lache-rien-meme-the-lord-of-the-rings-gollum-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1174842/in-ps4-cyb1k-ne-lache-rien-meme-the-lord-of-the-rings-gollum-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1174842/in-ps4-cyb1k-ne-lache-rien-meme-the-lord-of-the-rings-gollum-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1174842/in-ps4-cyb1k-ne-lache-rien-meme-the-lord-of-the-rings-gollum-4.jpg"
        }
    },
    "news_15": {
        "title": "[Switch/Vita] Zelda Tears of the Kingdom sur PS Vita et sous Unreal",
        "content": "Depuis quelques jours Zelda Tears of the Kingdom fait beaucoup parler de lui, il faut dire que les projets pour le mettre en avant sont de plus en plus ambitieux. \n \nLe premier d'entre eux est que nous avons vu passer quelques images d'une PlayStation Vita faisant tourner le jeu. Clairement non, il s'agit tout simplement d'un utilisateur de Reddit, oriorioriorioriori, qui a montré le jeu tournant sur un PC sur Yuzu et diffusé via Moonlight sur la PlayStation Vita. \n \nMême si cela peut sembler intéressant, ce n'est techniquement pas la possibilité de lancer nativement l'émulateur ou le jeu Zelda Tears of the Kingdom sur la console portable de Sony. \n \n \n \n\n \n \n \nMême si cela tourne plutot de manière efficace, il est à noter qu'il y a un temps de latence (input lag) qui empêche de profiter pleinement du titre. \n \nLe thread Reddit est là : managed_to_get_totk_working_on_the_psvita\n \nAutre sujet sur Zelda Tears of the Kingdom, un français a recréé une démo de Tears of the Kingdom utilisant l'Unreal Engine. Réalisé par un fan dans le cadre d'une vidéo Youtube, Praxis a recréé une partie de l'île céleste à la recherche de Zelda. \n \n \n\n \nPour tester tout le travail qu'il a effectué jusqu'à présent, il a créé une démo nommée Rip off the Kingdom, présentant une île flottante originale semblable à celles du jeu original, avec quelques Bokoblins à combattre, et quelques puzzles mineurs pour que les utilisateurs puissent utiliser les mécanismes réimplémentés tels que Ultrahand et Recall. La version Unreal Engine de TotK peut être téléchargée sur le site itch.io de Praxy et jouée sous PC Windows. Bien que la configuration minimale requise pour jouer ne soit pas indiquée, il suffit de télécharger les 519 Mo du fichier .zip du jeu et d'exécuter le fichier .exe.\n \n \n\n \n \n \nTout est là : praxisofficiel.itch.io\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-584842261.png"
        }
    },
    "news_16": {
        "title": "[XBO] Xemu v0.7.92 disponible",
        "content": "Le développement de l'émulateur Xemu continue son bonhomme de chemin, pour se souvenir Xemu est avant tout un fork de XQEMU, le projet d'émulation système complet QEMU, toujours axé sur les fonctionnalités, les performances, et la stabilité et surtout l'expérience utilisateur.\n \nXemu se charge de restituer le fonctionnement d'une Xbox originale, et il vient d'être mis à jour en version 0.7.92, apportant de nouvelles améliorations pour la partie audio et graphique.\n \n \n\n \n \nAinsi \"l'état de sauvegarde\" dans son interface utilisateur est désormais supporté à partir de la version v0.7.92 !\n \nAuparavant, c'était possible, mais en utilisant la ligne de commande et du coup ce n'était pas pratique. Désormais c'est très facile !\n \nAvec cette nouvelle version via l'interface il est possible de déplacer la mise à jour des paramètres du chemin dvd à un niveau inférieur pour le moment. \n \n \n \n\n \n \n \n \nTéléchargement : Xemu v0.7.92 (Windows / macOS / Linux)\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174826/in-xbo-xemu-v0792-disponible-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] PS4Profile v0.04 disponible pour éditer votre nom de profil",
        "content": "Le développeur Master-s à qui l'on doit de nombreux utilitaires PS4 comme PS5-PS4Tools, PS5-PS4PKGSender, ou encore PS4-PS5-Mast1c0re-Payloader, propose désormais PS4Profile dans une toute première version 0.01.\n \nL'idée est de pouvoir éditer le nom de son profil afin d'y apporter des modifications qu'il est impossible de faire dans une configuration standard.\n \n \n\n \n \n \nAttention : \n \n- Vous devez activer votre compte hors ligne\n- C'est le fichier \"online.jsom\" dont vous pouvez changer le nom\n \n \n \n\n \n \n \n \nTéléchargement : PS4Profile v0.01\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174798/in-ps4-ps4profile-v001-disponible-pour-editer-votre-nom-de-profil-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] PS5 BD-JB ELF Loader v1.6.2 disponible",
        "content": "Le développeur John Törnblom vient de publier une mise à jour de PS5 BD-JB ELF Loader pour PlayStation 5. Pour rappel, l'ISO exploite les vulnérabilités découvertes dans la couche BD-J du firmware 4.51 de la PS5 et les versions antérieures de la console PlayStation 5, il vous faudra donc une console avec un lecteur fonctionnel et de quoi graver le bluray, en plus du bon firmware compatible. \n \n \n\n \n \n \nDans cette nouvelle version 1.6.2 de PS5 BD-JB ELF Loader, le développeur a introduit la prise en charge des payloads indépendamment de la position dans le code. Cela signifie que les payloads peuvent désormais s'exécuter n'importe où sur le système ou l'appareil, sans être limitées à un emplacement spécifique. Cette flexibilité permet aux utilisateurs d'exécuter le code souhaité de manière plus polyvalente, sans dépendre de chemins fixes ou prédéfinis.\n \n \nIl a mis à jour également le SDK : ps5-payload-sdk\n \n \nTéléchargement : PS5 BD-JB ELF Loader v1.6.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174775/in-ps5-ps5-bd-jb-elf-loader-v162-disponible-1.jpg"
        }
    },
    "news_19": {
        "title": "[Multi] DS4Windows améliore la gestion des DualShock 3",
        "content": "Le développeur Ryochan7 vient de proposer une nouvelle version de son utilitaire DS4Windows qui comme vous le savez permet de détecter et de configurer de nombreuses manettes sur un PC. \n \nAvec cette version les nouvelles corrections se focalise sur quelques optimisations pour les DualShoc 3, mais aussi la gestion de la compensation du gyroscope des souris. Comme vous le savez DS4Windows est une interface efficace pour paramétrer une manette sur PC, il est basé sur un fork de Jays2Kings. Pour en profiter cela passe par un câble micro-USB, mais il est aussi possible de s'en servir sans fils avec quelques adaptateurs Bluetooth 2.1 (ou supérieur). \n \n \n\n \n\n \n \n \n \nChangelog : \n \n- Ajout de l'enregistrement des tâches à la méthode de reprise\n- Augmentation de la période d'attente dans la routine de reprise\n- Mise à jour du lien d'installation de HidHide vers la version 1.2.128.0\n- Modification de la vérification de la frontière pour le placement de la fenêtre principale au démarrage\n- Ajout d'une compensation de gigue pour le Gyro Mouse Joystick\n- Rendre optionnelle la prise en charge des périphériques DS3. Le séparer de la prise en charge de la manette DS4\n- Abaissement de la limite X- du JoyCon LS lorsqu'il n'y a pas de calibration utilisateur.\n- Mise à jour des fichiers FakerInputDll.dll avec correction du drapeau d'écriture de fichier\n- Correction de l'enregistrement initial de l'état d'activation par défaut pour les contrôleurs non-DS4. Modifie principalement l'enregistrement dans le dossier AppData\n- Mise à jour de la traduction française. Contribution de EnzoChaussivert\n- Correction de la restauration de la position de la fenêtre sur les systèmes multi-moniteurs. Contribution de kurtanr \n \nTéléchargement : DS4Windows 3.2.11\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174772/in-multi-ds4windows-ameliore-la-gestion-des-dualshock-3-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174772/in-multi-ds4windows-ameliore-la-gestion-des-dualshock-3-2.png"
        }
    },
    "news_20": {
        "title": "[PS4] Le développeur Noob404 apporte Windows 10 à la PS4",
        "content": "Le développeur Noob404 que l'on connait bien sur PlayStation 4 et PlayStation 4 Pro pour avoir apporter de nombreuses distributions Linux vient de mettre en ligne un nouvel OS pour la console de Sony. \n \n \n \n\n \n \n \nProxmox OS pour PS4 est une solution qui vous permet de virtualiser Microsoft Windows 10 sur votre console PlayStation 4 à l'aide du système d'exploitation Proxmox, cela signifie que vous allez pouvoir installer et faire tourner Windows 10 sur PS4 via cette plate-forme de virtualisation d'entreprise open-source.\n \n \n\n \n \n \nLe gros avantage de Proxmox OS est de proposer une interface Web permettant de gérer les machines virtuelles, mais aussi le réseau, l'espace des stockage : \n \n- GUI Web Admin : Proxmox OS fournit une interface d'administration basée sur une interface graphique accessible via un navigateur Web. Cela permet aux utilisateurs de gérer facilement les machines virtuelles, les conteneurs, le stockage et la mise en réseau directement depuis la console PS4.\n- Accéder à Internet via Ethernet : La console PS4 est capable de se connecter à Internet via une connexion Ethernet.\n- Possibilité de faire tourner Windows : Grâce à la virtualisation offerte par Proxmox OS , il est possible de créer et faire tourner des machines virtuelles Windows 10 sur la console PS4. Cela signifie que vous pouvez utiliser des applications et des jeux compatibles avec Windows.\n- Console intégrée, accessible via un navigateur : Proxmox OS pour PS4 propose une console intégrée accessible via un navigateur Web. Cela vous permet d'interagir directement avec les machines virtuelles et les conteneurs créés sur la console PS4.\n- Accès SSH et FTP activés : Proxmox OS pour PS4 prend en charge l'accès via SSH (Secure Shell) et FTP (File Transfer Protocol). Cela permet aux utilisateurs d'accéder à distance à la console PS4 et de gérer les fichiers système et les configurations.\n \nTout n'est pas parfait, et certains bugs seront présents, les machines virtuelles créées sur Proxmox pour PS4 ne peuvent pas accéder directement au GPU de la console. Cela signifie que les performances graphiques des machines virtuelles peuvent être limitées, et le Wifi de la console PS4 n'est pas encore prise en charge dans le cadre de Proxmox pour PS4, par conséquent, les machines virtuelles créées sur Proxmox OS devront s'appuyer sur une connexion Ethernet pour accéder à Internet.\n \n \n \n\n \n \n \nComment installer la bête : toutes les instructions ici \n \n \nTéléchargement : Proxmox pour PS4 (bêta)\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-16315622.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-791830903.png"
        }
    }
}