{
    "news_1": {
        "title": "[PS4/PS5] Une scène PS4/PS5 en feu, une nouvelle récompense de 10 000 $",
        "content": "Et on continue sur la scène PS5 qui semble prise aux flammes, puisque c'est une nouvelle récompense qui vient de jaillir du programme bounty référencé sur le site hackerone.com. \n \nUn développeur ou un chercheur en sécurité répondant au pseudonyme de slidybat vient d'être récompensé d'une prime de 10 000 $, nous sommes habitués à ce que ce soit Theflow qui reçoive ce genre de \"gain\", mais c'est donc un petit nouveau qui entre dans la scène. \n \n \n\n \n \nJusqu'à présent ce développeur n'avait rapporté que des bugs pour la partie Valve, et c'est donc la première fois qu'il est récompensé pour la branche PlayStation. \n \n \n \n \n\n \n \n \nNous ne savons pas si son rapport de bug concerne la PS4 ou la PS5, et nous n'en n'avons pas encore le détail, mais une chose est sûre, ce genre de prime récompense souvent un bug très critique, du genre faille webkit ou faille kernel. \n \nTout est là : Hackerone.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195737/in-ps4ps5-une-scene-ps5-en-feu-une-nouvelle-recompense-de-10-000-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1195737/in-ps4ps5-une-scene-ps5-en-feu-une-nouvelle-recompense-de-10-000-2.png"
        }
    },
    "news_2": {
        "title": "[PS5] Specter confirme que le kexploit fonctionne sur les firmwares 2.x",
        "content": "Le développeur Specter, dont la réputation n'est plus à faire, vient de lâcher une image non équivoque avec notamment quelques informations en annexe. Il vient d'annoncer que le Kexploit sur la PS5 est bel et bien là et qu'il faut disposer d'un firmware 2.00 pour profiter du jailbreak lié à l'exploit PS5 UMTX. Il confirme donc que l'exploit complet (kernel + webkit) fonctionne sur PS5, son screen confirme que l'exploit fonctionne, puisqu'il montre l'exploit et l'hello world. \n \n \n \n\n \n \nIl nous informe sur les réseaux privés que l'exploit est compatible avec le firmware 2.00 et que son intention est de le porter sur le firmware 2.50 avant de rendre la chose publique, il souhaite d'abord rajouter quelques objects supplémentaires. \n \nSelon le développeur, le portage sur les firmware 3.xx jusqu'au 5.xx se fera plus tard, alors que pour le moment sur les firmware 6.xx et 7.xx il faudra attendre une autre implémentation de webkit, il semblerait donc qu'il soit pour l'heure impossible de faire le lien entre les exploits webkits et l'exploit kernel. Il rajoute qu'il pense que quelqu'un travaille sur la version BD-J sans pour autant dire si cela sera possible.\n \nEdit 13h00, voilà c'est fait, le support jusqu'au 2.50 a été réalisé, et comme promis Specter livre l'exploit intégral. \n \n\nCette vulnérabilité concerne les firmwares 1.00 à 7.61, mais les firmwares >= 3.00 semblent avoir des atténuations supplémentaires qui nécessitent une adaptation de l'exploit pour fonctionner. Specter ne s'intéresse qu'aux firmwares inférieurs, cet exploit ne prend pas en charge les firmwares >= 3.00 pour l'instant. De plus, la vulnérabilité WebKit qui est utilisée ici a été corrigée dans la version 6.00, donc un autre exploit WebKit qui permet la lecture/écriture en userland sera nécessaire pour ces systèmes. \n \n\n \nTout est disponible ici : https://github.com/PS5Dev/PS5-UMTX-Jailbreak\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195736/in-ps5-specter-confirme-que-le-kexploit-fonctionne-sur-le-firmware-200-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS5] Sony sort le firmware 10.01 pour la PS5",
        "content": "Sony a dévoilé hier un tout nouveau firmware pour la PS5, la mise à jour système numérotée 10.01 est un peu mystérieuse dans le sens où le 10.00 a apporté de nombreuses nouveautés, mais là très peu d'informations circulent.\n \nLa possibilité de modifier la lecture à distance, le paramétrage de la charge adaptative des DualSense sur le modèle slim et la PS5 Pro (oui on commence à en parler), l'amélioration de la personnalisation des profils audio 3D, le partage de Party, et l'amélioration de l'interface du centre d'accueil sont autant d'éléments qui ont été introduits, mais là le firmware 10.01 on ne sait pas du tout ce qu'il apporte. \n \nC'est pour le moins minimaliste, Sony annonce l'amélioration des performances et la stabilité du logiciel système, veuillez entendre une correction de failles ou une amélioration sécuritaire d'un exploit (webkit ou kernel), peut être suite à des publications ou des remontées récentes.\n \n \n\n \n \nQuoiqu'il en soit, il est possible aussi que ce firmware s'adresse aussi à la future PS5 Pro, le temps nous le dira, mais ce qui est certain c'est qu'aucune mise à jour n'a été dévoilé pour la PS4, donc les corrections sont spécifiques à la PS5. \n \n \n\n \n \nIl se murmure aussi que certains jeux, notamment Final Fantasy XVI n'aimait pas beaucoup les évolutions apportées par le firmware 10.00, il est possible que Sony tente de changer quelques lignes de code pour amener un peu de stabilité tout simplement. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195735/in-ps5-sony-sort-le-firmware-1001-pour-la-ps5-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1195735/in-ps5-sony-sort-le-firmware-1001-pour-la-ps5-1.png"
        }
    },
    "news_4": {
        "title": "[PS4] AutoBackPort 1.11 mis à jour par Cyb1K",
        "content": "Le petit outil AutoBackPort, développé à l'origine par RetroGamer74 a été mis à jour par un certain Cyb1k que l'on ne présente plus. \n \nAu programme, la possibilité de backporter n'importe quel jeu disponible sur un firmware exploité vers le firmware 5.05, en fait ce sont tous les jeux dumpés à partir des firmwares 7.55, 7.51, 7.50, 7.02, et 6.72 qui sont backportables vers le 5.05. Le programme n'avait pas eu de mise à jour depuis mars 2021, la version de Cyb1k se base sur la dernière version 1.11. \n \n \n\n \n \nAinsi le développeur Cyb1K nous informe avoir réalisé quelques modifications sur AutoBackPort 1.11 pour pouvoir backporter les jeux dumpés les plus récents à la version 9.00. \n \nTout n'est pas parfait, il nous informe que l'automatisation ne peut pas faire de backports 5.05, mais cela devrait aider certains jeux 11.00 à passer sur le 9.00 avant qu'une mise à jour ne soit backportée. \n \nPour tout ce qui est inférieur à la 9.00, vous devez toujours attendre un backport réel de mise à jour. \n \n \n Télécharger : AutoBackPort_1.11_Firmware_9.00-CyB1K.rar (19.17 MB) / lien 1fichier / lien mediafire\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195712/in-ps4-autobackport-111-mis-a-jour-par-cyb1k-1.png"
        }
    },
    "news_5": {
        "title": "[PS5] LightningMods va améliorer etaHEN sur le lancement de plugin et son interface",
        "content": "Le développeur LightningMods est en train de travailler sur l'amélioration d'etaHEN, l'idée est développer de nouvelles fonctions dans etaHEN pour les consoles PS5 jailbreakées. \n \nL'une des fonctionnalités est le lancement automatique des plugins, mais cela ne s'arrêta pas là. \n \n \n\n \n \nDeux options sont envisagées, la première est la mise à jour manuelle de la liste des plugins, il faut alors appuyer sur \"retour\" et sélectionner à nouveau les plugins pour voir apparaitre les modifications. La seconde option est un menu séparé, un nouveau menu dédié qui permettrait d'activer ou pas le démarrage automatique. \n \n\n \n \nCe n'est pas tout le développeur travaille aussi sur une interface de bureau qui s'approche beaucoup du style mmOS permettant une gestion poussée des fichiers PS5. \n \n \n\n \n \nBasé sur l'API graphique native de la console, l'AGC (Advanced Graphics Core), cette interface permettrait de gérer facilement les fichiers de la console.\n \n \n\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195676/in-ps5-lightningmods-va-ameliorer-etahen-sur-le-lancement-de-plugin-et-son-interface-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1195676/in-ps5-lightningmods-va-ameliorer-etahen-sur-le-lancement-de-plugin-et-son-interface-2.jpg"
        }
    },
    "news_6": {
        "title": "[Switch] Une potentielle fuite de protoypes d'usine de la &#34;Switch 2&#34; a été mise en ligne",
        "content": "Information a prendre avec de très grosses pincettes bien entendu, des images et spécifications techniques à propos de la console qui doit succéder à la Nintendo Switch ont été mise en ligne ce matin. Ces images comprennent des photos des controlleurs incomplets, mais aussi des modèles 3D, sans doute à destination des fournisseurs d'accessoires pour consoles qui ont besoin des dimensions spécifiques de l'appareil afin de se préparer à sa sortie. \n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \nUne autre source a publié les informations suivantes (mis à jour le 19/09/2024) : \n \nComposants :\nHGU1100 : La console\nHGU1110 : Joy-Con gauche \nHGU1120 : Joy-Con droit\nHGU1130 : Station d'accueil - Dock\n \nSpécifications techniques :\nSoC (CPU+GPU) : GMLX30-R-A1\nMémoire : MT62F768M64D4EK-026, 6Go@7500 MT/s LPDDR5X x2 (12Go)\nStockage flash : 256GB UFS 3.1 produit par Kioxia\nChipset audio: Realtek ALC5658-CG\nLecteur NFC : NXP PN7160B1HN\nMicrophone: CMB-MIC-X7\nVentilateurs : BSM0405HPJH9 et BSM0505HPJQC\nConversion des signaux vidéos : Realtek RTD2175N, avec support du HDMI 2.1\nRéseau : Realtek RTL8153B-VB-CG (Gigabit Ethernet)\nMicroncontrolleur : STMicroelectronics STM32GOBOCET6\nHauts-parleurs : MUSE BOX-L - MUSE BOX-R (Son stéréo)\n \n \n \nAffaire à suivre ! \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195640/in-switch-une-potentielle-fuite-de-protoypes-dusine-de-la-switch-2-a-ete-mise-en-ligne-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1195640/in-switch-une-potentielle-fuite-de-protoypes-dusine-de-la-switch-2-a-ete-mise-en-ligne-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1195640/in-switch-une-potentielle-fuite-de-protoypes-dusine-de-la-switch-2-a-ete-mise-en-ligne-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1195640/in-switch-une-potentielle-fuite-de-protoypes-dusine-de-la-switch-2-a-ete-mise-en-ligne-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1195640/in-switch-une-potentielle-fuite-de-protoypes-dusine-de-la-switch-2-a-ete-mise-en-ligne-5.png",
            "image_6": "https://www.logic-sunrise.com/images/news/1195640/in-switch-une-potentielle-fuite-de-protoypes-dusine-de-la-switch-2-a-ete-mise-en-ligne-6.png",
            "image_7": "https://www.logic-sunrise.com/images/news/1195640/in-switch-une-potentielle-fuite-de-protoypes-dusine-de-la-switch-2-a-ete-mise-en-ligne-7.png",
            "image_8": "https://www.logic-sunrise.com/images/news/1195640/in-switch-une-potentielle-fuite-de-protoypes-dusine-de-la-switch-2-a-ete-mise-en-ligne-8.png",
            "image_9": "https://www.logic-sunrise.com/images/news/1195640/in-switch-une-potentielle-fuite-de-protoypes-dusine-de-la-switch-2-a-ete-mise-en-ligne-9.png",
            "image_10": "https://www.logic-sunrise.com/images/news/1195640/in-switch-une-potentielle-fuite-de-protoypes-dusine-de-la-switch-2-a-ete-mise-en-ligne-10.png"
        }
    },
    "news_7": {
        "title": "[PS5] PS5 weeTools Pro v0.2.0 disponible",
        "content": "Le développeur Andy_maN nous informe de la disponibilité d'une nouvelle version de son outil PS5 weeTools Pro en version 0.2.0.\n \n \n\n \n \nChangelog PS5 WeeTools PRO v0.2.0 :\n \n- De nombreux codes d'erreur ECM (18 millions)\n- Informations détaillées sur chaque erreur\n- Clonage MAC\n- Régénération de dump\n- Décompresseur PUP unpacker\n \nLe développeur tient à remercier tout ceux qui le soutiennent et aussi Electrosoft pour son aide. \n \n \n\n \n \nTéléchargement : PS5 Weetools 0.2.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195619/in-ps5-ps5-weetools-pro-v020-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1195619/in-ps5-ps5-weetools-pro-v020-disponible-2.png"
        }
    },
    "news_8": {
        "title": "[WiiU] Cemu Android Bêta 8 disponible",
        "content": " \nOfficiellement disponible sous Windows, Linux et macOS, Cemu est l'émulateur  Wii U par excellence, mais le développement de la version Android a largement progressé ces derniers jours. Il faut dire que son développement va plutôt vite puisque voilà déjà la huitième version depuis son lancement le 13 Juillet 2024. \n \n \n\n \n \n \nLes nouveautés sont nombreuses, l'introduction des améliorations de recompilation des tests, et de la gestion du code, la mise à jour de xbyak, l'implémentation de DCBZ, et surtout de nouveaux contrôles ont été intégrés pour l'architecture x64. \n \nD'autres corrections sur les boutons de volume, les manettes de jeux, et la taille des boutons qui a été corrigé, sans compter toutes les optimisations de rendements Vulkan, et sur l'interface utilisateur.\n \nTéléchargement : Cemu-Android v.8\n \n \n \n \n",
        "images": {}
    },
    "news_9": {
        "title": "[3DS] TWiLight Menu++ v27.8.0 et nds-bootstrap v2.0.0",
        "content": " \nDans cette nouvelle version, vous trouverez de nombreuses améliorations pour la compatibilité des jeux ! De plus, en mode B4DS, certains jeux qui n'ont pas démarré depuis longtemps, démarrent enfin ! Comme vous pouvez le voir dans les changelog les changements sont nombreux ! \n \nQuoi de neuf sur TWiLight Menu++ v27.8.0 : \n- En raison des améliorations de compatibilité des jeux apportées dans nds-bootstrap, il n'y a désormais plus de jeux incompatibles connus pour le mode B4DS !\n- Sur les consoles DSi, les fonctionnalités liées à la puce I2C BPTWL (telles que l'icône de volume, l'icône de batterie à 4 barres et le changement de luminosité) sont désormais masquées si la puce est trouvée briquée.\n \nCorrections de bugs : \n- Détection de vente au détail/homebrew améliorée en vérifiant d'abord s'il s'agit d'un titre de vente au détail, avant de supposer qu'il s'agit d'un titre homebrew.\n- Appuyer sur le D-Pad gauche/droite dans le thème Wood UI permet désormais de sauter en fonction du nombre de titres affichés.\n- Correction des icônes restantes ?affichées à la place des icônes de dossier lors de la sortie/entrée dans un dossier dans le thème Wood UI.\n- Détection de grondement améliorée pour ne pas prendre trop de temps.\n- Code de commutation du mode d'écran tactile optimisé pour résoudre le problème où le son ne serait plus joué sur certaines consoles DSi/3DS.\n- Correction où le passage à la page des paramètres Divers dans les paramètres TWLMenu++ provoquait un plantage dans certains cas.\n- Correction du problème où toucher l'icône du thème DSi dans le manuel n'avait aucun effet.\n \nTéléchargement : TWiLight Menu++ v27.8.0\n \n \n\n\n \n \n \nQuoi de neuf sur nds-bootstrap v2.0.0 :\n- Vous vous souvenez de Foto Showdown ? Le clone de Pokémon où vous obtenez de nouveaux monstres en utilisant votre appareil photo DSi ou 3DS, et les utilisez dans les combats ?\n- Vous pouvez désormais y jouer sur votre console DS Phat ou DS Lite, avec une différence !\n- L'objectif de l'appareil photo sera soit remplacé par une vidéo (placez le fichier vidéo dans fat:/_nds/nds-bootstrap/dsiCamera/et nommez-le default.bin, il doit être enregistré à l'aide de dsi-camcorder), soit il sera simplement recouvert et vous ne verrez rien.\n- Si vous utilisez un modèle debug/dev de la DS, vous pouvez désormais également jouer à System Flaw & System Flaw: Recruit !\n- Les paramètres de préchargement de la ROM du référentiel nds-bootstrap-extras font désormais partie de nds-bootstrap lui-même, car ils aideront à réduire certains problèmes de chargement de la ROM provoquant des scintillements d'image et/ou des ralentissements dans certains jeux, quelle que soit l'interface que vous utilisez !\n- Le patch Card Read DMA est désormais implémenté en mode B4DS, ce qui permet à davantage de jeux tels que Army Men: Soldiers of Misfortune , The Magic School Bus: Oceans et Ultimate Mortal Kombat de fonctionner désormais sur les flashcards DS !\n- Minna no Mahjong DS , Diddy Kong Racing DS et Golden Sun: Dark Dawn fonctionnent désormais en mode B4DS, car leurs fonctions de sauvegarde sont désormais directement patchées sur arm9.\n- Mario Hoops 3 contre 3 fonctionne désormais en mode B4DS, car un patch manquant a été ajouté.\n- La version Kiosk Demo de Mario Kart DS démarre désormais sur les consoles DS et DSi !\n- Le serveur de guides Nintendo DS démarre maintenant !\n- Si votre console DSi n'a plus de LED qui s'allument (à cause d'une puce I2C BPTWL bloquée), mais que vous parvenez toujours à la démarrer en utilisant ntrboot, des correctifs sont désormais implémentés pour permettre aux jeux de fonctionner correctement !\n- Le patch DMA de lecture de carte a été réactivé pour les titres TWL exécutés en mode DSi.\n- Amélioration de la fonction de préchargement de la ROM sur DSi/3DS, car elle essaie désormais de précharger uniquement les données NitroFS, si la ROM est légèrement trop grande pour tenir dans la RAM de la console.\n- De plus, pour le préchargement complet de la ROM, 480 Ko de WRAM DSi sont désormais alloués à quelques ROM supplémentaires à précharger.\n- Le réglage de fréquence du son/micro fonctionne désormais dans homebrew !\n \nCorrections de bugs :\n- Sur les consoles DSi, dans Pokémon Noir & Blanc 1&2 fonctionnant en mode DSi, le défilement dans le menu du sac ne présente plus de ralentissement.\n- Espérons que les plantages aléatoires ont également disparu.\n- Sur les consoles DSi, l'intro de MegaMan Battle Network 5: Double Team DS ne présente plus de légers ralentissements.\n- En mode B4DS, la version européenne de Super Princess Peach démarre désormais !\n- Sur les consoles DSi/3DS, le scintillement des écrans de titre de Dragon Quest IV et VI a été réduit.\n- Sur les consoles DSi, Nervous Brickdown et Big Bang Mini ne plantent plus sur des écrans noirs au démarrage !\n- Correction d'un bug de lecture de musique dans Cooking Mama 2: Dinner with Friends exécuté dans des exploits DSiWare (tels que Memory Pit) et/ou en mode DSi.\n- En mode B4DS, grâce à l'implémentation de Card Read DMA, Call of Duty: Modern Warfare 3 ne plante plus pendant une cinématique.\n- La boutique Nintendo DSi et les paramètres système ne plantent plus sur les écrans blancs.\n- Code de commutation du mode d'écran tactile optimisé pour résoudre le problème où le son ne serait plus joué sur certaines consoles DSi/3DS.\n- Autres corrections mineures.\n \nTéléchargement : nds-bootstrap v2.0.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195610/in-3ds-twilight-menu-v2780-et-nds-bootstrap-v200-1.png"
        }
    },
    "news_10": {
        "title": "[PS6] L'agence Reuters dévoile qu'Intel a perdu le contrat sur la PS6",
        "content": "Incroyable, l'agence Reuters vient de dévoiler qu'Intel a perdu le contrat sur la fourniture de la puce principale sur la PS6. Même si la console n'a officiellement pas été annoncée par Sony, et bien on peut ce que l'on veut, l'agence Reuters ce n'est pas rien, elle recoupe par deux sources différentes toutes les informations qu'elle confirme, et l'article qu'elle vient de publier va faire date. \n \nL'agence Reuters confirme qu'Intel a perdu en 2022 le contrat de fourniture de la puce qui aura été le coeur de la PS6, et cela face à AMD. Les efforts d'Intel à convaincre n'auront pas suffit, et l'avenir passera avec AMD, bien que d'autres concurrents comme Broadcom ont aussi tentes de proposer une solution. \n \nL'idée de base de Sony était de se séparer du fondeur TSMC (Taiwan Semiconductor Manufacturing Company) au profit d'Intel qui développait alors son process de fabrication en 18A qui sera lancé l'année prochaine. \n \nLe 18A est un équivalent à du 1.8 nm, sachant que la PS5 Pro disposerait d'un APU gravé en 4 nm permettant une montée en fréquence importante, et donc des performances de tout premier ordre. \n \n \n \n\n \n \n \nPourquoi cela n'a pas fonctionné ? \n \nL'agence Reuters explique que les consoles de Sony se vendent à plus de 100 millions d'exemplaires sur une période de 5 années, la conception de la puce principale aboutie sur des bénéfices importants, mais pas aussi important que les 50 % que génère les puces AI. Le profit réalisé sur console est certe moins important mais beaucoup plus stable, et c'est probablement là que certaines discordances sont venues, Intel souhaitant un bénéfice par puce plus élevé que ce que Sony voulait bien octroyer. Le rival direct d'Intel, AMD, lui a accepté d'être moins rémunéré, et pour cause la sous-traitance à TSMC, qui a déjà ces usines (on parle de FAB) en constante évolution, a besoin de moins investir, donc un seuil de rentabilité plus bas. \n \nEn réponse aux informations de Reuters sur les négociations autour de la PlayStation 6 et l'échec d'Intel à remporter le marché, un porte-parole d'Intel a déclaré : « Nous sommes en profond désaccord avec cette caractérisation, mais nous ne ferons aucun commentaire sur les discussions actuelles ou potentielles avec les clients. Nous avons un pipeline de clients très sain dans nos activités de produits et de fonderie, et nous nous concentrons résolument sur l'innovation pour répondre à leurs besoins. »\n \n \n\n \n \nL'autre argument est la compatibilité avec les plates-formes précédentes, Sony a toujours laisse le doute sur la rétrocompatibilité entre les générations, même si finalement c'est surtout la PS3 qui a fait le plus d'effort sur le sujet. Le fait de changer d'APU aurait changé l'expérience du matériel. Monopoliser des ressources sur l'ingénierie pour permettre potentiellement une fonctionnalité qui pourrait exister par nature ne peut pas avoir du sens. Passer d'une solution AMD, sur une nouvelle architecture totalement différente n'était pour Sony pas envisageable. \n \nSi Intel avait remporté le contrat de la puce PlayStation 6, cela aurait pu occuper son unité de fonderie pendant plus de cinq ans, ont déclaré deux sources différentes. Selon les projections internes d'Intel, la division consoles de Sony aurait pu rapporter environ 30 milliards de dollars à Intel au cours de la durée du contrat, ont indiqué ces deux sources. La PlayStation 2 s'est vendue à environ 150 millions d'exemplaires depuis son lancement en 2000, et réalisé la même projection fait envie. \n \nL'article de Reuters est un indispensable à lire et il se trouve ici : www.reuters.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195575/in-ps6-lagence-reuters-devoile-quintel-a-perdu-le-contrat-sur-la-ps6-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1195575/in-ps6-lagence-reuters-devoile-quintel-a-perdu-le-contrat-sur-la-ps6-2.jpg"
        }
    },
    "news_11": {
        "title": "[Switch] La Team UnlockSwitch a finalisé le PCB de l'Xtractor",
        "content": "A l'origine surnommé eXtractor, l'Xtractor est le Game Dumper de l'UnlockSwitch, il s'agit de la solution matérielle qui permet de dumper les jeux Nintendo Switch. Selon l'équipe en charge du développement, ce dumpeur de rom permet de se passer d'une Switch hackée, mais où est-il ? \n \nDébut août la team UnlockSwitch avait annoncé l'intention de présenter son Xtractor entre le 15 et le 20 aout 2024, le temps file, nous sommes un mois plus tard et nous ne voyons rien arriver. \n \nLa team UnlockSwitch vient de laisser un message en s'excusant pour le retard, elle l'explique par le fait qu'elle n'était pas satisfaite de la version initiale. \n \n \n\n \n\n \n \nAprès quelques ajustements, l'équipe dit avoir finalisé le PCB, et qu'il est désormais en production, dans ses mots \" c'est au four \". Cela signifie qu'il va falloir encore un peu de temps avant de placer les composants, et de vérifier que tout fonctionne. \n \nNous avons compris que la team UnlockSwitch souhaite prendre son temps, mais ce serait bien que cette solution arrive avant la Switch 2 (les rumeurs à son sujet sont d'ailleurs de plus en plus fréquentes), de plus nous restons toujours dans l'attente de la partie software. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195566/in-switch-la-team-unlockswitch-a-finalise-le-pcb-de-lxtractor-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1195566/in-switch-la-team-unlockswitch-a-finalise-le-pcb-de-lxtractor-2.jpg"
        }
    },
    "news_12": {
        "title": "[Multi] Le développeur de Duckstation change la licence de l'émulateur PS1",
        "content": " \nLe développeur de Duckstation, stenzek, vient de faire un choix assez fort, jusqu'à présent son émultateur PS1 était distribué sous licence GNU GPLv3, libre de droit et open source. \n \nC'est sous cet argument que les développeurs de RetroArch utilisait un fork de Duckstation, mais après des mois de bataille c'est désormais sous licence PolyForm (PolyForm Strict pour être précis) que Duckstation est distribué, faisant désormais de Duckstation un logiciel distribué comme logiciel propriétaire. \n \n \n \n\n \n \n \nEn décembre 2020, nous vous parlions de l'émulateur, mettant en avant justement des problèmes liés à des licences utilisateurs d'autres émulateurs (EPSXE, PCSX), et informant qu'au moins lui était open-source.\n \nLe soucis est que Duckstation lui même intègre de nombreuses contributions extérieures, et il semble que stenzek semble ignorer cela, ainsi en changeant volontairement la licence de Duckstation sans consultation, il se pourrait qu'il y est violation des termes de la GPL.\n \n \n\n \n \nDuckStation est donc actuellement publié sous les termes de la licence Creative Commons ShareAlike Non-Commercial No-derivative version 4.0, ou CC BY-NC-ND 4.0 en abrégé - il s'agit d'une licence propriétaire, elle interdit l'utilisation commerciale du logiciel et interdit à toute personne ou entité de distribuer des versions modifiées - Stanzek a également décrété que personne ne fournira de versions à part lui, à partir de maintenant, alors que les forks existent depuis plusieurs années, et que l'un d'entre eux, SwanStation, est intégré dans RetroArch. C'est un peu là le fond du problème d'ailleurs car Stanzek ne supporte pas que LibRetro utilise son logiciel dans RetroArch. \n \nStanzek, surnom de l'auteur principal de DuckStation dont le nom complet est Connor McLaughlin, ne souhaite donc plus voir son logiciel Duckstation utilisé librement par LibRetro, alors que ces derniers l'ont implémenté depuis Juillet 2020.\n \n \n\n \n \nReste à voir qui a tord, qui a raison, mais ce qui est désormais certain c'est que Duckstation ne peut plus être utilisé librement. \n \nD'autres, comme Leah Rowe, se sont organisés en archivant la dernière version open-source du projet ici, quand au site officiel il est toujours disponible ici : Duckstation\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195497/in-multi-le-developpeur-de-duckstation-change-la-licence-de-lemulateur-ps1-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1195497/in-multi-le-developpeur-de-duckstation-change-la-licence-de-lemulateur-ps1-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1195497/in-multi-le-developpeur-de-duckstation-change-la-licence-de-lemulateur-ps1-3.png"
        }
    },
    "news_13": {
        "title": "[Wii/CG] Swiss v0.6r1730 disponible avec de nombreuses optimisations",
        "content": " \nLes développeurs emukidid et Extrems continuent d'améliorer leur solution logicielle Swiss, véritable couteau suisse de la Wii et de la GameCube, Swiss est un utilitaire homebrew tout-en-un, surtout déstiné à la Gamecube et qui permet la lecture de Carte SDSC / SDHC / SDXC via SDGecko ou SD2SP2, la lecture de DVD (- / + R) ou disques GameCube originaux via le lecteur de disque, il permet aussi de lire une Mémoire flash Qoob Pro, de réaliser du stockage de fichiers à distance via USB Gecko, d'émuler des cartes mémoire et bien plus encore.\n \nSwiss permet aussi de lire des documents texte, de lancer des homebrews, de lancer de la musique ou même, et c'est aussi ce qu'on lui demande, de lancer des jeux.\n \nLa nouvelle version qui vient d'arriver amène de nombreux changements ! \n \n \n\n \n \n \nChangelog emukidid :\n \n- Mémoriser les sélections de triche, remplacer la fonctionnalité « toutes les triches ».\n \nChangelog Extrems :\n \n- Clamper les déclencheurs au niveau de déclenchement.\n- Forcer le niveau de déclenchement lorsque le bouton est pressé.\n- Vérifier que les paquets nécessaires sont installés.\n- Correction de la sélection du mode vidéo au démarrage sur PicoBoot.\n- Éviter PAL-M dans le démarrage anticipé lors de l'utilisation de l'AV numérique.\n- Éviter d'écrire des paramètres de jeu correspondant aux valeurs par défaut.\n- Désactivation de la mise en pause lorsque la configuration de l'hyperviseur ne le permet pas.\n- Définir le mode d'enveloppement dans le script gxtexconv.\n- Définir le mode de filtrage dans le script gxtexconv.\n- Mise à jour de la base de données Redump.\n- Mise à jour de la version 1.1.1 du firmware de FlippyDrive.\n- Mise à jour du fichier README.md\n- Correction de la régression PAL-M.\n- Amélioration de la gestion des codes régionaux.\n- Utilisation de libdeflate pour la compression zlib.\n- Pré-découpage du nom de fichier de l'image du disque et ajout de l'ID du disque.\n- Amélioration de la suppression des caractères invalides.\n- Ajout de swiss_r*.dol à la liste de démarrage automatique.\n- Empêche le démarrage automatique des versions précédentes.\n \n \nTéléchargement : Swiss 0.6r1730\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195494/in-wiicg-swiss-v06r1730-disponible-avec-de-nombreuses-optimisations-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] mast1c0re est officiellement compatible avec le firmware 7.61",
        "content": "Cela progresse sous le firmware 7.61, qui semble devenir le golden firmware de la console. Comme vous le savez, il est complexe de trouver un exploit webkit fonctionnant avec l'exploit kernel, surtout que dans le cas présent il faut en plus passer par l'exploit BD-JB.\n \nCe sont plusieurs personnes qui ont été impliqués dans le support du firmware 7.61 pour mast1c0re, nous vous l'avons dit à plusieurs reprises, mais Zecoxao est proche des développeurs, il nous informe que Ernesto93215608 a pu tester et confirmer les changements opérés sur l'exploit par StretchEcho.\n \nAinsi ce dernier a modifié le code de mast1c0re (à l'origine proposé par McCaulay) qui définissait le support général du firmware 6.50 au 9.00 pour le positionner globalement du 6.50 au 9.60, mais plus intéressant pour nous, il a rajouté les offsets pour libérer mast1c0re sur le firmware 7.61, en plus des offsets jusqu'au firmware 6.50 déjà présent (jusqu'à ce jour mast1c0re supportait jusqu'au firmware 6.50 sur PS5). \n \n \n\n \n \nPour pouvoir en profiter comme vous le savez il vous faut avoir installer Okage Shadow King qui pour rappel permet de lancer l'exploit Mast1c0re qui doit être exécuté à travers le jeu PS2 exploitable.\n \nL'exploit mast1c0re supporte donc désormais le firmware 7.61 : mast1c0re\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195493/in-ps5-mast1c0re-est-officiellement-compatible-avec-le-firmware-761-1.png"
        }
    },
    "news_15": {
        "title": "[PS5] fail0verflow propose le code de l'exploit fbsd umtx et Flatz l'implémentation bd-jb",
        "content": "L'équipe fail0verflow propose de jouer avec l'exploit  fbsd umtx, à proprement parlé elle vient de dévoiler le code de débogage de la machine virtuelle FreeBSD.\n \nLe bug a été découvert début décembre 2020, par un génie qui a regardé fbsd pendant 15 minutes et a immédiatement repéré un bug. \n \nCette implémentation c++ a été réalisée lors d'une expérimentation visant à accroître la fiabilité des exploits après que le noyau ps5 ait ajouté des fonctionnalités de randomisation du tas.\n \nAu delà de ça, le développeur Zecoxao quand à lui confirme que l'exploit a été écrit par un type au hasard, que quelques minutes plus tard, fail0verflow vous donne le code de débogage de la machine virtuelle FreeBSD.\n \nEt quelques minutes plus tard, flatz a donné une implémentation complète pour bd-jb (KernelExploitGraal.java) et sa version lua en mode utilisateur. Plus qu'à attendre le portage pour le webkit désormais. \n \n \n\n \n \nCa va aller très vite, voilà pourquoi parfois il peut être intéressant de garder au chaud certaines découvertes, et ne pas les publier au plus grand nombre ou à Sony.\n \nPour rappel ou information, Flatz a confirmé que l'exploit fbsd umtx est compatible jusqu'au firmware 7.61, au delà l'exploit kernel est corrigé. Flatz qui a d'ailleurs aussi rajouté qu'il est probable que Sony n'ait jamais eu l'intention de corriger ce bug, et que Sony l'a patché accidentellement sur le firmware 8.00 en corrigeant l'accès syscall et libkernel (pour éviter les exploits Bluray Java, Webkit et les jeux PS2...). \n \n \n\n \n \n \nSource : Flatz  / fail0verflow\n \nSi vous souhaitez en apprendre un peu plus sur cet exploit c'est par ici : freebsd-umtx-privesc\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1278262024.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1914701162.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] Un nouveau clone du Mig Switch est là",
        "content": "Une nouvelle équipe vient de voir le jour, il s'agit d'une équipe qui a pour ambition de cloner le Mig Switch v2. \n \nIl y a quelques jours naissait cette équipe qui porte le nom de OpenMig, qui annonce avoir complétement cloné le Mig Switch v2. \n \n \n\n \n \nLa team propose les screens de la copie du PCB, la team UnlockSwitch ayant fait le choix de communiquer avec cette équipe située en Russie. Les deux équipes ont partagé des fichiers, une partie du code source du clone qui a tellement surpris UnlockSwitch qu'ils ont envoyer un échantillon du PBS UnlockSwitch.\n \n \n\n \n \n\n \n\n \n\n \n \nTout est là : OpenMig\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195435/in-switch-un-nouveau-clone-du-mig-switch-est-la-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1195435/in-switch-un-nouveau-clone-du-mig-switch-est-la-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1195435/in-switch-un-nouveau-clone-du-mig-switch-est-la-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1195435/in-switch-un-nouveau-clone-du-mig-switch-est-la-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1195435/in-switch-un-nouveau-clone-du-mig-switch-est-la-5.jpg"
        }
    },
    "news_17": {
        "title": "[Switch] MigFlash met à jour le firmware du Mig Dumper en v1.15",
        "content": "La Team MigFlash anciennement connue sous le nom de MigSwitch, propose depuis quelques heures une mise à jour pour le firmware du Mig Dumper. En livrant la version 1.1.5, l'équipe souhaite corriger un bug, assez rare qui se produisait aléatoirement. \n \nIl y avait un petit bug avec le Mig Dumper sur quelques parties rares de manière aléatoire sur certains dumpers. Avec l'aide très appréciée des membres de la communauté, l'équipe a finalement pu zoomer sur ce problème et il est maintenant corrigé avec cette nouvelle mise à jour du firmware.\n \n \n\n \n \n \nChangelog  : \n \n- 1.1.5 : Correction d'un problème dans le mig dumper où le lecteur pouvait se retrouver soudainement déconnecté à de rares occasions.\n \nTéléchargement : migflash\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195419/in-switch-migflash-met-a-jour-le-firmware-du-mig-dumper-en-v115-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] Un nouvel exploit Kernel (KEX) sur PS5",
        "content": "Depuis le début de semaine, la Playstation 5 fait grand bruit, aussi bien du côté officiel suite à l'annonce de la PS5 Pro, que du côté obscure de la force...\n \nEn effet, depuis quelques heures, une nouvelle faille webkit affectant tous les firmwares PS4/PS5 ( à ce jour) a été publié, nous vous en parlons ici.\nCette faille webkit ne permet pas le jailbreak de vos consoles, ceci est une porte d'entrée pour les développeurs afin d'injecter du code permettant en gros d' attaquer le kernel, à condition de posséder une second faille (faille Kernel / KEX).\n \n \n\n \nC 'est maintenant qu' intervient le sujet de cette new, un nouvel kernel pourrait être en développement sur PS5 grâce à l'avis de sécurité lié à CVE-2024-43102, une vulnérabilité critique du noyau (kernel) FreeBSD. Comme la PS4 et la PS5 fonctionnent sur l'architecture FreeBSD, les bugs de ce système d'exploitation affectent généralement les consoles Sony.\n \nIl est question ici, d' une vulnérabilité qui affecte seulement la PS5, la scène a découvert que cela n’avait pas d’impact sur la PS4 car le bug est basée sur FreeBSD 11.00 utilisé sur PS5, la PS4, étant sur FreeBSD 9.00, ne possède pas ce bug.\n \n\n \n \nAprès la publication du CVE, Zecoxao a confirmé sur Twitter/X qu' un ami à lui a pu exploiter ce bug pour créer un exploit Kernel sur PS5.\n \n\n \n \nUn exploit kernel permet l' activation du debug setting, indispensable pour le hack PlayStation afin (en gros) d'installer les fameux pkg ou Fpkg.\nCe kex serait beaucoup plus stable que l' exploit IPV6 UAF (exploit 3.xx/4.xx) et fonctionnel jusqu' au firmware 7.61 inclu sur PS5, patché depuis, avec le firmware 8.00. \n \n \n\n \n \nNous possédons donc une faille webkit tous firmware, une faille kernel jusqu' au 7.61 sur PS5 grâce au rapport CVE-2024-43102 , il nous manque juste le développeur qui pourra implémenter tous ça afin de profiter d'un nouveau hack et ainsi agrandir le parc de PS5 jailbreakées.\n \nIl se dit que Specter (l' auteur du hack 4.03 d' après les travaux de TheFlow) travaillerait sur ce bug dans un premier temps sur VM FreeBSD 11.00 afin de le porter sur PS5 par la suite.\n \nComme le dit le vieil adage : Patience est mère de sureté\n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195384/in-ps5-un-nouvel-exploit-kernel-kex-sur-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1195384/in-ps5-un-nouvel-exploit-kernel-kex-sur-ps5-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1195384/in-ps5-un-nouvel-exploit-kernel-kex-sur-ps5-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1195384/in-ps5-un-nouvel-exploit-kernel-kex-sur-ps5-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1195384/in-ps5-un-nouvel-exploit-kernel-kex-sur-ps5-5.png"
        }
    },
    "news_19": {
        "title": "[PS4/PS5] Sony sort le firmware 12.00 pour la PS4 et le 10.00 pour la PS5",
        "content": "Sony vient de dévoiler un nouveau firmware pour la PS4 mais aussi pour la PS5, de nombreuses nouveautés, des fonctionnalités, mais surtout ces nouveaux firmwares corrigent les failles, et notamment la vulnérabilité critique découvert dans le noyau FreeBSD. \n \nL'information provient de Debty lui même, \n \nhttps://twitter.com/idebty/status/1834192289901556027?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1834192289901556027%7Ctwgr%5E9978717ca8d9bffb53e7c59154db0802958e3719%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.biteyourconsole.net%2F2024%2F09%2F12%2Fil-nuovo-aggiornamento-della-console-playstation-5-sembra-aver-corretto-il-bug-del-kernel-freebsd%2F\n \n \nFw 10.00\n \nWow Sony, c'était rapide, 2 jours pour le réparer le problème ait été signalé pendant 6 mois.\nMaintenant que Sony a résolu le problème, je peux vraiment commencer à publier autant d'informations que je veux sans m'en soucier légalement et il est assez facile de dire ne mettez pas à jour la version 2 du firmware 10.00 à moins que vous ne vouliez manquer quelque chose.\n \n \nVous l'aurez compris il faut rester sur un firmware inférieur au 12.00 sur PS4 et au 10.00 sur PS5 pour avoir de l'espoir. \n \n \n\n \n \nSur PS5, ce nouveau firmware apporte quelques nouveautés :\n \n- Profils audio 3D personnalisés pour casques et écouteurs \n- Ajustez les paramètres de lecture à distance par utilisateur et choisissez qui est autorisé à se connecter à votre console PS5 à l'aide de la lecture à distance \n- Charge adaptative pour vos manettes (disponible pour le modèle PS5 slim et PS5 Pro lorsqu'il sera disponible)\n \n \n\n \n \n \nPour la PS4, avec ce firmware 12.00 \" Sony a amélioré les messages et la convivialité de certains écrans \". \n \nBref, vous l'aurez compris évitez ces mises à jour !\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1759451885.jpg"
        }
    },
    "news_20": {
        "title": "[PS5] L'exploit webkit s'améliore et propose plus d'options",
        "content": "Le développeur de l'exploit webkit fonctionnant sur les firmwares récents, cela faisait bien longtemps qu'un exploit webkit n'était pas fonctionnel sur les derniers firmwares proposés par Sony, se voit évolué sous les traits de son auteur \"Debty\" qui propose désormais plus d'options sur la page de l'exploit. \n \nLe développeur tient à avertir que certains modifient son code, et qu'il ne peut être tenu pour responsable si l'exploit endommage votre console, il prévient d'ailleurs qu'il a été découvert qu'il bloque d'une manière ou d'une autre certains fichiers système, il faut donc l'utiliser avec prudence. \n \nIl rajoute que son exploit a été signalé à Sony, mais qu'il a été ignoré, il est basé sur un problème d'espace utilisateur, ce n'est pas un jailbreak intégral, mais il a déjà évolué. Encore une fois, il peut briquer votre console, mais de nouvelles options sont apparues. \n \n \n\n \n \nLa première version du développeur Debty qui se trouve ici https://debvt.github.io/Wm/ ne contenait que \"Exploit Heap Memory Overflow\" et \"String Overflow\". Désormais \"Lastest Iteration\", \"Install Bin File\" et \"Start Exploit with Delay\" ont été ajoutés par le développeur Seregon (fixseregonwar). A partir du moment où cela modifie certains fichiers système il y a un risque important de brick, c'est ce sur quoi met en garde Debty.  \n \nTout est là : https://seregonwar.github.io/Overflow/\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195334/in-ps5-lexploit-webkit-sameliore-et-propose-plus-doptions-1.png"
        }
    }
}