{
    "news_1": {
        "title": "[PS5] fail0verflow propose le code de l'exploit fbsd umtx et Flatz l'implémentation bd-jb",
        "content": "L'équipe fail0verflow propose de jouer avec l'exploit  fbsd umtx, à proprement parlé elle vient de dévoiler le code de débogage de la machine virtuelle FreeBSD.\n \nLe bug a été découvert début décembre 2020, par un génie qui a regardé fbsd pendant 15 minutes et a immédiatement repéré un bug. \n \nCette implémentation c++ a été réalisée lors d'une expérimentation visant à accroître la fiabilité des exploits après que le noyau ps5 ait ajouté des fonctionnalités de randomisation du tas.\n \nAu delà de ça, le développeur Zecoxao quand à lui confirme que l'exploit a été écrit par un type au hasard, que quelques minutes plus tard, fail0verflow vous donne le code de débogage de la machine virtuelle FreeBSD.\n \nEt quelques minutes plus tard, flatz a donné une implémentation complète pour bd-jb (KernelExploitGraal.java) et sa version lua en mode utilisateur. Plus qu'à attendre le portage pour le webkit désormais. \n \n \n\n \n \nCa va aller très vite, voilà pourquoi parfois il peut être intéressant de garder au chaud certaines découvertes, et ne pas les publier au plus grand nombre ou à Sony.\n \nPour rappel ou information, Flatz a confirmé que l'exploit fbsd umtx est compatible jusqu'au firmware 7.61, au delà l'exploit kernel est corrigé. Flatz qui a d'ailleurs aussi rajouté qu'il est probable que Sony n'ait jamais eu l'intention de corriger ce bug, et que Sony l'a patché accidentellement sur le firmware 8.00 en corrigeant l'accès syscall et libkernel (pour éviter les exploits Bluray Java, Webkit et les jeux PS2...). \n \n \n\n \n \n \nSource : Flatz  / fail0verflow\n \nSi vous souhaitez en apprendre un peu plus sur cet exploit c'est par ici : freebsd-umtx-privesc\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1278262024.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1914701162.jpg"
        }
    },
    "news_2": {
        "title": "[Switch] Un nouveau clone du Mig Switch est là",
        "content": "Une nouvelle équipe vient de voir le jour, il s'agit d'une équipe qui a pour ambition de cloner le Mig Switch v2. \n \nIl y a quelques jours naissait cette équipe qui porte le nom de OpenMig, qui annonce avoir complétement cloné le Mig Switch v2. \n \n \n\n \n \nLa team propose les screens de la copie du PCB, la team UnlockSwitch ayant fait le choix de communiquer avec cette équipe située en Russie. Les deux équipes ont partagé des fichiers, une partie du code source du clone qui a tellement surpris UnlockSwitch qu'ils ont envoyer un échantillon du PBS UnlockSwitch.\n \n \n\n \n \n\n \n\n \n\n \n \nTout est là : OpenMig\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195435/in-switch-un-nouveau-clone-du-mig-switch-est-la-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1195435/in-switch-un-nouveau-clone-du-mig-switch-est-la-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1195435/in-switch-un-nouveau-clone-du-mig-switch-est-la-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1195435/in-switch-un-nouveau-clone-du-mig-switch-est-la-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1195435/in-switch-un-nouveau-clone-du-mig-switch-est-la-5.jpg"
        }
    },
    "news_3": {
        "title": "[Switch] MigFlash met à jour le firmware du Mig Dumper en v1.15",
        "content": "La Team MigFlash anciennement connue sous le nom de MigSwitch, propose depuis quelques heures une mise à jour pour le firmware du Mig Dumper. En livrant la version 1.1.5, l'équipe souhaite corriger un bug, assez rare qui se produisait aléatoirement. \n \nIl y avait un petit bug avec le Mig Dumper sur quelques parties rares de manière aléatoire sur certains dumpers. Avec l'aide très appréciée des membres de la communauté, l'équipe a finalement pu zoomer sur ce problème et il est maintenant corrigé avec cette nouvelle mise à jour du firmware.\n \n \n\n \n \n \nChangelog  : \n \n- 1.1.5 : Correction d'un problème dans le mig dumper où le lecteur pouvait se retrouver soudainement déconnecté à de rares occasions.\n \nTéléchargement : migflash\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195419/in-switch-migflash-met-a-jour-le-firmware-du-mig-dumper-en-v115-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] Un nouvel exploit Kernel (KEX) sur PS5",
        "content": "Depuis le début de semaine, la Playstation 5 fait grand bruit, aussi bien du côté officiel suite à l'annonce de la PS5 Pro, que du côté obscure de la force...\n \nEn effet, depuis quelques heures, une nouvelle faille webkit affectant tous les firmwares PS4/PS5 ( à ce jour) a été publié, nous vous en parlons ici.\nCette faille webkit ne permet pas le jailbreak de vos consoles, ceci est une porte d'entrée pour les développeurs afin d'injecter du code permettant en gros d' attaquer le kernel, à condition de posséder une second faille (faille Kernel / KEX).\n \n \n\n \nC 'est maintenant qu' intervient le sujet de cette new, un nouvel kernel pourrait être en développement sur PS5 grâce à l'avis de sécurité lié à CVE-2024-43102, une vulnérabilité critique du noyau (kernel) FreeBSD. Comme la PS4 et la PS5 fonctionnent sur l'architecture FreeBSD, les bugs de ce système d'exploitation affectent généralement les consoles Sony.\n \nIl est question ici, d' une vulnérabilité qui affecte seulement la PS5, la scène a découvert que cela n’avait pas d’impact sur la PS4 car le bug est basée sur FreeBSD 11.00 utilisé sur PS5, la PS4, étant sur FreeBSD 9.00, ne possède pas ce bug.\n \n\n \n \nAprès la publication du CVE, Zecoxao a confirmé sur Twitter/X qu' un ami à lui a pu exploiter ce bug pour créer un exploit Kernel sur PS5.\n \n\n \n \nUn exploit kernel permet l' activation du debug setting, indispensable pour le hack PlayStation afin (en gros) d'installer les fameux pkg ou Fpkg.\nCe kex serait beaucoup plus stable que l' exploit IPV6 UAF (exploit 3.xx/4.xx) et fonctionnel jusqu' au firmware 7.61 inclu sur PS5, patché depuis, avec le firmware 8.00. \n \n \n\n \n \nNous possédons donc une faille webkit tous firmware, une faille kernel jusqu' au 7.61 sur PS5 grâce au rapport CVE-2024-43102 , il nous manque juste le développeur qui pourra implémenter tous ça afin de profiter d'un nouveau hack et ainsi agrandir le parc de PS5 jailbreakées.\n \nIl se dit que Specter (l' auteur du hack 4.03 d' après les travaux de TheFlow) travaillerait sur ce bug dans un premier temps sur VM FreeBSD 11.00 afin de le porter sur PS5 par la suite.\n \nComme le dit le vieil adage : Patience est mère de sureté\n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195384/in-ps5-un-nouvel-exploit-kernel-kex-sur-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1195384/in-ps5-un-nouvel-exploit-kernel-kex-sur-ps5-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1195384/in-ps5-un-nouvel-exploit-kernel-kex-sur-ps5-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1195384/in-ps5-un-nouvel-exploit-kernel-kex-sur-ps5-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1195384/in-ps5-un-nouvel-exploit-kernel-kex-sur-ps5-5.png"
        }
    },
    "news_5": {
        "title": "[PS4/PS5] Sony sort le firmware 12.00 pour la PS4 et le 10.00 pour la PS5",
        "content": "Sony vient de dévoiler un nouveau firmware pour la PS4 mais aussi pour la PS5, de nombreuses nouveautés, des fonctionnalités, mais surtout ces nouveaux firmwares corrigent les failles, et notamment la vulnérabilité critique découvert dans le noyau FreeBSD. \n \nL'information provient de Debty lui même, \n \nhttps://twitter.com/idebty/status/1834192289901556027?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1834192289901556027%7Ctwgr%5E9978717ca8d9bffb53e7c59154db0802958e3719%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.biteyourconsole.net%2F2024%2F09%2F12%2Fil-nuovo-aggiornamento-della-console-playstation-5-sembra-aver-corretto-il-bug-del-kernel-freebsd%2F\n \n \nFw 10.00\n \nWow Sony, c'était rapide, 2 jours pour le réparer le problème ait été signalé pendant 6 mois.\nMaintenant que Sony a résolu le problème, je peux vraiment commencer à publier autant d'informations que je veux sans m'en soucier légalement et il est assez facile de dire ne mettez pas à jour la version 2 du firmware 10.00 à moins que vous ne vouliez manquer quelque chose.\n \n \nVous l'aurez compris il faut rester sur un firmware inférieur au 12.00 sur PS4 et au 10.00 sur PS5 pour avoir de l'espoir. \n \n \n\n \n \nSur PS5, ce nouveau firmware apporte quelques nouveautés :\n \n- Profils audio 3D personnalisés pour casques et écouteurs \n- Ajustez les paramètres de lecture à distance par utilisateur et choisissez qui est autorisé à se connecter à votre console PS5 à l'aide de la lecture à distance \n- Charge adaptative pour vos manettes (disponible pour le modèle PS5 slim et PS5 Pro lorsqu'il sera disponible)\n \n \n\n \n \n \nPour la PS4, avec ce firmware 12.00 \" Sony a amélioré les messages et la convivialité de certains écrans \". \n \nBref, vous l'aurez compris évitez ces mises à jour !\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1759451885.jpg"
        }
    },
    "news_6": {
        "title": "[PS5] L'exploit webkit s'améliore et propose plus d'options",
        "content": "Le développeur de l'exploit webkit fonctionnant sur les firmwares récents, cela faisait bien longtemps qu'un exploit webkit n'était pas fonctionnel sur les derniers firmwares proposés par Sony, se voit évolué sous les traits de son auteur \"Debty\" qui propose désormais plus d'options sur la page de l'exploit. \n \nLe développeur tient à avertir que certains modifient son code, et qu'il ne peut être tenu pour responsable si l'exploit endommage votre console, il prévient d'ailleurs qu'il a été découvert qu'il bloque d'une manière ou d'une autre certains fichiers système, il faut donc l'utiliser avec prudence. \n \nIl rajoute que son exploit a été signalé à Sony, mais qu'il a été ignoré, il est basé sur un problème d'espace utilisateur, ce n'est pas un jailbreak intégral, mais il a déjà évolué. Encore une fois, il peut briquer votre console, mais de nouvelles options sont apparues. \n \n \n\n \n \nLa première version du développeur Debty qui se trouve ici https://debvt.github.io/Wm/ ne contenait que \"Exploit Heap Memory Overflow\" et \"String Overflow\". Désormais \"Lastest Iteration\", \"Install Bin File\" et \"Start Exploit with Delay\" ont été ajoutés par le développeur Seregon (fixseregonwar). A partir du moment où cela modifie certains fichiers système il y a un risque important de brick, c'est ce sur quoi met en garde Debty.  \n \nTout est là : https://seregonwar.github.io/Overflow/\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195334/in-ps5-lexploit-webkit-sameliore-et-propose-plus-doptions-1.png"
        }
    },
    "news_7": {
        "title": "[PS4/PS5] Un nouveau point d'entrée (exploit webkit) pour tous les firmwares PS4 et PS5",
        "content": " \nEt bien en voilà une journée bien complète, voilà que Zecoxao dévoile un nouveau point d'entrée, un nouveau webkit exploit pour la PS4 et la PS5, et qui est peut être fonctionnel aussi sous PS5 Pro. \n \nQuoiqu'il en soit, le webkit exploit fonctionnerait sur tous les firmwares, même les 5.xx, 6.xx, 7.xx, 8.xx et 9.xx sur PS5, et sur PS4 il serait fonctionnel aussi sur 11.02, 11.50 et 11.52. \n \nIl faut tester, mais il est fonctionnel sur PS5 9.60, donc il n'y aucune raison qu'il ne soit pas porté sur les autres, même s'il n'est pas directement fonctionnel. \n\nLe développeur Zecoxao invite donc à tester l'exploit wekbit compte tenu des avancées récentes du kernel exploit qui pour le moment reste dans l'ombre. \n \n\n \n \nL'exploit webkit est là : \n \nhttps://debvt.github.io/Wm/\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195258/in-ps4ps5-un-nouveau-point-dentree-pour-tous-les-firmwares-ps4-et-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1195258/in-ps4ps5-un-nouveau-point-dentree-pour-tous-les-firmwares-ps4-et-ps5-2.png"
        }
    },
    "news_8": {
        "title": "[PS5] La PS5 Pro annoncée, mais à un prix hallucinant de 799 euros sans lecteur",
        "content": "Sony vient d'annoncer sa PS5 Pro, au prix de lancement de 799 euros sans lecteur puisqu'il s'agit du modèle slim auquel il faudra ajouter un lecteur optique proposé officiellement à 119 euros, bref 920 euros, clairement Sony a craqué.\n \n \n\n \n \n \nLes hausses récentes de prix, l'inflation et les pénuries auront finalement auront fait pencher le prix dans la balance, mais quel prix ! Cela va limiter les scalpers ça c'est une certitude, mais est-ce qu'il est envisageable de mettre 920 euros dans une console. \n \n \n \n\n \n \n \nElle sortira officiellement le 07 novembre 2024, les précommandes seront prises à partir du 26 septembre 2024, et son design est même surprenant puisqu'elle est plus grande que la slim. \n \nAprès il faut avouer que la console a des spécifications incroyables, elle passe d'une puissance GPU FP32 de 10.2 Tlops à 33.5 Tflops, du AMD RDNA1 au AMD RDNA3, car il s'agit d'un SoC Viola au lieu d'un Oberon, de 36 CU à 60 CU, les fréquences CPU et mémoires étant elles aussi revues à la hausse. Tout cela pour dire que les jeux seront effectivement beaucoup plus beaux, et ils pourront enfin tourner en 4K. Le tout avec 2 To de stockage, c'est d'ailleurs aussi probablement cela qui fait qu'elle reste chère. \n \n \n\n \n \n \nSony pouvait probablement faire moins cher en proposant seulement une console avec 1 To, mais clairement Sony voit loin, avec une console qui arrive en mid-gen et qui fera quelques années supplémentaires.\n \nCe qui aussi certain c'est que la slim a déjà un an, et qu'un refresh verra le jour d'ici un an ou deux à base de Viola allégé ou incomplet pour rentabiliser la production, il faudra bien liquider les composants avec une véritable slim, mais nous n'en sommes pas encore là. \n \n \n\n \n\n \n \nLes premières images officielles proposées par Cnet ici : \n \nhttps://www.cnet.com/tech/gaming/exclusive-hands-on-i-played-sonys-all-new-ps5-pro/\n \n \nElles montrent aussi que la PS5 Pro est beaucoup plus grande que la slim, il est évident que cette PS5 Pro restera dans l'histoire de part son prix annoncé, qui sera certainement revu si les ventes ne sont pas au rendez-vous. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1492018403.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1559211324.png",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1968382684.png",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-1274922694.png"
        }
    },
    "news_9": {
        "title": "[PS5] PS5 Slim, PS5 Pro, DualSense v2, Portal 2 que prépare Sony ?",
        "content": "Ce soir à 17h00 Sony dévoilera une \"présentation technique\" de la part de Mark Cerny, l'architecte de la PS4 et de la PS5, sans aucune autre précision difficile de savoir ce qui sera présenté mais les rumeurs vont bon train. \n \nElles passent de la présentation officielle de la PS5 Pro, à la PS5 Superslim, avec des précommandes qui seraient disponibles dès la fin de la présentation avec une commercialisation en Novembre 2024, mais ce n'est pas tout. \n \n \n\n \n \nDans cette émission qui durera 9 minutes tout de même, Mark Cerny nous présentera le futur de la PS5 et de la technologie PlayStation. Dans ce stream certains pensent que Sony ne fera pas que présenter la PS5 Pro, il se murmure que la DualSense v2 sera également dévoilée, ou que la PSP 3 sera également annoncée, Sony ayant été motivé par le succès du PlayStation Portal. \n \nTout ceci s'accompagnerait de belles hausses de prix, on parle de 89 euros pour la DualSense 2, nous verrons bien ce soir à 17h00. Pensez vous que Sony va annoncer autre chose que la PS5 Pro ? \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195199/in-ps5-ps5-slim-ps5-pro-dualsense-v2-portal-2-que-prepare-sony-1.jpg"
        }
    },
    "news_10": {
        "title": "[WiiU] Cemu v2.2 disponible",
        "content": "Une nouvelle mise à jour de Cemu vient de paraitre, il s'agit de la version 2.2 de l'émulateur Wii U, qui introduit plusieurs correctifs notamment sur la gestion des délais d'attente, qui vise à résoudre un crash dans Skylanders SuperChargers et Imaginators. \n \nAuparavant il y avait un bug qui empêchait l'application de l'option \"Recevoir les mises à jour non testées\" désormais cela a été corrigé. \n \n \n\n \n \nLa version Linux de son côté à elle aussi été améliorée, notamment la gestion du fichier système a été rectifiée, et les fichiers de traduction en français, coréen et chinois simplifié ont été mis à jour.\n \n \n \nTéléchargement : Cemu 2.2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195196/in-wiiu-cemu-v22-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[XBO] XWineOne l'équivalent à ShadPS4 pour la Xbox One",
        "content": "L'émulateur ShadPS4 a déjà tourmenté le monde PS4, voilà peut être son équivalent sur Xbox One sous le nom de XWineOne, ou du moins, il vise à rendre l'intégralité du catalogue Xbox One compatible et accessible sous PC Windows. \n \nCette surcouche Xbox One se destine aux utilisateurs PC sous Windows, actuellement 6 jeux sont pleinement jouables, et nombreux sont ceux qui vont du logo jusqu'en jeu, sans pour autant prétendre être \"jouable\". \n \n \n\n \n \n\n \n\n \n\n \n \nComme vous le savez peut être Microsoft a introduit Xbox Play Anywhere, qui propose 333 titres compatibles et offrant ainsi une diversité importante des titres accessibles. \n \nTout est là : XWineOne\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195194/in-xbo-xwineone-lequivalent-a-shadps4-pour-la-xbox-one-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1195194/in-xbo-xwineone-lequivalent-a-shadps4-pour-la-xbox-one-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1195194/in-xbo-xwineone-lequivalent-a-shadps4-pour-la-xbox-one-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1195194/in-xbo-xwineone-lequivalent-a-shadps4-pour-la-xbox-one-4.jpg"
        }
    },
    "news_12": {
        "title": "[PS4] GoldHEN stage 2 v1.03 disponible",
        "content": "Le développeur SiStrO a mis a jour le stage2 de GoldHEN, en apportant le support officiel des firmwares 10.50, 10.70 et 10.71 de la PS4, des firmwares qui sont moins utilisés que les populaires 9.00 ou 11.00.\n \n\n \n \nPour rappel, GoldHEN est un Homebrew ENabler pour la PS4, sous forme de payload, qui permet aux utilisateurs de débloquer certaines fonctionnalités et d’exécuter des homebrews sur leur console. Ce laoder ne prend en charge que les payloads ayant un point d’entrée dans le kernel. La version personnalisée de stage recherche d’abord le payload dans le répertoire racine de la clé USB, et s’il est trouvé, il est copié sur le disque dur interne à ce chemin : /data/GoldHEN/payloads/goldhen.bin. \n \n \nTéléchargement : GoldHEN stage 2 v1.03\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195122/in-ps4-goldhen-stage-2-v103-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[Multi] Dolphin dévoile un énorme rapport et une nouvelle version",
        "content": "Les petits gars de Dolphin ont mis un gros coup de collier, ils proposent une nouvelle version et un énorme rapport de progression. La version 2409 et son rapport d'avancement sont en ligne ! \n \nL'équipe parle de polygones explosifs, Cached Interpreter 2.0, des capteurs externes sur Android, la nouvelle version de Dolphin va sauvegarder vos pixels et bien plus encore !\n \n \n\n \n \nBeaucoup de choses ont changé. Dolphin a finalement laissé derrière lui l'ère 5.0 et est entré dans l' ère des versions. Non seulement il s'agit de la première version en huit ans, mais à l'avenir elles seront nombreuses. \n \nDolphin prend désormais en charge RetroAchievements, au cours des deux derniers mois, l'équipe Dolphin a résolu un problème majeur ainsi que de nombreux problèmes plus petits avec RetroAchievements. La première itération de RetroAchievements dans une version de sortie est stable, mais pas si flashy. Les bases sont là pour de futures améliorations, mais de nombreuses fonctionnalités et options restent encore à terminer. De plus, le support Android est toujours bloqué par quelques problèmes.\n \n \nLe rapport est disponible ici : dolphin-progress-report-release-2407-2409\n \nTéléchargement : Dolphin 2409\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195101/in-multi-dolphin-devoile-un-enorme-rapport-et-une-nouvelle-version-1.png"
        }
    },
    "news_14": {
        "title": "[3DS] Mandarine v1.1 disponible",
        "content": "Le développeur PabloMK7 est de retour avec une nouvelle version de Mandarine, cette nouvelle version 1.1 apporte de nombreux changements par rapport à la v1.0 libérée il y a un mois. \n \nLe fork de Citra, Mandarine, est une version retravaillée qui offre en théorie des performances supérieures, des mises à jour récentes, et des optimisations supplémentaires par rapport à Citra Enhanced. L'interface utilisateur a été revue, de nouvelles options audio ont été introduites, et ainsi que le contrôle sur Android. \n \nLa nouvelle version 1.1 corrige beaucoup de bugs, apporte de nombreuses améliorations, des correctifs, par exemple une meilleur gestion de la pause de l'émulateur sur PC. \n \n \n \n \n\n \n \n \nChangelog : \n \n- PC : Modification de la façon dont la mise en pause de l'émulateur est gérée pour permettre le frame (@OpenSauce04)\n- Android : Implémentation d'une interface graphique de personnalisation de la mise en page (@DavidRGriswold)\n- Code/CI : Mise à jour vers Clang 18\n- PC : Corrections de la création de raccourcis Flatpak (@OpenSauce04, ceci pour une future implémentation de Flatpak)\n- externals : mise à jour des sous-modules\n- shader_jit_a64 : Optimisation des tests conditionnels (@Wunkolo)\n- Android : Quelques changements d'interface\n- Android : Correction du padding si l'interface des paramètres est trop petite\n- PC : Nombreuses corrections pour les raccourcis clavier (@OpenSauce04)\n- qt : Correction de la langue par défaut qui n'est pas définie sur la langue principale utilisée par le système (@kleidis)\n- Android : Ajout d'une option de thème statique (@kleidis)\n- GSP_GPU : Ne pas toujours déboguer GXCommandProcessed sur TriggerCmdReqQueue\n- gradle : mise à jour de certaines dépendances\n- PC : Renommer Report Compatibility en Report Issues\n- Android : implémenter le support pour l'échelle de résolution automatique\n- Android & PC : Rebrand Custom CPU Ticks names (Une réinitialisation de la configuration est suggérée ici)\n- Android & PC : Ajout d'un paramètre système pour les pas par heure (@szdarkhack)\n- vk_stream_buffer : Refonte de la sélection du type de mémoire tampon Vulkan (@i0x404)\n- act : Ajout de noms de commandes et implémentation de GetErrorCode (@DaniElectra)\n- core : Suppression de certaines utilisations de l'instance globale du système par le portage PLGLDR (@raphaelthegreat)\n- Android & PC : Ajout du mode 3D Sterioscopic Side by Side inversé (@OpenSauce04)\n- Android : Correction du bouton pause de l'émulateur qui fait planter l'émulateur\n- shader_jit_a64 : Compact host executable memory (@Wunkolo)\n- Code : Application d'autres mises à jour et améliorations minimales\n \n \nTéléchargement : Mandarine 1.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195100/in-3ds-mandarine-v11-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[PS4/PS5] Vers une solution semi permanente (CFW) sur PS4 et PS5",
        "content": "Le développeur Zecoxao, très proche de certains autres développeurs, annonce qu'une solution semi permanente serait possible sur PS4 et PS5. Attention, il parle bien avec le conditionnel et rien n'est certain, mais il parle bien d'une solution semi permanente sur PS4 et PS5. \n \nQuand nous parlons de solution semi permanente, nous parlons de ce qu'il est possible de faire avec un custom firmware, entendu qu'il s'agit d'une modification firmware, permettant de revenir en arrière ou de rester sur le firmware officiel. \n \nLes solutions actuelles ne sont pas codées dans le dur du firmware, et n'existe plus si vous mettez à jour votre cache, ou que vous le videz, cette solution serait donc plus évoluée.\n \n \n\n \n \nLe développeur Zecoxao précise que cela devrait fonctionner sur PS5 sous les firmwares 3.xx et 4.xx, et il ne sait pas si cela est envisageable sur plus récent, comme sur le firmware 8.20. \n \nNiveau PS4, il confirme que sur le firmware 5.05 ce serait possible, mais comme pour les autres firmwares sensibles. Cela semble laisser dire qu'il faudrait disposer d'un firmware sensible aujourd'hui à du hack pour installer ce CFW. \n \nBref, si cela s'avère vrai ce sera une bonne nouvelle pour les PS4 et PS5, même si cela ne change pas les firmwares sensibles. Dernier détail, le développeur annonce qu'on en saura plus très prochainement \"soon\", il n'y a plus qu'à patienter. Y aurait-il un lien avec la récente faille remontée par TheFlow, probablement pas non plus. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195033/in-ps4ps5-vers-une-solution-semi-permanente-cfw-sur-ps4-et-ps5-1.png"
        }
    },
    "news_16": {
        "title": "[PS4] D'énormes progrès aussi du côté de RPCSX (PS4)",
        "content": " \nIl n'y a pas que ShadPS4, c'est ce que souhaite montrer le développeur DH avec le second émulateur PS4 qui progresse lui aussi !\n \nDepuis quelques semaines, et c'est encore plus significatif ces derniers jours, l'émulateur ShadPS4 impressionne, il faut dire que les vidéos de démonstration sont nombreuses, la dernière en date fait tourner Bloodborne avec des patchs Ultrawide en 60 FPS, avec les DLC et les cheats d'actifs, rien que ça ! \n \n \n\n \n \n \nAu delà de ça, de nombreux jeux commerciaux se lancent, ou commencent même à être jouable même si les problèmes graphiques sont encore nombreux. \n \nLe développeur DH, lui qui s'occupe de la version PS4 de RPCS, qui se nomme RPCSX, a codé énormément ces deux derniers jours, cela faisait depuis le début que l'année que cela n'avait pas été le cas, mais alors là il ne fait pas les choses à moitié. \n \n \n\n \n \nLes premiers jeux commerciaux tournent, rien que ça, Sonic Mania arrive à démarrer, et le multithreading est aussi supporté. Zecoaxao nous informe qu'il faut quelques commits supplémentaires pour que rpcsx-gpu implémente les instructions manquantes et nous devrions le voir dessiner bientôt des éléments sur d'autres jeux, il prend pour exemple Gravity Rush. \n \n \nTout est là : RPCSX\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195011/in-ps4-denormes-progres-aussi-du-cote-de-rpcsx-ps4-1.jpg"
        }
    },
    "news_17": {
        "title": "[Switch] Sys-con et Nx Dump Client se mettent à jour",
        "content": " \nDeux programmes importants de la scène Nintendo Switch ont été mis à jour, Sys-con et NX Dump Client. \n \nSys-con \n \nLe développeur français o0Zz a pris la suite de Cathery avec Sys-con, et il le fait plutôt bien puisque les versions s'enchainent et ajoutent de nombreuses fonctionnalités. Inspiré du projet sys-con de Cathery, ce nouveau fork a été réalisé pour ajouter le support de toutes les manettes compatibles PC (avec un profil HID). \n \nAvec cette version, le développeur a voulu apporter de nombreuses nouveautés, la possiblité de mapper les commandes \"Slider\" et \"Dial\", ce qui peut être utile pour certains contrôleurs. Le mappage analogique a été revu, il est désormais possible de mapper n'importe quel contrôleur. Il en profité pour améliorer l'interprétation des données HID lors de rapports contenant des valeurs négatives. \n \n \n\n \n \n \nChangelog 1.4.0 : \n \n- Ajout d'un moyen d'associer les contrôles « Slider » et « Dial » (utile pour certains contrôleurs qui ont besoin d'un slider sur le stick droit).\n- Correction de l'interprétation incorrecte des données HID lorsque le descripteur de rapport HID contient des valeurs négatives.\n- Modification de la cartographie analogique pour pouvoir mapper tout sur n'importe quoi\n- Correction : le mapping Switch Controller Pro via USB ne fonctionne pas toujours (corrigé en version 1.3.0).\n- Ajout du mapping pour T.Flight Hotas X - PS3 Mode pour ACE Combat 7 Deluxe. Merci à @kfkboys.\n \n \nTéléchargement : Sys-con 1.4.0 \n \n \nNx Dump Client \n \nLe développeur v1993 propose une mise à jour de son programme NX Dump Client, son application client Linux utilisant Vala et GTK pour le dumping via USB en s'appuyant sur l'outil NXDumpTool. \n \nSa simplicité de lancement et d'utilisation font de cette application un indispensable de la console, même si cette version est une mouture de maintenance, elle annonce aussi la prochaine puisque le développeur dit \" version de maintenance avant la 1.2.0\". \n \n \nTéléchargement : Nx Dump Client 1.1.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195009/in-switch-sys-con-et-nx-dump-client-se-mettent-a-jour-1.png"
        }
    },
    "news_18": {
        "title": "[PS3] L'émulateur RPCS3 révise sa configuration matérielle minimale",
        "content": " \nL'équipe en charge du développement de l'émulateur PS3 RPCS3 vient de faire une annonce et une évolution importantes, elle vient en effet de relever la configuration minimale de l'émulateur, ce qui n'avait pas été le cas depuis plus de 4 ans. \n \nConcrètement qu'est ce que cela signifie, cela veut dire que les nouvelles versions de l'émulateur ne tourneront plus sur certaines configurations anciennes, et il faudra donc que votre configuration PC soit plus récente, cela va exclure de fait des ordinateurs anciens, c'est dommage mais cela va permettre de mieux exploiter les ressources récentes. \n \n \n\n \n \n \nL'équipe n'a pas fait dans la dentelle, voici les anciennes configurations minimales et les nouvelles exigences. \n \n \nVoici les changements apportés :\n \n> Processeur recommandé\nIntel : Skylake (6ème) -> Comet Lake (10ème)\nAMD : Zen 2 (3000) -> Zen 3 (5000)\n \n> RAM recommandée\n8 GO -> 16 GO\n \n> RAM minimale\n4 GB -> 8 GB\n \nCela signifie donc que toute configuration avec moins de 8 Go de RAM ne sont pas recommandés, mais assez paradoxalement l'équipe n'a pas accompagné cette annonce d'une mise à jour de l'émulateur qui le rendrait plus exigeant. Elle dit procéder à un petit ajustement de nos exigences matérielles, afin qu'elles garantissent une expérience plus solide avec les jeux jouables.\n \n \n\n \n \n \nEn pratique, ce changement d'exigences signifie que les nouveaux rapports de jeux jouables peuvent désormais cibler la nouvelle ligne de base recommandée, au lieu de s'appuyer sur Skylake ou Zen 2, qui date de bientôt 9 générations, avec ses problèmes de latence inter-CCX plus importants.\n \n \nDernière build ici :  rpcs3.net\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194968/in-ps3-lemulateur-rpcs3-revise-sa-configuration-materielle-minimale-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1194968/in-ps3-lemulateur-rpcs3-revise-sa-configuration-materielle-minimale-2.png"
        }
    },
    "news_19": {
        "title": "[Switch] NXBoot profite d'une mise à jour importante",
        "content": " \nPas moins de 3 années après la version précédente, voilà que NXBoot fait son grand retour pour la Nintendo Switch. NXBoot vous permet d'envoyer des payloads Fusée-Gelée vers un Switch depuis un appareil iOS ou un Mac.\n \nEn somme, derrière ce nom se cache une application avec laquelle vous allez pouvoir injecter des payloads et pouvoir lancer Linux depuis votre téléphone ou tablette sous IOS jailbreaké.\n \n \nPrérequis :\n \n- Un iphone ou ipad sous ios 9.x minimum et jailbreaké\n- Un cable OTG d'un coté et lightning de l'autre .\n \nBeaucoup de changements ont été apportés à cett nouvelle version, elle prend en charge les nouveaux jailbreaks « sans racine » ainsi que le TrollStore . De plus, NXBoot fonctionne désormais également sur l'ancien iOS 9 et ceux qui utilisent iOS 12+ peuvent s'attendre à un mode sombre . L'importation via le menu de partage a également été rendue plus intuitive et Coreboot/CBFS a été supprimé car hekate est \"maintenant\" établi.\n \n \n\n \n \nChangelog : \n \n \n- Ajouter la prise en charge du jailbreak sans racine\n- Ajouter le support de TrollStore\n- Ajoutez la prise en charge d'iOS 9, prend désormais en charge iOS 9 à 17\n- Interface utilisateur retravaillée avec un nouvel éditeur de charge utile\n- Mode sombre sur iOS 12+\n- L'importation via la feuille de partage est désormais beaucoup plus intuitive\n- Supprimez le support coreboot/CBFS, la communauté a opté pour Hekate 6 à la place\n- La version 0.3.0 était une version bêta privée et la version 0.3.1 contient uniquement des corrections de bugs.\n \n \nTéléchargement : NXBoot\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194962/in-switch-nxboot-profite-dune-mise-a-jour-importante-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] TinWoo est de retour et s'améliore",
        "content": " \nLe développeur Mrdude2478 propose une nouvelle version de TinWoo pour la Nintendo Switch, il faut dire que le programme avait disparu des écrans radars depuis un bon moment. \n \nRappelons que TinWoo est un installateur qui fonctionne un peu comme Tinfoil Installer ou Awoo Installer et comme ses ainés, le programme prend en charge l'installation de fichiers NSP, NSZ, XCI et XCZ en les divisant sur la carte SD, et il prend également en charge les DLC qu'ils proviennent d'un URL depuis un Google Drive ou via des outils tels que ns-usbloader. \n \nCe logiciel intègre aussi la possibilité de mettre à jour automatiquement les sigpatches, ainsi que le support de thèmes via la personnalisation des skins, et l'ajout de sons customisés, à condition de choisir les mêmes formats audio que ceux déjà présents. \n \n\n \n \nCaractéristiques : \n \n- Supporte l'installation de fichiers NSP/NSZ/XCI/XCZ et sépare les fichiers NSP/XCI de votre carte SD\n- Supporte l'installation de fichiers NSP/NSZ/XCI/XCZ sur un réseau local ou USB à partir d'outils tels que NS-USBloader\n- Supporte l'installation de fichiers NSP/NSZ/XCI/XCZ sur l'internet par URL ou Google Drive\n- Supporte l'installation de NSP/NSZ/XCI/XCZ à partir d'un disque dur (NTFS/Fat32/ExFat/EXT3/EXT4)\n- Vérifie les NCA par la signature de l'en-tête avant qu'elles ne soient installées\n- Installe et gère rapidement et facilement les derniers patchs de signature\n- Fonctionne sur SX OS et Atmosphere\n- Possibilité de créer un thème, de changer les sons d'installation\n \n \nSur les versions précédentes de TinWoo, il y avait un problème concernant la liste ou le chargement d'un dossier avec plusieurs fichiers à installer, le code a été réanalysé et a été modifié pour apporter quelques modifications pour corriger le problème, vous pouvez désormais installer par lots plusieurs fichiers en même temps sans faire planter l'application.\n \n \nTéléchargement : TinWoo 1.0.26\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1194951/in-switch-tinwoo-est-de-retour-et-sameliore-1.jpg"
        }
    }
}