{
    "news_1": {
        "title": "[PS5] PS5-Xplorer v1.00 en préparation par Lapy",
        "content": "Le développeur Lapy est en train de tester la version PS5 de PS4-Xplorer, ou plutôt si vous préférez il annonce l'arrivée prochaine de PS5-Xplorer. \n \n \nPS4 Xplorer est une application créée sous Unity et qui permet d'effectuer diverses opérations comme couper, copier, coller, renommer, supprimer des fichiers ou des dossiers, ou encore d'explorer le stockage de la console PS4, une adaptation PS5 est donc une bonne nouvelle. \n \nZecoxao a demandé à pouvoir explorer facilement les Debug Settings du firmware 4.02 sous PS5, le développeur Lapy a partagé une image montrant l'existence de PS5-Xplorer v1.00 et pesant quelques 64.81 MB. \n \n \n\n \n \nNous espérons que PS5-Xplorer proposera les mêmes options que PS4-Xplorer, à savoir l'accès root, le mode sandbox, la possibilité de bénéficier d'options avancées comme le copier, couper, coller, renommer, supprimer, la création de nouveaux fichiers, l'affichage de la température, la création de raccourcis, la possibilité d'installer des PKG en interne ou en externe, et bien plus encore. \n \n \n \n\nComme toujours Lapy est limité par ses possibilités d'upload, espérons que tout ceci permette rapidement l'arrivée de PS5-Xplorer dans sa version définitive. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185029/in-ps5-ps5-xplorer-v100-en-preparation-par-lapy-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1185029/in-ps5-ps5-xplorer-v100-en-preparation-par-lapy-2.jpg"
        }
    },
    "news_2": {
        "title": "[PS5] La Team Duplex fait désormais des dumps PS5",
        "content": "Voilà il n'a pas fallu bien longtemps pour qu'une team de renom se fasse une petite idée du potentiel du hack récent de la PS5, la team Duplex débarque donc avec ses propres dumps sur PS5. \n \n \n \n\n \n \n \nLes dumps proposés par la Team Duplex : \n \n- Ghost.of.Tsushima.Directors.Cut.PS5-DUPLEX\n- Alan.Wake.Remastered.PS5-DUPLEX\n- Marvels.Guardians.of.the.Galaxy.PS5-DUPLEX\n- LEGO.Star.Wars.The.Skywalker.Saga.PS5-DUPLEX\n- Necromunda.Hired.Gun.PS5-DUPLEX\n- Elex.II.PS5-DUPLEX\n- Tales.of.Arise.PS5-DUPLEX\n- Sackboy.A.Big.Adventure.PS5-DUPLEX\n \n \nEn plus d'autres utilisateurs comme BredoZen, THE KING OF FIGHTERS XV, Returnal ou encore Sifu, commencent à fournir leurs dumps. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1185028/in-ps5-la-team-duplex-fait-desormais-des-dumps-ps5-1.png"
        }
    },
    "news_3": {
        "title": "[PS4] La première version stable v1.00 du store GameBato est là",
        "content": "La Team GameBato vous souhaite une bonne et agréable année à sa manière, en proposant la toute première version stable de leur store. \n \nGameBato est un store qui vous permet de profiter à ses pleines capacités de votre PS4 ou PS4 Pro sous firmware 5.05, 7.55 ou 9.00 car pour rappel, il facilite le téléchargement, l'installation de jeux et de DLC, et petite nouveauté, l'équipe commence à parler de PS5 en s'engageant à rendre l'application compatible avec la dernière console de salon de Sony. Afin d'améliorer les vitesses de téléchargement, le nombre de serveurs a été revu à la hausse. \n \n \n\n \n\n \n\n \n \nChangelog v1.00 : \n \n- La première version stable de l'application GameBaTo a été publiée.\n \n- Après 24 subversions et la publication de nombreux patchs, nous sommes ici pour annoncer la sortie de la première version stable de l'application.\n \n- Dans cette version, de nombreux bugs majeurs et mineurs ont été corrigés.\n \n- En ce qui concerne le téléchargement de jeux, qui est l'objectif principal de cette application, nous avons mis en place un autre système de contrôle de sécurité pour éviter la perte de données et les blocages dans le Gestionnaire de téléchargements, ce qui a réduit le FPS dans la section mentionnée et les utilisateurs peuvent également sentir que l'application fonctionne lourdement.\n \n- En attendant d'ajouter de nouvelles fonctionnalités cool et utiles à l'application, nous travaillerons à rendre l'application compatible pour fonctionner sur PlayStation 5 dans un proche avenir.\n \n- Au fur et à mesure que le nombre de nos utilisateurs a augmenté, nous avons augmenté le nombre de nos serveurs pour fournir plus de vitesse à tous nos utilisateurs.\n- Partager notre application avec vos amis nous aide à fournir de meilleurs services aux utilisateurs et à ajouter de nouvelles fonctionnalités à l'application.\n \n- Comme dans beaucoup d'autres projets, il y aura toujours des problèmes et des bogues non découverts dans l'application, dont nous ne sommes pas conscients, et qui doivent être corrigés.\n \n- Vous, chers utilisateurs, pouvez nous aider à les déboguer et à les corriger en nous informant de ces problèmes.\n \n- Utilisez l'option Quitter du menu de l'application ou appuyez sur le bouton CERCLE sur l'écran principal de l'application chaque fois que vous souhaitez fermer l'application.\n \n \nTéléchargement : https://gamebatoapp.ir/\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184963/in-ps4-la-premiere-version-stable-v100-du-store-gamebato-est-la-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1184963/in-ps4-la-premiere-version-stable-v100-du-store-gamebato-est-la-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1184963/in-ps4-la-premiere-version-stable-v100-du-store-gamebato-est-la-2.png"
        }
    },
    "news_4": {
        "title": "[Switch] Une vidéo promotionnelle fanmade pour le Mig Switch",
        "content": "Nous ne sommes pas encore sur une review, simplement une compilation des images promotionnelles par un fan. Pendant que vous attendez votre propre unité Mig Switch, ou bien les premiers tests, voilà donc qu'un fan a envoyé une vidéo mettant en avant le Mig Switch. \n \n \n\n \n\n \n \nCe n'est pas temps la vidéo ou son contenu qui est importante, car finalement rien de neuf, par contre ce qui peut être intéressant c'est le niveau de qualité attendu par la Team, ou bien le type de promotion qu'elle accepte, une communication que la Team a voulu partager avec nous. \n \n \n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184940/in-switch-une-video-promotionnelle-fanmade-pour-le-mig-switch-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184940/in-switch-une-video-promotionnelle-fanmade-pour-le-mig-switch-2.png"
        }
    },
    "news_5": {
        "title": "[PS5] Self Dumper PS5 mis à jour par Echo Stretch",
        "content": "Le développeur Echo Stretch vient de mettre à jour PS5 Self Dumper, le payload qui permet de dumper vos jeux depuis votre PS5. Bonne nouvelle, cette mise à jour apporte le support de tous les firmwares 3.xx et 4.xx, rien que ça. \n \nPour bien réaliser les dumps il faut respecter les différentes étapes : \n- Le téléchargement des fichiers du jeu\n- Le renommage\n- Le déplacement des fichiers\n- Le décodage SELF\n- Le transfert des fichiers \n \nJusqu'à présent le dump était limité aux firmware 4.03, 4.50 et 4.51, ce sont désormais tous les firmwares 3.xx qui peuvent réaliser cette opération.\n \n \n\n \n \n \n1) Dump Game ( Opened Game ) /mnt/sandbox/pfsmnt\n   https://github.com/logic-68/pfsmnt-dumper\n \n2) Dumper les fichiers du jeu (copier le contenu des dossiers (fichiers et dossiers))\n   /system_data/priv/appmeta/PPSAXXXXX/ -->> PPSAXXXXX-app0\\sce_sys\\\n \n3) Dumper les fichiers de jeu (copier le contenu du dossier) \n   /user/appmeta/PPSAXXXXX -->> PPSAXXXXX-app0\\sce_sys\n \n4) Ouvrir npbind.dat pour voir les dossiers uds et trophées 000000080->04->0F\n \n5) uds00.ucp ( nommé uds.ucp )\n   /user/np_uds/nobackup/conf/NPWRXXXXX_00/uds.ucp -->>PPSAXXXXX-app0\\sce_sys\\uds00.ucp\n \n6) trophy00.ucp (nommé TROPHY.UCP )\n   /user/trophy2/nobackup/conf/NPWRXXXXX_00/TROPHY.UCP -->>PPSAXXXXX-app0\\sce_sysce\\trophy2\\trophy00.ucp\n \n7) Décrypter les fichiers self avec ps5-self-dumper puis copier les fichiers dans le répertoire du jeu\n   https://www.sendspace.com/file/po38ce\n   1) Télécharger socat\n      https://github.com/tech128/socat-1.7.3.0-windows\n   2) Placer le payload de ps5-self-dumper dans le dossier socat\n      https://www.sendspace.com/file/k87zug\n   3) Ouvrir le navigateur PS5 vers l'hôte Specter\n   4) Ouvrir windows cmd dans le dossier socat et taper les deux commandes\n      socat -u FILE:dumpgame.bin TCP:<ps5 ip>:9020\n      socat -u -d -d -d TCP:<ps5 ip>:9023,reuseaddr OPEN:game.tar,creat\n   5) Ouvrir game.tar et copier/remplacer les fichiers dans PPSAXXXXX-app0\n \n \nTéléchargement : Self Dumper PS5 (support 3.xx et 4.xx)\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184939/in-ps5-self-dumper-ps5-mis-a-jour-par-echo-stretch-1.png"
        }
    },
    "news_6": {
        "title": "[Xbox360] J-Runner avec Extras v3.3.0 r3 disponible",
        "content": "Comme un cadeau de début d'année, si tenté que cela existe, ou comme un cadeau de Noël qui se serait perdu du traineau puis retrouvé par mondialrelay, voilà que débarque une nouvelle version J-Runner avec Extras. \n \n \n\n \n \nProposé comme toujours par le développeur Octal450, Josh Davidson, cette nouvelle version de J-Runner avec Extras apporte pas mal de corrections de crashs, ajoute le support des patchs HDD XL, et améliore l'interface utilisateur. \n \nLe dashboard a été mis à jour avec le 13604 et une correction a été apporté face à des crashs sur certaines types de Nands. \n \nComme vous le savez certainement J-Runner est l'un des outils les plus complets toujours maintenu à jour par Octal450, et qui comme vous le savez s'intègre dans Xebuild pour lire, écrire ou encore créer des images NAND de la console de Microsoft afin de réinitialiser les problèmes de paramétrages ou appliquer le hack Jtag. \n \n \n\n \n \nChangelog v3.3.0 r3 :\n \n- Ajouté : Ajout du support pour les patchs XL Both\n- Ajouté : Mise à jour des patchs XL HDD pour corriger le problème de non démarrage du JTAG\n- Ajouté : Amélioration de l'interface utilisateur de la qualité de vie\n- Ajouté : Tableau de bord 13604\n- Corrigé : Bugs de l'interface utilisateur\n- Corrigé : Problèmes avec le tri des combos CB\n- Corrigé : Crash possible lors du chargement de certains nands\n \nInstructions :\n \n- Télécharger et extraire J-Runner-with-Extras.zip pour l'exécutable et les fichiers de support.\n- Ne pas utiliser JR-Auto-Update-Delta.zip, ou le paquet ne sera pas mis à jour correctement.\n \n \nTéléchargement : J-Runner avec Extras v3.3.0 r3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184871/in-xbox360-j-runner-avec-extras-v330-r3-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1184871/in-xbox360-j-runner-avec-extras-v330-r3-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[PS4/PS5] TheFlow une nouvelle fois primé mais cette fois de 12 500 $",
        "content": "Le développeur Andy Nguyen vient une nouvelle fois d'être primé par le programme bounty de Sony qui pour rappel vise à récompenser les utilisateurs qui découvrent un bug dans les sécurités de l'offre logicielle de la marque japonaise. \n \nConcernant la branche PlayStation, Andy Nguyen, connu sur la scène sous le pseudonyme de TheFlow, travaille à la fois sur la PS4 et sur la PS5, il est encore une fois impossible de savoir qu'elle console ce gain concerne, mais clairement il s'agit de la plus grosse prime jamais versée dans la branche PlayStation. \n \n \n\n \n \nNotzecoaxo rappelle qu'un exploit ou une grosse faille webkit était récompensé 2 500 $ et que les exploits kernel eux rapportaient 10 000 $, mais la donne semble avoir changé car il y a 2 mois youstin a été récompensé de 3 000 $ et donc désormais Theflow de 12 500 $, l'inflation certainement. \n \n \n\n \n \n \nCela signifie clairement qu'un exploit kernel non divulgué existe bel et bien, et que TheFlow a réussi une nouvelle fois à trouver ce que personne n'a réussi à trouver jusqu'à présent, c'est à dire un nouvel kernel exploit kernel exploitable sur PS4 ou PS5 probablement sur un firmware récent. \n \nComme vous le savez, le deal entre TheFlow et Sony est que les exploits soient toujours dévoilées après une certaine période, il faut compter entre 3 à 6 mois, donc il est possible que tout cela soit mis au grand jour entre Mars et Juin 2024, pour ensuite tenter une implémentation. \n \nTheFlow marque une nouvelle fois l'histoire sur la longueur, sa longévité et sa ténacité n'est désormais plus à démontrer, juste avec le programme bounty, il a reçu 73 000 $ de primes, uniquement avec les gros exploits.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184870/in-ps4ps5-theflow-une-nouvelle-fois-prime-mais-cette-fois-de-12-500-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184870/in-ps4ps5-theflow-une-nouvelle-fois-prime-mais-cette-fois-de-12-500-2.png"
        }
    },
    "news_8": {
        "title": "[PS5] LightningMods travaille déjà sur la prochaine version d'etaHEN",
        "content": "Le développeur LightningMods est en aucun doute la personne qui a fait progresser le plus rapidement la scène PlayStation 5 ses dernières semaines avec l'arrivée d'etaHEN et de la disponibilité d'Itemzflow. \n \nAu delà de cela il continue de travailler sur des évolutions, des améliorations notamment dans etaHEN, la version 1.3B vient tout juste d'être proposée au grand public, mais il table déjà sur la version 1.4B.\n \nComme nous pouvoir voir dans la vidéo qu'il dévoile, il semble vouloir améliorer la gestion du reste mode, le mode sommeil de la console, en proposant un redémarrage automatique du serveur à l'allumage de la console. \n \n \n\n \n \nAu passage, nous apprenons qu'il va démarrer le second semestre universitaire, qui va bientôt démarrer, son objectif est de proposer cette nouvelle version avant son démarrage afin d'être tranquille quelques temps pour continuer ses études. \n \nIl rajoute aussi qu'une possibilité de lire des MP3 est méconnue dans Itemzflow, vous pouvez non seulement jouer un dossier entier de MP3 et des fichiers MP3 individuels avec Itemzflow en utilisant le système de file d'attente, mais vous pouvez également arrêter et effacer la file d'attente en survolant le paramètre MP3 et en appuyant sur carré, de plus, il affichera le nom de la chanson et l'auteur dans le coin inférieur gauche et mettra en boucle tout ce qui se trouve dans la file d'attente.\n \n \n\n \n \nNous n'avons pas fini d'être surpris entre etaHEN et Itemzflow, la scène PS5 est gâtée. \n \n \n",
        "images": {}
    },
    "news_9": {
        "title": "[Switch] SysDVR v6.0 amène le support Android",
        "content": "Le développeur exelix11 annonce la version 6.0 de SysDVR, à cette occasion il nous informe avoir réécrit l'intégralité du code du programme, et il fonctionne désormais de manière indépendante par rapport à .NET.\n \nDe plus nous apprenons qu'une version Android est également de la partie, diffusée 6 mois après la version précédente, cette version 6.0 apporte en plus une toute nouvelle interface, elle permet d'enregistrer des vidéos et des captures d'écran en temps réel, et il y a une forme de détection automatique lorsque plusieurs Switch sont détectées sur le même réseau. \n \n \n\n \nPour rappel sysdvr permet de streamer l'écran directement sur son PC via le wifi ou via un câble. A noter qu'il est possible d'utiliser SysDVR sur windows, Linux, Mac OS, et désormais Android. \n \nLe guide utilisateur a lui aussi remis au goût du jour : https://github.com/exelix11/SysDVR/wiki/\n \n \n\n \n\n \n \nChangelog : \n \n- SysDVR Client est maintenant livré avec une interface graphique multiplateforme entièrement réécrite, quel que soit le système d'exploitation que vous utilisez, vous obtiendrez la nouvelle interface utilisateur, il n'y a plus besoin d'utiliser la ligne de commande\n- Cependant, l'interface en ligne de commande est toujours disponible et largement compatible avec la syntaxe précédente. Notez que certaines fonctionnalités ont été abandonnées, vous pouvez lancer SysDVR-Client --help pour voir les nouvelles commandes.\n- Le client SysDVR est maintenant disponible pour Android\n- La version android ne supporte qu'Android 10 et plus sur les appareils avec une version 64-bit d'Android. Cela limite la compatibilité avec les anciennes smart TVs et chromecasts mais c'est une limitation malheureuse de dotnet.\n- A partir de la version 6.0, SysDVR Client n'est distribué que sur cette page GitHub, tout rechargement sur le play store ou d'autres magasins n'est pas officiel et vous ne devriez pas le télécharger.\n- La nouvelle interface graphique permet de capturer des clips vidéo et des captures d'écran en temps réel.\n- Prise en charge de la découverte du réseau local\n- Le client est capable de détecter les consoles de votre réseau local et de s'y connecter, plus besoin de taper des adresses IP !\n- Le protocole est aussi complètement documenté au cas où vous voudriez construire votre propre client.\n- SysDVR Client est maintenant construit comme une application native, ce qui signifie qu'il fonctionnera simplement™ sans avoir besoin d'installer dotnet.\n- À partir de cette mise à jour, vous devrez télécharger la version exacte correspondant à votre système d'exploitation et à l'architecture de votre processeur.\n- Pour les architectures non couvertes ici (notamment raspberry pi et windows on arm), vous pouvez télécharger l'ancienne version multiplateforme appelée SysDVR-Client-dotnet.7z et configurer dotnet 8 et les bibliothèques natives nécessaires par vous-même, en vous référant à la section \"installation manuelle\" du guide.\n- Certaines fonctionnalités du client ont été abandonnées lors de la réécriture, en fonction des demandes des utilisateurs, elles peuvent être réintroduites dans les futures mises à jour, en particulier, les fonctionnalités suivantes ne sont plus disponibles :\n- Streaming vers d'autres joueurs en utilisant les options --stdout et --mpv\n- Relayer le flux avec l'option --rtsp sur le client. Le serveur RTSP sur console \"Simple network mode\" est toujours disponible.\n- Enregistrement vidéo en ligne de commande avec l'option --file\n- Plusieurs corrections de bugs signalés par les utilisateurs :\n- Correction de l'enregistrement vidéo ne fonctionnant pas sous linux\n- Correction de l'audio ne fonctionnant pas sur mac os\n- Ajout d'une option de sortie audio alternative pour les ordinateurs Windows où l'audio ne fonctionnait pas.\n- Le build du flatpak a été mis à jour pour corriger le problème #255, si vous êtes concerné, re-téléchargez-le. La version mise à jour montre l'identifiant de construction e18a704.\n \n \n \n \nTéléchargement : SysDVR v6.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184868/in-switch-sysdvr-v60-amene-le-support-android-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184868/in-switch-sysdvr-v60-amene-le-support-android-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1184868/in-switch-sysdvr-v60-amene-le-support-android-3.png"
        }
    },
    "news_10": {
        "title": "[Switch] Gary Bowser nie toute implication dans Mig Switch",
        "content": "L'enthousiasme qu'il soit positif ou négatif d'ailleurs suscité par le Mig Switch est sans commune mesure, c'est le grand retour des linkers, une espèce en voie de disparition avec les solutions software (Atmosphère) ou hardware (HWFly, Picofly, RP2040). Cependant tout le monde ne souhaite pas passer le cap d'une modification hardware ou software, le public le plus large cherche une solution simple à mettre en oeuvre. \n \nA n'en pas douter le Mig Switch ne sera probablement pas une solution miracle, mais elle sera une alternative, chère, mais une alternative existante qui rappelle fortement l'histoire des linkers, qui a connue quelques rebondissements au cours des 20 dernières années avec l'affaire Gary Bowser. \n \n \n\n \n \nLors de l'apparition de la rumeur de l'arrivée du Mig Switch, certains ont commencé à faire courir la rumeur selon laquelle Gary Bowser serait l'instigateur principal de la Team, agissant dans l'ombre du communisme de l'est. \n \n \n\n \n \nRien de tel, car Gary Bowser vient de nier toute implication dans ce linker Mig Switch sur son compte Twitter (X), il faut dire qu'il doit encore payer 10 millions de $ à Nintendo pour ses actions dans la Team-Xecuter.\n \n \n \n\n \n \nIl dit en effet : \" Je ne suis pas impliqué dans ce genre de choses \" , et de rajouter que \" si mon nom de domaine apparait à plusieurs reprises c'est parce qu'il a fait l'objet d'une attaque DNS sur mes serveurs, j'ai réparé les dégâts et changé tous mes mots de passe, mais malheureusement les gens en parleront longtemps, ce n'est pas ce dont j'avais besoin juste avant Noël\".\n \nBref, d'après ses dires, Gary Bowser n'est en rien impliqué de près ou de loin dans le Mig Switch. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184802/in-switch-gary-bowser-nie-toute-implication-dans-mig-switch-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184802/in-switch-gary-bowser-nie-toute-implication-dans-mig-switch-1.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1184802/in-switch-gary-bowser-nie-toute-implication-dans-mig-switch-2.jpg"
        }
    },
    "news_11": {
        "title": "[GC] Flippyboot : Remplacer son lecteur de disque par une carte mémoire devient plus simple",
        "content": "L'année 2023 aura été généreuse en nouveautés pour la Gamecube. Les solutions les plus classiques ont ainsi été revisitées, avec la sortie d'une nouvelle puce open source et autonome baptisée KunaiGC, ainsi que de nouveaux modèles de mods HDMI internes et externes. En parallèle, des pistes inédites ont aussi été explorées par les passionnés de la console 128bits de Nintendo, comme le M.2 Loader et le BlueRetro. Mais l'annonce la plus notable reste bien entendu celle du PicoBoot, une aussi accessible que moderne puisqu'elle fonctionne grâce à un Raspberry Pi Pico.\n \nAlors que reste-t-il à explorer pour la communauté en 2024 ? Et bien l'année commence plutôt fort, puisque le projet Flippydrive est enfin ouvert aux précommandes pour une livraison au premier semestre 2024 !\n \n\nLe Flippydrive rev. 5 (source : Macho Nacho Productions)\n \nLe Flippydrive est un Optical Disc Emulator (ODE), un dispositif qui va venir remplacer le lecteur de disque de votre console afin que vous n'ayez plus à lancer les jeux au format disque, mais directement depuis une carte mémoire. Dans ce cas précis, l'ODE s'installe en passtrough entre le connecteur de la carte mère et celui du lecteur optique, vous pourrez donc utiliser les deux librement. Pour les possésseurs d'une Gamecube avec un lecteur défectueux, voire-même sans lecteur, il est tout à fait possible d'installer le Flippydrive seul afin de donner un second souffle à la console.\n \n\nLa nappe de connexion du flippydrive (source : Macho Nacho Productions)\n \nLes ODE sont désormais chose courante dans le milieu du hacking des consoles de cinquième et sixième génération, notamment parce qu'ils permettent la conservation du lecteur d'origine, qui peut parfois se fragiliser avec le temps (comme sur la Sega Dreamcast), mais aussi parce qu'ils offrent une vitesse de lecture tout à fait convenable en comparaison au lancement de jeux depuis les connecteurs auxiliaires des consoles de ces générations. \n \nLe Flippydrive se singularise toutefois des ODE existants, en proposant une solution moderne fonctionnant grâce à un Raspberry Pi RP2040 associé à un microcontrolleur ESP32. Une fois installé, il est ainsi possible de lancer des jeux depuis une carte microSD installée, mais aussi depuis son réseau local via Wifi (fonctionnalité expérimentale pour le moment, et une solution ethernet est à l'étude). Les jeux seront sélectionnés et lancés directement depuis le menu Gamecube, à l'aide d'un IPL modifié intitulé Cubeboot (Flippyboot IPL). L'interface de Cubeboot a été énormément travaillée et s'intègre parfaitement au système d'origine, on pourrait presque s'y méprendre...\n \n\nL'interface FlippybootIPL/Cubeboot (source : Macho Nacho Productions)\n \nFonctionnalités disponibles dès aujourd'hui : \nInstallation sans soudure dans le connecteur du lecteur de disque Gamecube, \nChargement de jeux depuis une carte mémoire microSD, \nChargement de jeux depuis le Wifi (expérimental, à l'aide d'un Raspberry Pi, d'un PC ou d'un NAS), \nNul besoin de patcher les jeux pour les lancer, \nMenu de sélection des jeux intégré au menu de la Gamecube, \nPossibilité de lancer le homebrew Swiss, \nUtilise uniquement des contrôleurs RP2040 et ESP32 (ce qui réduit les chances de pénuries), \nLe lecteur d'origine n'a pas à être démonté ou modifié pour l'installation,\nPossibilité de lancer ses jeux au format disque (il suffit de maintenir le bouton L au lancement de la console).\n \nD'autres fonctionnalités sont en projet : \nSupport des manettes Bluetooth,\nSupport des manettes USB,\nConfiguration du Flippydrive depuis une webapp Chrome via le réseau Bluetooth\nDeux add-ons : un adaptateur ethernet et un adaptateur USB pour connecteur des clefs et disques durs USB. \n \nLe Flippydrive est prévu pour le début de l'année 2024, et les précommandes sont d'ores et déjà disponibles via ce lien. En termes de rapport qualité-prix, le FlippyDrive est extrêmement compétitif, avec un prix inférieur à 40 dollars, ce qui, avec sa facilité de montage, le rend vraiment très accessible.\n \n \n\n \nDans une interview avec le youtubeur tech Macho Nacho, Trevor Rudolph & Chris PVille, créateurs du projet, ont annoncé que les modèles de tests ont déjà été et qu'ils travaillent actuellement sur l'add-on ethernet, plus rapide et plus fiable que le Wifi pour le lancement de jeux... Affaire à suivre !",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184799/in-gamecube-flippyboot-remplacer-son-lecteur-de-disque-par-une-carte-memoire-devient-plus-simple-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184799/in-gamecube-flippyboot-remplacer-son-lecteur-de-disque-par-une-carte-memoire-devient-plus-simple-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1184799/in-gamecube-flippyboot-remplacer-son-lecteur-de-disque-par-une-carte-memoire-devient-plus-simple-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1184799/in-gamecube-flippyboot-remplacer-son-lecteur-de-disque-par-une-carte-memoire-devient-plus-simple-1.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] Le packaging final du Mig Switch qui sera fabriqué en Russie",
        "content": "La Team Mig Switch, si nous pouvons l'appeler ainsi, dévoile un nouvel article sur son site officiel : https://migswitch.com/\n \nLes premiers échantillons (samples) ont été envoyés hier, 04 Janvier 2024.\n \nAinsi les premiers testeurs vont pouvoir réaliser leur review et seront donc en mesure de  réaliser des critiques indépendantes de ce produit. En effet, la Team explique avoir envoyé à quelques évaluateurs respectés, non affiliés à Mig Switch, des échantillons afin que vous puissiez voir leur produit en action.\n \n \n\n \n \nL'équipe explique vouloir proposer sur le site des critiques, des vidéos complètes d'utilisation, mais elles seront d'abord sélectionnées pour la qualité vidéo et de montage. \n \nAutre chose, l'équipe Mig Switch dévoile le packaging où l'on voit clairement que c'est du \"Made in Russia\" mais nous pouvons aussi y voir d'autres logos qui peuvent prêter à sourire, comme celui de la directive européenne RoHS vise à limiter l'utilisation de dix substances dangereuses dans les équipements électriques et électroniques. Cette directive a été adoptée par le Parlement européen et par le Conseil et publiée au Journal officiel de l'Union européenne, ou encore le marquage CE qui a été créé dans le cadre de l'harmonisation des législations techniques européennes.\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184702/in-switch-le-packaging-final-du-mig-switch-qui-sera-fabrique-en-russie-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS4/PS5] LightningMods a mis à jour son store pour qu'il soit plus clair",
        "content": "Les efforts fournis par LightningMods et quelques autres comme Echo Stretch sont considérables ces derniers jours, il faut dire que ça bouge énormément depuis que la possibilité de lancer des fakePKG est arrivée sur PS5. \n \n \n\n \n \nEn s'appuyant sur une mise à jour proposée par Gkiokan Sali, PKG-Zone.com a été mis à jour pour être moins déroutant, désormais, si une application se destine à la fois à une version PS4 et PS5 au lieu d'un bouton de téléchargement d'aperçu, elle affichera à la place un bouton \"Plus d'informations\" qui vous mènera aux 2 boutons de téléchargement, uniquement s'il n'a pas de version PS5, il affichera le bouton de téléchargement de l'aperçu.\n \n \n\n \n \nCela a été fait pour que les utilisateurs ne téléchargent pas accidentellement la version PS4 et ne se demandent pas pourquoi elle ne fonctionne pas sur leur PS5, ainsi cela clarifie largement l'utilisation du store et des PKG proposés.\n \nIl en a profité pour également mettre à jour le payload du programme d'installation de la boutique en ligne PS4 pour le firmware 9.00 ainsi il ne devrait plus être sujet à un bug, et ne nécessite plus de désinstaller le store s'il est déjà installé avant de le retélécharger/réinstaller, et vous pouvez installer le HB Store directement depuis le navigateur de votre PS4 en allant sur via https://pkg-zone.com/install .\n \n \nAu passage, il nous informe que BedroZen aurait réussi à backporter Returnal, ce dernier confirme avoir réussi a travaillé sur la version US en appliquant des correctifs, mais qu'il doit encore tester si toutes les parties du jeu sont pleinement jouables. \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184698/in-ps4ps5-lightningmods-a-mis-a-jour-son-store-pour-quil-soit-plus-clair-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184698/in-ps4ps5-lightningmods-a-mis-a-jour-son-store-pour-quil-soit-plus-clair-2.png"
        }
    },
    "news_14": {
        "title": "[Switch] DBI v658 et NXMP v0.9.0 disponible",
        "content": "Et voilà la première version de l'année 2024 pour DBI, DBI est apprécié pour ses fonctionnalités et une partie backend de Windows qui permet de faciliter les transferts. \n \nRashevskyv, le développeur de DBI propose la v658 de DBI (pour DB Installer) qui est un gestionnaire et installateur de fichiers NSP/NSZ/XCI et XCZ via SD, USB. Il fonctionne tout aussi bien en standalone ou bien en créant son propre serveur http local. \n \n \n\n \n \nCette mise à jour a apporté quelques modifications et corrections de bugs au journal d'activité.\n \nTéléchargement : DBI v658\n \n \n\n \n \nPour profiter d'un peu plus de nouveautés, il faut basculer sur NXMP qui est désormais livré en v0.9.0. Comme vous le savez NXMP est un lecteur multimédia basé sur MPV et FFMPEG et il permet de lire les formats essentiels sur votre Switch. \n \n \n\n \n \n \nPour rappel, NXMP est un lecteur vidéo proposé par proconsule pour Nintendo Switch basé sur MPV https://mpv.io/ et sur la solution open source de Cpasjuste pplay, il supporte la plupart des formats vidéo populaires, le streaming HTTP et FTP et également les décodeurs Enigma2, qui sont des récepteurs satellite Linux. \n \nChangelog 0.9.0 : \n \nAjouté \n- Ajout du portugais brésilien \n- Ajout d'un backend deko3d capable de décoder le 4K HDR 60fps (expérimental) \n- Thème clair/foncé (imite l'interface native de HOS) \n- Ajout d'une visionneuse d'images triviale au lieu d'utiliser mpv (fonction zoom/pan) \n- Ajout de ZL/ZR pour afficher l'image précédente/suivante \n- Ajout d'un support pour la navigation dans les archives en utilisant libarchive comme montage devoptab \n- Ajout de l'analyseur M3U en tant que montage devoptab \n- Changements \n- samba, nfs, sftp, ftp, libarchive sont maintenant implémentés en tant que montages devoptabs. \n \nSupprimé \n- UPNP est désactivé car il nécessite une réécriture majeure du code. \n- Suppression de l'ancienne classe de thèmes (elle sera remplacée par une nouvelle lorsqu'elle sera prête) \n- Suppression de l'ancienne police ttf utilisée (elle utilise maintenant la police par défaut du système) \n \nCorrection \n- Le ghosting a été atténué mais était toujours présent dans la version 0.8.2, il est maintenant corrigé pour toujours. \n \nProblèmes connus \n- Le backend deko3d est expérimental et peut avoir des problèmes ou des fonctionnalités manquantes. \n- Le désentrelacement des shaders ne fonctionne pas sur le backend deko3d. \n- Shadermania ne fonctionne pas sur le backend deko3d \n- Miniplayer ne fonctionne pas sur le backend deko3d\n \n \nTéléchargement : NXMP v0.9.0\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184690/in-switch-dbi-v658-et-nxmp-v090-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1184690/in-switch-dbi-v658-et-nxmp-v090-disponible-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1184690/in-switch-dbi-v658-et-nxmp-v090-disponible-2.jpg"
        }
    },
    "news_15": {
        "title": "[PS4] PS4Shortcuts v1.0.0 disponible",
        "content": "Le développeur Master a publié la toute première version 1.0.0 de son utilitaire PS4Shortcuts, il s'agit d'un outil qui va vous permettre de créer et d'ajouter des raccourcis, mais également des fichiers App.db sur votre PlayStation 4 jailbreakée. \n \nPour information, le fichier App.db est une base de données détaillées de toutes les applications et jeux installés sur votre console. \n \n \n\n \n \nAinsi avec PS4Shortscuts vous allez pouvoir personnaliser selon votre bon vouloir votre XMB en retirant par exemple certaines icônes, ou certaines applications comme News, PS Store, Playroom, en les masquant. \n \n \n\n \n \nLe développeur rappelle que tout changement incombe un risque, et notamment celui de ralentissement de l'affichage de l'écran d'accueil, cela peut aussi avoir l'effet inverse, il est donc fortement conseillé de garder une sauvegarde du fichier avant d'utiliser PS4Shortscuts en profondeur. \n \n \n \nTéléchargement : PS4Shortcuts v1.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184689/in-ps4-ps4shortcuts-v100-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184689/in-ps4-ps4shortcuts-v100-disponible-2.png"
        }
    },
    "news_16": {
        "title": "[PS3] RPCS3 v0.0.30 disponible",
        "content": "Une nouvelle version majeure de l'émulateur PS3, RPCS3, vient d'apparaitre sur les serveurs de ses auteurs, ils dévoilent l'information via leur compte Twitter (X) et annonce pas moins de 490 changements (commits) par rapport à la version précédentes. \n \nCela va faire 13 ans que le développement a commencé avec une petite équipe de programmeurs dirigée par DH et Hykem, aujourd'hui le programme est le meilleur émulateur PS3 supportant DirectX12, Vulkan et OpenGL, et les chiffres de cette version 0.0.30 restent impressionnants !\n \n \n\n \n \nPas moins de :\n \n> 490 nouveaux changements / commits\n> 565 fichiers de code source ont été édités\n> 32 452 lignes de code ont été ajoutées et 12 759 supprimées\n> 16 contributeurs au code\n> 155 jours de développement\n \nBref, vous l'aurez compris cette version est majeure et arrive avec un changelog a faire tomber par terre, que l'on vous propose de retrouver ici, il est tellement long.\n \n \nTéléchargement : RPCS3 v0.0.30\n \n  \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184612/in-ps3-rpcs3-v0030-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[PS5] Itemzflow 1.04 apporte le support 3.xx",
        "content": "Ce n'est pas tout, le développeur Lightningmods propose aussi sur son store pkg-zone.com une nouvelle version d'Itemzflow qui passe désormais en v1.04.\n \nPour Noël il nous avait offert la version 1.03, et bien nous pouvons dire que cette version 1.04 arrive pour nous souhaiter la bonne année. Comme vous le savez désormais il s'agit d'un manager PS5 avec lequel vous allez pouvoir lancer des applications PS5, un game dumper, il dispose d'un installateur de PKG interne ou encore permet la lecture des MP3. \n \nLe logiciel va désormais encore plus loin en apportant le support des firmwares 3.xx, mais aussi quelques corrections. \n \n \n\n \n \n \nItemzflow (PS5) v1.04\n \n- Ajout de la prise en charge des firmwares FW 3.xx\n- Correction d'un problème où \"changing dir\" ne disparaissait jamais\n- Itemzflow va maintenant installer les triggers kstuff db (seulement pour 3.xx) au lancement.\n- La base de données des applications PS5 d'Itemzflow a été déplacée vers /data/itemzflow/PS5_Apps.db depuis le dossier app.\n- Réécriture de toutes les commandes IPC pour être sans réseau\n- Correction d'un problème où l'installation des PKGs depuis /data donnait une erreur\n \nA noter, si vous voulez garder vos vapps PS5 existantes AVANT d'installer le nouveau PKG déplacez l'ancienne base de données de /user/app/ITEM00001/ à /data/itemzflow\n \n \nTéléchargement : Itemzflow 1.04\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184611/in-ps5-itemzflow-104-apporte-le-support-3xx-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS5] etaHEN - AIO Homebrew Enabler 1.3B",
        "content": "Le développeur Lightningmods vient de mettre à jour, le plugin est tout simplement similaire à GoldHEN sur PlayStation 4 de SiStr0, il intègre plusieurs fonctionnalités, notamment un serveur FTP, un serveur klog, PS5-kstuff.\n \nCette mise à jour est importante car elle amène le support des firmwares 3.xx (seul le 3.00 a été officiellement testé, mais aussi quelques corrections qui sont nécessaires. \n \n \n\n \n \netaHEN 1.3B :\n \n- Kstuff pour les firmwares 3.xx ajouté (3.00 testé)\n- Supporte la mise en cache du navigateur et ne nécessite plus d'être connecté au réseau\n- Toutes les commandes IPC (Interprocess Communication) ont été réécrites pour ne pas utiliser le réseau.\n- Ajout d'une option dans la configuration de etaHEN pour lancer automatiquement itemzflow (/data/etaHEN/config.ini)\n- Prise en charge de la reprise des applications/jeux depuis le mode repos\n- Serveur Klog amélioré Serveur Klog amélioré (exécuté avec nc 9081)\n \n \nTéléchargement : etaHEN 1.3b\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184609/in-ps5-etahen-aio-homebrew-enabler-13b-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] Executable Decryptor UI disponible",
        "content": "Le développeur Rajeshca911 propose depuis quelques heures Executable-Decryptor-UI, il s'agit là d'un nouvel utilitaire à destination de la scène PS5, il s'agit d'un outil destiné à simplifier le processus de récupération des exécutables cryptés à partir d'un dump de jeu.\n \nAvec lui vous allez pouvoir déchiffrer, vérifier, signer des ELFs et des fichiers eboot.bin, le tout en s'appuyant sur une interface utilisateur conviviale. \n \n \n\n \n \n\n \n \nPossibilités : \n \n- Lancement initial : Executables DecryptUI fait ses débuts, offrant une solution complète pour automatiser la récupération, l'extraction, la vérification et l'organisation des exécutables cryptés à partir des vidages de jeux.\n- Traitement automatique : Introduction d'un processus transparent et automatisé qui récupère, extrait et vérifie les exécutables de jeux avec efficacité.\n- Amélioration de la signature : L'outil intègre un mécanisme de signature utilisant des scripts de LightningMods_, un outil Make Fself mis à jour par Flatz et EchoStretch.\n- Interface conviviale : L'ajout d'une interface conviviale simplifie le processus de signature. Les utilisateurs peuvent désormais facilement parcourir et sélectionner le dossier contenant les exécutables remplacés.\n- Correction d'une coquille / bugs mineurs\n- Ajout d'un type supplémentaire\n- Exécuter Exploint dans PS5 :\nexécuter la page Exploit, la laisser ouverte et noter l'adresse IP de la PlayStation.\n \n \nTout est là : Executable Decryptor UI V1.0.0.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184600/in-ps5-executable-decryptor-ui-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184600/in-ps5-executable-decryptor-ui-disponible-2.png"
        }
    },
    "news_20": {
        "title": "[PS5] Les firmwares sensibles des teskits tombent les uns après les autres",
        "content": "Le développeur Jose Coixao, notzecoxao, a fait tomber hier soir la plupart des firmwares sensibles des testkits PlayStation 5. Au délà de leur décryptage, cela signifie qu'il est désormais possible de lancer les backups de jeux et homebrews avec l'exploit kernel sans contrainte. \n \n \n\n \n \nAprès avoir réalisé le portage sur le firmware 3.00, il a basculé sur le 3.10 une heure après, ensuite il s'est attaqué au 4.00. Il reste encore un peu de travail pour trouver les offsets sur d'autres firmwares comme le 3.10 ou le 4.02 qui semblent encore crasher sur les offsets mini_syscore.\n \n \n\n \n \n \nIl annonce qu'il va continuer aujourd'hui, tout ceci arrive quelques heures après la mise à disposition de l'outil de sleirsgoevy, il y a forcément un lien direct, gageons que cela va faciliter le portage sur les firmwares retail. \n \n \n\n \n\n \n \n \nTout est là : notzecoxao\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184511/in-ps5-les-firmwares-sensibles-des-teskits-tombent-les-uns-apres-les-autres-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184511/in-ps5-les-firmwares-sensibles-des-teskits-tombent-les-uns-apres-les-autres-1.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1184511/in-ps5-les-firmwares-sensibles-des-teskits-tombent-les-uns-apres-les-autres-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1184511/in-ps5-les-firmwares-sensibles-des-teskits-tombent-les-uns-apres-les-autres-3.png"
        }
    }
}