{
    "news_1": {
        "title": "[Multi] La Team Dolphin s'explique sur l'échec Steam",
        "content": "Vous le savez si vous lisez nos lignes, l'équipe en charge du développement de Dolphin a proposé sur Steam son émulateur, mais cela n'a pas du tout était au goût de Nintendo qui a envoyé en simultané une demande de retrait DMCA. S'en est suivi un message de déception de la part de la Team Dolphin expliquant rapidement pourquoi la page Dolphin avait été retirée de Steam. \n \nPremier chapitre ici : Nintendo a envoyé un DMCA à Valve pour l'émulateur Dolphin\n \nSecond chapitre c'est maintenant : La Team Dolphin s'explique dans un long billet\n \n \n \n \n\n \n \n \n \n \nSur son blog, la Team Dolphin vient de publier un article dans lequel elle explique ce qu'il s'est passé de son point de vue étant très transparente avec son public. De nombreuses conclusions ont été tirées, et la Team a souhaité se défendre, c'est bien légitime. \n \nLa Team tient tout d'abord à remercie Kellen Voyer, de Voyer Law, qui nous a fourni des conseils juridiques s'appuyant sur le droit américain.\n \n \nQue s'est-il réellement passé ?\n \nTout d'abord, Nintendo n'a pas envoyé à Valve ou Dolphin une notification de la section 512© du Digital Millenium Copyright Act (DMCA) (communément appelée DMCA Takedown Notice) à l'encontre de notre page Steam. Nintendo n'a engagé aucune action en justice contre Dolphin Emulator ou Valve.\n \nEn réalité, le service juridique de Valve a contacté Nintendo pour s'enquérir de la sortie annoncée de l'émulateur Dolphin sur Steam. En réponse, un avocat représentant Nintendo of America a demandé à Valve d'empêcher la sortie de Dolphin sur le Store Steam, en citant le DMCA comme justification. Valve a alors transmis la déclaration des avocats de Nintendo à la Team Dolphin, et a demandé de trouver un accord avec Nintendo pour pouvoir sotir Dolphin sur Steam. \n \nLa Team explique avoir communiqué de manière assez frénétique, ce qui n'a fait qu'attiser les spéculations, mais elle explique dans son article arrêter ses efforts pour tenter de sortir Dolphin sur Steam. C'est tout, la Team Dolphin a perdu trop de temps dans cette bataille et souhaite se pencher sur des sujets plus accessibles que la sortie de Dolphin sur Steam. \n \n \nUne sombre histoire de clés\n \n \nAu cours des dernières semaines, beaucoup de choses ont été dites à propos de Dolphin et de la Common Key de la Wii, et on sent bien que la Team Dolphin souhaite clairement s'expliquer là dessus.  \n \n \n\" Comme vous le savez peut-être, les jeux Wii sont cryptés et la Wii utilise la Common Key qui est gravée dans la console pour décrypter les disques Wii. Le logiciel de la Wii n'a aucun accès à cette clé, mais il a suffit de quelques ingénieurs intelligents et d'une pince à épiler pour l'extraire. \n \nSi vous n'avez jamais entendu parler de cette histoire, nous vous recommandons vivement de jeter un coup d'oeil à la présentation du 25c3 sur l'exploit Tweezer qui a donné son nom à la Team Twiizers. Il s'agit d'une vidéo incroyablement divertissante qui vaut la peine d'être visionnée. Si vous ne connaissez pas la Team Twiizers, vous la connaissez peut-être sous son nom moderne : fail0verflow.\n \nL'extraction de la Common Key de la Wii n'a suscité aucune réaction juridique de la part de qui que ce soit. Elle a été librement partagée partout, et a finalement fait son chemin dans la base de code de Dolphin il y a plus de 15 ans (commis par un membre de la Team Twiizers, rien de moins).\n \nCes clés sont accessibles au public depuis des années et personne ne s'en est vraiment soucié. La loi américaine en la matière n'a pas changé, et pourtant de nombreux avocats de salon sont venus dire à quel point nous avions été stupides d'envoyer la Common Key de la Wii. La lettre de Nintendo à Valve, qui cite les dispositions anti-contournement du DMCA (17 U.S.C. § 1201), notamment parce que Dolphin doit décrypter les jeux Wii, alimente ce débat. \" \n \n \nLa Team explique disposer d'arguments très solides pour affirmer que Dolphin n'est pas principalement conçu ou produit dans le but de contourner la protection. \n \n \n\" Dolphin est conçu pour recréer le matériel du GameCube et de la Wii sous forme de logiciel et pour fournir à l'utilisateur les moyens d'interagir avec cet environnement émulé. Seule une infime partie du code est réellement liée au contournement. En outre, les jeux GameCube ne sont pas du tout cryptés, et Dolphin peut également lire des homebrews et est utilisé dans le développement de mods de jeux. Il existe même des homebrews et des mods qui ciblent spécifiquement Dolphin comme sa propre plateforme, étant donné qu'il a la capacité d'émuler plus de mémoire et de puissance de traitement que ce qui est possible sur les consoles d'origine. C'est pourquoi il existe des \"mode Dolphin\" dans de nombreux jeux homebrews modernes !\n \nÉtant donné que seule une petite partie de ce que nous faisons implique le contournement, nous pensons que l'affirmation selon laquelle nous sommes \"principalement destinés au contournement\" est exagérée. Nous ne pensons pas que cet angle d'attaque serait couronné de succès dans un tribunal américain, si jamais on en arrivait là. La raison pour laquelle les avocats représentant Nintendo font un tel saut est qu'ils souhaitent créer un récit dans lequel les exemptions du DMCA ne s'appliquent pas à nous, alors que ces exemptions sont puissantes et largement en notre faveur. Pour Dolphin, il est particulièrement intéressant de noter l'ingénierie inversée.\n \nNous ne pensons pas que Dolphin soit en danger juridique. Il suffit de lire la fin du message que Valve nous a transmis pour s'en convaincre. Après tous ces propos effrayants, Nintendo n'a rien exigé et n'a fait qu'une seule demande à Valve. Nous demandons spécifiquement que la mention \"bientôt disponible\" de Dolphin soit supprimée et que vous vous assuriez que l'émulateur ne soit pas mis en vente sur le magasin Steam à l'avenir.\n \nEn fin de compte, c'est Valve qui gère la boutique Steam et qui a le droit d'autoriser ou d'interdire tout ce qu'il veut sur cette boutique, quelle qu'en soit la raison. Quant à Nintendo, cet incident ne fait que confirmer sa position actuelle à l'égard de l'émulation. Nous ne pensons pas que cet incident doive changer l'opinion de quiconque à l'égard de l'une ou l'autre de ces sociétés.\n \nEn revanche, certaines des fonctionnalités développées pour la version Steam fonctionneront toujours dans les versions normales de Dolphin, et sont toujours en cours de développement. L'une des fonctionnalités que nous attendons avec le plus d'impatience est une interface graphique \"Big Picture\" complète qui peut être utilisée directement avec une manette. Cela va se produire indépendamment d'une sortie sur Steam, en même temps que plusieurs petites fonctionnalités qui étaient censées être des améliorations pour les builds Steam.\n \nLa dernière chose que nous aimerions faire avant de conclure est de remercier les développeurs qui ont consacré beaucoup d'efforts à la version Steam. OatmealDome en particulier a été l'architecte de l'intégration Steam de Dolphin, travaillant avec l'infrastructure de Dolphin et Steam pour passer de la théorie à une version pleinement fonctionnelle de Dolphin. Nous aimerions également remercier delroth pour l'immense quantité de travail de CI de ces derniers mois, qui a donné à OatmealDome une base solide sur laquelle s'appuyer. Enfin, MayImilae a fourni une grande quantité de travail médiatique pour la sortie de Steam, tout en travaillant sur une fonctionnalité majeure à venir. \"\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176134/in-multi-la-team-dolphin-sexplique-sur-lechec-steam-1.png"
        }
    },
    "news_2": {
        "title": "[3DS] Wumiibo 4.2 et rehid 4.0 disponibles",
        "content": "Le développeur hax0kartik vient de mettre en ligne une nouvelle version de Wumiibo, il s'agit là de la septième release publique de Wumiibo. Pour rappel, il s'agit d'un outil qui permet d'émuler les Amiibo sur la Nintendo 3DS et ses grandes et petites soeurs. En fait, sous ce nom se cache une réécriture intégrale du module NFC utilisé pour activer l'émulation Amiibo.\n \nCette v4.2 apporte surtout des correctifs sur l'environnement et des changements pour supporter la toute dernière version de Luma v13.0 sorti il y a quelques heures. \n \n\n\n\n \n \nChangelog 4.2 : \n \n- Mise à jour de Wumiibohelper et Wumiibo pour supporter le luma v13.0 récemment sorti.\n- Correction des entrées amiibo pour Hey Pikmin !\n- Pour installer/mettre à jour WumiiboHelper, vous pouvez scanner le code QR suivant avec FBI.\n\n \n- Un guide d'utilisation/installation de wumiibo peut être trouvé ici.\n- Pour tout problème/question ou suggestion, vous pouvez rejoindre ce serveur discord ou utiliser la page des problèmes/discussions du github. \n \n \nTéléchargement : Wumiibo 4.2\n \n \nAutre information, l'arrivée de la version 4.0 de rehid du même développeur. \n \n\n \n- Ajout de la prise en charge du debugpad.\n- Correction de bugs dans les remappings CPAD>DPAD et DPAD>CPAD.\n- Correction d'un bug où les remappages globaux n'étaient pas appliqués au menu d'accueil après la fermeture d'un titre.\n- Rehidhelper a été réécrit et devrait être plus stable.\n- Rehidhelper est maintenant disponible en tant que CIA et peut être installé sur l'écran d'accueil directement.\n- Ajout d'un support expérimental pour turbofire/autofire. Pour plus de détails, vous pouvez consulter cet article.\n- Le support de Luma v13.0 a été ajouté en passant à un patching basé sur CXI. Cette version ne fonctionnera qu'avec luma v13.0 et plus.\n \n\n \nTéléchargement : rehid 4.0\n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176131/in-switch-wumiibo-42-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176131/in-switch-wumiibo-42-disponible-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1176131/in-switch-wumiibo-42-et-rehid-40-disponibles-1.png"
        }
    },
    "news_3": {
        "title": "[3DS] Luma3DS v13.0.1 disponible",
        "content": "Nouvelle mise à jour de Luma3DS, le Custom Firmware à destination de la Nintendo 3DS développé à l'origine par AuroraWright et repris par TuxSH.\nPour rappel Luma3DS  est un programme permettant de corriger le logiciel système des consoles portables (New) Nintendo (2)3DS \"à la volée\", en ajoutant des fonctionnalités telles que les paramètres de langue par jeu, des capacités de débogage pour les développeurs et en supprimant les restrictions imposées par Nintendo telles que le verrouillage régional.\n \nLa version 13.0 sortie est une version \" majeur \" car il fusionne le code de Luma 3GX, une version de Luma customisé à l'origine par Nanquitas et repris par PabloMK7 le développeur de CTGP7 un mod customisé de Mario Kart 7.\nLuma3GX sert principalement pour l'usage de plugin / mod ainsi qu'un module de cheat plus complet.\n\n \nChangelog : \n \n\n \n\n \n- Fusion de la version 3GX de @PabloMK7 et @Nanquitas, ajoutant le support des plugins. Cela permet de jouer des mods comme CTGP-7.\n \nNOTE : En raison de changements planifiés (tels que la réimplémentation du noyau), les plugins plus anciens qui ne sont plus maintenus ou les plugins fermés\npeuvent soudainement cesser de fonctionner à un moment donné dans le futur. Nous vous conseillons d'utiliserdes plugins open source et/ou activement maintenus par des sources fiables.\n \n- Ajout d'un support pour remplacer le filtre d'upscaling TWL_FIRM (c'est-à-dire le logiciel DS(i)) basé sur la convolution par le contenu de /luma/twl_upscaling_filter.bin.\n- Vous pouvez trouver des exemples de matrices ici et le code Python pour les convertir au format attendu ici.\n- Ajout du support pour autoriser les combos de touches Gauche+Droite et Haut+Bas dans TWL_FIRM, bien que les jeux DS(i) commerciaux empêchent généralement ces combos d'eux-mêmes.\n- Ajout de la prise en charge de TWL_FIRM et AGB_FIRM de taille arbitraire et non compressés, lorsqu'ils sont chargés de manière externe à partir du dossier /luma.\n- Simplification du chargement des CXI des sysmodules et des correctifs IPS/BPS : le bit N3DS est maintenant effacé lors du choix du fichier CXI à charger à partir de /luma/sysmodules. Le chemin pour les correctifs IPS/BPS pour les sysmodules, et les sysmodules seulement, a été déplacé vers /luma/sysmodules/<titleId sans bit N3DS>.ips (resp. .bps). Il s'agit d'un changement important\n- Suppression de l'option \"Use EmuNAND FIRM if booting with R\" et de toute la logique associée. Il s'agit d'un reliquat de l'ère Gateway qui n'a plus sa place en 2023.\n- Correction d'un bug rare où la console démarrait avec 2 écrans blancs.\n- Autres changements mineurs\n\n \n\nMise à jour de Luma 3DS en version 13.0.1 qui fix une régression apparu dans la version 13.0 qui empêchais des modules de fonctionné comme celui gérant le widescreen sur TwilightMenu++\nChangelog : \n \n\n\n \nCorrection d'une régression de la v13.0 où le chargement de modules FIRM externes (tels que TwlBg) était interrompu.\n\n \n\nLien de téléchargement : Luma 3DS 13.0.1",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176110/in-3ds-luma3ds-v13-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[PS4/PS5] Sony sort les firmwares 10.70 (PS4) et 7.60 (PS5)",
        "content": "Sony vient tout juste de mettre en ligne des nouveaux firmwares à destination de la PlayStation 4 / PlayStation 4 Pro, et de la PlayStation 5. \n \nA l'occasion du 20eme jour du mois de Juillet 2023, la firme japonaise propose un tout nouveau firmware 10.70 pour la PS4 et le firmware 7.60 pour la PS5.\n \nCôté PS4, ce nouveau PUP a pour ambition d'améliorer les performances système de la console, tout un programme ! Bon comme vous le savez très bien il ne s'agit là que d'un message bateau pour dire qu'ils ont corrigés un ou deux bugs par ci-par là qui ne pourront plus être utilisé par les hackers. \n \n \n\n \n \n \nVersion 10.70\n \nPrincipales caractéristiques du logiciel système mise à jour :\n- Cette mise à jour du logiciel système améliore les performances du système.\n \n \nCôté PS5, et bien cela peut paraitre étonnant, c'est exactement la même chose, de là à dire que la performance va être de mise désormais il n'y a qu'un pas ! \n \n \nVersion 7.60\n \nPrincipales caractéristiques du logiciel système mise à jour :\n- Cette mise à jour du logiciel système améliore les performances du système.\n \n \n \nCette version 7.60, ou 23.01-07.60.00, vient donc corriger exactement la même chose que sur PS4, comme c'est étrange ! \n \n \nSource : FwPs5\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176098/in-ps4ps5-sony-sort-les-firmwares-1070-ps4-et-760-ps5-1.png"
        }
    },
    "news_5": {
        "title": "[Switch/PS4] Pikmin 4 leaké, FF Pixel Remaster Collection et F1 23 backportés",
        "content": "C'est l'été, il fait chaud, et cela chauffe aussi du côté de nos amis développeurs et dumpers qui proposent les jeux. \n \n \n\n \n \n \nNous venons d'avoir la confirmation que Pikmin 4 vient d'être dumpé sur Nintendo Switch. Ce n'est pas non plus très surprenant, le jeu est attendu officiellement pour le 21 Juillet 2023, mais c'est bel et bien le jeu complet qui a été dumpé et mis en ligne au téléchargement. Des captures d'écran, de vidéos commencent à sortir, ce qui gâche toujours un peu le plaisir du jeu.\n \n \n-------------\n \n \nAutres propositions, celle de Final Fantasy Pixel Remaster Collection sur PlayStation 4 et PlayStation 4 Pro backporté sur PS4 par CyB1K & Xmrallx, qui regroupe pas moins de 6 Final Fantasy dans une seule galette, enfin oui et non car les jeux sont proposés un par un dans l'ultime remaster en pixels 2D et profitant d'une bande-son magnifiquement réarrangée.\n \n \n \n\n \n \n \nLa jouabilité est améliorée grâce à une interface modernisée, et des extras tels qu'un bestiaire, une galerie d'illustrations et un lecteur de musique permettent de s'immerger encore plus dans l'univers du jeu. De quoi découvrir ou redécouvrir Final Fantasy I à VI.\n \n \n\n \n \nChaque jeu pèse entre 500 et 1 Go, ce qui fait que vous pouvez choisir selon celui que vous souhaitez découvrir, sachant que chacun des titres sera proposé avec sa mise à jour 1.01 ou 1.02 pour les 3 derniers (de Final Fantasy 4 à Final Fantasy 6).\n \n \n \n\n \n \n \nEnfin, le dernier titre dont nous parlerons ici est F1 2023 qui est sorti le 15 juin 2023, il a lui aussi été backporté pour les firmwares 5.05, 6.72, 7.02 et 9.00 par CyB1K, grâce à sa mise à jour 1.06. Il faudra être patient car le jeu pèse pas moins de 43 Go, et 27 Go pour son update. \n \n \n\n \n \nBref, de quoi faire chauffer nos consoles ! \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176071/in-switchps4-pikmin-4-leake-ff-pixel-remaster-collection-et-f1-23-backportes-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176071/in-switchps4-pikmin-4-leake-ff-pixel-remaster-collection-et-f1-23-backportes-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1176071/in-switchps4-pikmin-4-leake-ff-pixel-remaster-collection-et-f1-23-backportes-3.jpg"
        }
    },
    "news_6": {
        "title": "[PS4] PS4 Wee Tools 0.7.9 disponible",
        "content": "Le développeur Andy_maN continue d'améliorer PS4 Wee Tools, le logiciel open source PS4 évolue vite, voilà donc que débarque déjà la v0.7.7 après une v0.7.6 éclair. \n \nLa solution gratuite de donwgrade PS4 a donc de nouvelles cordes à son arc, la v0.7.6 a apporté des modifications mineures, l'hypothèse de la version FW2 a été ajoutée à l'écran d'informations.\n \n \n \n\n \n \n \nLa version 0.7.7 est un peu plus riche puisqu'elle apporte de nouvelles options : \n \n- la possibilité d'emballer et de déballer SLB2 (pack / unpack)\n- Mise à jour de l'écran de sélection de fichiers\n- Préparations pour le cfw EMC (Aeolia)\n \n \nTéléchargement : PS4 Wee Tools 0.7.7\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176056/in-ps4-ps4-wee-tools-077-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[PS4] Un nouvel outil de Zecoxao dévoilé il s'agit de decrypt_rnps",
        "content": "Sous le nom de decrypt_rnps se cache un outil qui va vous permettre de décrypter les applications React Native PlayStation utilisées sur PS5. Il est proposé par Zecoxao et cela amène un peu d'eau au moulin de la scène PS5. \n \ndecrypt_rnps est un outil C qui décrypte les rnps (React Native PlayStation Apps). Ces applications sont basées sur le Web, mais certaines d'entre elles semblent être liées à l'interface graphique PS5 en particulier, et peut-être plus.\n \nLe développeur Ifaicompa avait fourni il y a quelques temps plusieurs applications rnps, allant du firmware 2.00 au 6.90, provenant des serveurs officiel de Sony et qui peuvent donc être décryptées avec decrypt_rnps.\n \nElles sont disponibles ici : Applications rnps (ePKG)\n \n \n \n\n \n \n \nQuand au fichier de Zecoxao cela se passe ci-dessous, il a été testé sous Ubuntu 20.04 sachant qu'il n'y a pas encore de version binaire, vous devrez donc compiler l'exécutable vous-même.\n \nTéléchargement : decrypt_rnps\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176055/in-ps4-un-nouvel-outil-de-zecoxao-devoile-il-sagit-de-decrypt-rnps-1.png"
        }
    },
    "news_8": {
        "title": "[PS5] La conférence de Specter Hardwear.io en vidéo",
        "content": "Le site Hardwear.io vient de publier la vidéo de présentation de Specter du 02 Juin 2023, dans laquelle Specter nous a confirmé que c'est autour du firmware 3.xx que de nombreuses failles critiques ont été corrigées, il préconise donc d'essayer de rester sur un firmware inférieur si c'est possible.\n \n \n\n \n\n \n \nDans cette vidéo nous pouvons découvrir Specter, mais aussi voir ses réactions, bien que mesurées, il y détaille ainsi l'intégralité de la présentation, qu'il est toujours possible de trouver en PDF ici : the-PS5-security-landscape. En attendant on peut retrouver la vidéo ci-dessous. \n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1110740468.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1560520020.jpg"
        }
    },
    "news_9": {
        "title": "[Switch] Les rapports de Ryujinx et de Yuzu sont là",
        "content": "Au rapport, c'est un peu ce que se disent tous les mois les utilisateurs de Yuzu et de Ryujinx, mais clairement depuis la sortie de Zelda TotK la donne a changé, et la restitution doit être optimale. Comme un peu tous les mois, nous faisons le point sur les évolutions des deux émulateurs.  \n \n \n\n \n \n \nDu côté de chez Yuzu : \n \nLes développeurs, anciens et nouveaux, ne montrent aucun signe de ralentissement sur le développement de Yuzu. Des améliorations générales de performances et de la stabilité, de nombreuses corrections de bugs graphiques, Android reçoit sa première vague d'améliorations, et bien plus encore !\n \nDes corrections de particules sous The Legend of Zelda: Breath of the Wild & The Legend of Zelda : Tears of the Kingdom, d'explosions affectant les vertex sous Pokemon Scarlet & Violet, ou encore la correction de mouvements erratiques sous Super Mario Odyssey ou Xenoblade Chronicles 3. \n \nSans compter cela, il y a eu de grandes évolutions dans la gestion de la RAM, étant donné que les shaders natifs de Switch ne peuvent pas être exécutés directement sur le GPU, yuzu doit les recompiler dans une représentation intermédiaire (IR) qui est un format intermédiaire qui peut être optimisé puis converti en un shader que les pilotes GPU  peuvent réellement restituer (SPIR-V/GLSL/GLASM). Des corrections d'allocation de mémoire ont été retravaillées pour pouvoir restituer sur des PC disposant moins de mémoire RAM.\n \nClairement le rapport Yuzu est tout simplement ultra-complet, informant sur des superpositions, des problèmes de découpage de textures sous Vulkan, Android ne fonctionne pas uniquement sur les téléphones et les tablettes. Vous pouvez aussi utiliser Yuzu sur les téléviseurs ! Pour ces fous, le nouveau venu qurious-pixel a ajouté la prise en charge d'une bannière Android TV, si vous voulez en savoir davantage c'est ci-dessous. \n \n \nTout est là : yuzu-emu.org\n \n \n \n\n \n \nDu côté de Ryujinx :\n \nA la mi-2023 l'émulateur Ryujinx qui pour rappel est proposé pour Windows PC, MacOS et Linux, vient d'accueillir de nouvelles fonctionnalités, cela passe notamment par la prise en charge de nouveaux titres en day1, comme la démo de Pikmin 4, en attendant la sortie de la version complète.\n \nThe Legend of Zelda : Tears of the Kingdom a nécessité de nombruex correctifs afin d'obtenir une fluidité aux petits oignons, notamment sur les GPU Intel.\n \nDes optimisations Mac et OpenGL ont permis d'améliorer la gestion des textures 3D, de corriger des problèmes sur Vulkan et ainsi d'optimiser la restitution visuelle. \n \nD'autres correctifs sur DotNet ont permis d'automatiser certains processus dans le code avec le format DotNet. Enfin dans l'avenir, l'équipe en charge du développement souhaite unifier le code de certaines plates-formes cibles comme OpenGL, Vulkan et Metal. \n \n \nTout est là : blog.ryujinx.org\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176038/in-switch-les-rapports-de-ryujinx-et-de-yuzu-sont-la-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1176038/in-switch-les-rapports-de-ryujinx-et-de-yuzu-sont-la-2.png"
        }
    },
    "news_10": {
        "title": "[Vita] psp2etoi 1.0.0 disponible",
        "content": "Le développeur SKGleba vient de mettre en ligne la première version de psp2etoi, un nouvel outil de gestion des identifiants d'appareils uniques destiné à la PlayStation Vita et par extension à la PlayStation TV.\n \nCet outil qu'il vient de rendre public vous permet de sauvegarder, modifier, d'enregistrer les identifiants de périphériques uniques comme ConsoleID et OpenPSID. Il est également capable de dumper ou flasher le syscon S/NVS qui contient des données de configuration telles que les QA flags, les flags de management et bien plus encore.\n \n\n \nBien entendu vous vous doutez bien, il se destine aux utilisateurs expérimentés. \n \n \n\n \n\n \n \nTéléchargement : psp2etoi 1.0.0\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1176003/in-vita-psp2etoi-100-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1176003/in-vita-psp2etoi-100-disponible-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1176003/in-vita-psp2etoi-100-disponible-2.png"
        }
    },
    "news_11": {
        "title": "[PS4] I know that song de Lapy disponible",
        "content": "Le développeur Lapy vient de mettre en ligne un nouvel homebrew pour la PS4 qui porte le nom de \"I Know that Song\", il se destine aux PlayStation 4 et PlayStation 4 Pro jailbreakées, et s'appuie sur les vagues de \"PS Scene Quiz\" dont il en est déjà à l'origine. \n \nL'objectif du jeu est que les joueurs doivent deviner le titre d'une chanson, sachant que le jeu contient environ 50 chansons au format BSO (Original Soundtrack) et propose des paroles en anglais et en espagnol.\n \nUn prix spécial sera remis à ceux qui arrive à découvrir tous les titres correctement.\n \n \n\n \n\n \n \nTéléchargement : LAPY10023_V1.00.pkg (215.56 MB - I Know that Song 1.00.pkg)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175977/in-ps4-i-know-that-song-de-lapy-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175977/in-ps4-i-know-that-song-de-lapy-disponible-2.png"
        }
    },
    "news_12": {
        "title": "[Vita] Rinnegatamante est de retour avec un R-Type Like",
        "content": "Quand nous vous disions que la scène PlayStation Vita est en plein rebond en voilà une nouvelle preuve, de nombreux utilitaires ont été mis à jour ces derniers jours, bien qu'il ne nous semble pas opportun de tout newser, l'arrivée d'un tout nouvel homebrew est tout de même l'occasion de le faire, même si c'est sur PS Vita, cette démarche étant légitimée par son auteur Rinnegatamante. \n \nRinnegatamante aura fait énormément pour la console de Sony en matière d'homebrews, il faut reconnaitre qu'il est à l'origine de nombreux utilitaires et jeux homebrews pour la console, mais surtout ce qu'il propose est toujours bien finalisé, testé et bien présenté, ce qui fait que l'arrivée d'une nouvelle proposition est toujours intéressante.\n \n \n\n \n \nIl vient de mettre en ligne un homebrew sous forme de jeu, qui se nomme Prototype, il s'agit là d'un R-Type Like, qui peut être compilé pour d'autres plates-formes comme OpenPandora, Linux, Odroid ou AmigaOS4, et il a appliqué quelques correctifs spécifiques liés à certaines dépendances logicielles FMOD.\n \n \n\n \n \nComme le précise Rinnegatamante, il faudra disposer de la bibliothèque libshacccg.suprx, il existe un guide pour l'installer ici. \n \n \n\n \n\n \n \nTéléchargement : Prototype Vita v.1.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175916/in-vita-rinnegatamante-est-de-retour-avec-un-r-type-like-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175916/in-vita-rinnegatamante-est-de-retour-avec-un-r-type-like-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1175916/in-vita-rinnegatamante-est-de-retour-avec-un-r-type-like-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1175916/in-vita-rinnegatamante-est-de-retour-avec-un-r-type-like-4.png"
        }
    },
    "news_13": {
        "title": "[PS4] PS4 Wee Tools 0.75 déjà disponible",
        "content": "Le logiciel open source PS4 Wee Tools évolue vite, très vite, voilà déjà que débarque la version 0.71 et il est probable qu'il soit rapidement mis à jour, il faut avouer qu'il est en train de devenir la réelle solution gratuite de donwgrade PS4.\n \nLes mises à jour se succèdent sur PS4 Wee Tools car voilà encore une nouvelle version en quelques jours, son développeur andy-man réalise un boulot de dingue permettant à l'outil d'acquérir encore de nouvelles fonctionnalités jusqu'alors inaccessibles. \n \nL'outil prenant forme de script Python permet de manipuler la mémoire NOR et le Syscon d'une PS4 avec les bons outils hardware.\n \nClairement ce logiciel se rapproche de plus en plus de PS4-NOR-Validator et de Syscon-Patcher de BwE, mais en étant une alternative gratuite et open-source, et disposant d'une facilité d'utilisation déconcertante. \n \n \n\n \n \n \nLes versions se succèdent : \n \nPS4 Wee Tools v0.7 :\n- Extraire les partitions de NOR\n- Modeler un dump à partir de fichiers extraits\n- Obtenez les clés HDD EAP [keys.bin]\n- Correction de l'écran de sélection de fichier\n \nPS4 Wee Tools v0.71 :\n- Un bug a été corrigé\n- Une autre version est déjà en préparation, remerciements aux feedbacks des utilisateurs \n \nEdit 17.07.2023\n \nTéléchargement : PS4 Wee Tools 0.75\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175915/in-ps4-ps4-wee-tools-071-deja-disponible-1.jpg"
        }
    },
    "news_14": {
        "title": "[XBO] Le retour des émulateurs sur Series X/S",
        "content": "Lorsque Microsoft a fait le choix de retirer la possibilité d'avoir accès aux émulateurs WUP sur consoles Xbox Series S et Series X, les plus ingénieux d'entre nous se sont mis en recherche de trouver des failles. \n \nMicrosoft a fait le choix de désactiver les applications UWP sur les modèles de consoles Retail, ainsi la communauté s'est retrouvée sans possibilité de lancer ces petits programmes permettant de profiter de nos jeux du passé. \n \nLe grand public ne souhaite pas modifier sa console pour la passer en mode développeur, beaucoup préfèrent rester en mode retail car cela nécessite déjà quelques connaissances spécifiques, mais aussi une configuration logicielle supplémentaire. \n \n \nMais ça c'était avant. \n \nAvant quoi, avant que le développeur SirMangler et quelques autres développeurs qui se sont réunis sous la bannière \"UWeaPons Store\" ne proposent une nouvelle méthode permettant de profiter des applications UWP en mode retail, sans devoir forcer le mode développeur. \n \nPour l'heure, la méthode n'a pas été dévoilée, de crainte que Microsoft la corrige rapidement. Pour y parvenir, et pour stabiliser la chose, les développeurs ont réécrit une partie du code des applications afin de supprimer les éléments d'identification. L'ensemble des émulateurs a ensuite été regroupé sous une seule application nommée \"Root App\" qui est téléchargeable sur le store. \n \n \n \n\n \n \n \nAinsi ils rejoignent des émulateurs comme Xenia, Dolphin ou encore RetroArch ou XBSX.\n \nPour profiter de cette version il suffit de soutenir à 2 euros par mois les développeurs ici :  UWeaPonsStore\n \n\n \n \nUn autre émulateur, celui de la PS2, XBSX2 vient aussi d'être mis à jour en v2.0.3. Il est proposé par qui, par SirMangler, qui une nouvelle fois nous prouve que le monde de la Xbox One ou des Xbox Series S / X reste intéressant. Pour rappel, l'émulateur XBSX2 vous permet non seulement de jouer à des titres PS2 avec toute la puissance native de l' émulateur PCSX2 , mais vous permet également de profiter des résolutions échelonnées (+4K) jamais vues sur une console Xbox.\n \n \nTéléchargement : PCSX2 2.0.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175898/in-xbo-le-retour-des-emulateurs-sur-series-xs-1.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] NeXT 3.02 disponible",
        "content": "En ce début juillet 2023, le développeur mistervampi propose une mise à jour de NeXT en version 3.02, pour rappel NeXT est un tout en un qui supporte les CFW que ce soit Atmosphere ou SX OS, de plus sa gestion des applications est largement simplifiée par une interface utilisateur très fonctionnelle. Similaire à DeepSea ou encore RetroReloaded, NeXT intègre de nombreux payloads, et sa plus grande des possibilités est de pouvoir facilement gérer Atmosphere et SX OS au travers d'une interface graphique riche. \n \n\n \n\n \n \nCette mise à jour 3.02 apporte les versions les plus récentes des logiciels qui font sa force, à savoir que cette version 3.02 intègre les nouvelles moutures suivantes : \n \nMise à jour :\n- Atmosphère 1.5.4\n- DBI\n- Tinwoo\n- L4T Android - Linux Bootloaders\n \n \nTéléchargement : NeXT 3.02\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175852/in-switch-next-302-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175852/in-switch-next-302-disponible-2.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] NSZ 4.3.0 disponible",
        "content": "Le développeur Nico Bosshard a dévoilé il y a quelques jours une nouvelle version de NSZ, il s'agit de la version 4.3.0, la mouture précédente avait été mise en ligne en Décembre 2022, les changements sont donc nombreux.\n \nPour celles et ceux qui ne connaitraient pas les fichiers NSZ sont très proches des NSP, ils sont compressés, ce n'est pas tout à fait un nouveau format, le script est assez simple à utiliser, et sachez que NSC_Builder prend en charge la compression de fichier NSP dans NSZ et la décompression de fichier NSZ dans NSP.\n \n \n\n \n \nChangelog 4.3.0 :\n \n- Recréation bit-identique de PFS0 pour se conformer à la norme de non-introduction\n- Le hash du NSP original avant compression et le hash du NSP résultant de la décompression du NSZ correspondront car ils sont identiques en bits.\n- Utilisez la nouvelle option --remove-padding pour rendre les fichiers NSP/NSZ existants conformes à la norme nxdumptool/no-intro.\n- Utilisez l'option --keep-delta nouvellement introduite pour conserver tous les fragments delta inutiles (NDV0) pendant la compression afin que le NSP (PFS0) puisse être recréé à l'identique pendant la décompression.\n- La vérification du hachage de PFS0 fait maintenant partie du processus --verify. --verify nécessite maintenant --keep-delta lorsqu'il est utilisé pendant la compression ou il détectera les fragments NDV0 supprimés comme des erreurs. Utilisez --quick-verify pour sauter la vérification du hachage PFS0. --quick-verify ne vérifie que les hachages NCA et ne nécessite donc pas --keep-delta lorsqu'il est utilisé pendant la compression. Pour des raisons de compatibilité, --quick-verify sera automatiquement utilisé à la place lorsque l'on spécifie --verify sans --keep-delta afin de correspondre aux arguments de la ligne de commande et au comportement de vérification des versions précédentes de NSZ.\n- Ceci corrige les rapports #98, #101 et #116.\n- Ajout d'une sortie console avertissant des clés manquantes et invalides\n- Ajout du support de pyinstaller comme discuté dans #119 (pyinstaller builds for macOS)\n- Ajout du hash crc32 de master_key_0f. Merci à @drizzt de l'avoir ajouté !\n \n \n \nTéléchargement : NSZ 4.3.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175839/in-switch-nsz-430-disponible-1.jpg"
        }
    },
    "news_17": {
        "title": "[Vita] Enso Ex v5.0 disponible",
        "content": "Nous vous le disions, nous vous le confirmons, la scène PlayStation Vita se réveille, et cela peut paraitre assez brutal, mais c'est une réalité. Le développeur SKGleba vient de mettre en ligne il y a quelques minutes la version 5.0 d'Enso Ex, la version précédente était datée de Novembre 2020 !\n \n \n\n \n \nComme vous le savez probablement Enso Ex est l'installateur étendu pour enso dans PSP2 sur le firmware 3.60 / 3.65 de la PlayStation Vita et PlayStation TV, attention toutefois cette version 5.0 supporte uniquement le firmware 3.65.\n \n \n\n \n \nChangelog 5.0 :\n- Ajout de la journalisation de débogage\n- Ajout d'un support approprié pour le mode d'émulation Playstation TV sur les DevKits\n- Ajout de la récupération EMMC et des bascules de démarrage\n- Ajout d'un support basique de récupération SD pour Playstation TV\n- Réécriture majeure des composants les plus critiques\n- L'installateur est plus sûr et plus rapide\n- Diverses améliorations et corrections de bugs\n- Firmwares supportés : 3.65 uniquement sur types CEX, DEX, TOOL, CFT\n \n \nTéléchargement : Enso Ex v5.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175808/in-vita-enso-ex-v50-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175808/in-vita-enso-ex-v50-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[PS4/PS5] 24 bugs reportés et corrigés par Sony via HackerOne PlayStation",
        "content": "Le développeur mghack123 a reporté pas moins de 24 bugs au programme bounty PlayStation présent sur HackerOne. \n \nDes primes de 100 à 400 $, même si cela n'est pas clairement précisé, ces bugs concernent probablement le PlayStation Network, et peut être aussi le site Web, mais ce sont des bugs qui concernent la PlayStation 4 et/ou la PlayStation 5, mais pour cette console ce sont davantage des primes de 500 $ qui sont octroyées. \n \n \n\n \n \n \nLes primes précédentes reçues par mghack123 semble laisser penser qu'il s'agit de faille de sécurité puisqu'il a été récompensé pour des sites comme Alibaba, AirBnB, Yahoo, ou encore Paypal.\n \n11 500 $ pour les bugs PlayStation, et le double pour le reste des autres sites, cela peut paraitre intéressant, mais il faut mettre en face le temps passé à chercher toutes ces failles. Bien entendu l'ambition est aussi d'assurer la sécurité des consoles, et elles ne déboucheront probablement jamais sur un jailbreak, elles peuvent très bien concerner le site PSN, le webkit ou, vu leur nombre, des petits bugs faciles à corriger, mais ils sont nombreux, ce qui est loin d'être rassurant. \n \n \n \n\n \n \n \n \nTout est là : hackerone.com\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175805/in-ps4ps5-24-bugs-reportes-et-corriges-par-sony-via-hackerone-playstation-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175805/in-ps4ps5-24-bugs-reportes-et-corriges-par-sony-via-hackerone-playstation-1.jpg"
        }
    },
    "news_19": {
        "title": "[Switch] LineageOS 18.1 Bêta 2.75 disponible",
        "content": "Le développeur CTCaer est de retour avec une nouvelle version de  LineageOS 18.1 qui passe en Bêta 2.75 après la sortie express de la 2.5.\n \nIl y a tout juste une semaine sortait la 2.0, mais il semblerait que les versions s'enchainent rapidement puisque de nombreuses corrections ont déjà été apportées par le développeur. \n \nPour rappel LineageOS 18.1 est l'arrivée de la version d'Android 11 sur la Switch, et il faut donc l'ajuster pour qu'elle fonctionne au mieux sur la console de Nintendo. \n \nLa Team SwitchRoot propose donc cette Bêta 2.75 qui corrige de nombreux bugs, notamment sur la double entrée CEC, la correction de l'étalonnage de la Switch Lite, des corrections des paramétrages de la table EMC de L4T, mais aussi l'analyse d'adresse MAC, ou encore un correctif important sur la signature de l'APK du console launcher, ainsi les mises à jour via le Play Store devraient désormais fonctionner. \n \n \n\n \n \nChangelog Beta 2.75 :\n- Correction de la double entrée CEC\n- Correction de l'étalonnage Lite\n- Correction de la table EMC de L4T\n- Meilleure analyse de l'adresse MAC (et correction du MAC Wi-Fi - maintenant le MAC BT avec FF comme dernier octet est utilisé, et seul le joycon_mac.ini est analysé)\n- La signature de l'APK de Console Launcher devrait être corrigée, ce qui signifie que les mises à jour via le Play Store ne devraient plus échouer.\n \nChangelog Bêta 2.5 :\n- Correction des ventilateurs sur les modèles Erista\n \n \nTéléchargement : nx-tab-beta2.75-20230705-rel.7z\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175804/in-switch-lineageos-181-beta-275-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS4] PS4 Wee Tools 0.5 disponible",
        "content": "Cela s'accélère du côté de la possibilité de downgrade une PS4 qui dispose d'un firmware supérieur au 9.00. La possibilité de downgrade une console ayant été mise à jour au dessus du firmware 9.00 via une seule mise à jour est désormais certaine, il ne faudra pas que la console ait été mise à jour plus d'une fois, mais au moins cela est envisageable. \n \nUn nouvel utilitaire a fait son apparition il y a quelques jours, il s'agit de PS4 Wee Tools, proposé par Andy-man, il permet d'aider aux dumps PS4 nor et syscon. Pour parler simplement, il s'agit d'une alternative libre et gratuite aux outils PS4-NOR-Validator et Syscon-Patcher de BwE, écrite en Python pour rester simple.\n \n \n\n \n \n \nActuellement, il fournit des fonctionnalités de base et ne peut pas remplacer complètement ces outils, il faudra utiliser en complément PS4 Syscon Tools ou encore NOR validator, mais clairement l'outil progresse à grands pas. \n \nAinsi l'outil PS4 Wee Tools permet d'obtenir des informations détaillées sur le dump de la NOR, permet de basculer en mode UART, de réaliser des tests mémoire, ou sur les clés Keystorage, de nettoyer certains indicateurs système, de modifier la fréquences de la mémoire GDDR5, ou encore de modifier l'indicateur de démarrage SAMU. Il permet aussi d'offrir un contrôle important sur les Syscons, permettant de modifier certains emplacements de contrôles SNVS.\n \n \n\n \n \n \nChangelog v0.4 :\n- Vérification de la possibilité d'appliquer des correctifs à Syscon\n- Correction des bugs du patch manuel\n- Correction d'erreurs mineures \n \nChangelog v0.3 :\n- Statistiques de l'entropie NOR\n- Patch manuel Syscon\n- Correction d'erreurs mineures\n \nChangelog v0.2 :\n- Bascule Syscon DEBUG\n- Classe NVStorage Syscon\n- Syscon show active slot\n \nChangelog v0.1 :\n- Comparaison de fichiers\n- UART, Memtest basculer\n- Sys flags clean\n- Modifier l'horloge mem et le SAMU\n- Downgrade des motifs de commutation\n- Vérification de la base Syscon\n \n \nUn PDF regroupant l'ensemble des étapes a été diffusé sur l'expérience de Ruben Waernewyck qui a réussi à downgrader sa PS4 du firmware 9.03 au firmware 9.00. son expérience s'est appuyé sur de nombreux outils, dont PS4 Wee Tools. \n \nSi l'expérience de downgrade de Ruben vous intéresse elle est dévoilée ici (PDF).\n \n \nAttention, Andy-maN le rappelle, il n'est pas un professionnel de la réparation PS4, il a réussi quelques dumps mais ne peut garantir le fonctionnement parfait de PS4 Wee Tools, il faudra plusieurs mois de développement pour cela, à utiliser donc avec la plus grande prudence compte tenu que vous avez là accès à des éléments sensibles de la console. \n \n \nTéléchargement : ps4-wee-tools\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175803/in-ps4-ps4-wee-tools-04-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175803/in-ps4-ps4-wee-tools-04-disponible-2.png"
        }
    }
}