{
    "news_1": {
        "title": "Bonne année 2025",
        "content": "L'année 2024 s'est achevée, et cette année encore a été une année difficile, bien entendu encore une fois notre objectif est le jeu vidéo et le hack, 2024 aura été l'année des grands bouleversements, Microsoft ayant abandonné la course à la puissance vis à vis de Sony, qui a sorti sa PS5 Pro.\n \nCôté Nintendo, on attend toujours la Switch, même si les prototypes ou les concepts semblent de plus en plus réalistes, analysés par des robots anti-ai pour vérifier que les images soient réelles ou pas, il semblerait que la Switch 2 pointe le bout de son nez d'ici la fin du premier trimestre 2025. \n \n \n\n \n \n \nQue peut-on se souhaiter pour 2025 ?\n \nComme l'année dernière, on aimerait de nouveaux hardwares, une nouvelle Switch (décidément) on l'attendait déjà l'année dernière pour rappel, mais quoi attendre des autres constructeurs, pas grand chose, Sony pourrait travailler sur une PlayStation Portable fort du succès du PlayStation Portal, mais pour le reste, à part des modèles slim, pas grand chose de nouveau avant 2027.\n \nPour le hack, une libération de la PS5 pourrait s'envisager, la scène a bien progressé ces dernières semaines, il reste encore à élargir le hack sur des firmwares plus récents, côté Microsoft, rien à en attendre, et pour Nintendo, c'est la Switch 2 qui désormais va cristalliser les esprits après son lancement. \n \n \nPassez toutes et tous une excellente année 2025, toute l'équipe de Logic-Sunrise.com vous souhaite : Bonne Année 2025 !\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202267/in-bonne-annee-2025-1.jpg"
        }
    },
    "news_2": {
        "title": "[Oldies] Gran Theft Auto III s'invite sur Dreamcast",
        "content": " \nGTA III sur Dreamcast, bien sûr, c'est en tout cas un projet qui semblait impossible, et bien non finalement il a bel et bien été porté sur la console de Sega. \n \nLe portage est basé sur le projet RE3, le rétro-portage gratuit de GTA 3, qui déjà est une véritable réussite à lui seul, mais son adaptation à la Dreamcast, là c'est encore une autre étape. Pour l'heure, il ne s'agit que d'une version Alpha, il peut donc y avoir certains bugs gênants ou plantages occasionnels. \n \n \n \n\n \n \nLe projet a pu prendre forme grâce à l'utilisation de KallistiOS, une bibliothèque de développement pour Dreamcast, le projet a prouvé, même s'il reste au stade d'une Alpha, qu'il pouvait parfaitement tourner sur la console de Sega. \n \n \n \n\n \n \n \nAfin d'éviter tout problème avec Rockstar, les joueurs doivent posséder une copie légitime de GTA 3 sur PC, par exemple, cette version a été testée comme fonctionnelle : store.rockstargames.com\n \n \nUne interview des développeurs a été fait par thedreamcastjunkyard.co.uk\n \nComme le montre l'image, la manette VMU a été utilisée pour signaler les statistiques de performance lors des tests.\n \n\n \nMake sure you have a LEGIT copy with no corrupted files, as this process wont work otherwise.\n \nYou will also need the following tools installed\n- git-scm http://git-scm.com/downloads/win\n- dreamsdk r3 https://github.com/dreamsdk/dreamsdk/releases\n \n### Preparing the gta3 folder\n- Open dreamsdk shell\n- type `mkdir gta3` (and press enter)\n- type `explorer .` (and press enter)\n- This will open a folder named gta3. Copy your gta3 files in there.\n  - If you use the 2cdrom version of the game, make sure to also copy the contents of the play disc to this folder.\n- close the folder and the dreamsdk shell and proceed to the next step.\n \n### Cloning the dca3-game repo and downloading the prebuilt elf\n- Open dreamsdk shell\n- type `git clone https://gitlab.com/skmp/dca3-game.git`(and press enter) \n- It should take a moment and successfully clone the repo\n- type `cd dca3-game/dreamcast` (and press enter)\n- type `explorer .` (and press enter).\n- A folder named dreamcast with some files should be open. Keep it on the side.\n- Download the artifacts from https://gitlab.com/skmp/dca3-game/-/jobs/8725216645\n- Open artifacts.zip and extract dca3.elf to the folder that was kept open before.\n- Close the folder and dreamsdk shell\n \n### Repacking and making a prebuilt cdi FOR GD-EMU\n- Open dreamsdk shell\n- type `cd dca3-game/dreamcast` (and press enter)\n- type `make cdi-prebuilt` (and press enter)\n  - This should take a while (5-15 mins)\n  - Due to an issue with dreamsdk, this won't fully complete the first time\n- type `make cdi-prebuilt` (and press enter)\n  - It will continue where it left off before\n  - It should run to completion now and show \"*** Repack Completed Successfully ***\"\n- type `explorer .` (and press enter)\n- The dreamcast folder should open up, and it should contain dca3.cdi for you (~ 900 megs)\n \n### Repacking and making a prebuilt cdi FOR burning CD-ROM\n- Open dreamsdk shell\n- type `cd dca3-game/dreamcast` (and press enter)\n- type `make FOR_DISC=1 cdi-prebuilt` (and press enter)\n  - This should take a while (5-15 mins)\n  - Due to an issue with dreamsdk, this won't fully complete the first time\n- type `make FOR_DISC=1 cdi-prebuilt` (and press enter)\n  - It will continue where it left off before\n  - It should run to completion now and show \"*** Repack Completed Successfully ***\"\n- type `explorer .` (and press enter)\n- The dreamcast folder should open up, and it should contain dca3.cdi for you (~ 700 megs or ~260 megs)\n- If the .cdi is not ~ 700 megs (linux/mkdcdisc) or ~260 megs (windows/cdi4dc), then you did something wrong.\n  - You can type `rm -rf repack-data` (and press enter)\n  - And then start this step from the beggining\n \n \n\n \n\n \nTéléchargement : dca3-game sur Dreamcast\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202240/in-oldies-gran-theft-auto-iii-sinvite-sur-dreamcast-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202240/in-oldies-gran-theft-auto-iii-sinvite-sur-dreamcast-2.jpg"
        }
    },
    "news_3": {
        "title": "[PS5] PS5 Payload Web Server v0.17 disponible",
        "content": "Le développeur John Tornblom dévoile une nouvelle version de PS5 Payload Web Server qui est maintenant proposé en version 0.17. \n \n\n \n \nIl s'agit d'un serveur web qui permet de lancer des homebrews via le webkit ou via une connexion à distance sur un PC, smartphones ou tablettes. La version 0.17 intègre de nouvelles fonctionnalités sur l'interface RetroArch, des améliorations notamment sur la configuration par défaut, afin d'améliorer la lectures des menus. \n \nDe nouveaux cores ont été intégrés, pour le Commodore Amiga, pour le Commodore C64, ou encore pour la Neo Geo.\n \n \nTéléchargement : websrv v0.17\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202237/in-ps5-ps5-payload-web-server-v017-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[3DS] Luma3DS v13.3 disponible",
        "content": "Le développeur TuxSH vient de mettre en ligne une nouvelle version du CFW Luma3DS qui se destine pour rappel à la Nintendo Switch, la version précédente ayant été livrée début octobre 2024. \n \nComme vous le savez Luma3DS est le CFW indispensable pour les 3DS et 2DS et l'arrivée d'une nouvelle version est toujours intéressante à suivre. \n \n \n\n \n \nChangelog 13.3 : \n \n- Ajout de la prise en charge des prototypes de firmwares (en particulier celui utilisé à l'E3 2010), y compris la prise en charge d'EmuNAND (par@Wack0)\n- Correction du remplacement du volume pour les applets (i2s2/csnd), cette fonctionnalité réutilise la fonctionnalité utilisée pour le son de l'obturateur de l'appareil photo. En tant que telle, elle interfère avec elle :\n-> le volume de l'obturateur est réglé sur le dépassement au lieu de sa valeur par défaut de 100 %\n-> en raison de détails d'implémentation, la lecture de l'effet sonore de l'obturateur fera\ncesser cette fonctionnalité jusqu'à ce que le remplacement du volume soit réappliqué en\nrevenant à ce menu\n- D'autres améliorations de la stabilité globale du système et d'autres ajustements mineurs ont été apportés pour améliorer l'expérience utilisateur\n \n \nTéléchargement : Luma3DS v13.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202236/in-3ds-luma3ds-v133-disponible-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS5] SDK PS5 Payload v0.23 disponible",
        "content": "Le développeur John Tornblom dévoile une nouvelle version de son SDK PS5 Payload, la boite à outils destinée à la PS5 permet d'utilisé des payloads ELF.\n \nLa mise à jour régulière du SDK permet d'apporter les dernières évolutions et découvertes de stabilité afin d'améliorer l'expérience utilisateur. \n \n \n\n \n \nLa mise à jour intègre un correctif pour les plantages survenus lors des chargements des payloads via le loader JavaScript ELF. Elle rajoute aussi un gestionnaire de signaux qui intercepte les signaux POSIX critique, et génère une information enregistrée dans /dev/klog, permettant ainsi d'améliorer la gestion des débogages et la correction de bugs.\n \nCe n'est pas tout, un supporte rudimentaire pour les tables de liaison de procédures plt a été ajouté, ainsi qu'une exposition des adresses kernel_dynlib_mapbase_adrr.\n \nLa bibliothèque C (libc) dispose de nouveaux stubs et de certaines nouvelles fonctions ont été implémentées, et des problèmes de scripts sur les commandes systèmes Windows ont été résolus. L'ajout de la bibliothèque libSceSysmodule permet là encore d'élargir les fonctionnalités disponibles.\n \nVous l'aurez compris cette version 0.23 est très riche en nouveautés. \n \n \nChangelog 0.23 : \n \ncrt : correction de plantages lorsque des charges utiles sont déployées via le chargeur elf javascript\ncrt : ajout d'un gestionnaire de signaux qui attrape les signaux POSIX critiques et imprime un stacktrace sur /dev/klog\ncrt : aut du support rudimentaire pour la procédure de lien pour les tables (plt)\ncrt : Montre l'adresse kernel_dynlib_mapbase_addr aux utilisateurs du sdk\nlibc : ajout d'un stub pour getservbyname()\nlibc : ajout de getservbyport()\nlibc : ajout de quelques noms de services par défaut à getnameinfo\nhost : correction des scripts de commande windows\nhost : correction du wrapper pour clang quand aucune unité de traduction n'est fournie\nsce_stubs : ajout de libSceSysmodule\n \n \nTéléchargement : SDK PS5 v0.23\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-25183830.png"
        }
    },
    "news_6": {
        "title": "[PS3] Home Content Preserver v1.00 disponible",
        "content": "Le développeur principal de Destination Home a utilisé un exploit de jeton de bot Discord pour accéder et dumper les canaux Discord privés des développeurs d'un autre groupe Home Revival.\n \nLe développeur DeViL303 a créé une application qui vous permet de saisir en masse les URL d'accueil d'origine, puis de remplacer le domaine à la volée par celui de votre choix. Elle peut également générer automatiquement des liens pour une version alternative. Cela vous évite de devoir rechercher et remplacer des URL ou de créer des scripts pour faire la même chose.\n \n \n\n \n \nVoici une petite application, nommée Home Content Preserver, très simple, qu'il a créé pour télécharger des fichiers à partir des serveurs Web de Playstation Home. Il s'agit principalement d'un simple usurpateur d'agent utilisateur avec des capacités de téléchargement en masse et de génération de liens pour d'autres versions et fichiers associés (ODC/SDC/PNG)\n \nRemarque : Si un serveur dispose d'une liste blanche, vous devez d'abord être sur la liste blanche avant de pouvoir télécharger.\n \n \n \nTéléchargement : Home Content Preserver v1.00\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202160/in-ps3-home-content-preserver-v100-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[PS3] Evilnat a mis à jour xai_plugin en v1.6",
        "content": " \nLe développeur Evilnat continue de travailler, ce n'est pas parce qu'il a déployé son CFW Evilnat 4.91.2 en version stable qu'il ne continue pas à proposer des nouveautés. Il dévoile en effet la version 1.6 de xai_plugin.\n \nL'objectif est souvent le même, corriger des bugs, et cette version n'échappe pas à la règle. \n \nNathan Martin a récemment annoncé l'ajout de nouvelles options dans le xai_plugin, suite à une demande d'utilisateur. Ces nouvelles options incluent des fonctionnalités de la Rebug Toolbox, permettant une gestion plus avancée des partitions et des fichiers. Le xai_plugin continue d'évoluer avec des mises à jour régulières pour améliorer les performances et ajouter de nouvelles fonctionnalités.\n \n \n\n \n \nCette version 1.6 dévoilée hier vise à corriger un bug mineur. \n \nChangelog :\n \n- Correction d'un bug détectant à tort que les syscalls du CFW étaient désactivés lors de l'utilisation de l'option [Dump RAM] (Merci à gexgamingyt)\n \nVous pouvez mettre à jour xai_plugin à partir du XMB en sélectionnant l'option [Custom Firmware Tools > Update xai_plugin]\n \n \n \nTéléchargement : xai_plugin v1.6 (téléchargement direct)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202126/in-ps4-evilnat-a-mis-a-jour-xai-plugin-en-v16-1.jpg"
        }
    },
    "news_8": {
        "title": "[XO] PrometheOS V1.5.0 disponible pour la Xbox Originale",
        "content": " \nLe projet PrometheOS-Firmware est maintenu par la Team Resurgent et vise à fournir une version moderne de Xenium OS, le système d'exploitation de la Xbox originale, cet OS est spécifiquement conçu pour les puces Xenium/OpenXenium.\n \n \n\n \n\n \n \nPour contribuer au projet, il est recommandé d'utiliser Visual Studio 2003 ou Visual Studio 2022. Le dépôt GitHub contient des instructions détaillées sur la build et le test du firmware, d'ailleurs le projet PrometheOS est totalement open-source, et les améliorations sont nombreuses.\n \n \n\n \n\n \n \nLa version 1.5.0 de PrometheOS pour la Xbox originale a été officiellement publiée hier, le 26 décembre 2024. Cette mise à jour apporte des ajouts et des améliorations significatifs aux outils PrometheOS. Parmi les nouveautés, on trouve des fonctionnalités de mise à jour basées sur le réseau, le support de l'ISO compressée, et des améliorations des performances du système. Cette version est compatible avec les configurations de RAM de 64MB, 128MB et 256MB. Il est désormais possible de formater le disque dur en mode compatible Cerbios, avec une seconde option disponible lorsque le double disque dur est activé. L'ensemble des tables de partition est alors sauvegardé dans le dernier secteur du disque dur. \n \n \n\n \n \n \n \nChangelog de PrometheOS V1.5.0 :\n \nCorrections de bugs :\n- Correction de la sauvegarde du score élevé dans le mini-jeu Snake.\n- Problèmes de caractères Unicode FTP résolus.\n- Correction d'un bug de liste FTP MMU.\n \nAméliorations de Cerbios :\n- Ajout de l'éditeur de configuration Cerbios INI pour une configuration simplifiée.\n- Nouvelle option de format de disque dur, incluant la prise en charge du double disque dur lorsqu'elle est activée.\n- Table de partition sauvegardée automatiquement lors du formatage du disque dur.\n \nCompatibilité matérielle :\n- Démarrage amélioré pour les périphériques clones RP2040.\n- Ajout de la prise en charge du Pico 2 officiel (RP2350) via ModXo.\n- Ajout du support XIAO RP2040.\n \nModifications du mode d'éclairage et de la vidéo RVB :\n- Ajout de la sélection du format de pixel RVB pour la configuration des bandes LED RVB et des effets d'éclairage.\n \nCombinaisons de boutons spéciaux :\n- LT+RT+Blanc – Activer/désactiver le paramètre VGA et redémarrer.\n- LT+RT+Noir – Basculer entre NTSC-M et PAL-50 et redémarrer.\n \nPrise en charge des puces et des périphériques :\n- Ajout de la prise en charge LCD pour ModXo et tous les modchips sur Xbox SMBus.\n- Ajout de SPI2PAR pour les modchips Aladdin.\n \nDéverrouillage du lecteur et DLC :\n- Ajout de la prise en charge VSC pour le déverrouillage des lecteurs WD (modèles 2002-2016).\n- Ajout de DLC/Update Signer pour une meilleure gestion du contenu.\n \nMise à jour de Promtools (V1.5.0) :\n- Nouvelle option Launch XBE pour le chargement direct des jeux et des applications.\n \n \nTéléchargement : xbox-scene.info / Team-Resurgent/PrometheOS-Firmware\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202125/in-xo-prometheos-v150-disponible-pour-la-xbox-originale-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202125/in-xo-prometheos-v150-disponible-pour-la-xbox-originale-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1202125/in-xo-prometheos-v150-disponible-pour-la-xbox-originale-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1202125/in-xo-prometheos-v150-disponible-pour-la-xbox-originale-4.png"
        }
    },
    "news_9": {
        "title": "[PS4] shadPS4 v0.5.0 nom de code squidwars disponible",
        "content": " \nL'équipe en charge du développement de shadPS4 vient de publier une nouvelle version de son émulateur PS4 pour PC Windows, MacOS, et Linux.\n \nDéveloppé par Georgemoralis, connu aussi sous le nom de shadow, l'émulateur PS4 arrive au moment des fêtes de fin d'année, parmi les nouveautés de cette version 0.5 portant le nom de code \"Squidwars\", la prise en charge d'AJM, la mise en oeuvre du décodage vidéo et la correction des couleurs des bords.\n \nCe n'est pas tout, l'émulation de thread a été réécrite afin d'améliorer les performances, la bibliothèque lippngdec a été portée vers libpng pour élargir la compatibilité. \n \nLa gestion du cache de textures, l'interface graphique, le nettoyage des bibliothèques, et des améliorations sur les jeux développés avec Unity sont autant de nouveautés apportées. \n \nLe support de Vulkan 1.4 est amené, là aussi permettant d'apporter de meilleurs graphismes, et des performances plus élevées. Pour information, la v0.5.1 est déjà sur les rails. \n \n \n\n \n \nChangelog : \n \n- Support Ajm\n- Mise en œuvre du vidéodec\n- Correction de la couleur des bordures\n- Réécriture de l'émulation pthread\n- Portage de libpngdec vers libpng\n- Amélioration du cache des textures\n- Corrections et améliorations de l'interface graphique\n- Nettoyage des bibliothèques\n- Corrections pour cmake\n- Nombreux correctifs pour les jeux Unity\n- Prise en charge de Vulkan 1.4\n- Edition de shaders\n- Tesselation\n- Refonte du processeur GPU\n- Plus de corrections pour la mise à jour séparée\n- Corrections des splashscreens\n- Correction gamma\n \n \nTéléchargement : shadPS4 v0.5.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202114/in-ps4-shadps4-v050-nom-de-code-squidwars-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[Switch] Sphaira v0.5.0 disponible",
        "content": "Le développeur TotalJustice propose une mise à jour importante de Sphaira, la solution de remplacement du hbmenu proposant des fonctionnalités inédites, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \n \n\n \n\n \n \n \nChangelog :\n \n- Corrige l'épinglage du core3 dû à une interrogation trop fréquente de nxlink.\n- Ajout d'un serveur ftp, utilise ftpsrv.\n- Ajout d'un serveur mtp, utilise haze d'Atmosphere.\n- Mise à jour de l'assoc de fichiers du core Retroarch.\n- Optimiser encore plus l'analyse des assocs de fichiers.\n- Ajout de la fonction « étoiles » dans le hbmenu.\n- Ajout d'un habillage de texte pour les fenêtres popup.\n- Suppression de l'option « Set Archive Bit ».\n- L'installation d'une mise à jour demandera maintenant si vous voulez redémarrer sphaira.\n- L'installation du forwarder est maintenant désactivée par défaut, elle peut être réactivée via le menu avancé.\n- Le message d'avertissement de l'installation du forwarder peut maintenant être désactivé via le menu avancé.\n- Le navigateur web est maintenant désactivé en mode applet.\n- Réglage du service pour que la langue automatique fonctionne maintenant. \n- Traduction en suédois par HenryBaby \n- Presque toutes les chaînes à traduire. par Yorunokyujitsu \n- Mise à jour de la traduction française par shadow256\n- Mise à jour de la traduction suédoise par HenryBaby \n- Mise à jour de es.json par cucholix \n- Mise à jour de la traduction chinoise par do-kiss \n- Ajout de nouvelles chaînes et traductions en Coréen et Japonais par Yorunokyujitsu \n- Quelques corrections et mise à jour de la langue française par shadow2560 \n- Mise à jour de.json et fr.json par glitched-nx \n \n \n \nTéléchargement : Sphaira v0.5.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202097/in-switch-sphaira-v050-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202097/in-switch-sphaira-v050-disponible-2.jpg"
        }
    },
    "news_11": {
        "title": "[3DS] Panda3DS v0.9 disponible",
        "content": " \nLa version des fêtes de Noël de Panda3DS est de sortie, avec de nombreuses fonctionnalités intéressantes telles que la prise en charge de l'audio HLE, une nouvelle interface utilisateur de bureau, des performances Android améliorées, la prise en charge de libretro et bien plus encore !\n \nPanda3DS est un émulateur multiplateforme de la console 3DS, lancé en Septembre 2022, écrit en C++ et utilisant le HLE, cela faisait un bon moment qu'il n'avait pas été mis à jour de fait le changelog est énorme.\n \n \n\n \n \n \nChangelog : \n \n> Audio HLE presque complet (activez l'audio via les paramètres audio pour l'essayer)\n- Inclut la prise en charge de l'audio AAC et d'autres avantages tels que la possibilité d'augmenter le volume audio au-dessus de 100 %\n- De bien meilleures performances sur Android, fonctionnant confortablement à pleine vitesse sur de nombreux téléphones\n \n> Refonte de l'interface utilisateur du bureau\n \n> Nouveau menu de configuration avec la plupart des paramètres de l'émulateur + paramètres de configuration de l'interface utilisateur\n- Prise en charge des traductions (au moment de la rédaction de cet article, il existe l'anglais, le grec, l'espagnol, le néerlandais et le portugais brésilien)\n- Interface de triche, interface de script, interface de mise à jour de ROM, quelques widgets d'interface de débogage pour vider les systèmes de fichiers du jeu et le micrologiciel DSP, ...\n- Correction du redimensionnement de la fenêtre sur SDL et Qt, ajout de la prise en charge de la mémorisation facultative de la taille et de la position de la fenêtre\n- Le frontend Qt prend désormais en charge les contrôleurs (SDL le faisait déjà)\n- Nouveaux thèmes Qt UI (Cream, Greetings Cat)\n \n> Core officiel de Libretro\n- Vous pouvez le télécharger dans l'interface utilisateur Retroarch après avoir activé la prise en charge des « noyaux expérimentaux »\n \n> Beaucoup de travail et de correctifs sur l'émulation du GPU\n- Le nouveau backend de génération de shaders de fragments réduit considérablement l'utilisation du GPU\n- Le nouveau décompilateur de shader réduit considérablement l'utilisation du CPU et du GPU, ce qui rend l'émulateur beaucoup plus rapide sur les téléphones et les ordinateurs portables/PC bas de gamme.\n- Backend GPU Metal API pour appareils Apple (actuellement pris en charge uniquement sur la version SDL de l'émulateur)\n- Émulation de brouillard\n- Émulation d'éclairage appropriée\n- Améliorations JIT des shaders x64 et arm64\n- Correction de diverses erreurs de rendu et plantages (essayez d'activer l'option « Accélérer les shaders » au cas où un jeu ne fonctionnerait pas)\n- Implémentation des registres GPU manquants (par exemple VSH_OUTMAP_MASK)\n \n> Ajout de la prise en charge du gyroscope et de l'accéléromètre (« commandes de mouvement »)\n- Prise en charge sur le bureau lorsque l'utilisateur dispose d'un contrôleur compatible\n- Prise en charge sur Android en déplaçant votre téléphone \n \n> Androïd\n- Performances grandement améliorées, l'émulateur est désormais correctement utilisable sur de nombreux téléphones.\n- Prise en charge audio, prise en charge des mouvements, prise en charge des jeux cryptés...\n- Prise en charge de la configuration de la disposition de l'écran 3DS\n- Plus de paramètres d'émulateur exposés via l'interface utilisateur\n- Prise en charge de Store Access Framework (SAF)\n- Utiliser du matériel pour certaines parties de l'interface utilisateur\n- Les builds MacOS sont désormais universelles (c'est-à-dire qu'elles incluent à la fois un binaire arm64 et x64)\n- Améliore les performances sur les Mac arm64, c'est-à-dire « Apple Silicon », car l'émulateur ne fonctionne plus sous Rosetta.\n \n> Correction de divers bugs et plantages qui survenaient lors du chargement de jeux cryptés :\n- La prise en charge du décryptage des jeux nécessitant seeddb.bin a également été ajoutée, à condition que l'utilisateur ait seeddb.bin dans le bon chemin.\n- Ajout de la prise en charge du décryptage des jeux dans le backend Android. L'utilisateur peut fournir aes_keys.txt et seeddb.bin via l'interface utilisateur des paramètres.\n \n> De nombreux correctifs d'émulation :\n- Émulation audio améliorée, les jeux ont de l'audio et ne se bloqueront plus en raison du besoin d'une plus grande partie du DSP audio implémenté (par exemple dans Pokemon X/Y, Pokemon ORAS, Pokemon Mystery Dungeon Gates To Infinity, - TLoZ: A Link Between Worlds, Professor Layton, ...).\n- Émulation améliorée du système de fichiers, corrige de nombreuses applications du système d'exploitation (3DS Sound, Face Raiders, cartes AR, ...), homebrew (Anemone3DS) et jeux de détail (Luigi's Mansion)\n- Émulation de caméra améliorée (mais ne prend toujours pas en charge les captures de caméra appropriées) : les jeux ne se bloquent plus en raison de la non-implémentation de la caméra\n- Ajout de la prise en charge des applets du clavier logiciel et du sélecteur Mii. Les jeux ne se bloquent plus lorsqu'ils demandent à l'utilisateur de sélectionner un mii ou de saisir son nom.\n- Corrections CRO (les jeux Pokémon ne plantent plus de manière aléatoire, à l'exception de Soleil/Lune et US/UM qui nécessitent une dernière chose implémentée)\n- Corrections du noyau\n- Corrections Y2R\n- Corrections liées au menu d'accueil pour l'avenir\n \n> Diverses optimisations :\n- Ajout d'un planificateur pour la planification des événements de l'émulateur\n- Code SSE/NEON manuscrit pour une émulation GPU et DSP plus rapide\n- Ajout du saut au ralenti\n \n> Lua:\n- Exposez davantage de fonctions d'émulation à l'API de script\n- Exposer libuv\n \n> Corrections diverses\n- Correction du curseur de volume du système qui ne fonctionnait pas sur Android.\n- Corriger l'émulation de l'écran tactile qui ne fonctionne pas sur Qt.\n- Corriger les fichiers APK Android qui sont énormes car ils ne sont pas correctement supprimés\n- Correction du blocage de l'émulateur sur les appareils sur lesquels l'audio n'a pas pu être initialisé\n \n \nTéléchargement : Panda3DS 0.9\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202095/in-3ds-panda3ds-v09-disponible-1.jpg"
        }
    },
    "news_12": {
        "title": "[PS3] Evilnat propose les fonctions Cobra 8.5 en open-source",
        "content": " \nLe développeur Evilnat vient de mettre en ligne il y a 2 heures le code source de ses fonctions Cobra 8.5. Le développeur tient à remercier la team Cobra, Joonie, Habib, Haxxxen, Alexander, Dean, KW, Nzv, Bguerville, Aldo, LightningMods et tous ceux qui ont aidé à mettre à jour la source de Cobra.\n \n \n\n \n \n \nLes fonctions Cobra 8.5 intégrées dans son tout dernier CFW Evilnat 4.91.2 dévoilé hier ont un changelog imposant : \n \n- Support de TTYWRITE dans socat (Merci à haxxxen et à l'équipe PS3HEN)\n- Correction de la boucle infinie du contrôleur (Merci à aldostools)\n- Ajout d'un code asm pour afficher la température lors de la compilation de ps2_netemu.self (Merci à @3141card pour sa recherche)\n- Prise en charge des ISO 3k3y/Redump à la volée  \n- Changement de la charge de base à 0x8000000000001000 dans stage0\n- Opcode pour définir le mode SYSCALLS au démarrage\n- Code optique pour définir le mode GAMEBOOT\n- Code optique pour définir le mode EPILEPSY WARNING\n- Opcode pour définir le mode COLDBOOT au démarrage\n- Opcode pour définir le mode HIDDEN TROPHIES    \n- Probablement d'autres éléments oubliés\n \n \nIl est certain qu'il fera à l'avenir évolué ces fonctions Cobra car il souhaite encore rajouter certaines fonctions : \n \n- rap2bin - support de bin2rap par @esc0rtd3w\n- Patch pour permettre la région universelle du DVD\n- Patch PS2CLASSICS pour pouvoir le lancer sur DEX\n \nCes fonctions peuvent être intégrées dans la plupart des CFW, cependant il rappelle que pour que tout se passe correctement il est nécessaire de transférer certains fichiers : \n \n lv2\\include\\lv2\\symbols.h\n- ps2emu\\include\\ps2emu\\symbols.h\n- ps2emu_stage1_file\\Makefile.gxemu\n- ps2emu_stage1_file\\Makefile.hwemu\n- ps2emu_stage2\\gxemu\\main.c\n- ps2emu_stage2\\hwemu\\main.c\n- ps2emu_stage2\\netemu\\main.c\n- stage0_file\\Makefile\n- stage0_file\\start.S\n- stage2\\main.c\n- stage2\\modulespatch.h\n- stage2\\ps3mapi_core.h\n- stage2\\qa.h\n \n \nTéléchargement : Fonctions Cobra 8.5 (code source)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202083/in-ps3-evilnat-propose-les-fonctions-cobra-85-en-open-source-1.png"
        }
    },
    "news_13": {
        "title": "[PS5] PS5-UMTX Jailbreak et l'etaHEN SDK ont été mis à jour pour etaHEN 1.9b",
        "content": " \nBien entendu, l'exploit Jailbreak PS5-UMTX a du être mis à jour, il s'agit d'une version personnalisée proposée par idlesauce qu'il est possible de trouver ici : PS5-UMTX-Jailbreak\n \n \n\n \n \nPS5debug a été mis à jour et intégré par GoldHEN, et le support d'etaHEN 1.9B a été ajouté. Cette nouvelle version va être intégrée dans la plupart des hosts. Le correctif etaHEN a directement été intégré dans la version principale. de PS5-UMTX-Jailbreak. \n \nChangelog : \n \n- Mise à jour de ps5debug par @GoldHEN\n- Ajout etaHEN 1.9B\n- Fusion la branche 'fix-thread-exit'.\n \nTéléchargement : PS5-UMTX Jailbreak\n \n \nCe n'est pas tout, le SDK spécialement taillé pour etaHEN a lui aussi été mis à jour par LightninMods. \n \nChangelog : \n \n- Nouvelle mise à  jour\n- WIP readme.md\n- Mise à jour des offsets hijacker\n \n \nTéléchargement : etaHEN-SDK\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202082/in-ps5-ps5-umtx-jailbreak-et-letahen-sdk-ont-ete-mis-a-jour-pour-etahen-19b-1.png"
        }
    },
    "news_14": {
        "title": "[PS4/PS5] Itemzflow 1.08 disponible",
        "content": "En plus d'etaHEN 1.9b, le développeur LighingMods a déployé une nouvelle version d'Itemzflow, son célèbre manager. Cette nouvelle version a pour objectif de supporter les nouveautés introduites avec etaHEN 1.9b. \n \n \n\n \n \nChangelog 1.08 : \n \n- [2.xx UNIQUEMENT] Ajout de la prise en charge du décryptage du jeu dans le dumper itemzflow.\n- [2.xx UNIQUEMENT] Ajout de la prise en charge du patch dir depth\n- Ajout de vérifications supplémentaires pour s'assurer que les exécutables du jeu sont faussement signés\n- Mise à jour des plugins illusions_cheats avec le support 2.xx\n- Changement de « Launching ... » en « Preparing to launch... » pour le premier lancement\n- Correction de la vérification magique de l'eboot SELF\n \n \n \nTéléchargement : Itemzflow 1.08\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202081/in-ps4ps5-itemzflow-108-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[PS4/PS5] etaHEN v1.9B (Christmas Release) disponible",
        "content": " \nLe développeur LightningMods propose la nouvelle version d'etaHEN en version 1.9B, l'édition de Noël 2024. \n \n\n \n\n \n \nCette version est celle que l'on attendait et elle se destine surtout à ceux qui disposent d'une PS5 entre le firmware 1.xx à 4.xx, elle embarque de nombreux changements notamment :\n \n- Menu de lecture à distance\n- Mode simplifié\n- Menu du disque dur externe\n- Améliorations de la stabilité\n- Beaucoup plus\n \n \nIl est recommandé de mettre à jour l'exploit IPV6 qui a été modifié pour etaHEN\nAinsi que d'utiliser la version modifiée de UMTX d'Idlesauce.\n \n \nChangelog etaHEN 1.9B : \n \n- Le plugin elfldr n'est plus nécessaire pour charger des plugins (ou quoi que ce soit)\n \n- Ajout Byepervisor (Par@PS5Dev) à etaHEN pour 2.xx (déclenche également le mode repos)\n \n- [2.xx UNIQUEMENT] Ajout de correctifs de noyau pour mprotect, la limite dir_depth et MMAP RWX\n \n- Suppression des correctifs Syscore qui ne sont plus nécessaires\n \n- Ajout d'un mode Lite (kstuff ou HEN ONLY)\n \n- Suppression des déclencheurs DB d'etaHEN et déplacement vers itemzflow pour tous les microprogrammes\n \n- Le temps de chargement du démon etaHEN est passé de 5-6 secondes à 1 seconde\n \n- Correctifs de firmware requis pour Shellcore FPKG@EchoStretchpour 2.xx\n \n- Ajout d'un menu de lecture à distance à la boîte à outils etaHEN (activera le compte pour vous)\n \n- Ajout du menu du disque dur externe à la section des utilitaires de la boîte à outils etaHEN\n \n- Ajout d'un menu Extras à la section des utilitaires de la boîte à outils etaHEN qui inclut l'environnement NP et le gestionnaire de contenu supplémentaire\n \n- Ajout d'un menu de démarrage automatique du plugin (astuces d'illusion incluses avec Itemzflow)\n \n- etaHEN attendra désormais que kstuff soit complètement chargé avant de continuer\n \n- Tout plugin non activé via le menu de démarrage automatique du plugin ne démarrera PAS automatiquement lorsque vous chargez etaHEN\n \n- Cliquer sur le bouton Installer le Store ou charger des plugins ne se bloquera plus jusqu'à ce qu'ils soient terminés, ceux-ci sont désormais effectués de manière asynchrone\n \n- Après le chargement d'etaHEN, la boîte à outils etaHEN arrêtera le menu d'accueil avant l'injection (voir la notification)\n \n- Amélioration de la stabilité lors du redémarrage ou de l'arrêt de la PS5\n \n- Suppression du menu Cheats pour le rajouter plus tard dans la prochaine mise à jour (manque de temps)\n \n- Ajout du bundle React (tous les pare-feu) et de la prise en charge du décryptage Self (uniquement sur 2.xx) au FTP\n \n- etaHEN peut désormais être chargé via le chargeur Johns Elf (principalement pour 2.xx puisque 4.xx nécessite que kstuff soit envoyé à 9020)\n \n- Ajout de la prise en charge de l'exploit UMTX\n \n- Améliorations de la stabilité pour le redémarrage et l'arrêt (sans plugins activés)\n \n- De nombreux changements ont été apportés en interne à etaHEN pour se concentrer sur la stabilité\n \n- Ajout d'un menu Testkit qui ne laisse pas entrer les détaillants (pour l'instant)\n \nSuperposition d'informations sur la console\n \nSur [Personnalisé]\nMarche + Température APU\nSur + Ports de service + temp\nDésactivé\nSuperposition d'expiration du logiciel du système d'essai\n \nDésactivé\n \n(ON) Il reste 1 jour\n \n(ON) Il reste 2 jours\n \n(ON) Expiré\n \n- Ajout de la superposition de confidentialité TestKit. Lorsque etaHEN est actif, le numéro de série, le nom du modèle et l'adresse MAC dans la superposition seront censurés.\n \n \n \nTéléchargement : etaHEN 1.9B\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202080/in-ps4ps5-etahen-v19b-christmas-release-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202080/in-ps4ps5-etahen-v19b-christmas-release-disponible-2.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] NxFileViewer v3.0.0 disponible",
        "content": "NxFileViewer qui passe en version 3.0.0, une bonne nouvelle sachant qu'il n'avait pas été mis à jour depuis quasiement un an. NxFileViewer est un logiciel PC qui vous permet de parcourir les fichiers NSP, NSZ, XCI et XCZ et ainsi afficher tout un tas d'informations et de vérifier s'ils disposent de signatures, et d'afficher les hashs.\n \nCréée par le développeur Myster-Tee, le logiciel permet donc de visualiser et de parcourir le contenu des fichiers qui seront déplacés vers votre console Nintendo Switch, il vous faudra disposer des 3 clés (prod.keys, console.keys et title.keys) pour qu'il fonctionne correctement.\n \n \n \n\n \n\n \n\n \n\n \n \n \nAvec cette version 3.0.0 : \n \nLe support NSZ et XCZ a été finalisé et le contrôle d'intégrité a été simplifié. De plus, la sauvegarde a été corrigée et la version minimale requise du runtime .NET est désormais .NET 8 .\n \n- Prise en charge complète de NSZ/XCZ avec lecture optimisée\n- Simplification du contrôle d'intégrité\n- Correction de l'enregistrement des fichiers\n- Corrections et améliorations mineures de l'interface utilisateur\n- Mis à jour vers .NET 8\n \nTéléchargement : NxFileViewer v3.0.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202069/in-switch-nxfileviewer-v300-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202069/in-switch-nxfileviewer-v300-disponible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1202069/in-switch-nxfileviewer-v300-disponible-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1202069/in-switch-nxfileviewer-v300-disponible-4.png"
        }
    },
    "news_17": {
        "title": "[PS3] CFW 4.91.2 Evilnat version stable disponible",
        "content": "Après 17 bêtas, voici enfin la version stable du CFW 4.91.2 d'Evilnat, enfin à l'occasion de Noël, le développeur sort des Bêtas pour présenter la version finale de son custom firmware pour la PS3. \n \nIl s'est donc atelé à proposer la version finale de son CFW 4.91.2 Evilnat, il intègre les fonctions Cobra 8.5. \n \nCela a pris plusieurs mois de développement, de recherche et de tests, mais c'est enfin là, via Psx-place.com.\n \nOutre les améliorations mentionnées dans le changelog, le développeur dévoilera des fonctionnalités dans les futures versions comme rap2bin - bin2rap par @esc0rtd3w dans Cobra 8.5, ou encore la tentative de patcher complètement la région du film DVD et bien plus encore. \n \nLes contournements de la \"brique du bip d'ambulance\" pendant que le core DEX est chargé avec CEX TargetID ont été réalisés avec succès et cela fonctionne bien, merci à Pusch3l de l'avoir testé ! Et encore plein d'autres choses. \n \n \n \n\n \n \n \nChangelog : \n \n- Core DEX patché pour contourner le bip de l'ambulance (noyau DEX chargé avec CEX TargetID)\n- Options [Convertir en CEX/DEX] mises à niveau avec plus de sécurité pour éviter les problèmes\n- Options [Activer/Désactiver la prise en charge de DEX OFW] mises à niveau avec plus de sécurité pour éviter les problèmes\n- Ajout d'informations sur le mode Cobra externe actuel dans [Informations Cobra]\n- Message PlayStation Home d'origine rétabli dans XMB (Merci à @DeViL303 )\n- Correction de l'erreur 80710A06 lors du téléchargement de la mise à jour des PKG/webMAN MODs depuis le XMB avec VSH DEX\n- Correction de la traduction italienne de xai_plugin (Merci à Weeddaa3)\n- Mise à jour du programme de mise à jour xai_plugin vers la version 1.5\n- Mise à jour xai_plugin disponible depuis le XMB\n- Mise à jour des options « Activer FTP » et « Désactiver FTP » de xai_plugin avec un serveur FTP plus récent\n- Ajout de l'option « Afficher les informations du lecteur BD » dans [Outils de base] dans xai_plugin\n- Émulateurs PS1 et PS2 mis à jour\n- Ajout de l'option « Afficher les informations PS3 » (demandée par Luanteles)\n- L'option « Cobra Information » affiche désormais l'étape 2 actuelle et l'appel système 8\n- Ajout des émulateurs PS1 et PS2 recherchés et développés par mrjaredbeta et kozarovv\n- Icônes et fichiers XML du plug-in de téléchargement étendu fixe\n- Correction du format « .ntfs[PS3ISO] » dans Cobra lors du chargement des ISO cryptés\n- Ajout du plugin de téléchargement étendu par DeViL3O3\n- CEX game_ext_plugin.sprx est revenu à DEX pour éviter les problèmes avec PS Plus\n- Correction de la vérification externe du noyau lors de l'utilisation de l'option [Swap Kernel] dans PEX/D-PEX\n- Correction d'un écran noir aléatoire lors de l'activation des indicateurs d'assurance qualité\n- Flags QA avancés mis à jour (merci à Zecoxao et Soul)\n- Correction du code d'erreur 0x800299D2 et de l'écran noir (lecture Blu-ray/DVD en mode CEX/DEX)\n \n \n \nTéléchargement : CFW 4.91.2 Evilnat / Liens Mega\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202063/in-ps3-cfw-4912-evilnat-version-stable-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[Vita] ONEMenu pour PS Vita v3.21 disponible",
        "content": "La Team ONElua propose une nouvelle version de ONEMenu pour PSVita qui passe en v3.21. OneMenu LUA est un manager qui sépare les jeux et les applications installés sur votre console en plusieurs catégories. Si vous connaissez déjà ONEmenu de la PSP, alors vous avez déjà un bon aperçu de ce que ONEMenu peut proposer. Onemenu est livré avec un explorateur de fichiers intégré, il a pris la suite d'App Manager Plus qui n'a plus été mis à jour.\n \n \n \n\n \n \nChangelog 3.21 :\n \n- Ajout d'étoiles à l'occasion de Noël\n- Correction de la détection de la Gamecard\n- Corrections de bugs et quelques improvisations.\n \n \nTéléchargement : ONEMenu-for-PSVita 3.21\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202061/in-vita-onemenu-pour-ps-vita-v321-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS2] Apollo Save Tool v1.0.2 disponible",
        "content": "Le développeur Bucanero propose une nouvelle version d'Apollo Save Tool pour la PS2, proposé comme un défi il y a bientôt deux ans, cette version n'a finalement que très peu évoluée. \n \nAvec cette nouvelle mouture, le développeur a souhaité faire évoluer le format d'importation spécifique à la PS2 en amenant la conversion WMC pour les fichiers .MAX, .CBS, .XPS, et .SPS.\n \nEn plus de cela il a rendu la possibilité de charger à partir de cdfs:/ ou de mass:/ des sauvegardes hors ligne à partir d'une base de données. \n \n \n\n \n \nAjout :\n \n-> Prise en charge de formats d'enregistrement PS2 supplémentaires lors de l'importation dans des VMC PS2 : \n- Importation dans un VMC - Nouveaux formats pris en charge : .MAX, .CBS, .XPS, .SPS\n \n-> Ajout de la prise en charge du chargement d'une base de données de sauvegarde hors ligne (à partir de cdfs:/, mass:/) :\n- Remarque : le lecteur de masse doit être disponible pour décompresser les fichiers de sauvegarde.\n- Essayez le fichier sample-save-pack.zip comme pack de base de données hors ligne rapide.\n \nCorrection :\n \n- Résolution d'un problème lors de l'exportation de sauvegardes PS1 à partir de cartes mémoire\n \n \nTéléchargement : Apollo Save Tool v1.0.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202059/in-ps2-apollo-save-tool-v102-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS4] ps5debug v1.0b2 disponible",
        "content": "Il y a un peu plus d'un an, en Novembre 2023, SiSTR0 dévoilait la version v1.0b1 de PS5debug, et bien voici qu'en ce jour de Noël, un autre développeur bien connu ctn123 dévoile la version v1.0b2.\n \nComme sur PS4, PS5Debug est un payload qui permet de profiter d'un débogueur, il offre donc de nombreuses possibilités, il conserve d'ailleurs la même API que la version PS4, ce qui fait que la compatibilité est totale avec la bibliothèque libdebug. \n \nAvec PS5Debug vous allez pouvoir d'un programme vous permettant de supporter le mode repos, un scanner de console ou encore un serveur klog sur le port 3232. Il existe aussi des commandes permettant d'obtenir l'adresse de la base de la section exécutable.\n \n \n\n \n \n \nPs5debug v1.0b2 est maintenant disponible, le développeur s'excuse d'avoir mis autant de temps à sortir cette version, il n'avait pas réellement pris le temps de découvrir les bugs de la version PS5.  \n \nReaper studio v.1.0.4.2 et MultiTrainer II v.1.1.8.2 seront publiés peu après, pour profiter des nouvelles fonctionnalités. Le développeur tient à remercier Kameleonre pour son soutien, et Pharaoh2k pour les tests approfondis.\n \n \nChangelog ps5debug v1.0b2 :\n \n- Correction du problème d'attachement/détachement lorsque le jeu se termine pendant une session de débogage.\n- Amélioration de la prise en charge du débogage des processus multithreads.\n- Amélioration des allocations pour les cheats.\n- Améliorations générales de la stabilité.\n- Amélioration générale des performances.\n- Ajout de la prise en charge de la version 5.xx\n- Ajout de la prise en charge du chargeur elf 9021.\n- Implémentation de points d'arrêt matériels.\n- Optimisations pour kstuff.\n \n \n \nTéléchargement : ps5debug v1.0b2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202057/in-ps4-ps5debug-v10b2-disponible-1.jpg"
        }
    }
}