{
    "news_1": {
        "title": "[Switch] La team UnlockSwitch va devoir clarifier quelques points",
        "content": "Un petit retournement de situation sur l'UnlockSwitch, il semblerait que tout ne soit pas si clair que cela pouvait sembler l'être. \n \nDepuis quelques tweets la Team UnlockSwitch semble fuyante, il faut dire que la team Mig Switch vient de contre-attaquer, en effet la team Mig Switch affirme que les samples qui ont été envoyés sont en fait des Mig Switch maquillés, et non pas des clones. \n \nLes 50 échantillons intègrent en effet le chipset ICE40/ESP32S du Mig Switch, et il semblerait que les 50 unités soient même \" un ancien lot de production du Mig Switch relookés par des escrocs \" selon la team Mig Switch (via un article de Wololo.net). \n \nLa team Mig Switch aurait l'intention d'envoyer des mails pour avertir les clients et revendeurs de ne pas acheter sinon ils se feront arnaquer. \n \nElle est même en capacité de proposer un logiciel pour prouver que les puces sont celles du Mig Switch. \n \n \n\n \n \nLa team UnlockSwitch a laissé quelques tweets étranges:\n \n\" Juste une précision sur notre produit. Le produit UnlockSwitch est et ne sera jamais disponible en précommande, donc pas d'arnaqueurs ici... Aucune vente ne sera réalisée sans production préalable ! \"\n \n \nAux accusations qu'il s'agit d'un ancien lot de production du Mig Switch, aucune réponse n'est apportée sur https://twitter.com/UnlockSwitch/ malgré plusieurs posts à ce sujet.\n \n\" Dès le début, nous avons déclaré que notre produit était en développement et qu'il atteignait sa phase finale. Nous pouvons confirmer aujourd'hui qu'UnlockSwitch n'aura pas le chipset ( ICE40/ESP32S ), ni le même design de PCB, ni même le même boîtier. \"\n \nBref, il semblerait donc que pour le moment, les samples ne soient que des Mig Switch rebaptisés sur un PCB retravaillé (ou un ancien lot de production) équipés de puces ICE40/ESP32S, qu'aucun dumper ne sera commercialisé par UnlockSwitch, et que le produit final en première version disposerait d'un bouton on/off, et de puces différentes de celle du Mig Switch. \n \nOn est donc encore très loin de voir des samples de pré-commercialisation car ceux qui ont été livrés ne sont en rien ce qui sera réellement lancé en production et ça cela reste très étrange ! A clarifier ! \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189786/in-switch-la-team-unlockswitch-va-devoir-clarifier-quelques-points-1.jpg"
        }
    },
    "news_2": {
        "title": "[Switch] Nintendo dévoile le firmware 18.0.1 pour un problème WLAN",
        "content": " \nNintendo vient de dévoiler un nouveau firmware pour la Switch, la mise à jour firmware 18.0.1 est désormais disponible. Elle a été publiée le 22 avril 2024 et apporte plusieurs améliorations, notamment la correction d’un problème où certains points d’accès sans fil ne pouvaient pas être trouvés lors de la configuration d’un nouveau réseau sans fil. \n \n \n\n \n \nVoici le changelog :\n \n- Version 18.0.1 (Publiée le 22 avril 2024) : Correction d’un problème empêchant la détection de certains points d’accès sans fil lors de la configuration d’un nouveau réseau. Si vous ne pouvez pas mettre à jour vers la version 18.0.1 à cause de ce problème, changez temporairement les paramètres de sécurité de votre réseau sans fil pour utiliser uniquement “WPA2 (AES)” afin de pouvoir vous connecter sans fil et télécharger ainsi que installer la mise à jour du système. Après la mise à jour vers la version 18.0.1, restaurez les paramètres de sécurité de votre réseau à leurs paramètres précédents.\n- Des améliorations générales de la stabilité du système pour améliorer l’expérience utilisateur2.\n \nCette mise à jour est la deuxième de l’année 2024 pour la Nintendo Switch et il semble qu’elle soit principalement axée sur la résolution de problèmes de connectivité. \n \nDu côté de ce qui nous intéresse le plus, la pré-version actuelle d'Atmosphère (de la 1.7.0) fonctionne sans aucun problème sur le firmware 18.0.1 ! Les sigpatch continueront également à fonctionner puisque les modules concernés n'ont pas été modifiés.\n \nRapports : https://yls8.mtheall.com/ninupdates/reports.php?date=2024-04-23_00-06-36&sys=hac\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189748/in-switch-nintendo-devoile-le-firmware-1801-pour-un-probleme-wlan-1.jpg"
        }
    },
    "news_3": {
        "title": "[Wii/Wii Mini] GaryOrNothing porte l'exploit Bluebomb sur Raspberry Pi Pico W et l'ESP32",
        "content": "BlueBomb Micro est un projet intéressant développé par GaryOderNichts, il s’agit d’un portage de BlueBomb pour le btstack de BlueKitchen, qui fonctionne sur divers systèmes embarqués et microcontrôleurs. BlueBomb Micro est conçu pour les systèmes embarqués et permet d’exécuter BlueBomb sur des microcontrôleurs comme le Raspberry Pi Pico W et l’ESP32.\n \nPour l’utiliser, il faut que le microcontrôleur soit branché et que BlueBomb Micro soit en cours d’exécution. Si le microcontrôleur possède une LED, elle devrait clignoter lentement.\nL’utilisateur doit démarrer sa Wii et naviguer vers l’application qu’il souhaite exploiter. Pour le menu système, il suffit d’allumer la Wii et de la laisser sur l’écran de santé et de sécurité.\n \n \n\n \n \nIl est important de ne pas laisser d’autres appareils se connecter à la console via Bluetooth et de s’assurer que la console est proche du microcontrôleur pour une connexion réussie.\n \nUne fois connecté, BlueBomb Micro chargera un fichier boot.elf situé à la racine d’une clé USB formatée en FAT32 et l’exécutera. Cela peut être utilisé pour installer la Homebrew Channel avec l’installateur HackMii.\n \n \nTéléchargement : BlueBoomb Micro v1.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189727/in-wiiwii-mini-garyornothing-porte-lexploit-bluebomb-sur-raspberry-pi-pico-w-et-lesp32-1.jpg"
        }
    },
    "news_4": {
        "title": "[PS1/PS2/Vita/PSP/Vita/PS3/PS4/PS5] PS Multi Tools v14.0 disponible",
        "content": "Dans le monde en constante évolution des outils de gestion pour les consoles PlayStation, une nouvelle mise à jour fait sensation : PS Multi Tools v14. Cette version apporte son lot de nouveautés et d’améliorations qui raviront les utilisateurs les plus exigeants.\n \nParmi les points forts de cette mise à jour, on note la mise à jour des paquets NuGet, l’ajout de la classe NPSPKG & PKGDownloadListViewItem pour une utilisation avec le nouveau navigateur PKG, ainsi que des ajustements mineurs dans la fenêtre de bienvenue. Les utilisateurs de PS3 et PS Vita ne sont pas en reste avec des mises à jour spécifiques, notamment un nouveau navigateur PKG qui promet de simplifier la vie des joueurs.\n \nCette mise à jour souligne l’engagement continu des développeurs à fournir des outils robustes et à jour pour la communauté. Avec PS Multi Tools v14, la gestion de vos jeux et contenus sur PlayStation n’a jamais été aussi facile et intuitive.\n \n \n\n \n \nComme vous le savez  PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \nLe changelog est énorme et concerne toutes les consoles Sony !\n \n \nTéléchargement : PS Multi Tools v14.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189697/in-ps1ps2vitapspvitaps3ps4ps5-ps-multi-tools-v140-disponible-1.jpg"
        }
    },
    "news_5": {
        "title": "[3DS] Lime3DS s'améliore encore afin de succèder à Citra3DS",
        "content": " \nLe développement de Citra3DS a cessé suite à un accord avec Nintendo et Tropic Haze, et Lime3DS a été créé pour continuer le travail sur cet émulateur. Lime3DS est activement maintenu pour Windows, Linux, Android et macOS, et vise à raviver et poursuivre le développement de Citra. \n \nLa nouvelle version 2110 de Lime3DS a été récemment lancée, apportant des améliorations significatives et des corrections de bugs. Cette mise à jour inclut un correctif pour un crash lors de l’entrée en plein écran tout en jouant à Super Smash Bros 3DS sur Vulkan et des améliorations mineures de performance sur les GPU Mali.\n \n \n\n \n \n \nChangelog :\n \n- Correction d’un crash : Un problème a été résolu qui provoquait un crash lors du passage en plein écran en jouant à Super Smash Bros. 3DS sur Vulkan.\n- Améliorations de performance : Des améliorations mineures de performance ont été apportées sur les GPU Mali.\n- Joysticks sur Android : Correction de l’ordre de dessin incorrect des joysticks à l’écran sur Android.\n- Environnements de build mis à jour :\n- Clang mis à jour de la version 15 à la version 18.\n- Android Gradle Plugin (AGP) mis à jour de la version 8.2.1 à la version 8.3.2.\n- Gradle mis à jour de la version 8.2 à la version 8.4.\n \nNote : La correction pour Smash Bros a inclus une restructuration à grande échelle de plusieurs sections du rendu Vulkan. Cela pourrait entraîner des améliorations de compatibilité pour d’autres jeux qui n'ont pas été anticipées.  \n \nCes mises à jour montrent l’engagement continu de l’équipe de Lime3DS pour améliorer l’expérience utilisateur et la compatibilité des jeux, sachant que Lime3DS est disponible pour Windows, MacOS, Linux et Android. \n \n \nTéléchargement : Lime3DS version 2110\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189662/in-3ds-lime3ds-sameliore-encore-afin-de-succeder-a-citra3ds-1.jpg"
        }
    },
    "news_6": {
        "title": "[Vita/PSTV] Le firmware manager psp2fwtool pour Vita et PSTV devient un projet public",
        "content": "Le développeur SKGleba, que l'on connait bien pour l'ensemble de ces projets sur la PlayStation Vita avec des contributions à Enso Ex, VitaDeploy, Psp2renga, iTLS, psp2hfw ou encore Psp2spl, nous informe que son gestionnaire de firmware psp2fwtool pour PlayStation Vita et PSTV est désormais un projet public. \n \nC’est fascinant de voir comment le projet psp2fwtool a évolué au fil du temps ! Initialement créé en 2019 aux côtés de Modoru 2.0, il a été conçu pour contourner les restrictions imposées par PlayStation lorsqu’ils ont corrigé l’exploit original du coprocesseur cryptographique. À l’époque, il s’agissait d’un simple clic pour PlayStation.\n \nCependant, psp2fwtool a continué à se développer et à s’améliorer. Il a ajouté de nombreuses fonctionnalités supplémentaires, offrant ainsi aux utilisateurs de la PlayStation Vita et de la PSTV un outil plus puissant et polyvalent. C’est un excellent exemple de la passion et de l’ingéniosité des développeurs de la communauté homebrew comme tout ce que fait SKGleba. \n \npsp2fwtool intègre des fonctionnalités complètes bien que certaines soient encore en phase de test, il est suffisamment sûr pour être accessible au public. Cet outil est très puissant, et nécessite une connaissance avancée du système Vita ainsi qu'une documentation complète pour l'utiliser correctement. Le développeur espère finir cette documentation complète d'ici cet été. \n \n \n\n \n \nVoici quelques informations supplémentaires sur ce projet :\n \nFirmware Image : Il s’agit d’un conteneur pour les images de partition EMMC, les mises à jour du firmware et l’exploit enso.\nNPUP : C’est un package conforme au format PUP contenant l’image du firmware, un installateur autonome de l’image du firmware (psp2swu.self) ainsi que des correctifs de partition supplémentaires.\nCréation d’une image du firmware :\nAssurez-vous d’avoir gzip installé dans votre environnement WSL.\nClonez le référentiel psp2fwtool sur votre ordinateur local et exécutez la commande ‘. build_all.sh’ dans WSL.\nCopiez tous les composants de mise à jour dans le répertoire /create/ au format approprié.\nExécutez le script ‘mkcfw_wingui.ps1’ dans le répertoire /create/ pour créer l’image du firmware.\nInstallation de l’image du firmware :\nAssurez-vous que l’option ‘Unsafe homebrew’ est activée et qu’aucune carte de jeu n’est insérée.\nPlacez l’image du firmware dans ‘ux0:data/fwtool/’ sous le nom ‘psp2cfw’.\nL’installateur peut mettre à jour les partitions avec les fichiers trouvés dans ‘ux0:data/fwtool/[part]-patch/’ (par exemple, ‘os0-patch/’).\nOuvrez fwtool et sélectionnez ‘Flash a firmware image’, puis appuyez sur [start].\nAttendez que l’installation se termine avec ‘ALL DONE’ ou une erreur, puis appuyez sur [circle] pour redémarrer l’appareil.\nInstallation d’un package NPUP :\nInstallez-le avec modoru ou neighbourhood comme vous le feriez pour un PUP normal.\n \n \nVous pouvez trouver le projet psp2fwtool sur GitHub pour plus d’informations et de détails.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189658/in-vitapstv-le-firmware-manager-psp2fwtool-pour-vita-et-pstv-devient-un-projet-public-1.jpg"
        }
    },
    "news_7": {
        "title": "[PS3] La Bêta 6 du CFW Evilnat 4.91.2 disponible",
        "content": " \nL'univers du hacking de console est en constante évolution, et récemment, le développeur Nathan Martin, également connu sous le pseudonyme d'Evilnat, a dévoilé une mise à jour majeure de son Custom Firmware (CFW). La version 4.91.2 de l'Evilnat CFW, disponible en versions PEX, D-PEX, CEX, et DEX, propose une intégration étendue des fonctions Cobra 8.5, ainsi que des corrections de bugs importantes, offrant ainsi aux utilisateurs une expérience de jeu encore plus enrichie et personnalisée sur PlayStation 3.\n \nOutre les fonctionnalités habituelles de personnalisation et d'exécution de logiciels non signés, la version 4.91.2 du Custom Firmware Evilnat apporte plusieurs améliorations significatives. Tout d'abord, l'intégration des fonctions Cobra 8.5 offre aux utilisateurs une panoplie de nouvelles fonctionnalités, telles que le chargement de jeux à partir de disques durs externes et la lecture de fichiers multimédias, pour une expérience de jeu encore plus immersive.\n \nDe plus, cette mise à jour inclut des variantes spécifiques, notamment les versions noBD et Overclocked, permettant aux utilisateurs d'adapter leur expérience selon leurs besoins et préférences. De plus, la correction du bug entraînant l'erreur 0x8002F155 lors de l'installation de PUP améliore la stabilité et la fiabilité du Custom Firmware, offrant ainsi une expérience utilisateur plus fluide.\n \n \n\n \nImage d'illustration\n \n \nChangelog intégral : \n \n- Correction de l'erreur 0x8002F155 lors de l'installation de PUP.\n- Correction de la vitesse maximale du ventilateur, affichant désormais 0xFF et 100%.\n- Désactivation temporaire de \"Charger Cobra Externe\".\n- Reversion du code pour Cobra dans le noyau.\n- Ajout d'une option pour activer les drapeaux QA complets.\n- Correction de la description de xai_plugin pour le spoofing IDPS/PSID/MAC depuis \"/dev_hdd0/tmp\".\n- Ajout de la sortie TTY dans socat.\n- Construction de nouveaux charges utiles noyau/Cobra.\n- Correction des plantages/aléas aléatoires.\n- Mise à jour des fonctions Cobra vers la version 8.5.\n- Correction de l'écran noir/plantage lors du lancement d'ISO PS3/PSP/PSX.\n- Correction du plantage lors de l'installation de PKG à partir d'un périphérique exFAT/NTFS externe.\n- Réversion du patch qui causait des problèmes lors de la lecture de films BD.\n- Mise à jour du Débloqueur de Trophées en version 1.1.\n- Création de variantes [noBD] pour PEX et D-PEX.\n- [COBRA] Ajout du support du décryptage des ISO REDUMP à la volée.\n- [COBRA/XAI] Opcode pour basculer l'animation de démarrage à froid.\n- [COBRA/XAI] Opcode pour basculer l'avertissement d'épilepsie.\n- [COBRA/XAI] Opcode pour basculer l'animation et le son de démarrage du jeu.\n- [COBRA/XAI] Opcode pour basculer les informations de trophée cachées.\n- [COBRA/XAI] Correction du Gestionnaire de Cibles pour DEX.\n- [COBRA/XAI] Ajout de cellUsb000_mount_symbol.\n- [COBRA/XAI] Ajout de drapeaux usb_flag et no_cobra.\n- [COBRA/XAI] Option pour basculer l'icône de disque PS2 (ISO/BIN.ENC) dans XMB.\n- [COBRA/XAI] Activation des titres/détails/icônes de trophée cachés dans XMB et en jeu.\n \n \nLes versions PEX, D-PEX, CEX et DEX du Custom Firmware Evilnat 4.91.2 garantissent une compatibilité étendue avec une gamme variée de modèles de consoles PlayStation 3, assurant ainsi une expérience homogène pour tous les utilisateurs, quels que soient leurs besoins.\n \nEn termes de sécurité, le Custom Firmware Evilnat continue de proposer des mesures robustes pour minimiser les risques de bannissement ou de brick des consoles, offrant ainsi aux utilisateurs une tranquillité d'esprit lors de l'utilisation de leur console modifiée.\n \nEn conclusion, la version 4.91.2 du Custom Firmware Evilnat marque une avancée significative dans le domaine du hacking de console. Avec son intégration étendue de Cobra 8.5, ses corrections de bugs et ses variantes spécifiques, cette mise à jour offre aux utilisateurs une expérience de jeu encore plus personnalisée et immersive. Cependant, il est important de rappeler que l'utilisation de tout firmware non officiel peut présenter des risques et être contraire aux conditions d'utilisation des fabricants de consoles. Les utilisateurs sont donc invités à faire preuve de prudence et à agir de manière responsable lors de l'utilisation de ces outils.\n \n \nTéléchargement : CFW Evilnat 4.91.2 Bêta 6 \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2088245629.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] Les premiers échantillons du UnlockSwitch sont livrés",
        "content": "Les premiers utilisateurs et testeurs du UnlockSwitch sont en train de recevoir les échantillons du nouveau linker de la Nintendo Switch, clône du Mig Switch. \n \nDans le boitier transparent noir du sample du UnlockSwitch se trouve un message dans lequel on apprend qu'il n'y a que 50 samples, la vidéo montre le 22ème sample, et fait référence à un lieu \"Quelque part en Chine\". \n \n \n\n \n \nSur le sample, comme sur le MigSwitch point de bouton poussoir, il faut faire la même manipulation pour changer de jeu.\n \n \n\n \n\n \n\n \n\n \n\n \nVous trouverez ci-dessous la première vidéo de Nick Moses qui teste le UnlockSwitch, quelques petits détails, le signal de la LED semble moins puissant que celui du MigSwitch, et il semble que la partie plastique soit légèrement plus épaisse , à 14min40 on voit bien qu'il force pour retirer l'UnlockSwitch, là aussi peut être une amélioration à faire pour que la manipulation soit moins forcée, et assurer ainsi la longévité du port cartouche de la console. \n \n \n \n\n \n \n \nQuoi penser du UnlockSwitch face au MigSwitch ?\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189623/in-switch-les-premiers-echantillons-du-unlockswitch-sont-livres-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1189623/in-switch-les-premiers-echantillons-du-unlockswitch-sont-livres-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1189623/in-switch-les-premiers-echantillons-du-unlockswitch-sont-livres-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1189623/in-switch-les-premiers-echantillons-du-unlockswitch-sont-livres-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1189623/in-switch-les-premiers-echantillons-du-unlockswitch-sont-livres-5.png",
            "image_6": "https://www.logic-sunrise.com/images/news/1189623/in-switch-les-premiers-echantillons-du-unlockswitch-sont-livres-6.png"
        }
    },
    "news_9": {
        "title": "[XBO] Zelda 3 s'invite sur la Xbox Originale",
        "content": "Le développeur Calistex vient de réaliser le portage de Zelda 3 sur la Xbox originale, enfin pas exactement. Pour y parvenir il a porté une ancienne  version de Zelda 3 rétroporté par Rinnegatamante.\n \nIl va donc manquer quelques mises à jour des itérations un peu plus récentes, le gameplay reste parfait, il est jouable du début à la fin du jeu, mais il existe quelques bugs aléatoires sur l'audio en début de partie. \n \n \n\n \n\n \n\n \n\n \n \nLe portage a été développé à l'aide de la chaîne d'outils NXDK. Les utilisateurs intéressés peuvent cloner et contribuer au projet depuis GitHub en utilisant le lien du référentiel fourni https://github.com/Calistex/zelda3-xbox\n \nTout comme pour la version de Rinnegatamante, les utilisateurs doivent posséder le jeu Zelda 3 original et fournir leurs propres ressources de jeu pour pouvoir l'utiliser.\n \n \nTéléchargement : zelda3-xbox\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189620/in-xbo-zelda-3-sinvite-sur-la-xbox-originale-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1189620/in-xbo-zelda-3-sinvite-sur-la-xbox-originale-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1189620/in-xbo-zelda-3-sinvite-sur-la-xbox-originale-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1189620/in-xbo-zelda-3-sinvite-sur-la-xbox-originale-4.png"
        }
    },
    "news_10": {
        "title": "[PSP/Vita] Nouveau Custom IPL et Despertar del Cementerio v10 disponibles",
        "content": "Cela continue de bouger sur la scène PSP, après la disponibilité de Aiseirigh, voilà que débarque une nouvelle version de DDC ( Despertar del Cementerio ) qui est donc désormais proposé en version 10.\n \nCela permet la prise en charge des 8 modèles PSP différents, comme vous le savez DDC (Despertar del Cementerio) vous permet de débricker n'importe quelle PSP, tandis que l'ARK CFW avec CIPL vous permet d'utiliser un firmware personnalisé entièrement et véritablement permanent sur n'importe quelle PSP, une solution permanente contrairement à Infinity par exemple. \n \n \n \n\n \n \nChangelog : \n \n- Mise à jour de Despertar del Cementerio à la version 10. Peut maintenant être utilisé pour débrider n'importe quel modèle de PSP.\n- Peut maintenant installer le cIPL sur tous les modèles de PSP.\n- Ajout de FinalSpeed pour faciliter l'accès aux installations Live.\n- Plusieurs autres petites corrections et améliorations.\n \nVeillez à désinstaller Infinity avec ChronoSwitch Downgrader avant d'utiliser le programme d'installation CIPL, ils ne sont pas compatibles les uns avec les autres et entreront en conflit.\n \n \n \n\n \n\n \n \n \nLe flash du CFW 6.61 ARK4 est permanent et DC10 est disponible via les outils ARK : DDC 10  \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189619/in-pspvita-nouveau-custom-ipl-et-despertar-del-cementerio-v10-disponibles-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] Ca bouge aussi du côté du Mig Switch",
        "content": "Il semblerait que cela bouge du côté du Mig Switch, ou du moins certains vendeurs ou revendeurs semblent vouloir se débarrasser de leur stock car il n'est désormais pas rare de voir le produit en dessous des 60 euros.\n \nEncore plus fort, il semble que certains revendeurs cassent le prix du Mig Switch sur AliExpress où il a été vendu 43 euros port compris, bien entendu le stock a fondu comme neige au soleil, et il est en rupture chez ce revendeur, les autres vendeurs le proposent à un prix plus de deux fois supérieurs. \n \n \n \n\n \n \n \nCela peut avoir plusieurs causes, se débarrasser d'un stock, envisager l'arrivée d'une nouvelle version ou bien tout simplement pour anticiper la sortie du UnlockSwitch, ou se payer une pub intéressante, et ça marche pour ce revendeur de Hong Kong. \n \n \n\n \n \nDernière petite information, l'une des personnes qui a commandé sur Aliexpress confirme que son linker n'a pas de puces grattées, un oubli ou une volonté de liquider là aussi un maximum de Mig Switch le plus rapidement possible, le doute est permis. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189550/in-switch-ca-bouge-aussi-du-cote-du-mig-switch-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1189550/in-switch-ca-bouge-aussi-du-cote-du-mig-switch-1.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] Un interrupteur sur l'UnlockSwitch confirmé ?",
        "content": "L'équipe en charge du développement de l'UnlockSwitch vient de confirmer une première grosse évolution qui pourrait être présente dans la version finale de leur produit et qui permettra de proposer réellement autre chose que le MigSwitch. \n \nL'une des plus grandes critiques du MigSwitch est qu'il est nécessaire de sortir et remettre le linker pour changer de jeu, une manipulation qui sur la durée peut endommagé le port cartouche car il n'est pas prévu pour autant de manipulation. \n \nLa Team UnlockSwitch vient de confirmer qu'elle a réussi a outrepasser la limite du switch on et off, ce qui signifie qu'elle va certainement intégrer un bouton dans la version finale. \n \n\n \nElle confirme que comme pour le MigSwitch, l'UnlockSwitch ne permettra pas de jouer en ligne, et cet interrupteur permettra de changer de jeux, son objectif n'est pas d'allumer ou d'éteindre l'UnlockSwitch, malgré qu'elle parle de bouton on/off, certains font référence Sky3DS+ qui permettait d'avancer ou de revenir sur un jeu, dans le cas de l'UnlockSwitch, le bouton serait un poussoir qui permettrait de passer au jeu suivant en faisant une boucle. \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-92140384.png"
        }
    },
    "news_13": {
        "title": "[PSP] L'unbricker Aiseirigh dévoilé par Davee",
        "content": "Comme nous en informe Wololo.net, le développeur Davee dévoile Aiseirigh, son unbricker permettant de prendre en charge tous les modèles PSP, rien que ça ! Utilisé en couplage avec BaryonSweeper, Aiseirigh peut débloquer ainsi  débloquer n'importe quelle PSP et la restaurer vers le firmware 6.61.\n \nAiseirigh qui se prononce \" ash-er-eye \" est un mot gaélique écossais signifiant \" résurrection \", et il est parfaitement compatible avec les outils Pandora et DDC (Despertar del Cementerio).\n \nLe code source se trouve ici : Aiseirigh\n \n \n\n \n \n\n \n\n \n \nNécessaires :\n \n- une Memory Stick Pro Duo (PSP) ou une Memory Stick Micro (PSPgo) avec suffisamment d'espace dans le secteur IPL\n- un BaryonSweeper physique (obligatoire pour les PSP 3000 03g, 3000 04g, 3000 07g, 3000 09g, PSPgo et PSP E1000 ; fonctionne également pour les PSP 1000 et 2000)\n- une batterie Pandora classique (uniquement pour les PSP 1000 et 2000, y compris 2000 88v3 !)\n- un logiciel qui peut interagir avec BaryonSweeper, tel que pySweeper\n- pySweeper nécessite que Python3 soit correctement installé et configuré, ainsi que les paquets pip suivants : \"pycryptodome\", \"tk\", \"pyserial\" et \"requests\".\n- Les fichiers de mise à jour du firmware 6.61 pour les PSP ordinaires ou la PSPgo (correspondant à votre modèle)\n- le fichier IPL Aiseirigh unbricker\n- un moyen d'injecter le fichier IPL Aiseirigh dans la clé USB (par exemple Rains IPL Tool via PC ou PSP-Tool via PSP)\n- un peu de compréhension de la lecture du tutoriel disponible ici.\n \n \n \n\n \n \n \nLa mise en oeuvre n'est pas simple, il vous faudra un BaryonSweeper, pas mal de connaissances, ou bien d'une batterie Pandora selon votre modèle de PSP. \n \n \nTéléchargement : Aiseirigh v0.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189513/in-psp-lunbricker-aiseirigh-devoile-par-davee-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1189513/in-psp-lunbricker-aiseirigh-devoile-par-davee-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1189513/in-psp-lunbricker-aiseirigh-devoile-par-davee-3.png"
        }
    },
    "news_14": {
        "title": "[PS4] Le store GameBato améliore ses performances et stabilité",
        "content": "Le store décrié GameBato a été mis à jour en version 1.99, il est comme vous le savez question d'un store qui met à disposition plus de 2000 jeux qui sont directement accessibles sur la PlayStation 4 et PlayStation 4 Pro, avec les DLC et les mises à jour, et tout cela d'un simple clic. \n \n \n \n\n \n \n \nChangelog Version 1.99 :\n \nAmélioration des performances :\n- Amélioration de la stabilité de l'application.\n- Réduction de l'utilisation du processeur de l'application de ~270%.\n \nAmélioration de l'interface utilisateur :\n- Normalisation de la vitesse d'exploration dans l'application.\n- Changement de l'image de fond de la section des téléchargements.\n- Ajout d'un avis de téléchargement pour certains jeux qui ne peuvent pas être exécutés sans installer les paquets de mise à jour, afin de rappeler aux utilisateurs de télécharger les paquets de mise à jour pour ces jeux.\n \n- Correction de quelques problèmes mineurs.\n \n \nTéléchargement : GameBato\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189503/in-ps4-le-store-gamebato-ameliore-ses-performances-et-stabilite-1.png"
        }
    },
    "news_15": {
        "title": "[Vita] RetroFlow-Launcher 7.0.1 disponible",
        "content": "Le développeur jimbob4000 vient de publier RetroFlow-Launcher dans sa version 7.0.0. Pour rappel, RetroFlow-Launcher est une jolie petite interface graphique permettant de parcourir et delancer vos jeux Retro sur la PS Vita, et est à l'origine un fork de HexFlow-Launcher par VitaHEX.\n \nIl s'agit d'une version modifiée de HexFlow Launcher, un coverflow 3D comme un lanceur pour PS Vita. Cette version comprend des catégories de jeux rétro qui peuvent être lancées sans bulles pour RetroArch, DaedalusX64 et Flycast. Les jeux Playstation et PSP peuvent également être lancés sans avoir à créer de bulles pour chaque jeu. Vous l'aurez compris RetroFlow remplacera le Menu Bull avec le plus bel effet. \n \n \n\n \n \n \nChangelog 7.0.1 : \n \nCorrections de bugs\n \nCorrection d'un problème avec les jeux Adrenaline, le 'boot.bin' généré était mal formé. Cela provoquerait un crash lors de l'accès aux paramètres de démarrage pendant que le jeu était en cours d'exécution, ainsi que d'éventuels problèmes de performances dans le jeu.\n \n \nChangelog 7.0.0 : \n \nAperçu\nLes notes de version sont longues, voici donc un bref résumé.\n \nMeilleures illustrations pour les jeux rétro .\nDes vérifications CRC de fichiers ont été ajoutées pour aider à identifier davantage de jeux. Elles ne sont pas disponibles pour tous les systèmes, mais la plupart des systèmes non basés sur CD ont été ajoutés.\n \nInstallation et configuration plus faciles lors de l'utilisation d'Adrenaline .\nAdrenaline bubble booter et le vpk RetroFlow Adrenaline Launcher sont installés automatiquement si vous utilisez Adrenaline. Ceci est effectué lors de la première configuration et également vérifié lors de l'analyse des jeux.\n \nNouveau\nMeilleure identification du jeu pour les téléchargements d’illustrations de jeux rétro.\nDes vérifications de fichiers CRC ont été ajoutées pour une meilleure correspondance des illustrations pour la plupart des systèmes non basés sur CD. Zip et rar sont pris en charge mais ne sont pas recommandés car l'application doit les extraire pour vérifier le CRC. 7z n'est pas pris en charge. Pour plus d'informations sur la prise en charge du CRC, voir ici . CRC a été rendu possible grâce à l'utilisation du code de « Adrenaline bubble manager » de l'équipe ONElua.\n \nNouveau téléchargeur d'œuvres d'art.\nUn nouveau téléchargeur d'illustrations a été conçu pour fonctionner avec les nouveaux contrôles CRC du jeu. Le téléchargeur essaiera d'abord de télécharger l'illustration en fonction du nom de fichier du jeu, puis tentera d'identifier le jeu à l'aide de sa somme de contrôle CRC si rien n'est trouvé. L'illustration téléchargée est maintenant affichée sur l'écran de progression. Il y a également une meilleure gestion de l'énergie, la Vita ne peut pas se mettre en veille (ce qui mettrait les téléchargements en pause), l'écran s'éteindra après un certain temps et se rallumera une fois le téléchargement de l'illustration terminé.\n \nPossibilité d'utiliser l'ancien téléchargeur d'œuvres d'art.\nVous pouvez utiliser l'ancien téléchargeur en désactivant le paramètre « Illustration > Télécharger à l'aide du CRC », mais il risque de trouver moins d'illustrations. L’option permettant de télécharger des illustrations système par système a été supprimée pour simplifier l’expérience utilisateur et le code.\n \nInstallation automatique de RetroFlow Adrenaline Launcher.\nLe VPK sera installé automatiquement lors de l'analyse des jeux (à condition qu'Adrenaline soit installé).\n \nInstallation automatique du booter Adrenaline Bubble.\nL'application va maintenant vérifier si Adrenaline bubble booter est installé (nécessaire pour lancer les jeux Adrenaline), s'il n'est pas installé ou si le CRC des fichiers est différent, alors Adrenaline bubble booter sera installé et vous serez invité à redémarrer la vita. Cela devrait simplifier le processus de configuration. Cela a été rendu possible grâce à l'utilisation du code de « Adrenaline bubble manager » de l'équipe ONElua, « Adrenaline bubble booter ». par Leecherman.\n \nPlus d'options de jeu Adrenaline ajoutées pour les jeux PSP.\nDes paramètres supplémentaires ont été ajoutés pour les plugins, la vitesse du processeur, la mémoire élevée, le moteur NoDRM et les threads de suspension. Toutes les options d'ABM sont désormais disponibles ici également.\n \nPrise en charge des noms de fichiers Amiga WHD ajoutée.\nL'application recherchera les titres de jeux en fonction des noms de fichiers WHD courants.\n \nHorloge au format 12 heures.\nAjout d'une option pour utiliser une horloge au format 12 heures. Accédez à « Autres paramètres > Heure » pour modifier.\n \nAméliorations\nIllustration - Extraire les arrière-plans PSP - L'illustration est désormais affichée à l'écran pendant le processus.\n \nTraductions polonaises mises à jour grâce à SK00RUPA.\n \nPositionnement des icônes en haut de l'écran lorsque l'icône Wi-Fi n'est pas affichée.\n \nCorrections de bugs\nCorrection des couvertures PS1 personnalisées ne s'affichant pas pour certains jeux Retroarch PS1.\n \nExtraire les icônes et les arrière-plans Vita - J'ai utilisé les copyicons de cy33hc pour plus de stabilité. Ma version avait des fonctionnalités supplémentaires mais comportait des bugs.\n \nLa description de ScummVM a été supprimée car elle peut provoquer une erreur Lua.\n \n \n \nTéléchargement : RetroFlow-Launcher 7.0.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189464/in-vita-retroflow-launcher-701-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[PS3] Custom firmware Evilnat 4.91.2 CEX/PEX/D-PEX avec Cobra 8.5 Bêta 5",
        "content": "Le développeur Nathan Martin vient de mettre en ligne une nouvelle version de son Custom Firmware Evilnat en 4.91.2, il s'agit comme d'habitude des versions PEX et D-PEX qui sont proposées, et il a intégré les fonctions Cobra dans leur mouture 8.5. \n \n \n \n\n \n \n \nCette Bêta 5 a pour ambition d'apporter 3 corrections que nous pouvons retrouver dans le changelog (en plus des éléments déjà précédents). \n \n- Correction de la vitesse maximale du FAN, qui affiche désormais 0xFF et 100 % \n- Désactivation temporaire de \"Load External Cobra\" \n- Inversion du code pour cobra dans le kernel\n \nA noter que la version CEX sera publiée normalement dans l'après-midi. \n \n \nTéléchargement : CFW Evilnat 4.91.2 PEX/D-PEX avec Cobra 8.5 Bêta 5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189443/in-ps3-custom-firmware-evilnat-4912-pexd-pex-avec-cobra-85-beta-5-1.jpg"
        }
    },
    "news_17": {
        "title": "[Switch] Les samples (échantillons) d'UnlockSwitch sont en route",
        "content": "La team UnlockSwitch vient à priori de finaliser le packaging de sa solution, clone du Mig Switch mais qui coutera plus de 2 fois moins cher. \n \nElle montre donc quelques photos de ce packaging même si elle précise que ce sont des samples (les échantillons) qui sont en route ! \n \nElle tient à préciser plusieurs choses, déjà qu'il ne s'agit pas de la version finale, et que les futurs propriétaires seront ravis. \n \n \n \n\n \n\n \n\n \n \nElle a rappelé une nouvelle fois que de nombreux scammers tentent avec des mails bien rédigés de contourner les commandes, il y a même des Youtubers qui font la promotion de sites web frauduleux. Elle confirme que pour l'heure aucune précommande n'existe car la production de masse n'a pas été lancée, à la question de savoir quand les précommandes seront effectives, la team répond \"très bientôt\". \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189432/in-switch-les-samples-echantillons-dunlockswitch-sont-en-route-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1189432/in-switch-les-samples-echantillons-dunlockswitch-sont-en-route-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1189432/in-switch-les-samples-echantillons-dunlockswitch-sont-en-route-3.jpg"
        }
    },
    "news_18": {
        "title": "[Switch] Lakka v5.0 disponible",
        "content": " \nEt ben dit donc, on a failli l'oublié lui, Lakka, vient d'être mis à jour, il faut dire que l'OS Switch n'avait pas été updaté depuis Janvier 2023 !\n \nPour bénéficier de Lakka sur votre Switch, il suffit de le placer sur une carte SD formatée en FAT32, rappelons que Lakka est une distribution Linux spécialement taillée pour intégrer RetroArch sur Nintendo Switch, cette distribution est notamment optimisée pour émuler les jeux Dreamcast, N64, Saturn, GameCube et Wii profitant de meilleures performances que le système classique.\n \n \n\n \n \nCette version 5.0 est basée sur la dernière version de RetroArch, la 1.17.0 et permet donc de profiter de l'ensemble de ses améliorations. \n \nLe changelog intégral est disponible ici.\n\n \nChangelog mini : \n \n- Based on LibreELEC 11.0 build system\n- RetroArch updated to 1.17.0\n- Cores updated to their most recent versions\n- New cores added:\ndirksimple: Dragon’s Lair player\ndosbox-core: DOSBox\nep128emu: Enterprise 64/128, Videoton TVC, Amstrad CPC and ZX Spectrum\ngeolith: Neo Geo AES and MVS Cartridge Systems\njaxe: XO-CHIP/S-CHIP/CHIP-8\nnumero: TI-83\nthepowdertoy: The Powder Toy\nvice_xpet: Commodore PET\nvircon32: Virtual Game Console inspired by 16/32-bit systems\nvitaquake2: Quake II\n- Mesa updated to 24.0.4\n- Updated Linux kernel\nmainline: 6.1.84\nraspberry: 6.1.77\namlogic: 6.1.38\n- Added images for following devices\nRaspberry Pi 5\nRaspberry Pi Zero 2 in Retroflag GPI Case 2W\nRaspberry Pi Compute Module 4 in Retroflag GPI Case 2\n- Generic PC:\nSupport for nVidia GPUs (using proprietary nVidia driver, separate image)\n- Allwinner SOC:\nOrangePi Zero2\nOrangePi 3 LTS\n- Amlogic SOC:\nBananaPi CM4\nBananaPi M2 Pro\nBananaPi M2S\nBananaPi M5\nRadxa Zero\nRadxa Zero2\nWeTek Core\nWeTek Hub\nWeTek Play 2\n- Rockchip SOC:\nFirefly ROC-PC Plus\nOrangePi 4 LTS\nRadxa Rock Pi 4 Plus\nRadxa Rock Pi 4 C Plus\n- Retrorama - theme and dynamic wallpapers for XMB\n \n \n\n \n\n \nTéléchargement : Lakka-5.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189367/in-switch-lakka-v50-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[Switch] L'UnlockSwitch à moins de 40 $ mais attention aux scammers",
        "content": "La Team UnlockSwitch vient d'annoncer que de nombreux sites internet essayent de tirer profit de leurs premières livraisons en essaynt déjà de contourner ceux qui acheteraient le linker. De nombreux sites se font donc passer pour le site officiel, mais pour le moment aucun d'entre eux n'est revendeur de la solution.\n \nCe sont donc uniquement des scammers ou des sites qui vous promettent que vous recevrez votre exemplaire, mais il n'en est rien. \n \n \n\n \n \nDeuxième information importante, la team s'exprime sur le prix est annoncé qu'elle est heureuse de vous confirmer que le prix attendu pour l'utilisateur final (et non pas les revendeurs) sera approximativement de 39 $, soit moins de 40 $, sachant que le Mig Switch lui est plutôt vendu plus du double.\n \nPour le moment, l'UnlockSwitch n'est pas encore lancé en production, et l'équipe demande même quelle couleur vous souhaiteriez pour l'emballage final via un sondage .\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189366/in-switch-lunlockswitch-a-moins-de-40-mais-attention-aux-scammers-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] Suyu 0.0.3 disponible",
        "content": "Malgré la tourmente et aussi surprenant que cela puisse paraître, l'équipe en charge du développement de Suyu a réussi à créer une nouvelle version de leur émulateur Switch. \n \nAprès Github, après Gitlab, c'est au discord que Nintendo s'est attaqué, et l'a fait disparaitre. Cependant tout cela n'entache en rien la motivation de ceux qui ont pris la relève de Yuzu et propose donc des correctifs pour le firmware 18.0.0, mais aussi des améliorations du support de Princess Peach : Showtime !, ou encore cette version vient corriger des problèmes avec certains fichiers NRO provoquant des plantages. \n \n \n\n \n \nCertains supports ont été améliorés comme ceux des appareils Android, ou encore FSR Sharp ou encore l'audio. A noter qu'officiellement le firmware 18.0.0 n'est pas supporté, il s'agit du firware 17.0.0. \n \n \nTout est là : Suyu v0.0.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189348/in-switch-suyu-003-disponible-1.png"
        }
    }
}