{
    "news_1": {
        "title": "[PS4/PS5] Les Résident Evil et Red Dead Redemption en HD et 60 fps",
        "content": "Il semblerait que plusieurs Resident Evil et Red Dead Redemption ont été retravaillés sous la forme de fpkg disponible pour la PS4 et la PS5. A partir de la version PS4, un développeur Speed-007, a retravaillé quelques jeux afin de proposer une version personnalisé améliorée. \n \n \n\n \n\n \n\n \n \nLes jeux en question : \n \n- Resident Evil 8 : Village\n- Resident Evil 2\n- Resdient Evil 3 \n- Red Dead Redemption 1\n \n \n\n \n\n \n\n \n \n\n \n\n \n \nCe sont essentiellement des titres soit qui sont sortis sur PS5, soit sorti sur PC et c'est donc en enlevant toutes les textures PS4, et en les remplaçants par celles qui versions PS5 ou PC que le développeur arrive à un tel résultat. \n \nLes titres PS4 disposant des textures PS5 ou PC tournent sur PS4 et PS5, sont proposés en fpkg, et fonctionnant en 4K 60FPS sur PS5. Le développeur en a profité pour remplacé la lumière, certains modèles, certains effets visuels et même certains shaders. Bien entendu cela fonctionne aussi sur PS4 mais en 30 fps, et pas en 4K, et il est possible de s'attendre à des chutes de framerate par moment.\n \nIl ne va pas s'arrêter là, il a l'intention de travailler d'autres jeux, notamment Red Dead Redemption 2. \n \n \nTout est là : x.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201215/in-ps4ps5-les-resident-evil-et-red-dead-redemption-en-hd-et-60-fps-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1201215/in-ps4ps5-les-resident-evil-et-red-dead-redemption-en-hd-et-60-fps-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1201215/in-ps4ps5-les-resident-evil-et-red-dead-redemption-en-hd-et-60-fps-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1201215/in-ps4ps5-les-resident-evil-et-red-dead-redemption-en-hd-et-60-fps-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1201215/in-ps4ps5-les-resident-evil-et-red-dead-redemption-en-hd-et-60-fps-5.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1201215/in-ps4ps5-les-resident-evil-et-red-dead-redemption-en-hd-et-60-fps-6.jpg",
            "image_7": "https://www.logic-sunrise.com/images/news/1201215/in-ps4ps5-les-resident-evil-et-red-dead-redemption-en-hd-et-60-fps-7.jpg",
            "image_8": "https://www.logic-sunrise.com/images/news/1201215/in-ps4ps5-les-resident-evil-et-red-dead-redemption-en-hd-et-60-fps-8.jpg"
        }
    },
    "news_2": {
        "title": "[Switch] Nintendo souhaite que Reddit dénonce les membres de r/SwitchPirates",
        "content": "Dans le cadre du process qui l'oppose à Archbox, J.Williams, devant le tribunal fédéral de Washington, Nintendo souhaite que Reddit, Discord et d'autres plates-formes en ligne dévoilent la liste de tous les participants actifs au pirtage. \n \nBien entendu Nintendo ne va pas s'arrêter à Archbox et à l'intention désormais de s'attaquer à tous ceux qui ont un boutique, qui font du commerce, ou qui contournent les droits d'auteurs. Ainsi Nintendo s'attaque au modérateur de  r/SwitchPirates, à tous ceux qui ont une boutique virtuelle, dans la plainte c'est très clair. \n \nNintendo a nommément cité « Jack-in-the-Shop », « Turtle in the Shop » et « NekoDrive », qui ont été fermés suite à une lettre de cessation envoyée par Nintendo en Mars 2024. Une quatrième boutique, LiberaShop, est restée sur Telegram, mais a fermé peu après le dépôt de la plainte.\n \n \n\n \n \nRappelons que l'on parle de 190 000 membres, et que Nintendo cherche des informations sur Reddit, Discord, Google, GitHub, Namecheap et d'autres salon, réseaux sociaux ou services tiers. \n \nNintendo affirme recherche des informations limitées pouvant aider à identifier les titulaires de compte et les flux de paiement, ainsi que les statistiques de trafic et d'accès aux boutiques pirates, cela inclut par exemple le nombre de téléchargement. \n \nLe soucis dans cette affaire est que le défendeur, Archobox, est toujours aux abonnés absents, et que Nintendo a donc tout pouvoir d'agit par défaut, Nintendo mettant en avant plusieurs requêtes pour obtenir l'autorisation d'accès aux données de chaque site. \n \nTout est là : Requête d'accès / plainte de Nintendo\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201213/in-switch-nintendo-souhaite-que-reddit-denonce-les-membres-de-rswitchpirates-1.jpg"
        }
    },
    "news_3": {
        "title": "[Multi] Le payload pour le réveil Alarmo mis à jour",
        "content": "Le développeur GaryOderNichts propose une mise à jour de son payload permettant de modifier quelques éléments du réveil Alarmo de Nintendo. \n \n \n \n \n\n \n \n \n \nL'idée est déjà d'apporter le support de l'USB le payload permet de lancer Alarmo via USB et d'afficher l'image d'un chat sur l'écran de l'appareil. \n \nAinsi il est possible avec ce payload d'apporter quelques fonctionnalités supplémentaires : \n \n- En tournant le bouton, vous pouvez mélanger différentes couleurs\n- En appuyant sur le bouton retour, un QR code contenant des données relatives à la clé AES s'affiche. \n- En appuyant sur un bon, vous revenez à l'image du chat. \n \n \n\n \n \nProcédure d'utilisation : \n \n- Téléchargez la dernière version ou compilez la à partir du code source\n- Appuyez et maintenez simultanément les boutons de confirmation, de retour et de notification\n- Connectez le câble USB au PC tout en maintenant enfoncés les trois boutons\n- Une fois connecté, le bouton supérieur d'Alarmo s'allumera en rouge, et le PC reconnaitra un nouveau disque.\n- Copiez le fichier a.bin et le fichier MarkFile sur le lecteur qui apparaît\n- Alarmo se déconnectera automatiquement, et affichera une image d'un char sur l'écran.\n \nTéléchargement : Alarmo USB payload 2 \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201196/in-multi-le-payload-pour-le-reveil-alarmo-mis-a-jour-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201196/in-multi-le-payload-pour-le-reveil-alarmo-mis-a-jour-2.png"
        }
    },
    "news_4": {
        "title": "[PS5] Une nouvelle faille pour le firmware 7.61",
        "content": "Il semblerait qu'une nouvelle faille vient d'être découverte, et pas sur un firmware trop ancien, sur le firmware 7.61. Il s'agit d'une faille qui pourrait très bien fonctionner sur la PS5, et même déboucher sur un webkit exploit sur le 7.61 et inférieur. \n \n \n \n\n \n \n \nCela semble se confirmer comme fonctionnel sur le firmware 7.61, reste à voir s'il peut être utilisé avec UMTX, et si tout peut être implémenté. \n \nLa faille étant dévoilé trop récemment, nous ne savons pas comment cela va finir, mais restez à l'écoute. \n \n \n \nTout est là : WebKit\n \n",
        "images": {}
    },
    "news_5": {
        "title": "[Switch/PC/Android] NooDS mis à jour pour la Switch",
        "content": "Le développeur Hydr8gon vient de sortir une nouvelle version de son émulateur NooDS, comme vous le savez probablement l'ambition de NooDS est d'être le meilleur émulateur de Nintendo DS, celui avec la meilleure restitution, le plus rapide tout en restant portable.\n \nAutre spécificité de cet émulateur, il prend en même en charge la rétrocompatibilité GBA, Linux, macOS, Windows, Switch, Vita et Android.\n \n \n\n \n \n \nLe développeur corrige régulièrement l'émulateur en proposant une à deux fois par mois quelques évolutions, récemment un mode \"DSi\" a été introduit, ce mode de base permet à d'autres homebrews comme par exemple SM64DSi de fonctionner. \n \nIl a aussi ajouter le registre CP15 afin d'assurer la compatibilité avec les nouvelles bibliothèques libnds, et il y a quelques jours, il a corrigé l'overclocking sur Switch.\n \n \n \n\n \n \n \nChangelog : \n \n- Switch : correction de l'overclocking non appliqué lors de l'appui sur la touche home\n- Ajout du registre CP15 pour la compatibilité avec les nouvelles bibliothèques libnds\n- Ajout d'un mode \"DSi\" de base pour les homebrews comme SM64DSi\n- Amélioration de la gestion des fenêtres verticales\n- Android : corrige un crash et améliore le compteur FPS\n- Ajout des options de rapport hauteur/largeur personnalisées\n \n \nTéléchargement : NooDS (dernière mise à jour le 24.11.2024)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201141/in-switchpcandroid-noods-mis-a-jour-pour-la-switch-1.png"
        }
    },
    "news_6": {
        "title": "[Vita] vitaQuakeIII v1.3 améliore ses performances",
        "content": " \nLe développeur Rinnegatamante n'abandonne pas la PlayStation Vita et continue de proposer du contenu dessus, cet été il avait proposé la mise à jour de certains homebrews comme VitaDB Downloader, vitaVoyager, RVGL, ou encore Pickleball ou Pang Adventures. \n \nRécemment, début novembre, il a mis à jour RVGL en v1.1, ShaRKBR33D en v1.2, et aussi le rajout de tag dans VitaDB permettant un filtrage de recherche plus optimisé. \n \nAinsi il a découvert que lors du profilage d'OpenMoHAA, un goulot d'étranglement assez considérable dans le pipeline vitaGL à chaque fois qu'un vbo n'est pas utilisé. Cela affecte également un bon nombre d'anciennes versions, alors attendez-vous à des versions avec amélioration des performances dans les prochaines semaines.\n \nIl commence avec vitaQuakeIII qui passe de 24 fps à 32 fps par exemple, il s'agit du premier homebrew recevant une mise à jour d'amélioration des performances avec cette nouvelle découverte.\n \n \n\n \n\n \n\n \n \nvitaQuakeIII est le portage ioquake3 pour PSVITA. ioquake3 est un portage source amélioré d'idTech 3, le moteur de Quake III : Arena.\n \nvitaQuakeIII supporte Quake III : Arena, OpenArena et Quake III : Team Arena.\n \n \nConfiguration requise :\n \n- libshacccg.suprx\n \nChangelog (v.1.3) :\n \n- Mise à jour de l'utilisation de vitaGL.\n- Performances grandement améliorées grâce à l'utilisation du pool de vertex circulaire dans vitaGL.\n \n \nTéléchargement : vitaQuakeIII v1.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201140/in-vita-vitaquakeiii-v13-ameliore-ses-performances-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1201140/in-vita-vitaquakeiii-v13-ameliore-ses-performances-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1201140/in-vita-vitaquakeiii-v13-ameliore-ses-performances-3.jpg"
        }
    },
    "news_7": {
        "title": "[PS3] IrisMan 4.91.2 mis à jour par Aldostools",
        "content": " \nLe développeur Aldostools, sous son vrai nom Aldo Vargas, vient de mettre à jour le manager IrisMan 4.91.2.\n \nIrisMAN est un gestionnaire de sauvegarde pour la PlayStation 3, développé par Aldo Vargas. Il est un fork du gestionnaire Iris Manager d'Estwald et est entièrement open-source. Voici quelques fonctionnalités clés d'IrisMAN :\n \nCompatibilité avec les firmwares CFW/HFW : IrisMAN est compatible avec une large gamme de firmwares, permettant aux utilisateurs de gérer leurs sauvegardes de jeux facilement.\n \nSupport des PEX : Il inclut le support des PEX (PlayStation Exported Executables), permettant l'exécution de jeux non signés.\n \nGestionnaire de fichiers exFAT : IrisMAN inclut un gestionnaire de fichiers exFAT pour une gestion efficace des fichiers sur des disques durs externes.\n \nMise à jour de Mamba et Movian : IrisMAN inclut les dernières versions de Mamba et Movian, offrant ainsi des fonctionnalités supplémentaires et des améliorations de performance.\n \nEn mettant à jour IrisMan 4.91.2, il a rajouté la version 0.12 d'exFat Manager. \n \n \n \n\n \n \n \nChangelog : \n \n- Compatibilité avec les firmwares CFW/HFW 4.91 : IrisMAN prend désormais en charge les dernières versions de firmware.\n \n- Inclusion de Mamba 8.4 (20230307) : Cette version inclut la dernière version de Mamba, offrant un support pour les PEX de la version 4.91.\n \n- Gestionnaire de fichiers exFAT 0.12 : Le gestionnaire de fichiers exFAT a été mis à jour pour offrir de meilleures performances et une gestion plus efficace des fichiers.\n \n- Inclusion de Movian M7 7.0.2 : La dernière version de Movian de deank est incluse pour améliorer l'expérience utilisateur.\n \n \nTéléchargement : IrisMan 4.91.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201138/in-ps3-irisman-4912-mis-a-jour-par-aldostools-1.png"
        }
    },
    "news_8": {
        "title": "[PS4] NoBD Toolkit mis à jour en v2.03",
        "content": "Le développeur LightningMods propose une mise à jour de son NoBD Toolkit qui est désormais estampillé 2.03.\n \nNoBD Toolkit de LightningMods est une application très utile pour les utilisateurs de PS4 sans lecteur Blu-Ray ou s'il est défaillant et ainsi la mettre à jour. \n \nNoBD Toolkit se base sur l'utilisation d'un payload et d'une version modifiée de Mira pour fonctionner.\n \nContrairement à la version précédente, cette version fonctionne sur tous les firmwares.\n \nCette mise à jour est particulièrement bénéfique pour ceux qui ont une PS4 sans lecteur Blu-Ray et souhaitent la mettre à jour sans avoir à remplacer le lecteur.\n \n \n\n \n \n\n \n \n \nChangelog : \n \n- prise en charge de la mise à jour vers 11.00 à partir de 9.00+\n- réduction du temps nécessaire pour identifier le PUP FW\n \n \nTéléchargement : NoBD Toolkit 2.03\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201135/in-ps4-nobd-toolkit-mis-a-jour-en-v203-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1201135/in-ps4-nobd-toolkit-mis-a-jour-en-v203-2.jpg"
        }
    },
    "news_9": {
        "title": "[PS5] L'exploit bd-j mis à jour par TheFlow",
        "content": "Le développeur TheFlow, Andy Nguyen, vient de mettre à jour l'exploit bd-j, cela faisait quasiment 2 ans que cela n'avait pas été le cas ! \n \nLa mise à jour, même si elle n'est pas très marquante par son contenu, va amener un nouveau souffle à l'exploit si TheFlow continue d'y travailler dessus ! \n \nSa mise à jour d'hier consiste à optimiser certains calls natifs en modifiant certaines fonctions, à ajouter le loader JAR à distance, et à retirer l'exploit userprefs. Au passage il en a profité pour mettre à jour le Copyright de 2021 à 2021-2024 sur 28 fichiers.\n \n \n\n \n \n \nTout est là : bd-j exploit\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201114/in-ps5-lexploit-bd-j-mis-a-jour-par-theflow-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS3/Vita/Switch] ezRemote Client v1.07 disponible",
        "content": "La version 1.07 d'ezRemote Client est maintenant disponible pour la PS Vita, la Nintendo Switch et la PS3 ! ezRemote Client est une application de gestion de fichiers qui vous permet de connecter une console (Switch/Vita ou PS3 ici) à des serveurs FTP, SMB, WebDAV distants pour transférer et gérer des fichiers. L'interface est inspirée du client Filezilla qui fournit une interface graphique de type Commander.\n \n \n\n \n \n \nVoici quelques-unes des nouveautés et améliorations de cette version :\n \n- Support des serveurs FTP/SFTP, SMB (Windows Share), NFS, WebDAV, HTTP et Google Drive : Vous pouvez maintenant transférer des fichiers entre votre console et ces serveurs.\n \n- Interface inspirée de Filezilla : Un gestionnaire de fichiers avec une interface conviviale.\n \n- Installation PKG à l'intérieur des fichiers ZIP : Vous pouvez installer des fichiers PKG directement à partir de fichiers ZIP, que ce soit sur votre disque dur local ou à partir de serveurs distants.\n \n- Nouveaux correctifs de bugs : Plusieurs bugs ont été corrigés pour améliorer la stabilité et les performances.\n \n- Cette mise à jour rend l'utilisation de votre console encore plus flexible et pratique. \n \n- Résoudre un problème qui supprimait le fichier local après le téléchargement à l'aide de webdav et le serveur ne renvoyait pas de code d'état http 200\n \n \nTéléchargement : switch-ezremote-client v1.06 / vita-ezremote-client v1.07 / ps3-ezremote-client v1.07\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201094/in-ps3vitaswitch-ezremote-client-v107-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[PS3] CFW Evilnat 4.91.2 Beta 15 disponible",
        "content": "Le développeur Nathan Martin vient de dévoiler la 15ème bêta du CFW Evilnat 4.91.2, une mise à jour très attendue pour les utilisateurs de PlayStation 3. \n \n \n\n \n \n \nVoici quelques points clés de cette version :\n \n- Compatibilité améliorée avec les jeux récents : Cette bêta permet de jouer à des jeux plus récents sans problème.\n \n- Support des nouvelles fonctionnalités de Cobra 8.5 : Amélioration des performances et de la stabilité.\n \n- Installation simplifiée : Le processus d'installation a été simplifié pour les utilisateurs.\n \n- Correctifs de bugs : Plusieurs bugs ont été corrigés pour améliorer l'expérience utilisateur.\n \n- Cette version est encore en bêta, donc il est possible qu'il y ait encore des ajustements avant la version finale. \n \n \nA noter les changements de cette version Bêta 15 : \n \nvous pouvez désormais télécharger des PKG et charger des URL depuis Github, vous ne subirez plus d'erreur 80710A06. Ainsi avec cette version Bêta 15 :\n \n- Les variantes PEX et D-PEX ne sont disponibles que maintenant.\n- Réinitialisation du message original PlayStation Home dans le XMB (Merci à @DeViL303)\n- Correction de l'erreur 80710A06 lors du téléchargement de la mise à jour des PKGs/webMAN MODs depuis le XMB avec VSH DEX\n- Correction de la traduction italienne de xai_plugin (Merci à Weeddaa3)\n- Mise à jour de l'updater xai_plugin en v1.5\n- Mise à jour de xai_plugin disponible depuis le XMB\n \nTéléchargement : CFW Evilnat 4.91.2 Beta 15\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201093/in-ps3-cfw-evilnat-4912-beta-15-disponible-1.jpg"
        }
    },
    "news_12": {
        "title": "[Wii/WiiU] WiiLink Patcher v2.0.4 disponible",
        "content": "La version 2.0.4 de WiiLink Patcher a été récemment mise à jour.\n \n \n\n \n \nVoici quelques-unes des principales fonctionnalités :\n \n- Amélioration de la compatibilité avec le Dolphin Emulator.\n \n- Téléchargement du canal EULA et d'une version étendue de la sélection de région.\n \n- Extension du délai de connexion pour réduire les erreurs de tâche.\n \n- Correction d'un problème de téléchargement des canaux de traduction sous Linux.\n \nCette mise à jour permet de rendre votre Wii ou Wii U compatible avec le remplacement de WiiConnect24, assurant ainsi le bon fonctionnement de Wii Mail et de divers canaux Wii.\n \nChangelog : \n \n- Le processus de correction ne prend que quelques instants en fonction de votre processeur et de votre vitesse de connexion.\n \nModifications:\n- Ajout d'un support approprié pour l'émulateur Dolphin (merci à AyeItsHarry!)\n- Patcher télécharge désormais à nouveau les chaînes CLUF et la chaîne de sélection de région étendue\n \nCorrections de bugs :\n- Le délai d'expiration de la connexion a été prolongé, ce qui devrait réduire les risques d'erreurs de tâches.\n- [Linux] Téléchargement de canal pour les traductions plus fiables. (merci à@AyeItsHarry!)\n \n \nTéléchargement : WiiLink Patcher v2.0.4\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201072/in-wiiwiiu-wiilink-patcher-v204-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[DS/2DS/3DS] nds-bootstrap 2.2.2 et TWiLight Menu++ v27.12.2",
        "content": "Le développeur RocketRobz offre une mise à jour de nds-bootstrap et TWiLight Menu++ qui passent respectivement en v2.2.2 et v27.12.2.\n \n \n\n \n \n \nChangelog TWiLight Menu++ v27.12.2 :\n \n- Désormais à nouveau utilisable sur l'EZ-Flash Parallel avec la prise en charge du démarrage automatique réajoutée !\n- lifehackerhansola corrigé le bug qui causait la corruption de la carte microSD lors des écritures, en augmentant la latence entre les écritures. En conséquence, les écritures sont désormais un peu lentes, mais nds-bootstrap sauvegardera désormais correctement les jeux !\n \nCorrection de bug :\n \n- edo9300: Correction d'un bug négligé qui faisait que la sélection du bas apparaissait grisée dans le menu DS Classic lors de l'exécution à partir de cartes flash Slot-2 (selon ce qui est inséré et/ou quel micrologiciel est flashé).\n \n \nChangelog nds-bootstrp :\n \nCorrections de bugs :\n Le développeur a tenté de corriger les plantages occasionnels dans les jeux Pokémon Gen 5 exécutés en mode DSi sur les consoles DSi.\n- Obtenu en réduisant le tas de 2,5 Mo au lieu de 512 Ko, ce qui augmente l'espace de cache LRU en conséquence.\n- Correction du plantage de Rockman EXE : Operate Shooting Star sur les consoles 3DS lors de l'ouverture de Star Colosseum.\n- Iron Man 2 redémarre désormais sur la carte SD DSi/3DS en corrigeant un bug négligé qui s'est produit depuis la v1.6.0.\n- Correction d'un bug négligé qui empêchait le DMA de lecture de carte de fonctionner (et par conséquent, un éventuel plantage) pour les ROM DSi exclusives préchargeables sur les consoles 3DS.\n \n \nTéléchargement : nds-bootstrap 2.2.2 et TWiLight Menu++ v27.12.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201052/in-ds2ds3ds-nds-bootstrap-222-et-twilight-menu-v27122-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS4] Le chapitre 4 d'Hellblade 2 est ici",
        "content": "Le développeur Lapy vient de mettre en ligne le chapitre 4 de son adaptation d'Hellblade II pour la PS4. \n \nVoilà que débarque donc le 4ème chapitre, de ce film proposant quelques scènes en QTE pour amener une interactivité avec le \"joueur\". \n \nA noter qu'un autre développeur, dravszoo1, va proposer la version PKG de cette proposition avec les vidéos à l'intérieur.\n \n \n \n\n \n \nTéléchargement : HB2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201051/in-ps4-le-chapitre-4-dhellblade-2-est-ici-1.png"
        }
    },
    "news_15": {
        "title": "[PS5] Une mise à jour d'idlesauce pour PS5-UMTX-Jailbreak",
        "content": "Le développeur idlesauce ne s'arrête plus, voilà qu'il propose une nouvelle version de PS5-UMTX-Jailbreak. Son intérêt commence à être très intéressant faisant ainsi évoluer le jailbreak. \n \n \n\n \n \nChangelog : \n \n- Changements dans le CSS pour les textarea des crédits et du journal, cela permet de créer des crédits multilignes sur les boutons de payloads et créez une zone de texte du journal en lecture seule\n- Correction du loader d'elf sur le port 9020, il utilisait des sockets non bloquants mais ne vérifiait pas la présence de EAGAIN lors de la lecture.\n- Il utilise maintenant blocking+select puisque nous n'avons pas errno.\n \n \n \nTéléchargement : PS5-UMTX-Jailbreak\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201033/in-ps5-une-mise-a-jour-didlesauce-pour-ps5-umtx-jailbreak-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS4] Remote Lua Loader pour PS4 et PS5 s'améliore avec Artemis",
        "content": "Remote Lua Loader pour PS4 et PS5, basé sur la découverte de gezine qui permet aux jeux créés avec le moteur Artemis de charger des fichiers Lua arbitraires. Actuellement, ce chargeur est spécifique au Raspberry Cube (CUSA16074). Le laoder ne dépend pas du firmware et a été testé avec succès sur une PS5 Pro sous le firmware 10.20 !\n \n \n\n \n \nL'utilisation a été documentée sous PS4 Jailbreakée, PS5, PS5 Slim et/ou PS5 Pro. Actuellement, Remote Lua Loader permet d'éditer et d'exécuter des scripts Lua directement dans les jeux, c'est finalement un outil puissant pour personnaliser l'expérience de jeu.\n \n \nTéléchargement : Remote Lua Loader\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201027/in-ps4-remote-lua-loader-pour-ps4-et-ps5-sameliore-avec-artemis-1.png"
        }
    },
    "news_17": {
        "title": "[PS4] Live Die Repeat v1.01 disponible",
        "content": "Le développeur Lapy a annoncé il y a quelques jours qu'il allait proposer une mise à jour de Live Die Repeat car il a vu que les 10 000 téléchargements ont été dépassés. \n \nCe jeu est un hommage à Dragon's Lair, tant pour les QTE que pour la difficulté ou encore la mécanique du jeu. L'expérience est assez difficile à maîtriser du fait du gameplay qui se répète et qu'il oblige à se concentrer sur un gameplay prenant. \n \n \n\n \n \nLa mise à jour apporte la \" Visual Alert \", il s'agit de là d'un signalement du prochain bouton QTE qui disposera d'une aura lumineuse pour simplifier l'expérience. Lapy informe qu'il ne faut pas appuyer trop tôt sinon cela échouera. \n \n \nTéléchargement : Live Die Repeat 1.01 (pour PS4)\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200993/in-ps4-live-die-repeat-v101-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[Oldies] Mise à jour de RAWeb, des nouvelles fonctions pour RetroAchievemnts",
        "content": "Une mise à jour de RAWeb vient de débarquer, RAWeb c'est la plateforme RetroAchievements.org gère les réalisations, les données de jeu et les fonctionnalités gèrent la communauté de rétrogaming. \n \nRAWeb est une application qui permet aux utilisateurs d'interagir avec la plateforme RetroAchievements pour ainsi profiter des avantages de la communauté. \n \n \n\n \n \nRAWeb 6.20.0 s'adresse à tous ceux qui utilisent http://RetroAchievements.org pour obtenir des succès et des badges sur les émulateurs pris en charge comme ceux de 32X, Atari, Genesis, Saturn, Game Boy/Color/Advance, DS/DSi, NES, SNES, N64, GameCube, PlayStation, PlayStation 2, PSP, NeoGeo ... bref vous l'aurez compris cela s'adresse à beaucoup de monde.  \n \nTéléchargement : RAWeb 6.20.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200984/in-oldies-mise-a-jour-de-raweb-des-nouvelles-fonctions-pour-retroachievemnts-1.png"
        }
    },
    "news_19": {
        "title": "[PS3] Apollo Save Tool pour PS3 passe en v2.0.2",
        "content": "Le développeur d'Apollo Save Tool, Damian Parrino, nous propose de découvrir une nouvelle version de son outil indispensable pour la PS3. \n \nComme vous le savez, il s'agit d'un outil à installer sur votre console et qui va vous permettre de sauvegarder vos sauvegardes, cela l'air de rien, mais quand vous avez passé plusieurs centaines d'heures de jeux, vous ne voulez pas tout recommencer à cause d'un crash ou d'un bug. Bref, nous vous recommandons de faire régulièrement des sauvegardes de vos jeux. \n \n \n\n \n \nAjout : \n \n- Supprime les sauvegardes PS3 de l'USB\n- Images de la carte mémoire virtuelle PS2 (VMC)\n- Prise en charge de formats d'importation supplémentaires : .XPS, .CBS, .MAX, .SPS\n- Base de données en ligne : affichage des icônes PS1\n- Outils utilisateur :\n- Conversion des sauvegardes PS1/PS2 au format .PSV\n- Convertir les enregistrements .PSV aux formats .MCS/.PSU\n- Re-signature des sauvegardes .PSV\n \nCorrection :\n \n- L'option « Copier sur le disque dur » n'est disponible que lorsque l'on parcourt des sauvegardes USB.\n \nDivers :\n \n- Mise à jour du moteur de patch Apollo vers la version 1.1.2\n- Correction du bug de recherche du code SW lorsque les octets ne sont pas trouvés\n- Option pour lancer une application externe\n- (L1 + START) exécute /dev_hdd0/game/NP0APOLLO/USRDIR/EXTRA.SELF\n \n \nTéléchargement : Apollo Save Tool v2.0.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200980/in-ps3-apollo-save-tool-pour-ps3-passe-en-v202-1.png"
        }
    },
    "news_20": {
        "title": "[Switch] L'émulateur Switch Citron coule sur le jus de Yuzu",
        "content": "Depuis 5 jours est proposé un tout nouvel émulateur Switch, se nommant Citron, il est développé par Zephyron et reprend les bases de Yuzu. \n \nBien entendu, ce projet est une alternative à usage éducative, et le développeur tente de se prémunir de l'avenir en mettant en garde dès le téléchargement et l'installation, dès que l'on tente d'ouvrir la version PC un avertissement apparait prétextant que le logiciel est proposé \" à des fins éducatives uniquement \", et \"nous interdisons strictement l'utilisation de Citron pour des copies piratées ou non autorisées\". \n \n \n\n \n \nIl faut l'admettre, une fois les clés intégrées, il est possible de réaliser à peut prêt ce que l'on veut avec l'émulateur comme cela était possible avec Yuzu ou Ryujinx, Suyu ou Sudachi, toute retirées par Nintendo.\n \nCitron n'échappera pas à la règle, et se fera presser par les avocats de Nintendo. Les vidéos d'installation et de démonstration pleuvent sur Youtube. \n \n \nTéléchargement : Citron\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1200931/in-switch-lemulateur-switch-citron-coule-sur-le-jus-de-yuzu-1.png"
        }
    }
}