{
    "news_1": {
        "title": "[PS3] RPCS3 v0.0.31 Alpha disponible",
        "content": "L'équipe en charge du développement du meilleur émulateur PlayStation 3, RPCS3, propose une nouvelle version majeure de leur proposition. Ils dévoilent en effet la version v0.0.31, une version qui compile l'ensemble des correctifs apportés et le changelog est donc conséquent. \n \n \n\n \n \nDepuis que la v0.0.30 a été balisée :\n \n> 254 nouveaux commits\n> 325 fichiers de code source ont été édités\n> 24 555 lignes de code ont été ajoutées et 12 301 supprimées\n> 16 contributeurs de code\n> 62 jours de développement\n \nRPCS3 a vu son développement débuté il y a 13 ans, avec deux développeurs DH et Hykem et aujourd'hui regroupe une équipe de choc.\n \n \n\n \n \n \n \nTéléchargement : RPCS3 v0.0.31\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187652/in-ps3-rpcs3-v0031-alpha-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[Switch] Yuzu et Citra même combat, Citra est aussi dans l'accord et disparait",
        "content": "Coup dur pour le monde de l'émulation, en plus de perdre Yuzu, les utilisateurs de Citra se trouvent aussi sur le carreau. Ce sont les deux émulateurs qui sont visés par l'accord trouvé entre Tropic Haze LLC et Nintendo. \n \nYuzu étant un fork de Citra, il est donc logique Citra disparaisse également, ce n'était pas encore le cas hier soir quand Yuzu a été retiré en premier, mais c'est désormais chose faite, le site https://citra-emu.org/ fait apparaitre le même message que le site https://yuzu-emu.org/  \n \n \n\n \n \n \nBonjour aux yuz-ers et aux fans de Citra :\n \nNous vous écrivons aujourd'hui pour vous informer que yuzu et le soutien de yuzu à Citra sont interrompus, avec effet immédiat.\n \nyuzu et son équipe ont toujours été contre le piratage. Nous avons commencé nos projets en toute bonne foi, par passion pour Nintendo, ses consoles et ses jeux, et nous n'avions pas l'intention de causer du tort. Mais nous constatons aujourd'hui que nos projets, en contournant les mesures de protection technologique de Nintendo et en permettant aux utilisateurs de jouer à des jeux en dehors du matériel autorisé, ont donné lieu à un vaste piratage. En particulier, nous avons été profondément déçus lorsque des utilisateurs se sont servis de nos logiciels pour faire fuir le contenu de jeux avant leur sortie et ruiner l'expérience des acheteurs légitimes et des fans.\n \nNous avons décidé que nous ne pouvions pas continuer à permettre que cela se produise. Le piratage n'a jamais été notre intention et nous pensons que le piratage des jeux vidéo et des consoles de jeux vidéo doit cesser. À partir d'aujourd'hui, nous allons mettre hors ligne nos dépôts de code, arrêter nos comptes Patreon et nos serveurs Discord et, bientôt, fermer nos sites web. Nous espérons que nos actions constitueront un petit pas vers la fin du piratage des oeuvres de tous les créateurs.\n \nNous vous remercions pour vos années de soutien et pour votre compréhension de notre décision.\n \n \n \nLancé en Avril 2014, Citra était un émulateur libre et open-source de la console de jeu portable Nintendo 3DS, comme nous le voyons, l'impact est donc désormais large, les deux émulateurs sont donc tombés face à la puissance de Nintendo. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187629/in-switch-yuzu-et-citra-meme-combat-citra-est-aussi-dans-laccord-et-disparait-1.png"
        }
    },
    "news_3": {
        "title": "[PSP] pspident et PKGi PSP se mettent à jour",
        "content": "La PSP n'est pas encore à enterrer, du moins certains de proposer encore quelques programmes qui permettent d'en profiter. \n \n\nC'est le cas du développeur Yoti qui propose pspident dans sa version 3.1 apportant un peu correctif pour la PSP Go. \n \nIl y a quelques jours il a mis en ligne la version 3.0 qui a apporté quelques améliorations. \n \nChangelog 3.0 :\n \n- Ajout de la version UMD FW (sauf Go, par @krazynez)\n- Ajout de la détection de la PSP Go TA-094 (nom de code Strider2)\n- pspIdent fonctionne maintenant sur OFW (par @Acid_Snake)\n \nTéléchargement : pspident 3.1\n \n \nAutre nouveauté, PKGi PSP qui se met à jour. \n \n \n\n \nChangelog \n \n\nAjout :\n- Affichage du niveau de la batterie\n- Prise en charge des fichiers .zip (Téléchargement et extraction de liens .zip)\n- Installation locale de fichiers .PKG\nInstaller des fichiers .pkg à partir de la clé USB de la PSP\n- Analyse et liste des paquets à partir de ms0:/PKG\n- Ajouter l'option de stockage PSP-Go (Modifier le fichier config.txt pour changer l'emplacement de stockage et ajouter la ligne storage ms0)\n \nCorrection :\n- Correction de l'ETA de la barre de progression lors de la reprise des téléchargements\n \nDivers : \n- Ajout d'une version compatible OFW (@krazynez)\n\n \n \nTéléchargement : PKGi PSP\n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-90654181.jpg"
        }
    },
    "news_4": {
        "title": "[Switch] Nintendo et Yuzu ont trouvé un accord : arrêt du dév et 2.4 Millions",
        "content": "Et bien cela n'aura pas duré bien longtemps, Nintendo et Yuzu ont trouvé un accord, ou plutot Nintendo et Tropic Haze LLC, la société qui développe l'émulateur Yuzu, enfin qui développe, qui développait du coup. \n \n \n\n \n \nOui l'accord est immédiat, et porte donc sur le fait de la disparition de Yuzu, Nintendo va recevoir 2.4 Millions de $, l'injonction permanente interdit à Tropic Haze LLC de : \n \n- Proposer, commercialiser ou distribuer l'émulateur Yuzu ou son code source\n- Proposer d'autres logiciels ou appareils qui contournent les mesures de protection contre la copie de Nintendo\n- Violer les droits d'auteur de Nintendo directement ou indirectement\n- Utiliser le domaine yuzu-emu.org et les domaines similaires\n- Détruire ou cacher des preuves\n \n \nLe domaine est transféré à Nintendo et le développement est arrêté, cela n'aura pas trainé. Sur le serveur Discord, le développeur principal Bunnei a également annoncé que les développeurs ne travailleraient plus ni ne prendraient plus en charge l'émulateur 3DS Citra (Yuzu étant un fork de Citra). \n \nYuzu a déjà été retiré du site https://yuzu-emu.org, son téléchargement n'est plus possible, le lien /github.com/yuzu-emu/ a aussi été retiré, bref c'est la fin de Yuzu, du moins dabs la forme que nous connaissions depuis plus de 4 ans. \n \n \nTout est là : storage.courtlistener.com\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187571/in-switch-nintendo-et-yuzu-ont-trouve-un-accord-arret-du-dev-et-24-millions-1.jpg"
        }
    },
    "news_5": {
        "title": "[PS5] PS4-5 Eboot DLC Patcher a été mis à jour",
        "content": "Le développeur idlesauce vient de mettre à jour son script PS4-5-eboot-dlc-patcher qui est toujours en bêta.\n \nComme vous le savez cet outil permet d'appliquer des correctifs au fichier eboot pour charger un fichier .prx contenant les ID des DLC, et certaines autres fonctions comme libSceAppContent par exemple.\n \n \n\n \n \nCertaines des fonctions qui sont émulées : \n \n- sceAppContentGetAddcontInfoList\n- sceAppContentGetAddcontInfo\n- sceAppContentGetEntitlementKey\n- sceAppContentAddcontDelete\n- sceAppContentAddcontMount\n- sceAppContentAddcontUnmount\n- sceAppContentGetPftFlag \n \n \nToutes les bibliothèques ne sont pas encore correctement émulées, comme par exemple libSceNpEntitlementAccess, et à l'origine il a été conçu pour les fPKG de la PS4, pas pour la PS5.  \n \nLes changements sont nombreux et se trouvent ici : changelog\n \nTout est là : ps4-eboot-dlc-patcher\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187523/in-ps5-ps4-5-eboot-dlc-patcher-a-ete-mis-a-jour-1.png"
        }
    },
    "news_6": {
        "title": "[Switch] Ryujinx présente la nouvelle interface Avalonia",
        "content": "L'équipe Ryujinx est fière d'annoncer l'arrivée de la toute nouvelle interface Avalonia. Il s'agit d'un framework qui vient en surcouche en interface utilisateur multiplateforme basé sur .NET. L'un des grands avantages est que cette interface est assez souple, et offre un style de système flexible.\n \n \n\n \n \nCette nouvelle interface apporte plusieurs fonctionnalités, comme un écran de démarrage du loader de jeux, un gestionnaires de mods, une vue en grille de la liste des jeux, ou encore la gestion des thèmes sombres et clairs. \n \n \n \n\n \n \n \nLa Team explique qu'il n'y aura pas de rapport d'avancement ce mois-ci car le rédacteur n'a pas eu assez de temps disponible pour pouvoir le rédiger. \n \n \nTéléchargement : ryujinx.org\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187519/in-switch-ryujinx-presente-la-nouvelle-interface-avalonia-1.png"
        }
    },
    "news_7": {
        "title": "[Switch] SimpleModDownloader 2.0.0 disponible!",
        "content": "Salut à tous, c'est avec grand plaisir que je vous annonce la sortie de la version 2.0.0 de SimpleModDownloader. Pour rappel cet homebrew va vous permettre de télécharger les mods depuis gamebanana directement depuis votre switch. Cette mise à jour est particulière rien qu'en voyant le tag, en effet c'est une mise à jour majeur. J'ai réécris l'application de zéro en utilisant un fork de borealis qui est bien plus avancé et m'a permis de faire une UI bien plus jolie. Tous les bugs connus ont été fixé, le changelog est plutôt conséquent\n \n \n\n \n\n \nvidéo:\n\n \nChangelog :\n- Réécriture de l'app avec borealis\n- Passage vers un nouveau build tool : cmake\n- Fix #46 and #39\n- Une nouvelle page pour voir la preview du mod\n- Ajout d'une détection pour voir si un mod est compatible avec SimpleModDownloader (en réalité l'application regade si dans l'archive il y a un dossier romfs, l'api de gamebanana le permet)\n- Ajout d'un fix pour éviter un crash qui arrivait quand le mod comprenait des caractères spéciaux\n- Les temps de chargement sont réduits en plus d'utiliser du multi threading\n \n \nTéléchargement : SimpleModDownloader 2.0.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187517/in-switch-simplemoddownloader-200-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1187517/in-switch-simplemoddownloader-200-disponible-2.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] La team Yuzu se prépare pour répondre à l'action de Nintendo",
        "content": "Il fallait s'en douter, la team Yuzu ne va pas se laisser faire et compte bien continuer à proposer son émulateur, et c'est le volet juridique que cela va désormais se passer.\n \nL'équipe vient en effet de répondre aux injonctions de Nintendo en commençant en assurer sa défense, la team Yuzu est accompagné d'un avocat spécialisé dans la résolution de litiges internationaux. \n \n \n \n\n \n \n \n \nMichael Daly est un avocat spécialisé possédant une expérience significative dans les arbitrages internationaux, sa pratique vise à aider ses clients à résoudre des défis transfrontaliers, notamment les plus grandes entreprises et les représentants gouvernementaux. Il conseille actuellement le Centre international pour le règlement des différends relatifs aux investissements (CIRDI), la Chambre de commerce internationale (CCI), la Cour d'arbitrage international de Londres (LCIA) et le tribunal de district des États-Unis.\n \nMichael a auparavant été conseiller juridique au Tribunal des réclamations Iran-États-Unis à La Haye et auprès de Charles N. Brower, ce n'est à priori pas l'avocat du coin de la rue. Bien entendu le risque est tellement grand pour Tropic Haze LLC, l'entreprise qui détient Yuzu, qu'elle se devait de répondre avec une assistance juridique sérieuse. \n \n \n \n\n \n \n \nIl y a urgence, l'ordonnance du tribunal interdit à Tropic Haze de diffuser, commercialiser ou fabriquer l'émulateur Yuzu et oblige l'entreprise à se rendre et à cesser d'utiliser le nom de domaine YUZU-EMU.ORG. Nintendo demande la saisie, la mise en fourrière et la destruction de toutes les copies de l'émulateur Yuzu ou d'autres appareils ou logiciels dans un délai de 30 jours.\n \nTous les documents juridiques sont compilés quotidiennement ici : courtlistener.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187472/in-switch-la-team-yuzu-se-prepare-pour-repondre-a-laction-de-nintendo-1.jpeg",
            "image_2": "https://www.logic-sunrise.com/images/news/1187472/in-switch-la-team-yuzu-se-prepare-pour-repondre-a-laction-de-nintendo-1.png"
        }
    },
    "news_9": {
        "title": "[Series X/S] Flatz a dumpé la rom AMD PSP du CPU 4800s",
        "content": "Le développeur Flatz vient d'annoncer sur X avoir réussi à dumper la Rom AMD PSP de l'APU 4800s d'AMD, bon dit comme ça cela ne signifie pas grand chose. \n \nLa Rom AMD PSP, pour AMD Platform Security Processor, est la partie de l'APU qui jusqu'à présent était inaccessible. Le processeur 4800s est l'APU de PC de bureau qui est utilisé dans les consoles Xbox Series X, nom de code Arden et Sparkman.\n \nPour rappel, l'AMD Secure Processor (AMD-SP) anciennement appelé Platform Security Processor (PSP) est un minuscule coprocesseur microcontrôleur intégré dans les puces d'AMD qui fournit les fonctionnalités nécessaires au management de certains assets à distance, un sous-système dédié à la sécurité et du démarrage sécurisé.\n \n \n\n \n \nAinsi arriver à dumper cette partie de l'APU permet d'en explorer le coeur, le fait d'avoir le dump de la ROM permet de lire son code, mais aussi d'en trouver des failles. Au début il s'est trouvé confronté à un blocage au niveau de l'interface UART, puis à un disfonctionnement du loader PSP qui ne configurait pas la puce SuperIO. Pour cela il a du utiliser une carte mère spécifique de MSI, utilisant la même puce SuperIO, mais le faible volume de documentation technique ne permet pas d'avancer rapidement. \n \nAprès une semaine d'essai, d'utilisation de la force brute, de flash de bios dans lequel il a intégré le payload PSP, puis réussi à faire fonctionner le bus LPC à l'aide de Logic Analyzer, et ainsi il a pu trouver une combinaison de registres/bits qui devaient être basculés pour activer l'UART.\n \n \n\n \n \n \nEnfin, il a appliqué des primitives de lecture/écriture/appel appropriées exécutées via le serveur UART à partir de son payload PSP qui fonctionne en mode SVC.\n \nBien entendu tout cela ne signifie en rien que la Xbox Series X va être craquée, mais cela montre que certains s'intéressent toujours à tenter d'en faire sauter certaines sécurités. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187470/in-series-xs-flatz-a-dumpe-la-rom-amd-psp-du-cpu-4800s-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1187470/in-series-xs-flatz-a-dumpe-la-rom-amd-psp-du-cpu-4800s-2.png"
        }
    },
    "news_10": {
        "title": "[Switch] Strato, l'émulateur Switch qui vaut le coup d'oeil",
        "content": "Comme vous le savez, les équipes en charge du développement de Ryujinx et Yuzu sont désormais dans le viseur des avocats de Nintendo, ce qui menace à long terme les deux solutions, même si les deux teams souhaitent continuer chacune à proposer leur solution software.\n \nLes forks de ces émulateurs sont nombreux, même si pour la plupart cela se limiter à quelques optimisations assez spécifiques, l'un d'entre eux, Strato, sort du lot. \n \n \n \n\n \n \n \nStrato est une solution open-source permettant d'émuler une Nintendo Switch sur Android,  des progrès significatifs ont été effectués récemment. \n \nStrato a été lancé après l'arrêt de Skyline, un précédent émulateur Nintendo Switch™, en mai 2023. Le projet Strato a été créé pour poursuivre le travail de Skyline, en résolvant ses problèmes et en améliorant ses performances et sa compatibilité.\n \n \n \n\n \n \n \nD'ailleurs, l'un des 8 développeurs, Senhor Linguica, montre une vidéo assez impressionnante de Nier : Automata tournant sous Snapdragon 8 Gen 2, de quoi se donner une idée des capacités de Strato en attendant sa sortie vers Juin 2024.\n \nLe site officiel est là : https://strato-emu.github.io/\n \n(edit RomAnOCrY: modif de la news suite au commentaire d'Adrien98)\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2046505681.png"
        }
    },
    "news_11": {
        "title": "[Switch] Le Mig Switch bénéficie d'une mise à jour firmware",
        "content": " \nL'équipe en charge du développement du Mig Switch a dévoilé il y a quelques jours une mise à jour firmware pour leur solution. Le 26 février 2024, le firmware 1.1.0 a été mis en ligne, ce qui d'un côté rassure les utilisateurs et futurs acheteurs car cela faisait quelques semaines que nous n'avions plus de nouvelles sur leur site, et puis cela permet d'améliorer la solution. \n \nDisponible dans la partie \"Download\" de leur site, cette mise à jour vise à améliorer le temps de démarrage des fichiers XCI fragmentés sur une partition formatée en exfat. \n \nCette mise à jour apporte aussi une amélioration sur la détection lors du lancement des ROM. \n \n \n\n \n \nLa Team communique aussi au travers de ce ticket puisqu'elle informe que le design du Mig Dumper a été finalisé, et que sa production a démarré lentement, tout en ajoutant qu'elle laisse de la place au Mig Card. Elle assure qu'elle met tout en oeuvre pour que chacun puisse obtenir ses deux solutions le plus rapidement possible. \n \n \n \nTéléchargement : Firmware 1.1.0 pour le Mig Switch\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187416/in-switch-le-mig-switch-beneficie-dune-mise-a-jour-firmware-1.png"
        }
    },
    "news_12": {
        "title": "[PS3] Nathan Martin travaille sur le CFW Evilnat 4.91 CEX Cobra",
        "content": "Le développeur Nathan Martin nous informe via un tweet qu'il finalise le développement de son nouveau custom firmware basé sur l'OFW 4.91 de Sony.\n \nSon CFW qui portera le nom de CFW Evilnat 4.91 Cex Cobra nécessite encore un peu de temps pour tester si tout fonctionne correctement. Il est fort probable que d'ici quelques jours il soit disponible en privé pour tout une batterie de tests avant de le libérer plus largement au téléchargement. \n \n \n\n \n \nLes CFW sont maintenant moins nombreux, les développeurs ayant désormais arrêtés les développements, ou ont basculés vers la PS4 ou plus récemment la PS5. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2027253783.png"
        }
    },
    "news_13": {
        "title": "[Switch] Nintendo s'attaque aux créateurs de Yuzu",
        "content": "Nintendo vient de déposer plainte contre Tropic Haze LLC, la société a qui appartient Yuzu le célèbre émulateur Switch. Les arguments sont toujours les mêmes, pour Nintendo la solution proposée permet de contourner les protections et de violer le DMCA (Digital Millennium Copyright Act).\n \nSelon Nintendo, l'émulateur engendre le téléchargement illégal des prod.keys, un procédé décrit comme illégal, le développeur principal connu sous le pseudo de \"Bunnei\" est cité et Yuzu apparait comme permettant le \"piratage à une échelle colossale\". \n \nNintendo affirme que \"The Legend of Zelda: Tears of the Kingdom\" a été téléchargé illégalement plus d'un million de fois par semaine avant sa sortie et que de nombreux sites Web ont souligné qu'il pouvait être joué directement sur Yuzu. \n \n \n\n \n \nIdem, les abonnés \"Early Access\" ont doublé depuis la sortie du jeu, preuve du lien entre le jeu et Yuzu. \n \nNintendo impose l'arrêt du développement de Yuzu, la fin de domaines, des comptes des réseaux sociaux et la destruction des disques durs, sans compter bien entendu des dommages et intérêts, qui vont certainement s'élever à plusieurs millions de $.\n \nTout est là : Nintendo-of-America-Inc-v-Tropic-Haze-LLC-1-24-Cv-00082-No-1-D-R-I-Feb-26-2024\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187283/in-switch-nintendo-sattaque-aux-createurs-de-yuzu-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS3] IrisMan et webMAN Mod déjà prêts pour les CFW 4.91",
        "content": "Le développeur Aldo Vargas a déjà réagit à l'arrivée du nouveau firmware de Sony sur PS3 puisqu'il prépare déjà les CFW avec la sortie de la mise à jour de son plugin webMAN Mod pour les CFW 4.91.\n \nwebMAN Mid 1.47.45 a été mis à jour pour apporter le support des CFW 4.91 quand ils seront proposés. \n \nTéléchargement : webMAN Mod\n \n \n \n\n \n \n \n \nIl a profité pour mettre à jour irisMAN lui aussi pour supporter les CFW 4.91, cette mise à jour intègre autant le support des CFW hybrides, la mise à jour Mamba, et la version 7.02 de Movian M7.\n \nTéléchargement : IrisMan 4.91\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1878325690.jpg"
        }
    },
    "news_15": {
        "title": "[PS3] Sony sort le firmware 4.91 pour la PS3",
        "content": "A la surprise générale, Sony vient de mettre en ligne un nouveau firmware pour la PlayStation 3, qui n'a rien demandé, et qui se retrouve une nouvelle fois être mise à jour. \n \nLe firmware 4.91 n'apporte rien de spécial, si ce n'est la mise à jour des clés blu-ray comme d'habitude. \n \n \n \n \n\n \n \n \n \nMise à jour 4.91 du logiciel système PS3\n \nUne mise à jour du logiciel système PS3™ est disponible depuis le 27 février 2024.\n \nPour télécharger la mise à jour, vous devez disposer d'au moins 200 Mo d'espace libre sur le disque dur de votre PS3 (mise à jour système) ou sur un support de stockage amovible (mise à jour PC). \n \nVous devez toujours installer la version la plus récente du logiciel système sur votre système PS3. La mise à jour permet de bénéficier de fonctionnalités supplémentaires, d'une meilleure ergonomie et d'une sécurité renforcée.\n \nRemarque : pour lire des disques Blu-ray, votre système PS3 a besoin d'une nouvelle clé de chiffrement pour le lecteur Blu-ray. Pour renouveler la clé de chiffrement du lecteur Blu-ray, installez la dernière version du logiciel système PS3.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187255/in-ps3-sony-sort-le-firmware-491-pour-la-ps3-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS5] Le HB Store lui aussi a été mis à jour",
        "content": "Le développeur LightningMods a également mis à jour le PS5 HB Store, pour rappel la particularité de ce store est qu'il a été construit en GLES2.\n \n \n\n \n \nL'application a été mise à jour :\n \n- Ajout d'une option pour utiliser les tâches de fond natives de la PS5 (la progression sera affichée dans le menu d'accueil et non dans l'application)\n- Correction d'un problème qui entraînait un décalage de l'application Store s'il y avait moins de 15 articles/PKG.\n- Correction d'un problème qui empêchait la mise à jour fréquente des boutons de la boutique.\n- La section Mises à jour et le compteur de téléchargements in-app continueront d'être désactivés jusqu'à la prochaine mise à jour du site web/backend\n- Diverses corrections de bugs\n \nComme toujours, l'application Store se met à jour automatiquement. Pour obtenir cette nouvelle mise à jour, il suffit de fermer (si elle est déjà ouverte) et de rouvrir l'application Store pour qu'elle se mette à jour. Si vous n'avez pas encore l'application PS5 HB Store, téléchargez-la ici : https://pkg-zone.com/Store-R2-PS5.pkg\n \nPour ceux qui utilisent un CDN local, vous pouvez trouver les fichiers de mise à jour du PS5 Store ici : https://github.com/LightningMods/PS4-Store/releases/tag/4.5\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187196/in-ps5-le-hb-store-lui-aussi-a-ete-mis-a-jour-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS5] etaHEN mis à jour en version 1.7B",
        "content": "Le développeur LightningMods vient de mettre à jour sa solution etaHEN en version 1.7B. Comme vous le savez il s'agit actuellement de la solution à mettre en place pour profiter de la pleine capaicté de votre PS5. Ce plugin est tout simplement similaire à GoldHEN sur PlayStation 4 de SiStr0, il intègre plusieurs fonctionnalités, notamment un serveur FTP, un serveur klog, PS5-kstuff (pour le firmware 4.03 et 4.50) ...\n \n \n\n \n\n \n \netaHEN a été mis à jour à la version 1.7B :\n \n- Ajout d'un service Direct PKG Installer (port 9090)\n- Ajout d'un paramètre pour désactiver le DPI dans /data/etaHEN/config.ini\n \nLe service DPI sera mis à jour à l'avenir pour inclure des fonctionnalités supplémentaires s'il y a suffisamment de soutien.\n \nVous pouvez télécharger la mise à jour du payload ici : etaHEN\n \nA noter que l'outil Remote Package Sender a été mis à jour : ps4-remote-pkg-sender\n \nRemerciements à modded_warfare & à d'autres pour avoir testé et rapporté à quel point cette méthode est plus rapide que les autres.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187185/in-ps5-etahen-mis-a-jour-en-version-17b-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1187185/in-ps5-etahen-mis-a-jour-en-version-17b-1.jpg"
        }
    },
    "news_18": {
        "title": "[Switch/Vita] De nouvelles version de uae4All2 disponible",
        "content": "Le développeur Rsn8887 met à jour Uae4All2 Mod, son portage de l'émulateur Amiga pour la Switch et la PSVita. Ce portage, initialement développé par Cpasjuste pour la PSVita, est désormais disponible sur les deux consoles grâce à ce Mod.\n \n \n\n \n \nChangelog :\n \nVersion 2.10\n \n- Prends en charge le lancement du fichier de configuration par argument en ligne de commande et pour la Nintendo Switch, le fordwarder de RetroArch peut être utilisé ainsi que sur la PsVita un \"générateur\" de bulles personnalisé est fourni. Il utilise la même méthode que DaedalusX.\n \nVersion 2.11 (Bugfix)\n \n- Correction d'un bug sur l'écran tactile de la Nintendo Switch.\n \nTéléchargement : https://github.com/rsn8887/uae4all2/releases\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187172/in-switchvita-de-nouvelles-version-de-uae4all2-disponible-1.jpeg"
        }
    },
    "news_19": {
        "title": "[PS4/PS5] LibHijacker 1.152 disponible",
        "content": "LibHijacker développé par Astrelsky est un outil permettant d’exécuter des applications homebrew sur les consoles PlayStation 4 et 5. Dans sa dernière version, LibHijacker peut lancer des homebrews sous forme de fichiers ELF, et potentiellement même des jeux PS5. Comme vous le savez le code source a été libéré par Astrelsky en Juin dernier, puis repris par SiSTR0, quelques patchs sont mis à jour et cette nouvelle version prend en charge l'activation des correctifs à partir du fichier de configuration et l'ajout d'un titleID supplémentaire à la liste de déverrouillage du framerate dans la version 1.152.\n \n \n\n \n \nPS4 : \n- Batman: Arkham Knight v1.15: 60 FPS\n- Bloodborne v1.09: 60 FPS by Lance McDonald : Notes: You may encounter softlock during Laurence (optional DLC boss) cinematic. Disable patch to progress.\n- Also includes: No Motion Blur / No Chromatic Aberration\n- Burnout Paradise Remastered v1.03 : Skip Logo Videos / Skip First Time Introduction Video\n- Crash Team Racing v1.21: 60 FPS\n- Dragon Age: Inquisition v1.12: 60 FPS\n- Driveclub v1.28: 60 FPS\n- Gravity Rush 2 v1.11: 60 FPS\n- The Order 1886: v1.02: 60 FPS : Notes: Softlocks will occur in Chapter 6 and 9 during Quick Time Events. Disable patch to progress.\n- The Last Guardian v1.03: 4K at 60FPS\n- The Last of Us Remastered 60 FPS + Debug Menu (v1.11)\n- The Last of Us Part 2 60 FPS + Debug Menu (v1.00 + v1.09)\n- Uncharted: The Nathan Drake Collection Debug Menu (v1.00)\n- Uncharted 4: A Thief's End 60 FPS (v1.33)\n- Uncharted: The Lost Legacy 60 FPS (v1.09)\n- Just Cause 4 v1.32: 60 FPS\n- Shadow of the Colossus: 1440p at 60FPS + Debug Menu\n- Silent Hills: P.T at 60FPS\n- Red Dead Redemption 2 v1.29: 60FPS\n- Mafia Definitive Edition v1.04: 60 FPS + Skip logo movies\n \nPS5 : \n- Demon Souls v1.00 : 60 FPS Unlock in Cinematic Mode / Debug Menu\n- Uncharted: Legacy of Thieves Collection v1.00 : Debug Menu\n \n \nPour utiliser LibHijacker, suivez ces étapes :\n- Pendant l’étape de chargement ELF, exécutez send_elf.py avec l’adresse IP de votre PS5 comme premier argument (par exemple, python ./send_elf.py 10.0.6.9).\n- Pour simplifier le développement, vous pouvez arrêter le processus daemon en utilisant kill_daemon.py, puis relancer send_elf.py pour envoyer la nouvelle version de l’exécutable du daemon (cela peut être fait en dehors de la fenêtre du navigateur web ou BDJ).\n \n \nTéléchargement : libhijacker 1.152\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1187136/in-ps4ps5-libhijacker-1152-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS4] bzImages aéolia/belize 5.15.15 compilés en FullLTO et ThinLTO",
        "content": "Hello,\nJe propose des BzImages compatibles en interne/externe pour Ps4 fat/slim/pro aéolia / bélize\nCompilés avec une distribution manjaro linux ps4, paramétrée pour compiler avec ce type de compilation.\nLes bzImages sont déclinés en 2 versions FullLTO ou en ThinLTO\navec 4 types de led ps4 linux\nLes valeurs de benchmark vulkan (vkmark) sont plus haut sur un bzImage compilé en FullLTO\nLes bzImages compilés en ThinLTO sont plus rapides au chargement de Linux, et la distribution est plus réactive.\n-Basé sur une source kernel aeolia/belize de codedwrench\n-Rajouts de divers patchs d'améliorations pour les jeux (dont fsr)\nmore-uarches-for-kernel 5.15-5.16.patch\nprjec_v5.15-r1.patch\n0003-glitched-base.patch\n0003-glitched-base-nonrt.patch\n.patch 0009-glitched-bmq.patch\n.patch 0007-v5.15-futex_waitv.patch\n.patch 0007-v5.15-fsync1_via_futex_waitv.patch\n-Reconnaissance des périphériques au format fat32/ntfs/exfat/ext4\n-Détection manettes :\nwii\nswitch pro controller\n360 filaire\n360 sans fil + adaptateur Microsoft usb/bluetooth spécifique\nps3/ps4 en filaire et bluetooth\n-Partage de connexion internet par téléphone android ou iphone , en usb\n-Reconnaissance des périphériques audio\n-Snap et flatpak fonctionnels sur toutes distributions linux\n-Détection de la webcam ps3 et du kinect 360\n-Bluetooth fonctionnel aussi sur les PS4 ayant le MT7668\nPossibilité d'utiliser un pare-feu\nVidéo de l'apparence des leds sur une ps4 pro avec linux chargé :\n\nVideo de la compilation des bzImages en FullLTO :\n\nVideo de la compilation des bzImages en ThinLTO :\n\nreconnaissance et detection de la webcam ps3 :\nreconnaissance du kinect 360 :\nparefeu activé visible sur la distribution Fedora 39 de DFAUS\nBzImages FullLTO\nps4-linux-5.15.15-aeolia-belize_Full-LTO-LED-goldhttp://e.pc.cd/Uszy6alK\nps4-linux-5.15.15-aeolia-belize_Full-LTO-LED-lavandehttp://e.pc.cd/3ezy6alK\nps4-linux-5.15.15-aeolia-belize_Full-LTO-LED-rose-fushiahttp://e.pc.cd/NHRy6alK\nps4-linux-5.15.15-aeolia-belize_Full-LTO-LED-violettehttp://e.pc.cd/JSvotalK\nBzImages ThinLTO\nps4-linux-5.15.15-aeolia-belize_Thin-LTO-LED-goldhttp://e.pc.cd/Vnzy6alK\nps4-linux-5.15.15-aeolia-belize_Thin-LTO-LED-lavandehttp://e.pc.cd/xszy6alK\nps4-linux-5.15.15-aeolia-belize_Thin-LTO-LED-rose-fushiahttp://e.pc.cd/qpRy6alK\nps4-linux-5.15.15-aeolia-belize_Thin-LTO-LED-violettehttp://e.pc.cd/XYvotalKRemerciements :\ncodedwrench pour les sources 5.15.15 ps4 de son github\nYoshiLightStar pour les .patchs trouvés pour kernel 5.15.15\nBlackdragon pour tous les tests et les videos de l'affichage des leds\nVvSx87 pour les tests sur sa ps4 pro ayant le bluetooth MT7668\n",
        "images": {
            "image_1": "https://sayalinux.free.fr/Release_5.15.15_FullLTO_ThinLTO/reconnaissance_et_detection_webcam_ps3.jpg",
            "image_2": "https://sayalinux.free.fr/Release_5.15.15_FullLTO_ThinLTO/reconnaissance_kinect_360.jpg",
            "image_3": "https://sayalinux.free.fr/Release_5.15.15_FullLTO_ThinLTO/parefeu.jpg"
        }
    }
}