{
    "news_1": {
        "title": "[Switch] UnlockSwitch fait le plein de photos de production",
        "content": "La Team UnlockSwitch dévoile de nombreuses photos de la production de la première version du UnlockSwitch au PCB de couleur violette. \n \nCette révision violette intègre la correction du port du programmateur, il s'agit de la version finale du PCB (V5R1) pour le UnlockSwitch PBS (PURPLE EDITION).\n \n \n \n\n \n\n \n\n\n \n \nCe n'est pas tout, la team dévoile aussi des images de la production, des photos des machine qui réalisent les PCB. \n \n \n\n \n\n \n\n \nElle rajoute à la publication de ces nouvelles photos : Nous avons connu des retards dus à la fragilité du câble entre le UnlockSwitch et son programmateur, mais nous sommes satisfaits du résultat. Il est désormais plus robuste et nous commencerons les tests de programmation cette semaine.\"\n \n\n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-5.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-6.jpg",
            "image_7": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-7.jpg",
            "image_8": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-8.jpg",
            "image_9": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-9.jpg"
        }
    },
    "news_2": {
        "title": "[Switch] MigSwitch précise pourquoi avoir intégré un bouton très fin",
        "content": "La Team Mig Switch a posté un nouveau message sur son site internet, elle a souhaité apporter une clarification sur l'utilisation des boutons de la v2 de son linker, celle qui dispose d'un bouton permettant de changer les jeux sans devoir retirer et réinsérer le linker du slot de jeux. \n \nAvec les retours que l'équipe a reçu des premiers utilisateurs de la Mig Card V2, l'équipe a voulu clarifier quelque chose concernant le bouton de changement de jeu. Lors de la conception de la V2, l'équipe a volontairement intégré un bouton fin car, comme vous pouvez le voir dans la vidéo ci-dessous, il est destiné à être également utilisé avec le couvercle de la fente du slot de carte de jeu fermé.\n \nLa Team Mig Switch a pensé plus pratique de pouvoir fermé le slot jeux, et ne plus avoir besoin de l'ouvrir une fois vos jeux installé dans la microSD, selon la team c'est tout simplement plus propre et plus beau. Bien entendu, elle précise que vous pouvez également l'utiliser l'emplacement pour carte de jeu ouvert, mais cela n'est plus nécessaire avec cette V2 contrairement à la V1 qui nécessite la fameuse manipulation pour changer de titre. \n \n \n \n\n \n \n",
        "images": {}
    },
    "news_3": {
        "title": "[Multi] PS Multi Tools v14.3 disponible",
        "content": " \nLe développeur SvenGDK a retravaillé PS Multi Tools et propose désormais la v14.3. Comme vous le savez probablement cet utilitaire s'adresse à tout ceux qui dispose d'une console Sony, de la PSP à la PS5 en passant par toutes les générations. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n\n \n \nChangelog 14.3 : \n \nGénéral :\n- Changement de la couleur d'arrière-plan du thème sombre de #FF252525 à #2D2D30 pour toutes les fenêtres\n- Suppression des paquets NuGet inutilisés\n- Mise à jour de FluentFTP 50.0 -> 50.1\n- Mise à jour de WinSCPNet 1.15.0.14890 -> 1.15.0.14955\n- Mise à jour Microsoft.Web.WebView2 1.0.2535.41 -> 1.0.2592.51\n- Utilisation des listes principales PS1IDs & PS2IDs intégrées pour obtenir le titre du jeu si aucune information ne peut être trouvée sur PSXDatacenter.\n \nPS1 :\n- Les jeux au format VCD peuvent désormais être chargés dans la bibliothèque de jeux PS1.\n- Nouvelle option de menu contextuel dans la bibliothèque de jeux PS1 pour créer un projet de jeu PS1 pour la PSX\n \nPS2 :\n- Nouvelle interface graphique CUE2POPS\n- Convertit les jeux PS1 au format VCD pour les utiliser avec POPStarter\n- Nouveau GUI ELF2KELF\n- Convertit les fichiers ELF homebrew au format KELF (HDDOSD, PSBBN, PSX XMB)\n- Nouvelle option de menu contextuel dans la bibliothèque de jeux PS2 pour créer un projet de jeu PS2 pour la PSX\n \nPSX Tools Integration :\n- Ajout de PSX Tools à partir de PSX XMB Manager avec des changements mineurs\n- L'utilisation de PSX Tools nécessite un accès administrateur pour connecter les disques durs via NBD.\n- Vous serez invité à redémarrer PS Multi Tools en tant qu'administrateur.\n \n \n\n \n \nCaractéristiques de PSX Tools :\n- Installer des homebrew et des jeux PS2 sur le disque dur interne de la PSX\n- Installer des jeux PS1 sur le disque dur interne du PSX\n- Gestionnaire de partitions du disque dur (créer une partition, supprimer une partition (destructive), modifier la visibilité d'une partition)\n- Explorateur de fichiers XMB (Outils XMB)\n- Ouvrir un dossier _system ou xosd pour charger, visualiser et modifier son contenu\n- Éditeur de texte pour les fichiers .xml et .dic avec mise en évidence de la syntaxe\n- Traduire automatiquement les fichiers .dic et .xml dans la plupart des langues\n- L'aide et plus d'informations sont disponibles ici https://github.com/SvenGDK/PSX-XMB-Manager\n \nPS4 :\n- Mise à jour de PPPwn C++ avec les derniers changements (16/06/2024)\n- Ajout des fichiers SiSTRo/GoldHEN stage1 & stage2 pour FW 9.50 / 9.51 / 9.60\n- Mise à jour de GoldHEN inclus à v2.4b17.3\n- Vous pouvez toujours obtenir la dernière version en cliquant sur \"Télécharger la dernière version de GoldHEN sur une clé USB\" si celle qui se trouve dans PS Multi Tools est obsolète.\n \n \nTéléchargement : PS Multi Tools v14.3\n \n \n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192451/in-multi-ps-multi-tools-v143-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1192451/in-multi-ps-multi-tools-v143-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[PS4/PS5] Un nouvel exploit webkit qui pourrait impacter le 11.02 (PS4) et 8.60 (PS5)",
        "content": "Le développeur Zecoxao a publié un fichier PoC (preuve de de concept) pour une toute nouvelle vulnérabilité qui affecterait les firmwares du 10.00 au 11.02 sur la PS4, et du firmware 6.00 au 8.60 sur la PS5, on serait donc sur un exploit webkit plutôt intéressant, reste à voir ce qu'il va être possible de faire avec. \n \nInitialement, cette vulnérabilité du webkit a été signalée par Kameleon pour la scène PlayStation, mais nous apprenons que cette faille a été corrigée sur Safari.\n \n \n\n \n \n \nPour tester la faille : \n \nhttps://zecoxao.github.io/cve/index.html\n \nLa faille est expliquée ici : \n \nhttps://medium.com/@enki-techblog/ios-16-5-1-safari-rce-analysis-cve-2023-37450-89bb8583bebc\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192448/in-ps4ps5-un-nouvel-exploit-webkit-qui-pourrait-impacter-le-1102-ps4-et-860-ps5-1.jpg"
        }
    },
    "news_5": {
        "title": "[2DS/3DS] Luma3DS v13.1.2 disponible",
        "content": " \nLe développeur TuxSH a déployé une nouvelle version de Luma3DS, il a mis en ligne la version 13.1.2 du moyen CFW pour la Nintendo 3DS. Comme vous le savez Luma3DS est le CFW indispensable pour les 3DS et 2DS et l'arrivée d'une nouvelle version est toujours intéressante à suivre. \n \nLuma3DS apporte des améliorations dans les paramètres des langues de jeux, le débogage amélioré pour les développeurs, ou encore le déverrouillage de région, cette nouvelle version 13.1.2 apporte de nouvelles fonctionnalités, et vient corriger le problème de démarrage automatique après avoir laissé enfoncé le bouton power trop longtemps. \n \n \n\n \n \nAvec cette nouvelle version, les captures en mode 800 pixels sont désormais restitués en 800 x 480, ce qui rend une image plus fidèle avec une mise à l'échelle entière sur l'axe Y.\n \nDes petites améliorations sur la stabilité système ou l'expérience utilisateur ont été apportées également à cette version, même si clairement nous ne savons pas dans le changelog de quoi il s'agit. \n \nChangelog v13.1.2 :\n \n- Correction de l'autoboot homebrew bloqué dans une exception au démarrage après que le bouton POWER ait été maintenu trop longtemps.\n- Captures d'écran : en mode 800px, produire des images 800x480 avec le bon rapport hauteur/largeur au lieu de 800x240 pour une sortie plus fidèle (en utilisant l'échelle entière sur l'axe Y).\n- D'autres améliorations de la stabilité générale du système et d'autres ajustements mineurs ont été apportés pour améliorer l'expérience de l'utilisateur.\n \nTéléchargement : Luma3DS v13.1.2\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192445/in-2ds3ds-luma3ds-v1312-disponible-1.jpg"
        }
    },
    "news_6": {
        "title": "[PS4] PPPwnUI 3.20 moddé par aldostools",
        "content": " \nLe développeur Aldo Vargas, alias Aldostools, semble s'intéresser à la scène PlayStation 4, il nous a davantage habitué à travailler sur PS3, mais depuis quelques semaines il livre un fork de PPPwnUI à l'origine proposé par Memz qu'il est venu modder avec ses propres intégrations ou bien il compile une version avec les dernières nouveautés disponibles dans ce domaine. \n \nPPPwnUI est un programme réalisé en Python qui ajoute une interface utilisateur à l'exploit PPPwn créé par TheFlow, la version moddée par Aldostools ajoute de nombreux éléments, cette version 3.20 apporte encore plus d'options. \n \n \n \n\n \n \nIl a ainsi rajouté les derniers payloads disponibles, les dernières versions de PPPwn compatible IPv6, comme le USB BinLoader / NOBD stage2 8.00 & 8.01 de StretchEcho & LightningMods, ou encore les dernières mises à jour des payloads PS4-HEN-VTX-PPPwn de StretchEcho & BestPig.\n \nDans la version 3.20 qu'il vient tout juste de mettre en ligne, il présente une nouvelle interface graphique, les derniers payloads Linux pour le firmware 11.00 de EinTim23.\n \n \nChangelog PPPwnUI 3.20 moddé par aldostools :\n \n- Nouvelle présentation de l'interface graphique\n- Suppression de l'étape 1 dupliquée\n- Inclut les dernières charges utiles PS4-HEN-PPPwn-VTX par EchoStretch & BestPig\n- Inclut la dernière version de l'étape 2 avec USB Loader (normal & NOBD) par LightningMods\n- Inclut les dernières versions de GoldHEN 2.4b17.3 & GoldHEN Lite 1.0 pour 9.00 par SiSTR0\n- Inclut les dernièrs payloads Linux pour le firmware 11.00 par EinTim23\n- Inclut le dernier payload PPPwn par TheFlow0 compatible avec une adresse IPv6 qui fonctionne sur toutes les PS4\n- Comprend un pack de payloads supplémentaires par LightningMods\n \nCaractéristiques :\n \n- Se souvient des dernières options sélectionnées\n- Option de démarrage automatique de PPPwn lorsque l'interface graphique est lancée\n- Option d'auto-rétention en cas d'échec\n- Script python multiplateforme\n- Possibilité d'utiliser des étapes 1 et 2 personnalisées\n- Logo personnalisable 580x50\n \n \nTéléchargement : PPPwnUI 3.20 moddée par aldostools\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192395/in-ps4-pppwnui-320-modde-par-aldostools-1.png"
        }
    },
    "news_7": {
        "title": "[Switch] UnlockSwitch a détecté une fragilité sur les ports utilisés",
        "content": "L'équipe UnlockSwitch vient d'informer via un post qu'après des tests approfondis internes, elle a identifié des problèmes de fragilité à long terme avec les ports entre le UnlockSwitch et le programmeur. En conséquence, elle a décidé de ne pas utiliser cette version pour les samples et commencera les tests avec vous sur une version mise à jour. \n \n \n\n \n \nEn conséquence, le port a déjà été modifié et la production de cette version finale débutera ce lundi. L'équipe rappelle qu'elle n'a aucunement l'intention de se précipiter pour fournir son produit, elle dit la même chose depuis le début sur ce point, ne s'engageant sur aucune date de disponibilité de leur produit final.\n \n \n\n \n \nLa team UnlockSwitch accorde la priorité à une vérification approfondie avant de tester avec des samples, elle rappelle qu'elle n'a pas l'intention de précipiter le lancement d’un produit inachevé. Concernant le logiciel, il reste en développement et sera présenté une fois que chacun aura reçu ses échantillons.\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192393/in-switch-unlockswitch-a-detecte-une-fragilite-sur-les-ports-utilises-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1192393/in-switch-unlockswitch-a-detecte-une-fragilite-sur-les-ports-utilises-2.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] Libnx 4.7.0 disponible",
        "content": "L'équipe en charge du développement de Libnx propose une nouvelle version de leur bibliothèque, Libnx est une bibliothèque essentielle pour les développeurs qui facilitent le développeur des homebrews sur la dernière console de Nintendo. \n \nDans cette nouvelle version, il y a des changements opérés par Masagrator, DarkMatterCore, SciresM, EpicUsername, ou encore Averne, nous connaissons quelques uns des développeurs qui ont donc contribués à cette nouvelle mouture, corrigeant ici et là des bugs et apportant notamment le support du firmware 18.0.0.\n \n\n \nQu'est ce qui a changé ?\n \n- Mise à jour de SetSysProductModel_Aula suite au commentaire de Masagrator  \n- Implementation FS \"ChallengeCardExistence\" and \"GetGameCardDeviceCertificate\" by @EpicUsername12\n- Correction sur nvchannel SET_CLK_RATE, implementation de GET_CLK_RATE et SET_SUBMIT_TIMEOUT de Averne \n- Le rajout de la commande fs: add GetFileSystemAttribute de DarkMatterCore\n- Le support basique du firmware 18.0.0 par SciresM \n \nNouveau contributeur :\n \n- Remerciement à EpicUsername12 pour sa première contribution \n \n \nTéléchargement :  Libnx 4.7.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192377/in-switch-libnx-470-disponible-1.jpg"
        }
    },
    "news_9": {
        "title": "[WiiU] ISFShax v4.0 et son programme d'installation ISFShax v2.0",
        "content": "Une mise à jour de ISFShax vient d'être mis en ligne, il s'agit de la V4.0 comme vous le savez cet exploit se destine à la Nintendo Wii U. C’est un exploit coldboot qui permet d’exécuter du code personnalisé dès le démarrage de la console Wii U. Pour rappel Cet exploit ISFShax s'appuie lui sur le boot1 avec un superblock ISFS (le système de fichiers du SLC) spécialement conçu. Une fois installé, ISFShax offre des fonctionnalités similaires à de_fuse.\n \nIl se lance avant IOSU, ce qui permet d’appliquer des correctifs à IOSU et de réparer la plupart des bricks. Cependant, il ne protège pas contre les bricks causées par la rupture de boot1, les bricks seeprom ou l’installation d’un superblock ISFShax défectueux, c'est pourquoi comme toujours, il est recommandé de se pas se lancer dans la manipulation si vous ne maitrisez pas le sujet parfaitement. De toute façon vous l'aurez compris, ISFShax ne vous aidera pas non plus si vous avez déjà briqué la Wii U.\n \n \n\n \n \nEn résumé ISFShax permet :\n \n- Reconstruction / mise à niveau du MLC.\n- Suppression de la limite de 64 Go du MLC et désactivation du SCFM.\n- Protection contre les bricks (par exemple, avant de changer de région).\n- Coldboot redNAND (utile lorsque l’eMMC est défaillant).\n- Il offre un CFW minimal, qui peut lancer d’anciens homebrews à l’aide du homebrew launcher (bien que nous ayons maintenant Aroma et Tiramisu).\n \nChangelog d'ISFSHax 4.0 :\n- Mettre à jour le code d'actualisation pour mieux prendre en charge les SLC usés\n- Signaler l'état d'ISFShax à la minute près\n \nChangelog du programme d'installation d'ISFSHax 2.0 :\n- Correction de l'ECC\n- Prise en charge d'ISSFShax v4.0\n \n \nTéléchargement : isfshax 4.0 / isfshax_installer 2.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192351/in-wiiu-isfshax-v40-et-son-programme-dinstallation-isfshax-v20-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS3] WebMAN Mod vient d'être mis à jour par Aldo Vargas",
        "content": " \nLe développeur Aldo Vargas, alias Aldostools, vient de mettre à jour son plugin webMAN Mod en version v1.47.46f, un petit coup de jeune à l'un des outils les plus célèbres de la scène PlayStation 3. \n \nwebMAN est un plugin développé par Deank qui permet de lancer des backups de jeux PS3, PS2, PS1, PSP ainsi que des Blu-ray ou des DVD, stocké sur disque dur (y compris en NTFS) ou sur le réseau local, au format JB ou ISO. M@tsumot0 et Aldostools ont proposé une version MOD de webMan, apportant notamment le support de 21 langages utilisant des fichiers externes, un installer/updater pour CFW Cobra et NonCobra, le spoof IDPS/PSID, la désactivation des syscalls du cfw, et de nombreuses autres évolutions qui se sont succédées.\n \n \n \n\n \n \nComme il le précise dans son post d'hier sur Twitter.com, cette nouvelle version 1.47.46f apporte : \n \n \n- Remplacement de \"Reload XMB\" par la méthode de déconnexion de l'utilisateur par LuanTeles\n- Ajout de l'attente et de la prise en charge des commandes multi-pad en un seul call sur /pad.ps3\n \npar exemple 0/xmb.ps3$focus_category+user;/pad.ps3?cross|1|cross|5|cross\n \n \n\n \n \nCette nouvelle version 1.47.46f est proposée directement en PKG sur github. \n \nTéléchargement : WebMAN Mod 1.47.46f\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192322/in-ps3-webman-mod-vient-detre-mis-a-jour-par-aldo-vargas-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1192322/in-ps3-webman-mod-vient-detre-mis-a-jour-par-aldo-vargas-2.png"
        }
    },
    "news_11": {
        "title": "[3DS] Anemone3DS Theme Manager v3.0.1 disponible",
        "content": " \nEnviron un mois après la bêta, les développeurs d'Anemone3DS ont publié la version complète d'Anemone3DS v3.0.0 puis un petit correctif amenant la v3.0.1 . Il s'agit ni plus ni moins de la première version majeure d'Anemone3DS depuis environ 6 ans ! Sans plus attendre, entrons dans le détail de cette nouvelle version.\n \nPour rappel, Anemone3DS est un gestionnaire de thèmes et de splashs screens (les écrans de démarrages) développé par astronautlevel2, il permet la prise en charge de l'installation d'un seul thème sur votre 3DS jusqu'à 10 thèmes aléatoires. Il vous propose un effet de prévisualisation de vos thèmes avant leur installation et le support d'installation pour les boot splashs (uniquement sous Luma3DS).\n \n \n\n \n \nCorrections de bugs :\n- Correction de diverses erreurs lors du téléchargement de thèmes via le lecteur de code QR\n- Correction d'un bug avec les fichiers dont le nom contient * (par @Zemogiter)\n- Correction de bugs avec les noms de fichiers Unicode\n- Autorise x-zip-compressed à être un type Mime valide\n- Désactivation du bouton \"home\" après l'installation du thème ; ceci a été considéré comme étant à l'origine d'un certain nombre de problèmes de corruption\n- L'échec d'une recherche dans le navigateur ThemePlaza renvoie désormais correctement à la page précédente, au lieu de bloquer le navigateur dans un état de blocage.\n- Correction de plusieurs bogues liés au défilement et au saut.\n \nNouvelles fonctions :\n- Prise en charge complète des badges ! Anemone3DS supporte maintenant l'installation de badges, avec des sets personnalisés et des icônes de set. De plus, il est possible de supprimer des badges, en conservant le set dont ils sont issus et en supprimant également l'icône du set. Pour plus d'informations, consultez notre wiki.\n- Cadre de traduction permettant d'afficher Anemone3DS dans votre langue maternelle ! Actuellement, seuls l'espagnol, le portugais et le français sont présents, mais nous acceptons les PR pour d'autres langues - n'hésitez pas à m'envoyer un message ou à me pinger sur les discords ThemePlaza ou Nintendo Homebrew si vous voulez des instructions !\n- Traduction française ajoutée par @cooolgamer\n- Ajout de la traduction en portugais par @iveurne\n- Ajout de la traduction espagnole par @Tristanabs, Angelpro09, et @Gatokun\n- Ajout du fallback libcurl pour qu'Anemone puisse scanner les QR Codes depuis n'importe où - pas seulement les sites web HTTP.\n- Ajout du BCSTM Player pour les prévisualisations de thèmes, ce qui signifie qu'Anemone3DS devrait maintenant représenter plus précisément ce qui sera joué dans le menu d'accueil, et permettre des tests plus faciles avec des outils comme Kame Editor qui ne produisent pas de fichier ogg de prévisualisation.\n- Prise en charge des systèmes régionaux coréens à l'aide du patch du menu d'accueil (merci à @cooolgamer)\n- Assemblage d'un aperçu de l'écran d'accueil si aucun n'a été trouvé (merci à @Jan200101)\n- Amélioration significative des performances, en particulier lors du défilement entre plusieurs thèmes\n- Nouvelle interface utilisateur qui devrait être à la fois plus intuitive (plus de combinaisons de boutons !) et plus conviviale pour les écrans tactiles\n- Respect du contrôle parental qui bloque l'utilisateur hors du navigateur et exige un code PIN pour l'accès si cette restriction est activée.\n- Avertissement de l'utilisateur de l'installation d'un thème avec un son mono - cela peut causer de nombreux problèmes audio avec le menu d'accueil.\n \nCorrectif de la v3.0.1 : \n- Le dump des badges contenant des caractères illégaux fonctionne désormais comme prévu\n- L'installation de badges avec plus de deux sous-dossiers fonctionne désormais comme prévu.\n- Sauvegarde automatique des données extdata des badges lors de la première installation des badges\n \nTéléchargement : Anemone3DS v3.0.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192270/in-3ds-anemone3ds-theme-manager-v301-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[PS3] RPCS3 apporte des corrections importantes sur la précision",
        "content": " \nL'équipe en charge du développement de l'émulateur RPCS3 est de retour avec la version RPCS3 v0.0.31-16347, cette nouvelle version fait la part belle à de grandes corrections faisant de l'émulateur confirmant qu'il s'agit du meilleur émulateur PS3 actuellement et pour longtemps. \n \nL'équipe nous informe qu'elle a apporté de nombreux correctifs sur la précision de restitution, et les problèmes graphiques liés au RSX Rop ont été résolu dans plusieurs jeux, et ceci grâce au développeur kd-11. Cela permet également de corriger certains problèmes de rendu avec le moteur 3D PS3 de Insomniac. Le feuillage dans Ratchet & Clank : A crack in Time est beaucoup mieux restitué.\n \n \n\n \n\n \n \nDepuis la team RPCS3 a mis en ligne la version 0.0.32-16614 qui vise elle aussi a corriger des problèmes de buffer SPU.\n \n \nTéléchargement : rpcs3.net\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192268/in-ps3-rpcs3-apporte-des-corrections-importantes-sur-la-precision-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1192268/in-ps3-rpcs3-apporte-des-corrections-importantes-sur-la-precision-2.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] Les clones du Mig Switch se multiplient comme des petits pains",
        "content": "Après le Mig Diy, qui est une copie de la V1 du Mig Switch, voilà désormais que débarque le Mig X, lui aussi une copie de la copie, ou tout simplement une nouvelle version du Mig Switch car le Mig X est même livré avec une carte de visite Mig Switch. Cela pourrait être tout simplement du rebranding du Mig Switch ou bien une manière de se libérer des veilles versions v1 qui ne seront bientôt plus vendables.\n \n \n\n \n \nLa carte de visite intègre aussi un QR Code qui renvoie vers un lien vers leur site cloud baidu cloud, elle est certainement destinée aux revendeurs du marché chinois, c'est là aussi la preuve que nous sommes sur une vraie fausse copie. \n \n \n\n \n \nCertains prétendent que les MigDIY, MigX et MigSwitch sont tous de la même origine, il se pourrait que cela soit aussi les usines chinoises qui copient directement la solution de Mig Switch, sur des PCB différents pour tenter d'éviter le scandale qui arrivera tôt ou tard. \n \nUne vidéo du MigDIY\n \n\n \n \nDes photos du MigDIY et du Mig X\n \n \n\n \n\n \n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192258/in-switch-les-clones-du-mig-switch-se-multiplient-comme-des-petits-pains-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1192258/in-switch-les-clones-du-mig-switch-se-multiplient-comme-des-petits-pains-1.jpeg",
            "image_3": "https://www.logic-sunrise.com/images/news/1192258/in-switch-les-clones-du-mig-switch-se-multiplient-comme-des-petits-pains-1.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1192258/in-switch-les-clones-du-mig-switch-se-multiplient-comme-des-petits-pains-2.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-1720431526.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-533318468.jpg"
        }
    },
    "news_14": {
        "title": "[PS4] TheFlow a apporté le support de l'IPv6 à PPPwn et ça change tout",
        "content": " \nLe développeur TheFlow continue de faire évoluer la scène PlayStation comme il l'a toujours fait, il prouve une nouvelle fois ses talents de chercheur en sécurité informatique en améliorant encore l'exploit PPPwn, le rendant désormais plus stable et compatible avec les adresses IPv6. Cela n'a l'air de rien mais cela change quasiment tout. \n \n \n\n \n \nLe support de l'IPv6 permet d'élargir le support de PPPwn à des firmwares et des appareils beaucoup plus nombreux, comme les firmwares 7.00, mais en plus cela implique davantage de réussite de l'exploit. La compatibilité est donc élargie à tous les \"anciens firmwares\" de la série 7.00, 7.01, 7.02, 7.50, 7.51, 7.55, mais aussi tous les 8.00 et 9.00. \n \nFirmware supporté désormais par PPPwn :\n \n- FW 7.00 / 7.01 / 7.02\n- FW 7.50 / 7.51 / 7.55\n- FW 8.00 / 8.01 / 8.03\n- FW 8.50 / 8.52\n- FW 9.00\n- FW 9.03 / 9.04\n- FW 9.50 / 9.51 / 9.60\n- FW 10.00 / 10.01\n- FW 10.50 / 10.70 / 10.71\n- FW 11.00\n \nBien entendu l'exploit PPPwn étant modifié, tous les développeurs qui proposent des outils liés à PPPwn doivent mettre à jour leur solution afin d'apporter le support de ces nouveaux firmwares. \n \nTéléchargement : PPPwn\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192213/in-ps4-theflow-a-apporte-le-support-de-lipv6-a-pppwn-et-ca-change-tout-1.png"
        }
    },
    "news_15": {
        "title": "[PS5] Zecoxao propose sa version personnalisée de FTPS5",
        "content": " \nLe développeur Zecoxao a informé il y a quelques jours qu'il commençait le développement d'une version personnalisée de FTPS5, il s'est appuyé sur le travail avec l'un de ces amis, un fork de PS5FTP de Sistro avec la fonctionnalité de SpecterDev pour décrypter les SELF à la volée qu'il a nommé PS5FTP.\n \nCette facture de décryptage à la volée est similaire au fonctionnement de la version PS4 de ce même payload FTPPS4, il y a quelques modifications de structures entre la PS4 et la PS5 notamment sur les tailles. Cette fonction permet de décoder automatiquement les fichiers SELF.\n \n \n\n \n \nIl y a eu quelques buids de proposées, et des modifications sont apportées ces dernières heures. \n \n \nTéléchargement : PS5FTP\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192209/in-ps5-zecoxao-propose-sa-version-personnalisee-de-ftps5-1.png"
        }
    },
    "news_16": {
        "title": "[Switch] LinageOS 21 (Android 14) porté sur la Nintendo Switch",
        "content": "L'équipe SwitchRoot vient de mettre en ligne la version officielle de LinageOS 21 basée sur Android 14 pour la Nintendo Switch. L'équipe a mis en avant l'intégralité de ces travaux sur Xdaforums. La solution d'adresse autant à la Nintendo Switch v1/v2/Lite ou encore OLED.\n \n\n \n \nIl existe la version habituelle pour tablette et Android TV ainsi que des variantes avec applications Google intégrées et goodies Google Pixel . Si vous préférez tout faire vous-même : les seules GApp supportées sont celles de « MindTheGapps ». Comme toujours, Android n'est pas \"installé\" sur la Switch, mais sur la carte SD et vous pouvez à tout moment basculer entre le système normal et Android.\n \n \nTout est là : xdaforums.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192206/in-switch-linageos-21-android-14-porte-sur-la-nintendo-switch-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] PPPwnUI Version 4.0 Disponnible",
        "content": "PPPwnUI est un programme disponible sur Windows et Linux qui ajoute une UI (Interface Utilisateur) pour l'exploit de TheFlow : PPPwn\n \n \nChangelog: \n\n- Ajout de PPPwn_Go par BestPig\n- Mise à jour de Goldhen en v2.4b17.3\n- Ajout des Payloads VTX HEN par BestPig & EchoStretch (Disponibles pour les firmwares 8.00, 8.03, 8.50, 8.52, 9.03, 9.04, 10.00, 10.01, 10.50, 10.70, 10.71 & 11.00)\n- Ajout des Payloads PS4 Linux 11.00 (Merci Eintim !)\n- La dernière sélection de l'utilisateur est maintenant sauvegardée (Merci Aldostools !)\n- Légère modification du menu Custom\n- Suppression de fichiers inutilisés\n \n\n \n \n\n \n \nTéléchargement : PPPwnUI V4.0\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192194/in-ps4-pppwnui-version-40-disponnible-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] TheFlow dévoile son exploit PS Portal avec les firmwares inférieurs au 2.06",
        "content": " \nLe développeur TheFlow vient de dévoiler un hack pour la PlayStation Portal, il vient en effet de mettre en ligne un fichier, un hack qui avait déjà été annoncé en Février dernier. Cette faille dévoilée à Sony a été corrigé à partir du firmware 2.06, ce qui signifie qu'il vous faudra une console disposant d'un firmware inférieur pour en profiter. \n \nCet exploit se base sur une faille dans le décodeur HEVC, utilisé pour streamer de la PS5 à la PlayStation Portal. En février, TheFlow avait prouvé son exploit en exécutant l'émulateur PSP nommé PPSSPP sur la PlayStation Portal.\n \nLe Poc publié ne montre qu'une partie de l'exploit, ne permettant pas de réaliser l'ensemble des capacités de la Toolchain que TheFlow a réussi à trouver, notamment parce que d'autres failles et exploits sont nécessaires, notamment dans le Soc Qualcomm.\n \n \n \n\n \n \nLe décodeur HEVC utilisé dans Remote Play du PlayStation Portal ne valide pas la longueur des éléments copiés dans un tableau. Cela entraîne une écriture hors limites sur la pile et peut conduire à un RCE.\n \nUn utilisateur capable d'exécuter ce débordement de tampon peut modifier le portail PlayStation pour exécuter du code arbitraire. Cela affecte le portail PlayStation et tous les autres clients de lecture à distance iOS, Android, Windows et MacOS.\n \n \nTheFlow ne semble pas vouloir pour le moment trop pousser l'analyse, il semble que ses propres intérêts avec Google le freine, mais il semble vouloir proposer quelques éléments plus conviviaux. \n \nTout est là : twitter.com/theflow0/\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192187/in-ps5-theflow-devoile-son-exploit-ps-portal-avec-les-firmwares-inferieurs-au-206-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] EzPPPwn v1.20",
        "content": "L’application EzPPPwn se met à jour en version 1.20. C'est programme Windows basé sur PPPwn qui vise à réduire les dépendances environnementales nécessaires à l'exécution de PPPwn et à implémenter le RCE de la manière la plus simple possible.\nL'application contrôle désamarrage que les pré-requis sont bien installés (sinon il proposera de les installer), ainsi que la configuration (si elle n'est pas complète alors il vous demandera de la compléter)\n \n\n\n\n\nChangeLog :\n- Design revue (Ajout image GitHub + lien).\n- Ajout d'une vérification au démarrage si une mise à jour est disponible.\n- Ajout d'un bouton pour mettre à jour l'application si une mise à jour est disponible.\n\n\n\n\n\n\n\nTéléchargement : EzPPPwnV1.20\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192178/in-ps4-ezpppwn-v120-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1192178/in-ps4-ezpppwn-v120-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1192178/in-ps4-ezpppwn-v120-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1192178/in-ps4-ezpppwn-v120-4.png"
        }
    },
    "news_20": {
        "title": "[PS4] Ez Payload Sender V1.00",
        "content": "Ez Payload Sender v1.00\n\n \nChangelog\n  \n\n- Réécriture du code.\n- Check la validité de l'adresse Ip  et du Port.\n- Ajout config (la config est sauvegardée et chargée au démarrage, plus besoin de devoir rentrer les paramètres à chaque fois sauf si vous devez changer quelques choses).\n- Nettoyage.\n- Code réorganisé.\n- Suppression du bouton Connect ( Il se connecte quand vous cliquer sur Send ).\n- Ajouter d'un bouton Cancel.\n- Ajout de la vérification d'une update disponible au démarrage et installation.\n- Ajout d'un bouton Update\n\n# Config\n- Le Port par defaut Port est 9090.\n \n# Screenshots\n \n# Démarrage\n\n \nTéléchargement : EzPayloadSenderV1.00\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192177/in-ps4-ez-payload-sender-v100-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1192177/in-ps4-ez-payload-sender-v100-2.png"
        }
    }
}