{
    "news_1": {
        "title": "[PS5] Le writeup de sleirsgoevy sur son hack",
        "content": " \nLe développeur sleirsgoevy vient de mettre en ligne un énorme writeup sur le hack utilisé sur le firmware 4.03, un writeup c'est un résumé de tout ce qu'il faut comprendre pour arriver au même résultat que le code. Pour bien comprendre, le writeup permet si les bons offsets sont trouvés, de porter sur d'autres firmwares les possibilités offertes. \n \nC'est un travail impressionnant, notamment parce que le hacker a dû trouver des décalages de fonctions spécifiques à détourner, bien que le noyau PS5 soit XOM (eXecute Only Memory). Dans un long article, le développeur explique comment il a fait cela et comment cela pourrait être reproduit sur d'autres firmwares.\n \nIl aura fallu plusieurs mois à Sleirsgoevy pour comprendre le fonctionnement du firmware 4.03, il est clair que porter ces possibilités sur d'autres firmwares ne se fera pas en claquant des doigts. Sleirsgoevy ne dispose pas de 20 PS5, et il est probable qu'il n'en dispose que d'une sous firmware 4.03, le portage ne sera possible qu'avec l'appui d'autres développeurs. \n \n \nVoici les principales catégories de compensations :\n \n- Décalages de données du noyau, ceux-ci peuvent être trouvés à partir de vidages de données qui ne sont pas protégés par XOM\n- Décalages de texte du noyau indiqués par les données du noyau\ndoreti_iret offset (c'est un offset, mais il mérite son propre mot)\n- Décalages trouvés à partir d'une seule étape des fonctions du noyau\n- Compensations trouvées dans les journaux ps5-kstuff (appelés « parasites » dans la source)\n- Décalages des données du noyau\n \nCeux-ci inclus:\n \n- Décalage IDT (recherchez quelque chose qui ressemble à un pointeur et se trouve au décalage 2 mod 8)\n- Décalage TSS (par processeur, tableau)\n- Décalage PCPU (par processeur, tableau. Il s'agit de la base GS du noyau)\n- sysentvecs (natif et PS4, recherchez les xréfs des chaînes « Native SELF » et « PS4 SELF »)\n- crypt_singleton_array (celui-ci n'a pas été trouvé dans le dump)\n- Décalages de texte du noyau indiqués par les données du noyau\n \nCette catégorie contient principalement des gestionnaires d'interruptions, qui peuvent être recherchés dans l'IDT dumpé. Pour ps5-kstuff, deux d'entre eux sont importants : Xinvtlb (nom officiel de FreeBSD, porte également les noms de int244 ou push_pop_all_iret) et Xjustreturn (peut également être trouvé à partir d'une porte IDT).\n \ndoreti_iret\nCe décalage est crucial pour établir la primitive de kernel en une seule étape utilisée pour trouver d'autres offsets, et comme il s'agit d'un offset de texte du kernel qui n'est pointé par quoi que ce soit, il doit y avoir un moyen de résoudre ce problème de la poule et de l'œuf.\n \nIl y en a, et voici comment :\n \nConfigurez une pile d'interruptions dédiée pour l'exception #GP (int13). Utilisez n'importe quelle primitive malloc du noyau pour lui allouer de la mémoire, ou utilisez un mappage dmem dans le noyau d'une page d'espace utilisateur (cela vous donne également plus de liberté avec l'écrasement). Soit X (x === 0 mod 16) l'adresse de pile écrite dans le TSS.\n \nÀ partir d'un autre thread, utilisez la primitive d'écriture de 20 octets pour écrire {(uint64_t)0x43, (uint64_t)0x202, (uint32_t)0} à l'adresse X-32.\n \nDans le thread principal, épinglé au CPU pour lequel vous avez reconfiguré le TSS, utilisez setcontext ou sigreturn pour charger un mcontext_t qui a une adresse non canonique (les 16 premiers bits non 0000 ou ffff) dans son champ mc_rip. Cela provoque le crash du noyau avec #GP sur l'instruction iret (dont on veut connaître l'adresse).\n \nNormalement, le kernel gérerait cela comme un crash et une panique du noyau (ps5-kstuff corrige cela, FreeBSD et PS4 ne sont pas affectés). Cependant, le thread d'arrière-plan qui écrit écrase m_cs et m_eflags (et les 4 octets faibles de m_rsp) dans la trame de trap enregistrée avec des valeurs d'espace utilisateur valides, et fait croire au noyau qu'il s'agit d'un crash dans l'espace utilisateur.\n \nAvant de faire tout ce qui précède, configurez une pile de signaux pour votre thread avec sigaltstack(2) (le rsp « actuel » proviendra du noyau et sera corrompu, donc inutilisable) et enregistrez un gestionnaire de signaux pour SIGBUS. Lorsque le crash écrasé se produit et que le gestionnaire est appelé, récupérez l'adresse de m_rip dans le mcontext transmis.\n \nDécalages trouvés à partir d'une seule étape des fonctions du kernel\n \nLes deux premiers offsets importants sont rdmsr et wrmsr_ret (qui peuvent également être utilisés à la place de wrmsr). Pour trouver rdmsr, effectuez une seule étape sur n'importe quelle entrée du gestionnaire d'interruption et recherchez une instruction qui charge simultanément eax et edx avec des valeurs. Pour trouver wrmsr, il suffit de revenir en un seul pas, de changer la direction du saut (pour faire croire que vous avez un X2APIC), et de noter l'adresse qui fait paniquer la console.\n \nVous aurez également besoin de l'adresse du « rep movsb ; pop rbp; ret\", qui se trouve dans la fonction memcpy(2) et est utilisé par les programmes de trace pour lire/écrire la mémoire du noyau. Pour le trouver, exécutez la trace (sans vider la trame iret, ce que vous ne pouvez pas encore faire) jusqu'à ce que vous voyiez l'effet secondaire spécifique de « rep movsb » ou « rep movsq » (rdi += 1 ou 8, rsi += 1 ou 8, rcx -= 1), puis exécutez à nouveau la trace et utilisez ce gadget pour copier sa propre adresse dans la mémoire de l'espace utilisateur. …Eh bien, c'est comme ça que j'ai fait, il peut être plus facile de mapper la page contenant le cadre de retour dans l'espace utilisateur et de la lire directement.\n \nUne fois que vous les avez mis en place, le suivi des appels système avec la famille de fonctions r0gdb_trace() devrait fonctionner et vous pourrez obtenir des traces du noyau (au moins 1 autre personne est arrivée ici le 4.50). Cela vous permet de trouver un tas d'autres compensations :\n \nmalloc(9) — tracez l'allocation IPV6_RTHDR, recherchez un appel avec la taille spécifiée dans rdi. Attention aux arrondis. M_something est le deuxième argument (rsi) de l'appel malloc. Cela est nécessaire pour avoir une primitive d'allocation de taille illimitée, car le malloc basé sur RTHDR est limité à 2 KiB.\n \nprintf — tracez dynlib_load_prx d'un fSELF, recherchez le message d'erreur dans rdi. Non nécessaire au moment de l'exécution, mais utile pour trouver d'autres décalages.\nDécalage du point d'arrêt mprotect, décalage du point d'arrêt mmap pour le mappage SELF (pour cela, regardez simplement d'où proviennent les codes d'erreur), décalages de contournement des autorisations d'autres appels système.\n \nCependant, si vous essayez de retrouver un appel système bloquant, le système se bloquera. Cela se produit parce que l'indicateur d'interruption (TF) n'est pas effacé lors des changements de tâches dans le noyau et est divulgué dans un autre processus, où la partie espace utilisateur du mécanisme de traçage n'est pas mappée. Pour éviter cela, vous devez trouver cpu_switch (qui, d'après le PoV du thread appelant, est la primitive de blocage la plus atomique et doit être non tracée). L'idée est la suivante : lancez un appel système bloquant connu (nanosleep est le meilleur car il se réveille tout seul) sous count_instrs, faites une recherche binaire sur le nombre d'instructions jusqu'à ce que vous soyez proche (100-200 instructions) du point de mort . Videz la trace, ouvrez le premier appel de fonction. À la fin, vous verrez un tas de rets sans instructions entre les deux ; cela se produit parce que le pointeur de pile du nouveau thread est chargé, et il arrive (cela m'est arrivé ?) d'être plus haut en mémoire que l'ancien. La dernière instruction avant que cela ne se produise se trouve dans cpu_switch, faites défiler jusqu'au début de la fonction et notez l'adresse.\n \ncpu_switch peut également être trouvé en recherchant une instruction d'appel se produisant sur une pile alignée sur 8 octets (l'alignement normal est de 16 octets). Mais cela n'a pas fonctionné pour moi.\n \nUne fois cette case cochée, vous pouvez désormais tracer des appels système (presque) arbitraires. La plupart des compensations liées à fSELF sont désormais trouvées de manière triviale :\n \nsceSblServiceMailbox — tracez load_prx, recherchez « sx_xlock » transmis en tant que rdi, prenez note de l'adresse de la fonction. Pour vérifier, faites-lui renvoyer une erreur et consultez le journal du noyau.\n \nsceSblServiceMailbox_lr_* (également connu sous le nom de *_call_mailbox) — tracez load_prx, recherchez les appels de sceSblServiceMailbox, prenez note de l'adresse de retour (poussée vers la pile). Pour distinguer les adresses de retour, faites-lui renvoyer -1 et consultez le journal du noyau.\nsceSblAuthMgrIsLoadable2 — il s'agit de la fonction qui effectue le deuxième appel de boîte aux lettres pendant load_prx. Je ne me souviens pas si son nom peut être trouvé via l'indice précédent.\n \nsceSblServiceMailbox_lr_decryptMultipleSelfBlocks est spécial, car il n'est normalement pas appelé sur les fichiers SELF vendus au détail et fera planter le noyau en cas de panne. Pour trouver cela, mappez un fSELF suffisamment grand avec un programme de trace qui bloque l'exécution à chaque appel de boîte aux lettres *inconnu* (vous pouvez utiliser trace_mailbox de prosper0gdb). Après le blocage, dans un autre thread, videz le journal de trace, extrayez la dernière valeur RSP enregistrée et lisez l'adresse de retour. Utilisez r0gdb singlestep pour confirmer le message d'erreur.\n \nUn autre ensemble de décalages importants peut être trouvé en effectuant une seule étape avec la fonction cpu_switch (et pmap_activate_sw qu'elle appelle).\n \nCeux-ci sont:\n \ndr2gpr (lecture des registres de débogage) : pas à pas sur le mauvais chemin d'un condjump (quelque part près du début de la fonction).\ngpr2dr (écriture des registres de débogage) : pas à pas sur le mauvais chemin d'un condjump (quelque part près de la fin de la fonction). Notez que le code y est légèrement différent de FreeBSD 11 : il écrit d'abord dr0-dr3, puis effectue un tas d'accès MSR sans rapport (qui manquent sur FreeBSD), et ensuite seulement il écrit finalement dr6-dr7.\nmov_rdi_cr3, mov_cr3_rax — pmap_activate_sw en une seule étape avec le thread actuel, prenez le mauvais chemin lors d'un condjump pour lui faire penser qu'il doit changer de table de pages.\nCela devrait être suffisant pour que le déchiffrement fSELF fonctionne pendant l'appel système, pour les décalages de pagination paresseux, voir la section suivante.\n \nLes décalages de boîte aux lettres fPKG, sceSblServiceMailbox_lr_verifySuperBlock et sceSblServiceMailbox_lr_sceSblPfsClearKey_{1,2}, sont plus délicats. \n \nLe syscall mount(2) utilisé pour le montage PFS est trop volumineux pour être entièrement effectué en une seule étape, vous devez donc utiliser des registres de débogage pour interrompre sceSblServiceMailbox et enregistrer les accès. L'appel verifySuperBlock a {uint64_t}rdx == 0x11, les deux appels sceSblPfsClearKey (ceux-ci n'apparaissent que si vous usurpez le premier) ont {uint64_t}rdx == 3.\n \nCompensations trouvées dans les journaux ps5-kstuff (appelés « parasites » dans la source)\nCeux-ci peuvent être regroupés en 2 groupes selon leur importance :\n \nParasites importants – syscall_before, points de surveillance fSELF, sceSblServiceCryptAsync_deref_singleton. Ceux-ci sont utilisés pour implémenter des fonctionnalités, sans eux, certaines parties de ps5-kstuff ne fonctionneront pas.\nParasites sans importance : ils ne causent aucun dommage s'ils ne sont pas manipulés, mais il est préférable de les manipuler pour éviter d'encombrer les bûches.\n \nps5-kstuff utilise la technique que j'ai baptisée « empoisonnement du pointeur » pour insérer des hooks dans le kernel sans recourir à des correctifs de texte. En cas d'empoisonnement du pointeur, les 16 premiers bits du pointeur sont remplacés par la constante 0xdeb7 (signifie « DEad PoinTer »), ce qui en fait une adresse non canonique. Lorsque ce pointeur est déréférencé ultérieurement, #GP se produit, qui est accroché par ps5-kstuff, et ce dernier essaie de réparer tous les pointeurs marqués avec 0xdeb7 en pointeurs normaux du noyau, et ces correctifs sont enregistrés dans le journal ps5-kstuff (il devrait normalement il n'y en a pas). Une fois que vous avez l'adresse, vous devez déterminer si elle est importante ou non :\n \nParasites Syscall – ils apparaissent lorsque vous empoisonnez le pointeur sysents dans le sysvec. Le troisième d'entre eux est syscall_before, les autres ne sont pas importants.\nParasites fSELF — ils apparaissent lorsque vous empoisonnez le pointeur self_header dans self_context. Deux d'entre elles se trouvent à l'intérieur de fonctions appelées au début de decryptSelfBlock (_sceSblAuthMgrLoadSelfBlock) et decryptMultipleSelfBlocks (_sceSblAuthMgrLoadMultipleSelfBlocks), et sont utilisées comme points de surveillance (*_watchpoint_*), d'autres ne sont pas importantes.\nParasites fPKG — un parasite apparaît lorsque vous corrompez les objets de chiffrement à l'intérieur de crypt_singleton_array, à savoir sceSblServiceCryptAsync_deref_singleton.\nD’autres parasites peuvent apparaître, ils sont généralement sans importance.\nLes parasites importants sont traités dans try_handle_*_trap comme n'importe quel autre piège. Les parasites non importants sont gérés dans handle_*_parasite dans uelf/parasites.h.\n \nSuivi des fichiers de montage\n \nPour tracer mountpfs, j'ai corrigé le processus shellcore, de sorte que lorsqu'il rencontre un appel système mount(2), il vide ses arguments vers une adresse connue et se bloque. Ensuite, je lis les arguments de mon processus principal en utilisant mdbg_call et j'appelle le même syscall dans le processus principal. Voir « CODE TEMPORAIRE » dans ps5-kstuff/main.c à l'adresse commit 960a62520cd561adb66c2c010a040bc50a659633 pour plus d'informations (vous devrez ajuster les offsets des correctifs shellcore, mais c'est trivial car des dumps de texte sont disponibles).\n \nDerniers mots\n \nQuelqu’un a suggéré qu’un « payload de test » pourrait être développé pour découvrir les compensations. Ce ne serait pas anodin, car cela impliquait beaucoup de devinettes manuelles et d'observation des traces, pour essayer de donner un sens à ce qui se passait. De plus, certaines de ces vérifications impliquent de faire paniquer le système, de sorte qu'il ne peut pas être entièrement automatisé en tant que payload unique. À mon avis, une meilleure approche consiste à développer un script qui s'exécuterait sur PC et sonderait la PS5 sur le réseau – ce script ne se terminera pas en cas de panique, et il pourrait même détecter la panique et demander à l'utilisateur d'agir. Je pense que cela pourrait être le meilleur moyen de réduire le travail manuel impliqué dans la recherche, afin que tous ceux qui possèdent une PS5 puissent contribuer aux compensations en exécutant simplement le script.\n \n \nTout est là : github.com/sleirsgoevy\n \n",
        "images": {}
    },
    "news_2": {
        "title": "[PS5] Homebrew BigApp Loader en développement pour la PS5",
        "content": "Le développeur John Tornblom que nous connaissons bien pour tout ce qu'il a su apporter sur l'exploit bluray sur PS5, nous informe qu'il travaille actuellement sur un loader d'application d'homebrews pour la dernière console de Sony.\n \nHomebrew BigApp Loader pour PS5 n'est pour l'heure qu'un projet en développement, il y a encore des problèmes de corruption, et pour le moment restreint au firmware 3.21. \n \nPour l'heure pas grand chose à se mettre sous la dent car le développeur n'a pas publié le loader, juste un vidéo dans laquelle nous pouvons y trouver tout un jeu d'alternance de couleur, comme pourrait le faire un test vidéo permettant de tester les écrans. \n \n \n \n\n \nAvertissement épilepsie ! \n \n \n \n \nTout est là : homebrew-bigapp-loader-for-ps5\n \n \n \n",
        "images": {}
    },
    "news_3": {
        "title": "[PS5] Le payload ps5-skstuff.bin publié par Sleirsgoevy",
        "content": "Le développeur Sleirsgoevy propose le premier payload concernant sa nouvelle solution qui porte le nom de ps5-skstuff.bin.\n \nVous pouvez l'injecter, et il permet donc d'exécuter des jeux PlayStation 4 sur la PlayStation 5 sous firmware 4.03 uniquement. \n \nCe payload est similaire à PS4 fPKG Enabler, la seule différence est qu'il est plus facile à charger, puisqu'il ne nécessite plus Netcat. \n \n \n \n\n \n \n \n \n \nPour en profitez, il suffit de se rendre ici : \n \n \nhttps://sleirsgoevy.github.io/ps4jb2/ps5-403/index.html\n \nil suffit alors simplement de cliquer sur JB+KSTUFF et le tour est joué, il suffit alors d'attendre environ 20 secondes pour en profiter ! \n \nSi quelques choses se passe mal vous aurez un message d'erreur, si votre PS5 ne répond pas au bout d'une minute, il faudra redémarrer votre PS5. \n \nComme le précise Sleirsgoevy, il est parfois nécessaire de réaliser l'opération jusqu'à 10 fois, pour qu'elle soit fonctionnelle.\n \nCrédits : \n@theflow pour la divulgation de la vulnérabilité, @ChendoChap pour le contournement de la FCI, @SpecterDev & @ChendoChap pour diverses aides.\n \n \nTout est là : PS4JB 2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-841726054.png"
        }
    },
    "news_4": {
        "title": "[PS4] Assassin's Creed Mirage backporté par Cyb1k",
        "content": "Le développeur Cyb1K annonce avoir backporté l'un des jeux les plus attendus d'Octobre 2023, voir de cette fin d'année. \n \nIl s'agit du bakcport de Assassin's Creed Mirage sur PS4 et PS4 Pro, qui a débarqué et qui pour le jeu principal pèse 21.74 Go, alors qu'il vous faudra aussi installer sa mise à jour 1.02 contre 5.26 Go. \n \n \n\n \n\n \nDeux screens de Cyb1K\n \n \n \nLa version PC n'a pas encore été hackée (vous priant de m'excuser pour l'heure initiale), la version PS4 est donc la première à être accessible à ceux qui disposent d'une PS4 ou d'une PS4 Pro exploitable. \n \n \n \n\n \n \nLe nombre de commentaires est incroyables sur le profil de Cyber1000, ou Cyb1K, c'est dire l'engouement que suscite le titre. Pour l'heure, les liens ne sont pas encore disponibles, le tout sera probablement compatible 5.05, 6.72, 7.xx et 9.00 comme d'habitude. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180386/in-ps4-assassins-creed-mirage-backporte-par-cyb1k-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1180386/in-ps4-assassins-creed-mirage-backporte-par-cyb1k-2.jpg"
        }
    },
    "news_5": {
        "title": "[PS5] Les PKG PS4 activables sur PS5 uniquement pour le firmware 4.03",
        "content": "Le développeur Zecoxao nous informe de la disponibilité d'un \" PS4 fpkg enabler \" proposé par Sleirsgoevy pour la PlayStation 5 sous firmware 4.03. \n \nPour le moment, cette proposition ne reste compatible qu'avec le firmware 4.03, mais il n'est à n'en pas douter que cette solution sera porté sur les autres firmwares. \n \nPour que cela fonctionne, il faut déjà disposer d'une PS5 sous firmware 4.03, vous allez sur le site de Sleirsgoevy, vous chargez le payload, et cela devrait alors vous permettre d'installer et d'exécuter les fPKGs PS4 sur PS5. \n \n \n \n\n \n \n \nLe développeur a publié très récemment des progrès supplémentaires sur PS5-kstuff, il est clair que ce PS4 fPKG enabler arrive après l'évolution de ce contenu.\n \nSleirsgoevy a donc trouvé un moyen de contourner la fonction de protection, le décryptage de fichiers SELF, qui n'utilise aucun cryptage ou signature. Des appels SM qui chargent leurs segments permettent ensuite d'avoir accès aux fonctions propres dans un payload  du kernel.\n \nC'est confirmé, les fPKG PS4 sont donc désormais activables sur PS5 sous firmware 4.03 ! \n \nComme le confirme StretchEcho qui montre le fPKG PS4 de Minecraft qui tourne sur PS5 sous firmware 4.03. \n \n \n \n \n \n",
        "images": {}
    },
    "news_6": {
        "title": "[3DS] L'exploit kernel ARM9 pour les OLD3DS sous FW 11.8 à 11.17 (New3DS aussi)",
        "content": "Le développeur Zoogie a annoncé un peu dans l'ombre la découverte d'un nouvel exploit ARM compatible avec les consoles OLD 3DS sous firmware 11.8 à 11.17. \n \nAvec cet exploit kernel, plus besoin d'utiliser de jeux ou d'autres méthodes complexes de points d'entrée, et il pourrait aussi être rapidement compatible avec les New3DS dans un futur plus ou moins lointain, entendez par là qu'on n'en sait rien. \n \nPour l'heure, ce nouvel exploit est proposé en Bêta, il vous faudra un PC pour le faire fonctionner sous Windows ou Linux, sachant que macOS n'est pas supporté. Il vous faudra également une clé SD ainsi que maitriser Python 3.\n \n \n \n\n \n \n \n \nQu'est ce que ce nouvel exploit ?\n \nMSET9 s'appuie sur un bug de la fonction FS_EnumerateExtDATA, une fonction qui rentre dans le processus de \"gestion des données\" > \"données supplémentaires\".\n \nSi un fichier est placé dans le répertoire extdata et commence par huit chiffres haxadécimaux, cela peut provoquer un crash, celui-ci peut alors déboucher sur des références nulles, et ARM9 va alors sauter directement à la chaîne ID1, située à côté de la mémoire ARM9. Pour résumer simplement, ce bug permet d'obtenir le contrôle sur la 3DS. \n \nLa dernière Bêta 2 vient légèrement modifier usr2arm9ldr utilisé dans le payload du stage1 et il permet de charger SafeB9SInstaller. \n \n \n \nTout est là : MSET9\n \n \n",
        "images": {}
    },
    "news_7": {
        "title": "[PS3] CFW Evilnat 4.90.2 en développement",
        "content": "Le développeur espagnol Nathan Martin vient d'annoncer une information intéressante sur son profil Twitter ou X, son message est sans équivoque. \n \nIl annonce en effet qu'il développe et teste la 20 ème Bêta de son CFW Evilnat 4.90.2. Comme vous le savez ce custom firmware intègre la plupart des fonctions de l'ancien Rebug Toolbox, ce qui en fait le compagnon idéal d'une PS3 sous firmware officiel 3.55.\n \n \n \n \n\n \n \n \n \n \nPour rappel, le CFW Evilnat intègre aussi l'accès à deux kernel en LV2, CEX et DEX, ainsi que le module xai_plugin retiré depuis le firmware 3.40.\n \nMalheureusement le développeur n'a pas précisé les changements qui seront implémentés dans cette nouvelle version, mais nous pourrions penser qu'il puisse faire évoluer des possibilités liés à des modifications de la mémoire flash. \n \nTout est là : xXEvilnatXx\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180336/in-ps3-cfw-evilnat-4902-en-developpement-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS4] GameBato Store 1.20 avec des vitesses de téléchargements accrues",
        "content": "Une toute nouvelle version de GameBato Store vient d'arriver et cette nouvelle version apporte une amélioration sur les vitesses de téléchargement entre 1 et 30 %.\n \n \n\n \n\n \n \n \nCe n'est pas tout puisque d'autres nouveautés sont apportés par cette version 1.19 : \n \n- Correction d'un crash qui se produisait parfois dans l'écran de chargement \"GameBato\", ainsi si cela vous arrive et que vous êtes bloqué, fermez l'application et redémarrez la, un processus de réparation sera effectué afin de résoudre le problème. \n \n- Réduction de la fréquence du processus de réparation des applications légères, si une image ne peut pas être chargée à cause d'une image corrompue ou d'un échec de téléchargement, elle sera remplacée par une image par défaut, qui sera à nouveau automatiquement téléchargée à nouveau la prochaine fois que vous accéderez à une section contenant la même image. Cela empêche l'application de se fermer et de se réparer constamment.\n \n- Correction de quelques bugs mineurs\n \n- Augmentation de la vistesse de téléchargement (entre 1 à 30% selon votre région). \n \nIl est à noter que cette nouvelle mise à jour a une chance de réinitialiser les téléchargements, surtout les mises à jour et les DLC ne n'exécutant qu'en mode console. Il est donc fortement conseillé de terminer les téléchargements en cours afin d'éviter tout problème. \n \nMéthodes de dépannage :\n- Effacer le cache : Effacer les données temporaires de l'application, y compris les images téléchargées. Si vous restez bloqué dans l'écran \"Chargement des données\" lorsque vous entrez dans des sections spécifiques à chaque fois, essayez d'effacer le cache et cela résoudra le problème. L'utilisateur peut utiliser cette fonction en cliquant sur l'option Vider le cache dans la section Paramètres de l'application.\n- Réparation logicielle : Effacer les métadonnées de l'application et les données temporaires qui peuvent causer un blocage dans l'application. Cela se produit automatiquement par l'application lorsque certaines métadonnées de l'application sont corrompues, après avoir affiché un message à l'écran, puis quitté l'application et réparé l'application au prochain lancement.\n- Hard Repair : Effacer tout ce qui a été créé par l'application, y compris les téléchargements en cours. Cela revient à désinstaller/réinstaller l'application. L'utilisateur peut le faire en cliquant sur l'option Réinitialisation d'usine dans la section Paramètres de l'application.\n \nLa team explique qu'elle travaille constamment sur les problèmes actuels, qu'elle ajoute de nouvelles fonctionnalités et plus de jeux à l'application afin que vous puissiez avoir l'expérience d'utiliser une application stable avec le meilleur contenu.\n \nTout est là : gamebatoapp.ir\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180310/in-ps4-gamebato-store-119-avec-des-vitesses-de-telechargements-accrus-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1180310/in-ps4-gamebato-store-119-avec-des-vitesses-de-telechargements-accrus-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS5] Vers un chargement de fPKG sans hyperviseur sur la PS5",
        "content": "Le développeur Sleirsgoevy vient d'ajouter quelques correctifs surprenants qui pourraient conduire au chargement des backups PS4 sur PS5. \n \nLe développeur a amélioré ps5-kstuff, et a ajouté une fonctionnalité \"nmount\" afin de gérer les montages et des hooks pour \"sceSblServiceCrypt\".\n \nAvec ces changements, il devient possible de déchiffrer le PFS interne à l'aide de clés personnalisés, avec en plus la dérivation de clé à l'aider de la clé \"ypkg\" qui a également été implémentée. \n \nEn plus de tout cela, des bibliothèques comme BearSSL pour RSA et SHA256HMAC ont été utilisées, tout comme libtomcrypt pour AES/XTS. \n \n \n \n\n \n \n \nIl s'agit là d'une avancée importante en matière de hack PS5, cela sous-entend en effet qu'il va être possible de charger des backups PS4 sans approbation de l'hyperviseur, par contre pas les backups PS5 qui eux nécessitent pour le moment le passage en HV.\n \nCes évolutions pour le moment restent limitées aux consoles disposant d'un lecteur blu-ray car lié à la toolchain BD-JB, et donc compatible avec les firmwares 3.00 à 4.51, il faudrait trouver un exploit webkit pour le rendre compatible avec la version digitale ou les PS5 sans lecteur fonctionnel. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180279/in-ps5-vers-un-chargement-de-fpkg-sans-hyperviseur-sur-la-ps5-1.png"
        }
    },
    "news_10": {
        "title": "[PS4] FC2024, Lies of P, Scars Above ou encore Separate Ways, bref on est gâté !",
        "content": "Malgrés les firmwares récents, malgrés les mises à jour nécessitant les dernières clés, la scène PlayStation continue de régaler ceux qui disposent d'une console PlayStation 4 ou PlayStation 4 Pro sous firmware inférieur ou égal au 9.00.\n \nDans quelques heures, c'est EA Sport FC 24 qui sera proposé grâce au travail de Opoisso893, soutenez le en réalisant un don. \n \n \n\n \n \n \n \n\n \n \n \nCes derniers jours nous avons eu droit au portage et backport de Lies of P, Scars Above ou encore de Separate Ways, le DLC de Resident Evil Remake. Ces backports fonctionnent sur le firmware 9.00 mais également sur 5.05, 6.72, 7.02 et 7.55.\n \n \n \n\n \n \n \n\n \n\n \n\n\n\n \n\n \n \n \nCes jeux disposent en plus de DLC, et pour FC 24 il y aura probablement des packs de langues, nous verrons bien demain. \n \n \n\n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180241/in-ps4-fc2024-lies-of-p-scars-above-ou-encore-separate-ways-bref-on-est-gate-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1180241/in-ps4-fc2024-lies-of-p-scars-above-ou-encore-separate-ways-bref-on-est-gate-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1180241/in-ps4-fc2024-lies-of-p-scars-above-ou-encore-separate-ways-bref-on-est-gate-1.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1180241/in-ps4-fc2024-lies-of-p-scars-above-ou-encore-separate-ways-bref-on-est-gate-2.png"
        }
    },
    "news_11": {
        "title": "[PS4] La première version de l'émulateur shadPS4 disponible",
        "content": "Voilà qu'arrive la première version officielle de l'émulateur PS4 shadPS4, sous ce nom se cache le premier émulateur destiné à une plate-forme PC sous Windows développé par Georgemoralis. \n \nGeorgemoralis est connu aussi sous le pesudonyme shadow, cela ne vous dit peut être pas grand chose, mais c'est le programmeur qui a conçu des émulateurs comme PCSX, PCSX2 ou encore PCSP comme nous vous le disions en Juin 2023. \n \n \n\n \n \nBien entendu, il n'est pas encore question de pouvoir lancer le moindre titre, seulement une démonstration d'un ELF, qui porte le nom de videout_basic.elf.\n \nIl s'agit d'une démo officielle du SDK PS4, ce qui n'est tout de même pas rien, cette démo intègre environ 20 000 lignes de codes cibles, et permet donc de se faire une idée des capacités de shadPS4.\n \n \n \n\n \n \nPour l'heure, il s'agit d'un début, mais pourquoi pas, un serveur discord a été mis en place ici : https://discord.com/invite/MyZRaBngxA , et quelques autres développeurs commencent à se rapprocher de la solution.\n \nTéléchargement : shadPS4 0.0.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180227/in-ps4-la-premiere-version-de-lemulateur-shadps4-disponible-1.jpg"
        }
    },
    "news_12": {
        "title": "[WiiU] Cemu désormais compatible avec les jeux au format NUS",
        "content": "Cemu 2.0-53 vient de sortir, toujours en version expérimentale mais qui permet d'améner de nombreuses optimisations. L'émulateur de Wii U n'a pas encode dit son dernier mot, puisque cette nouvelle version vient améliorer le rendu graphique lors de l'utilisation de l'API Vulkan, mais ce n'est pas tout. \n \nCette nouvelle version prend en charge les jeux sous format NUS (.app), il sera nécessaire d'assurer la présence des fichiers title.tmd et title.tik dans le même répertoire. \n \nDes massages d'erreurs plus détaillés, notamment en cas de problèmes avec des titres cryptés, l'amélioration de la gestion des chaînes dans le logiciel avec un code retravaillé en utf8, afin d'améliorer la compatibilité et l'efficacité. \n \nDes instructions ont été mises à jour également pour améliorer la prise en main par les développeurs pour facilité l'émulation.\n \n \n \n\n \n \n \nChangelog 2.0-53 : \n \n- Vulkan : Ne créer un renderpass imgui qu'une seule fois (#972)\n \n- nn_olv : Gestion des clés nullptr dans SetSearchKey (#974)\n \n- BUILD.md : Requiert libtool et libusb1-devel pour Fedora (#979)\n \n- Latte : Refactorisation très mineure + optimisation\n \n- Latte : Limiter les buffers uniformes basés sur des schémas d'accès dans le shader\n \n- Vulkan : Ajout d'un profileur pour le coût CPU de l'API Vulkan \n \n- Ajout de la prise en charge les jeux au format NUS (.app) \n \n- Messages d'erreur plus détaillés lorsque les titres cryptés ne se lancent pas\n \n- Refactorisation de plus d'instances wstring en chaînes encodées en utf8\n \n- Correction de la conversion WUA qui ne détectait pas les mises à jour\n \n- Activation de la prise en compte du DPI sous Windows\n \n- Mise à jour des instructions de compilation pour Windows\n \nListe des compatibilités : http://compat.cemu.info/\n \n \n\n \n \nTéléchargement : Cemu 2.0-53\n \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180222/in-wiiu-cemu-desormais-compatible-avec-les-jeux-au-format-nus-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS4] GameBato v1.18 disponible",
        "content": "Les développeurs en charge de GameBato viennent de mettre à jour leur store GameBato, l'application lancée recemment doit encore s'améliorer, pour rappel cette application permet de profiter du meilleur si tenter que vous possédez une console avec un firmware inférieur ou égal au firmware 9.00. \n \nJustement, cette nouvelle version introduit un nouveau système de téléchargement, et il faut dire qu'il faut qu'il soit optimisé pour proposé les plus de 2000 jeux directement téléchargeables depuis la console, ainsi que tous les DLC et mises à jours. \n \n \n\n \n\n \n\n \n \n \nLa version 1.18 est disponible !\n \nChangelog :\n \nNouveau système de téléchargement : Nous avons ajouté une nouvelle méthode de téléchargement, qui dans la boîte de confirmation de téléchargement, l'utilisateur peut maintenant choisir entre les protocoles de téléchargement GameBaTo ou Console :\n \nProtocole de téléchargement GameBaTo :\n- Connexion multiple et connexion rapide en utilisant le gestionnaire de téléchargement GameBaTo, la vitesse dépend de votre connexion réseau et de l'état actuel de la bande passante de nos serveurs !\n- Géré par l'application GameBaTo !\n- Maximum de 5 téléchargements en cours avec ce protocole !\n- Vous pouvez avoir un téléchargement actif en utilisant ce protocole !\n- Pause/Resumable downloads !\n- Processus de téléchargement et d'installation séparés !\n \nProtocole de téléchargement de la console :\n- Connexion unique et téléchargement persistant à l'aide du gestionnaire de téléchargement de la console, la vitesse dépend de votre connexion réseau et de l'état actuel de la bande passante de nos serveurs !\n- Géré par la console et l'application GameBaTo !\n- Maximum d'un téléchargement présent en utilisant ce protocole !\n- Téléchargement en pause/résumable, même après le redémarrage de la console !\n- Processus de téléchargement/installation unique, qui sera installé simultanément au téléchargement !\n- Risque pratiquement nul de corruption du téléchargement, géré par la console, si une corruption se produit, c'est Sony qui en est responsable !\n- Vous pouvez télécharger en mode repos !\n \nSuivez les étapes suivantes pour pouvoir télécharger en mode repos :\n- Paramètres de la console ->\n- Paramètres d'économie d'énergie ->\n- Définir les fonctions disponibles en mode repos->\n- activer Rester connecté à Internet\n- activer Garder l'application suspendue !\n \nNotez que l'application GameBaTo empêche l'appareil de passer en mode repos, vous devez le mettre en mode repos manuellement en appuyant sur le bouton PS !\n \n- Correction d'un bug qui provoquait le plantage de l'application quelques secondes après le démarrage lors de l'entrée dans l'écran principal !\n- Correction d'une boucle bloquée dans le processus de réparation !\n- Correction de la console HDD n'affichant pas l'espace de stockage utilisé et libre !\n- Ajouter \"Factory Reset\" aux paramètres pour résoudre tous les problèmes de blocage causés par la corruption des métadonnées, ce qui réinitialise l'application à son état initial, notez que tous vos téléchargements en cours seront effacés !\n- Diminution du risque de corruption des paquets à 1% causé par l'application (la corruption peut toujours se produire !), il y a toujours des chances que certains paquets ne soient pas compatibles avec votre firmware et ne s'installent pas !\n- Amélioration de l'expérience utilisateur avec une navigation plus fluide dans l'application !\n- Correction de nombreux problèmes mineurs !\n \nSi vous êtes bloqué dans la boîte de dialogue Chargement des données lorsque vous entrez dans les détails d'un jeu, procédez comme suit :\n- GameBaTo Settings ->\n- Appuyer sur le bouton d'option Vider le cache\n- Il n'est pas nécessaire de relancer l'application !\n- Profitez du téléchargement et de la lecture de jeux avec GameBaTo !\n- Maintenant, vous pouvez aussi jouer à des jeux tout en téléchargeant des paquets !\n \n \nTéléchargement : http://gamebatoapp.ir/home/en/\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180182/in-ps4-gamebato-v118-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1180182/in-ps4-gamebato-v118-disponible-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1180182/in-ps4-gamebato-v118-disponible-2.png"
        }
    },
    "news_14": {
        "title": "[PS4/PS5] Jim Ryan, President et CEO, annonce son départ après 30 ans chez Sony",
        "content": "Le président et CEO de Sony, Jim Ryan, vient d'annoncer qu'il va quitter la tête de Sony Interactive Entertainment en le 31 Mars 2024. \n \nDans un communiqué de presse, Sony annonce sa retraite et rajoute qu'il va être remplacé par Hiroki Totoki qui va jouer le rôle de PDG par intérim, actuellement il est président et directeur de l'exploitation et directeur financier de Sony Group Corporation. \n \nJim Ryan aura été l'homme qui a tout connu, il a rejoint l'entité juridique européenne de Sony Interactive Entertainment, Sony Interactive Entertainment Europe (SIEE) — qui s'appelait alors Sony Computer Entertainment Europe — en 1994. Il a alors occupé plusieurs postes de direction au sein de l'entreprise, notamment ceux de président de SIEE, Responsable des ventes et du marketing mondiaux chez SIE et président adjoint de SIE depuis janvier 2018, avant d'être nommé président-directeur général de SIE. Son mandat de PDG aura duré 5 années, comme Kazuo Hirai (2007 - 2011) et Andrew House (2011 - 2017), mais sa démission pour prise de retraite laisse entendre de la fatigue ou de la lassitude. \n \n \nIl laisse un message émouvant, humble et expliquant sa décision. \n \n \n\n \n \n\" Comme vous l'aurez vu aujourd'hui dans l' actualité  , j'ai annoncé ma retraite après près de 30 ans chez Sony Interactive Entertainment. Je n'ai pas pris cette décision à la légère et j'adore SIE et notre communauté, mais ces derniers temps, j'ai de plus en plus de mal à trouver le bon équilibre entre ma maison au Royaume-Uni et mon travail aux États-Unis. Comme mentionné dans le communiqué de presse, je conserverai mon rôle de président et chef de la direction jusqu'en mars 2024. À compter du 1er avril 2024, Hiroki Totoki sera nommé PDG par intérim de SIE tout en conservant son rôle actuel chez Sony Group Corporation.\n \nJe me sens honoré d'avoir l'opportunité de diriger une entreprise fournissant des produits qui touchent des millions de vies. Des jeux primés aux prouesses techniques incroyablement immersives fournies avec la PlayStation 5, je suis immensément fier de ce que nous avons réalisé et très optimiste pour l'avenir de Sony Interactive Entertainment.\n \nDès mes débuts en Europe, il était clair que Sony avait construit quelque chose de vraiment spécial. Des générations plus tard, je suis toujours étonné par l'enthousiasme et la passion de la communauté PlayStation. C'est grâce à vous que nous avons pu continuer à innover et à proposer des expériences encore plus belles. Depuis 1994, des générations de joueurs nous ont inspirés à nous améliorer, à repousser les limites, et les résultats ont été incroyables. \n \nMerci du fond du coeur.\n \nJim Ryan. \n \n \n \nDe sont côté, Hiroki Totoki s'est également exprimé. \n \n \n\n \n \n\" Je voudrais exprimer ma sincère gratitude à Jim Ryan pour ses réalisations et contributions exceptionnelles au cours de ses 30 années de carrière chez Sony, y compris le grand succès du lancement de la PlayStation 5. L'activité PlayStation gérée par SIE est une partie essentielle de l'activité du groupe Sony. l'ensemble du portefeuille d'activités. Je travaillerai en étroite collaboration avec Jim et l'équipe de direction pour assurer notre succès continu et notre croissance future. J’ai également hâte de créer l’avenir passionnant de la PlayStation et de l’industrie du jeu avec l’ensemble de SIE et de ses partenaires commerciaux. \"\n \nHiroki Totoki. \n \n \nLa concurrence, Phil Spencer, vient de s'exprimer également. \n \n \n\n \n \n\" Jim Ryan a apporté une énorme contribution à l’industrie du jeu vidéo et a été un grand leader pour PlayStation. Je lui souhaite le meilleur dans son avenir, merci Jim pour tout ce que vous avez contribué à faire pour la communauté au cours des trente dernières années. \". \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180180/in-ps4ps5-jim-ryan-president-et-ceo-annonce-son-depart-apres-30-ans-chez-sony-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1180180/in-ps4ps5-jim-ryan-president-et-ceo-annonce-son-depart-apres-30-ans-chez-sony-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1180180/in-ps4ps5-jim-ryan-president-et-ceo-annonce-son-depart-apres-30-ans-chez-sony-2.png"
        }
    },
    "news_15": {
        "title": "[2DS/3DS/DS] TWiLight Menu++ v26.1.1 et nds-bootstrap v1.0.1 disponibles",
        "content": "Le développeur RocketRobz est de retour avec de nouvelles versions de TWiLight Menu++ et de nds-bootstrap, au programme des correctifs AP supplémentaires ont été ajoutés à TWiLight Menu++ pour divers jeux tels que Alice au pays des merveilles et Inazuma Eleven. \n \nLe paramètre du disque RAM est désormais à nouveau modifiable et \"Mario & Luigi : Together Through Time\" sur les cartes flash DS n'affiche plus le message \"on sait que cela ne fonctionne pas\" lorsque vous tentez de l'exécuter avec nds-bootstrap .\n \nAvec bootstrap NDS, le temps de démarrage a été légèrement amélioré et la mise en oeuvre de la ROM et de la mise en miroir de sauvegarde améliore la compatibilité avec des jeux DS moins connus comme My Stop Smoking Coach. \n \n \n\n \n \nLa mise à jour a également amélioré la détermination de la région pour les titres DSiWare sans région : si TWLCFG ou les paramètres régionaux qu'il contient ne sont pas reconnus, la région sera désormais déterminée en fonction de la langue actuellement définie. Cela résout un problème où la ROM des paramètres DS-WiFi sur les cartes flash était affichée en japonais même lorsqu'une autre région que le japonais était définie.\n \n \nTéléchargement : TWiLight Menu++ v26.1.1 et nds-bootstrap v1.0.1 disponibles\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1180169/in-2ds3dsds-twilight-menu-v2611-et-nds-bootstrap-v101-disponibles-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS4] Waste_Ur_Time l'application à force brute de iBhoppers pour les PKG PS4",
        "content": "Le développeur iBhoppers, aka HoppersPS4, vient de mettre la ligne la première version publique de son application Waste_Ur_Time, il s'agit d'une application de force brute permettant de décoder les PKG utilisant orbis-pub-cmd.exe pour forcer brutalement le code d'accès d'un package PKG.\n \nWaste_Ur_Time prend en charge, dans sa version actuelle, les CID de 263 titres PS4 et l'accès à une base de données en ligne est également prévus. \n \n- Ajout de la Bruteforce (Ajoutée dans la v1.00) \n- Threads (Ajouté dans la v1.01) \n- GPU / CPU (Ajouté dans la v1.04) \n- Base de données (Ajoutée dans la v1.05)\n \n \n\n \n \n \n24/09/2023 - Changelog 1.06\n- Suppression de la version 1.05 car je ne veux pas être poursuivi en justice.\n- Support des codes d'accès sauvegardés\n \n23/09/2023 - Changelog 1.05\n- La base de données contient maintenant 263 titres !\n- https://pastebin.com/7daQHbpQ\n- Le GPU est encore plus rapide maintenant !\n \n23/09/2023 - Changelog 1.04\n- Support GPU ajouté (utiliser le drapeau --GPU)\n- Amélioration générale pour rendre le programme plus léger et plus rapide.\n- Ajout d'une base de données de Passcodes Connus ou de Passcodes déjà forgés.\n \n23/09/2023 - Changelog 1.03\n- Recodez, c'est maintenant en C++ !\n- Cette mise à jour du logiciel améliore les performances de Bruteforce. ( ͡° ͜ʖ ͡°)\n \n21/09/2023 - Changelog 1.02\n- Amélioration générale\n- Modification de la génération du mot de passe\n \n20/09/2023 Changelog 1.01\n- Ajout de fils de discussion\n- Quelques optimisations\n \n20/09/2023 - Changelog 1.00\n- Version initiale\n \n \n \nTéléchargement : Waste_Ur_Time\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1178739/in-ps4-waste-ur-time-lapplication-a-force-brute-de-ibhoppers-pour-les-pkg-ps4-1.jpg"
        }
    },
    "news_17": {
        "title": "[Vita] FuHEN le concours touche à sa fin",
        "content": "Le concours FuHEN touche à sa fin, c'est en effet la période de cloture des soumissions, ce sont pas moins de 1000 utilisateurs qui ont suivi le concours sur Twitter (X).\n \nLa période de soumissions s'est déroulée du 22 juillet 2023 au 22 septembre 2023, les votes sont désormais ouverts jusqu'au 29 septembre, date à laquelle les résultats du concours seront affichés sur le site internet ici et sur le profil Twitter.\n \n \n\n \n \nCe sont 15 jeux originaux, 4 utilitaires et 22 portages de jeux qui ont été proposés avec quelques pépites comme récemment Professor Layton: Curious Village HD ou encore REDRIVER2.\n \nSi vous voulez suivre les délibérations, cela va se passer dans les prochains jours, restez par là nous vous tiendrons au courant des gagnants ainsi que des propositions qui seront titrées. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1178538/in-vita-fuhen-le-concours-touche-a-sa-fin-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] NXMP 0.8.0 disponible avec de nombreux changements",
        "content": "proconsule vient de mettre en ligne une nouvelle version de NXMP à destination de la Nintendo Switch. \n \nPour rappel, NXMP est un lecteur vidéo pour Nintendo Switch basé sur MPV https://mpv.io/ et sur la solution open source de Cpasjuste pplay, il supporte la plupart des formats vidéo populaires, le streaming HTTP et FTP et également les décodeurs Enigma2, qui sont des récepteurs satellite Linux. \n \n \n \n\n \n \n \nChangelog 0.8.0 : \n \nAjout : \n- Prise en charge des DVD ISO VIDEO (DVD et HD-DVD) (la piste la plus longue est lue par défaut)\n- Mise à jour de l'interface graphique (affichage de la date du fichier sur les FS qui le supportent)\n- Sortie audio Audren (SDL reste la valeur par défaut si elle n'est pas modifiée dans les paramètres)\n- Media Probe (pour l'analyse de la durée des Playlists et dans le futur pour d'autres choses intéressantes)\n- Mini Player (en parcourant le contenu NXMP)\n% de batterie et horloge HH::MM dans le menu\n- Menu contextuel (pour la navigation dans les fichiers et le menu de la liste de lecture)\n- Tri des fichiers (nom, date, taille)\n- Liste des extensions utilisateur dans le fichier de configuration (vous pouvez filtrer les extensions de fichiers que vous souhaitez)\n- Démarrage désactivé en mode applet (nous avons besoin d'un accès complet à la RAM)\n- Description des boutons en bas de l'écran pour les fonctions pertinentes\n \nModifications : \n- Le fichier de configuration de la section Réseau a été modifié (voir README.md pour plus de détails)\n- Mise à jour de SQLite de 3.7.3 à 3.43.1\n \nCorrection : \n- Correction du décodeur VP9 HW\n- Vidéo MPEG2 maintenant par défaut au décodage HW\n- Mise en page en mode dock\n- Petites corrections dans le code\n \nProblèmes connus :\n- Des tonnes de changements peuvent conduire à des tonnes de bugs...\n- Je sais que le code est en désordre mais il fonctionne (j'essaie lentement de l'améliorer).\n \nInformations sur la version : \n- Depuis que l'analyseur ini a changé, il est recommandé de commencer avec un nouvel ini.\n- La syntaxe du partage réseau a changé, voir le README pour plus de renseignements\n \n \nTéléchargement : NXMP 0.8.0 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1178433/in-switch-nxmp-080-disponible-avec-de-nombreux-changements-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS4/PS5] TheFlow annonce des failles importantes reportées récemment",
        "content": "Le développeur TheFlow a lancé quelques tweets qui suffisent à enflammer la scène PlayStation, un simple \"Spoiler alert : don't update\" suffit à mettre tout le monde d'accord.\n \nIl s'agit selon lui de \"bugs très cools\" qui ont été reportés à Sony, certainement dans le cadre du programme bounty, afin d'en tirer des milliers de $, qui prendront \"du temps avant qu'ils ne soient divulgués\". Clairement comme nous en avons l'habitude, ces bugs ont été reportés, ils seront donc dévoilés dans 6 mois, donc autour du mois de Mars 2024, il faudra ensuite qu'ils soient implémentés. \n \nRien n'est dit au sujet de ces bugs, ils pourraient très bien concernées les firmwares 4.xx, 5.xx ou 6.xx, ou même les derniers firmware 8.xx, TheFlow ironisant en disant que cela concerne même la prochaine console PS6.\n \n \n \n\n \n \n \n \nCes bugs pourraient aussi concernés la PS4 et donc être implémentés sur les derniers firmwares de la console, au dessus du firmware 9.00 jusqu'au 11.00. \n \nN'oublions qu'il y a quelques jours, TheFlow a annoncé que son exploit bd-jb fonctionnait sur le dernier firmware. \n \n \n \n\n \n \nLe développeur Notzecoxao lui mise sur un exploit compris entre le 5.xx à 7.xx. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1178427/in-ps4ps5-theflow-annonce-des-failles-importantes-reportees-recemment-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1178427/in-ps4ps5-theflow-annonce-des-failles-importantes-reportees-recemment-2.png"
        }
    },
    "news_20": {
        "title": "[PS4] GoldHEN Cheats Manager v1.1.4 disponible",
        "content": "Le développeur Bucanero vient de publier une nouvelle version de GoldHEN Cheats Manager pour PlayStation 4 et PlayStation 4 Pro, cette nouvelle version 1.1.4 apporte pas mals de nouveautés \n \n \n\n \n \nAjout\n- Ajout d'un outil de mise à jour des plugins (@illusion0001)\n- Sauvegarde des plugins locaux\n- Amélioration de la mise à jour locale des cheats et patches\n- La mise à jour locale (Cheats, Patches, Plugins) analyse les fichiers dans 8 partitions USB montées possibles et sur le disque dur.\n- Ajuster l'assignation des boutons Cercle/Croix en fonction des paramètres de la console\n- Téléchargement de la mise à jour de l'application .pkg sur usb0 si disponible\n \nModifié\n- Modification des chemins de sauvegarde en :\n- /mnt/usb0/backups/(nom)\n- /data/GoldHEN/backup/nom/\n \nDivers\n- Mise à jour de la version du SDK Open Orbis\n- Inclut le dernier cheat+patch pack officiel (2023-09-21)\n \n \nTéléchargement : GoldHEN Cheats Manager v1.1.4 \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1178210/in-ps4-goldhen-cheats-manager-v114-disponible-1.jpg"
        }
    }
}