{
    "news_1": {
        "title": "[PS5] PS5 Homebrew Apps_v1.4 disponible",
        "content": "Le développeur Master-s propose une nouvelle version de PS5 Homebrew Apps qui est maintenant affublé de la numérotation 1.4.\n \nPS5 Homebrew Apps est un ensemble d'homebrews qui fonctionne avec websrv. websrv est un serveur Web simple qui peut être exécuté sur une Playstation 5 jailbreakée via les points d'entrée BD-J ou Webkit . Il peut être utilisé pour lancer des homebrews via le navigateur Webkit intégré à la PS5, ou à distance depuis votre PC, smartphone...\n \n \n\n \n \nDans cette version 1.4 le développeur a ajouté fetchpkg.elf et kstuff.elf.\n \nTéléchargement : PS5 Homebrew Apps_v1.4 \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203347/in-ps5-ps5-homebrew-apps-v14-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PSP] ChronoSwitch v7.6.3 disponible",
        "content": "Il aura fallu attendre 6 ans, mais voilà que débarque une nouvelle version de ChronoSwitch Downgrader, l'outil qui permet de downgrade la console PSP, développé à l'origine par Davee, l'utilitaire a repris du service grâce au développeur krazynez. \n \nLa mise à jour a démarré il y quelques jours puisque les premiers changements ont eu lieu le 30 décembre 2024, avec notamment l'ajoute de nouveaux prints pour diagnostiquer des problèmes avec l'Eboot.pbp grâce à une analyse poussée des fichiers et des tampons ainsi que des rapport d'erreurs. \n \n \n\n \n \n \nChangelog ChronoSwitch v7.6.3 :\n \n- Firmware downgrader pour la Playstation Portable (PSP)\n- Mise à jour pour utiliser la somme de contrôle md5 pour le firmware PSP GO\n- Plus de clarté dans la sélection du firmware de base afin d'exécuter ChronoSwitch \n \n \n\n \n \nDes améliorations ont été apportées sur l'utilisation des contrôles MD5 pour le firmware PSPgo, pour installer Chronoswitch Downgrader vous allez devoir télécharger et extraite le contenu dans le dossier PSP de votre console. \n \nTéléchargement : ChronoSwitch Downgrader v7.6.3\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203345/in-psp-chronoswitch-v763-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203345/in-psp-chronoswitch-v763-disponible-1.jpg"
        }
    },
    "news_3": {
        "title": "[WiiU] minutes v1.1 disponible",
        "content": "Le développeur jan-hofmeier propose une mise à jour de minute_minute, qui comme vous le savez permet de remplacer le boot1 de la Nintendo Wii U, un peu comparable à BootMii. \n \nMinute_minute ne s'affichent plus pendant le démarrage automatique et le rechargement de l'IOSU.\n \n \n\n \n\n \n \n \nChangelog :\n \n- masque les minutes au démarrage automatique\n- masque les minutes lors du rechargement d'iosu\n \n \nTéléchargement : minute_minute v1.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203343/in-wiiu-minutes-v11-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203343/in-wiiu-minutes-v11-disponible-2.png"
        }
    },
    "news_4": {
        "title": "[Switch] Switchroot LineageOS Downloader v1.0.1 disponible",
        "content": "Le développeur sthetix a dévoilé Switchroot LineageOS Downloader qui passe déjà en v1.0.1. De quoi s'agit-il, d'un petit programme Windows qui permet de simplifier le processus de téléchargement et d'organisation des builds LineageOS pour la console Switch. \n \nCette petite application permet de télécharger les fichiers nécessaires, elle va se charger de vérifier l'intégrité avec les contrôles SHA-256, l'idée est aussi d'organiser les dossiers correctement pour une installatio simplifiée, voir pour les variantes des tablettes ou des android TV.\n \nLe logiciel se charge automatiquement de créer des dossiers, y compris swithroot et bootloader, qui va générer le fichiers android.ini, ce logiciel s'appuie aussi sur les téléchargements multithreads, sur des fonctions de reprises de téléchargements, ou encore d'optimisation de bande passante. \n \n \n \n\n \n \n \nChangelog 1.0.1 : \n \n- Gestion des téléchargements améliorée : processus rationalisés pour une gestion plus facile des fichiers et une gestion plus efficace des téléchargements ayant échoué.\n- Barre de progression améliorée : un indicateur de progression visuellement amélioré qui compte les fichiers téléchargés (par exemple, 1 sur 10) au lieu d'afficher la taille totale du fichier.\n- Compatibilité multiplateforme : inclut un script Python spécial, LineageOSDownloader-mac-pc.py, conçu pour la compatibilité avec Mac et PC (Remarque : non testé sur macOS).\n \nChangelog 1.0.0 : \n \n- Interface graphique facile à utiliser : une interface claire et intuitive pour une navigation fluide.\n- Thème sombre : un thème sombre moderne pour une utilisation confortable.\n- Structure de dossiers automatique : crée les dossiers nécessaires ( switchroot, bootloader, etc.) et génère le fichier android.in requis.\n- Téléchargements multithreads : télécharge plusieurs fichiers simultanément pour des performances plus rapides.\n- Vérification de la somme de contrôle : garantit l'intégrité des fichiers en vérifiant les sommes de contrôle SHA-256 pour les fichiers téléchargés.\n- Téléchargements reprenables : prend en charge la reprise des téléchargements interrompus, économisant ainsi du temps et de la bande passante.\n- Suivi de la progression : mises à jour de la progression en temps réel avec une barre de progression et des statistiques de téléchargement détaillées.\n- Gestion des erreurs : réessaye automatiquement les téléchargements ayant échoué et enregistre les erreurs à des fins de dépannage.\n- Répertoire de téléchargement personnalisable : les utilisateurs peuvent sélectionner un dossier de téléchargement personnalisé.\n- Portable : Aucune installation requise ; téléchargez simplement le fichier EXE et exécutez-le.\n \nTéléchargement : Switchroot LineageOS Downloader v1.0.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203319/in-switch-switchroot-lineageos-downloader-v101-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS5] etaHEN 2.0b pre-release intégré dans IPV6-BDJ-etaHEN",
        "content": "Si vous suivez l'actualité de la scène PS5, cela ne vous aura pas échappé que LightningMods propose depuis quelques jours de tester etaHEN 2.0b Pre-Release. Bien entendu cette version doit être utilisé avec la toute dernière version ItemzFlow, l'ensemble se trouvant ici : https://github.com/etaHEN/etaHEN/releases/tag/2.0b-pre\n \nLightningMods a informé qu'il n'y aura plus de mise à jour d'etaHEN avant l'arrivée de la version finale, sans pour autant s'engager sur un délai de disponibilité, cette pre-release servant de beta-test. La première des choses qui frappe est que le poids a été divisé par trois, cette version préliminaire ne sera pas mise à jour. Toutes les corrections ou mises à jour effectuées après cette version seront enregistrées et ajoutées à la version finale.\n \n \nTéléchargement : etaHEN 2.0b pre-release\n \n \nLe développeur vient également de publié une version d'IPV6-BDJ-etaHEN intégrant cette version d'etaHEN 2.0b Pre-Release, il s'agit d'une version ISO qui peut être lancé avec l'exploit blu-ray BDJ qui fonctionnera sur les firmwares 3.00 à 4.51 (l'exploit blu-ray lui fonctionnant au dessus, mais pas l'exploit kernel). \n \n \n \n\n \n \n \n \nTéléchargement : IPV6-BDJ-etaHEN avec etaHEN 2.0b Pre-Release\n \n \n \n",
        "images": {}
    },
    "news_6": {
        "title": "[Multi] Des failles dans les AMD Zen 1 à Zen 4",
        "content": "Notre ami sunriseur rim-k06 nous informe via le tchat que des failles de sécurité ont été découvertes sur les CPU Zen 1 à Zen 4, des vulnérabilités de vérification de firmwares présentes et exploitables sur de nombreux appareils et qui pourraient être utilisé à des fins malveillantes. \n \nGoogle, via son équipe Google Security Research, a récemment publié un avertissement de sécurité (GHSA-4xq7-4mgh-gp6w) mettant en garde contre une vulnérabilité critique affectant un logiciel ou une bibliothèque open source largement utilisée. Bien que les détails techniques exacts n’aient pas été divulgués publiquement pour éviter toute exploitation malveillante, l’avertissement indique que cette faille pourrait permettre à un attaquant d’exécuter du code à distance ou de provoquer un déni de service.\n \nSelon les experts en sécurité, cette vulnérabilité pourrait toucher des milliers de systèmes et d’applications dépendants de la bibliothèque ou du logiciel concerné. Les secteurs les plus à risque incluent les services cloud, les infrastructures critiques et les applications web. Google a noté que les attaquants pourraient exploiter cette faille pour prendre le contrôle de systèmes vulnérables ou interrompre des services essentiels.\n \n \n\n \n \nGoogle a collaboré avec les acteurs du projet concerné pour publier un correctif. Les utilisateurs et administrateurs sont vivement encouragés à :\n \n- Vérifier s’ils utilisent une version affectée du logiciel ou de la bibliothèque.\n- Appliquer immédiatement les mises à jour ou correctifs fournis.\n- Surveiller les systèmes pour détecter toute activité suspecte.\n \nCet avertissement souligne l’importance de la collaboration entre les chercheurs en sécurité et les macteurs de projets open source. Google Security Research joue un rôle clé dans l’identification et la correction des vulnérabilités avant qu’elles ne soient exploitées à grande échelle.\n \nPour plus de détails techniques, les utilisateurs peuvent consulter le document officiel sur GitHub : GHSA-4xq7-4mgh-gp6w.\n \n \nA l'image de ce qui se passe sur le programme bounty, les failles ont été rapportées le 25 septembre 2024, et n'ont été dévoilées qu'hier, laissant le temps à AMD et aux acteurs de réagir, AMD a ensuite fourni un correctif sous embargo à ses clients le 17 décembre 2024. Pour coordonner nos efforts avec AMD, nous avons fait une exception ponctuelle à notre politique standard de divulgation des vulnérabilités et avons retardé la divulgation publique jusqu'à aujourd'hui, le 3 février 2025. \" Cette divulgation conjointe intervient 46 jours après qu'AMD a partagé le correctif avec ses clients et 131 jours après le rapport initial de Google. En raison de la chaîne d'approvisionnement, de la séquence et de la coordination approfondies requises pour résoudre ce problème, nous ne partagerons pas tous les détails pour le moment afin de donner aux utilisateurs le temps de rétablir la confiance dans leurs charges de travail informatiques confidentielles. Nous partagerons des détails et des outils supplémentaires le 5 mars 2025. \" \n \n \nMerci rim-k06 pour l'information. \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203298/in-multi-des-failles-dans-les-amd-zen-1-a-zen-4-1.png"
        }
    },
    "news_7": {
        "title": "[PS3] PS3HEN Open Beta (release candidate) d'esc0rtd3w disponible",
        "content": "Le développeur esc0rtd3w propose depuis quelques jours de tester une version Bêta de ce qui sera le prochain PS3HEN, nous sommes déjà à la version 9 de ce test grand public qui est ce que l'on pourrait qualifier d'Open Bêta. \n \nLes changements ne sont pas forcément le fruit d'esc0rtd3w, Aldostools a largement contribué à modifier certains paramétrages. Cette version du 02.02.2025 est la version la plus aboutie, appelée Version Candidate n°1 entre les firmwares 4.80 et 4.91 en CEX.\n \n \nCette version 3.3.1 apporte bien entendu pas mal de changements.\n \n \n\n \n \n \n3.3.1 Source :\n \n- Modifications du plugin HEN\n- Ajout de la fonctionnalité de restauration HEN pour le nouveau package qui prend en charge la survie de HEN après un reformatage du disque dur (merci @LuanTeles )\n- Ajout de la fonction create_default_dirs pour créer des dossiers standard s'ils manquent sur dev_hdd0 (merci @LuanTeles )\n- Ajout de la fonction DLOG pour la sortie vers usb000 (développeurs uniquement)\n- Ajout du nettoyage des fichiers PSN (merci @LuanTeles )\n- Fonction clear_web_cache_check nettoyée\n- Fonctions mises à jour pour les préréglages LED\n- Fonction set_build_type mise à jour pour vérifier les ports USB 000 - 007 (pour le mode développeur)\n- Programme d'installation d'urgence mis à jour pour vérifier les ports USB 000 - 007 (HEN_UPD.pkg depuis USB)\n- Modifications du payload\n- Les fichiers du plug-in de démarrage sont désormais renommés temporairement, au lieu de les supprimer si WMM est détecté lors de l'installation\n- Mise à jour des décalages cellFsMkdir_symbol\n- Ajout de cellFsRename_symbol\n- Ajout de la prise en charge de rap.bin. Il recherche /dev_hdd0/game/PS3XPLOIT/USRDIR/rap.bin lorsque la fonction make_rif s'exécute.\n- Modifications apportées à la fonctionnalité make_rif pour de meilleures performances (merci @aldostools )\n- Mise en œuvre d'une fonctionnalité de lecture optimisée de rap.bin (merci @Evilnat )\n- Modifications des ressources\n- Ajout de nouveaux fichiers RAF de coldboot personnalisés pour la publication, le débogage, l'USB et DEX (merci @Charles_n_town )\n- Utilisation du répertoire de jeu PS3XPLOIT pour ajouter l'état d'installation de HEN à la base de données GAMEDATA, pour survivre au format HDD (masqué du XMB) (merci @LuanTeles )\n- Entrée seg_mcutility corrigée dans category_game.xml (répare le problème avec l'élément de menu de la carte mémoire virtuelle PS1/PS2) (merci @LuanTeles )\n- Ajout du lien d'installation/lanceur PS Home sous la catégorie PSN (merci @DeViL303 )\n \n \n \nTest n°9 (02-02-2025) : version candidate n°1 (firmware entre 4.80 - 4.91 CEX)\n \nAttention : il y a un lien par firmware ! \n \n \nTout est là : psx-place.com\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203278/in-ps3-ps3hen-open-beta-release-candidate-desc0rtd3w-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[Switch] ezRemote mis à jour sur PS3, Switch et Vita",
        "content": "Le développeur cy33hc propose une nouvelle version d'ezRemote, mais comme toujours, ce sont toutes les consoles qui profitent de ces évolutions. Il n'y a que la version PS4 qui n'a étrangement pas été mise à jour. \n \n \n\n \n \nChangelog : \n \n- Correction d'un crash aléatoire lors de la connexion à archive.org\n- Mise en oeuvre d'une optimisation de la mémoire lors de l'analyse de listes HTML volumineuses dans archive.org et le site Web myrient. Certaines listes volumineuses de quelques milliers ne devraient plus faire planter l'application maintenant. L'application peut toujours planter s'il y a plus de 5 000 listes dans un répertoire.\n- L'application demandera désormais un filtre lorsque la liste des répertoires archive.org et myrient contient plus de 500 listes. Il est recommandé d'appliquer un filtre pour réduire les résultats afin d'éviter le plantage de l'application\n \n \n \nTéléchargement : ezRemote v1.09 / ps3-ezremote 1.10 / vita-ezremote 1.10\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203267/in-switch-ezremote-mis-a-jour-sur-ps3-switch-et-vita-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS3] WebMAN MOD 1.47.47n disponible",
        "content": "Le développeur Aldo Vargas, connu sous le pseudonyme d'Aldostools, vient de publier une nouvelle version de son plugin WebMAN MOD qui est désormais proposé en v1.47.47n.\n \nComme vous le savez son plugin développé par Deank permet de lancer des backups de jeux PS3, PS2, PS1, PSP ainsi que des Blu-ray ou des DVD, stocké sur disque dur (y compris en NTFS) ou sur le réseau local, au format JB ou ISO. M@tsumot0 et Aldostools ont proposé une version MOD de webMan, apportant notamment le support de 21 langages utilisant des fichiers externes, un installer/updater pour CFW Cobra et NonCobra, le spoof IDPS/PSID, la désactivation des syscalls du cfw, et de nombreuses autres évolutions qui se sont succédées.\n \n \n \n\n \n \nChangelog : \n \n- Mise à jour cumulative (comprend plus de 29 changements sur l'ensemble d'outils depuis la version initiale de 1.47.46).\n- Correction de la détection des clés partielles dans language.h #1170\n- Régression corrigée dans l'affichage de /setup.ps3\n- Correction d'une erreur typographique dans le code setu qui dupliquait les paramètres pour « Attendre qu'un périphérique USB soit prêt » #1169\n- Correction automatiquement l'horloge PS3 si la date est antérieure au 24/12/2024.\n- Nouvelles mises à jour de la base de données de configuration PS2 avec corrections de bugs@mrjaredbetaet@kozarovv.\n- Configuration webMAN : ajout d'un sous-menu pour activer/désactiver webMAN MOD Lite\n- Création de répertoire par défaut modifiée en fonction du type de contenu sélectionné dans /setup.ps3\n- Divers correctifs mis en œuvre par@sunnyqeen #1158  #1155  #1145 ",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203266/in-ps3-webman-mod-14747n-disponible-1.png"
        }
    },
    "news_10": {
        "title": "[PS4] Une demande de retrait DMCA pour Bloodborne étrange",
        "content": "Sony a récemment envoyé une notification DMCA (Digital Millennium Copyright Act) concernant un patch pour le jeu Bloodborne qui avait été publié en 2021, c'est ce que rapporte IGN.com. Ce patch, développé par des passionnés, vise à améliorer l'expérience de jeu sur PlayStation 4, notamment en ajustant le taux de rafraîchissement et en corrigeant certains bugs.\n \n \n\n \n \nBien que le patch ait été disponible depuis plusieurs années, Sony semble maintenant prendre des mesures pour empêcher sa distribution. La notification DMCA cible spécifiquement les liens et les ressources liés à ce patch, invoquant des violations de droits d'auteur.\n \nCette décision a suscité des réactions mitigées dans la communauté des joueurs. Certains soutiennent que Sony protège légitimement sa propriété intellectuelle, tandis que d'autres estiment que le patch était une contribution positive pour les fans de Bloodborne, un jeu qui n'a jamais reçu de mise à jour officielle pour les consoles next-gen comme la PlayStation 5.\n \nPour l'instant, il reste à voir si cette action de Sony aura un impact plus large sur les mods et les patches créés par la communauté pour d'autres jeux de la marque, mais il pourrait s'agir avant tout d'une demande de FromSoftware. \n \n \n \n\n \n \nBloodborne est bien sûr l'une des plus grandes énigmes de l'industrie du jeu vidéo. Le chef-d'oeuvre de FromSoftware a été lancé sur PS4 et a été salué par la critique et le public, mais depuis, Sony et FromSoftware n'y ont plus touché, il semblerait qu'un remake ou un remaster soit donc dans les projets, ce qui viendrait justifier cette demande de DMCA. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203246/in-ps4-une-demande-de-retrait-dmca-pour-bloodborne-etrange-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203246/in-ps4-une-demande-de-retrait-dmca-pour-bloodborne-etrange-2.png"
        }
    },
    "news_11": {
        "title": "[PS4] Les GoldHEN Cheats mis à jour encore et toujours",
        "content": "De manière régulière les cheats codes de GoldHEN Cheat sont mis à jour par de nombreux développeurs et utilisateurs, la liste de codes est très régulièrement mise à jour, il faut dire que cela évolue vite. \n \nAu délà de rajouter ou modifier certains codes, ce sont de nouveaux supports qui sont aussi ajoutés, et certains sont spécifiques selon les jeux, ainsi depuis le début de l'année des jeux comme Final Fantasy 7 Remake 1.02, Astérix, Devil May Cry Définitive Edition, ou encore The Witcher 3 Wild Hunt 4.06 ont vu débarquer des updates spécifiques. \n \nPour mettre à jour les cheats codes il est préférable d'utiliser GoldHEN_Cheat_Manager de Bucanero, même si ce dernier a été archivé.\n \n \n \n\n \n \n \nComme vous le savez, activer ce genre de fonctions, de vies, d'argent ou de munitions illimitées peuvent gâcher un peu le plaisir de jouer et l'équilibre défini par les développeurs des jeux, donc à utiliser avec parcimonie.\n \n \nTéléchargement : GoldHEN_Cheat_Repository (01/02/2025)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203243/in-ps4-les-goldhen-cheats-mis-a-jour-encore-et-toujours-1.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] DeepSea 4.13.0 disponible",
        "content": "Le développeur mkod avec la collaboration de la Team-Neptune vient de mettre à jour la solution All-in-one DeepSea, pour rappel, DeepSea est un Pack AIO regroupant tout en un pack, l'objectif est de facilité l'accessibilité pour les utilisateurs d'Atmosphère.\n \nAttention, comme le précise mkody il ne s'agit pas d'une version officielle proposée par Team-Neptune, l'objectif étant avant tout d'apporter le support d'Atmosphere 1.8.0 et d'Hekate 6.2.2.\n \n \n\n \n \nChangelog : \n \n- Mise à jour de la version dans settings.json\n- Mise à jour du référentiel des actions GitHub \n- sys-ftpd-light est désormais sys-ftpd\n- Fusion de la demande d'extraction n°145 depuis mkody/feature/update-actions \n- Fusion de la demande d'extraction n°146 depuis mkody/feature/rename-to-sysftpd \n- Ajout support Atmosphère 1.8.0\n- Ajout support Hekate 6.2.2\n- Support du firmware officiel 19.0.0 et 19.0.1\n \n \nTéléchargement : DeepSea 4.13.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203230/in-switch-deepsea-4130-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[PS4] shadps4 v0.6.0 disponible",
        "content": "Le développeur George Moralis dévoile une nouvelle version de l'émulateur shadps4, voilà que débarque la v0.6.0 avec de nombreux changements en partie implémentés dans les versions intermédiaires, notamment 0.5.1 qui n'aura finalement pas été proposée bien longtemps. \n \n \n\n \n \nBeaucoup de choses ont été améliorées depuis la dernière version, rendant un grand nombre de nouveaux jeux jouables et d'autres ayant des progrès intéressants. Voici une courte liste de ce qui a changé :\n \n- Outils de développement améliorés\n- Amélioration du recompilateur de shaders\n- Ajout de sceGnmGetEqEventType/sceKernelGetEventData\n- Amélioration du backend audio (SDL)\n- Amélioration de la bibliothèque de fibres HLE\n- Implémentation des contrôles de mouvement\n- Améliorations des données sauvegardées\n- Corrections de l'Unmap\n- Implémentation des fonctions sceNpCmp\n- GUI : Accélération du chargement de l'interface graphique par la mise en cache des tailles de jeu\n- Implémentation de sceKernelAio*\n- Corrections pour plusieurs formats de surface\n- Correction de l'initialisation de l'address_space sous Windows\n- Correction de sceKernelVirtualQuery\n- Ajout de la possibilité de changer le chemin des données de sauvegarde\nbibliothèques : Implémentation de libSceZlib\n- Mise à jour de plusieurs traductions\n \nLa liste de compatibilité se trouve ici : shadps4-game-compatibility\n \n \nTéléchargement : shadPS4 0.6.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203216/in-ps4-shadps4-v060-disponible-1.jpg"
        }
    },
    "news_14": {
        "title": "[Multi] Playnite 10.35 disponible",
        "content": " \nPlaynite est un gestionnaire de jeux vidéo universel et open-source conçu pour centraliser toutes vos bibliothèques de jeux en un seul endroit, quelle que soit la plateforme ou le store (Steam, Epic Games Store, GOG, Xbox, PlayStation, Nintendo, etc.). Il est particulièrement apprécié des joueurs PC qui possèdent des jeux sur plusieurs plateformes et qui souhaitent une interface unique pour gérer et lancer leurs jeux.\n \nIl a intégré de nombreuses fonctionnalités importantes et s'ouvre de plus en plus aux émulateurs 3DS, PS4 et RetroArch comme le montre le dernier changelog, il est d'ailleurs possible de retrouver l'outil ici : https://playnite.link\n \n \n\n \n \n \nFonctionnalités principales de Playnite :\nCentralisation des jeux :\n- Importez vos jeux depuis des plateformes comme Steam, Epic Games, GOG, Origin, Uplay, Xbox, PlayStation Network, etc.\n- Ajoutez manuellement des jeux non pris en charge par les plateformes intégrées.\n \nInterface personnalisable :\n- Plusieurs thèmes disponibles pour adapter l'apparence de Playnite à vos préférences.\n- Mode plein écran (Fullscreen) pour une expérience similaire à celle d'une console.\n \nGestion des métadonnées :\n- Téléchargez automatiquement les informations sur vos jeux (images, descriptions, genres, etc.).\n- Ajoutez des tags personnalisés, des catégories ou des notes pour organiser votre bibliothèque.\n \nIntégration des émulateurs :\n- Ajoutez et gérez vos jeux rétro via des émulateurs (Nintendo, PlayStation, Sega, etc.).\n- Playnite peut importer automatiquement vos ROMs et les organiser dans votre bibliothèque.\n \nExtensions et plugins :\n- Une communauté active propose des plugins pour étendre les fonctionnalités de Playnite (intégration de nouvelles plateformes, outils de sauvegarde, etc.).\n- Possibilité de créer vos propres extensions si vous avez des compétences en programmation.\n \nPortable et léger :\n- Playnite est léger et ne nécessite pas d'installation (version portable disponible).\n- Il fonctionne sur Windows et est entièrement gratuit.\n \nPourquoi utiliser Playnite ?\nGain de temps : Plus besoin d'ouvrir plusieurs clients de jeux (Steam, Epic, etc.) pour accéder à vos jeux.\nPersonnalisation : Vous pouvez organiser et personnaliser votre bibliothèque selon vos préférences.\nCompatibilité multiplateforme : Idéal pour les joueurs qui possèdent des jeux sur plusieurs stores ou plateformes.\nCommunauté active : Playnite est open-source et bénéficie d'une communauté qui propose régulièrement des mises à jour, des thèmes et des plugins.\n \n \nChangelog 10.35 : \n \nNouveau :\n \nAjout du profil d'émulateur Lime3DS (par Jeshibu)\nAjout du support de l'émulateur ShadPS4 (par vaughngx4)\n \nCorrection  : \n \n- Mises à jour du profil de l'émulateur RetroArch (par darklinkpower)\n- Empêche l'activation du HDR sur Windows 24H2 lors de la fermeture d'un jeu (par lscholte)\n- Bibliothèque d'entrées de manette de jeu mise à jour\n- État et paramètres du plug-in : Les balises de liaison ne sont pas disponibles pour les thèmes en mode plein écran\n \n \n \nTéléchargement : Playnite 10.35\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203205/in-multi-playnite-1035-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS5] PS5 Jar Loader 3.1.0 disponible",
        "content": "Le projet PS5 Jar Loader, développé par hammer-83, vient de dévoiler sa toute nouvelle version 3.1.0, cette mise à jour apporte son lot d'améliorations, de nouvelles fonctionnalités et de corrections de bugs, consolidant sa position comme un outil essentiel pour les développeurs et les passionnés de la PlayStation 5. \n \nLes Nouveautés de la Version 3.1.0 :\n \nAmélioration de la Stabilité : La version 3.1.0 corrige plusieurs bugs critiques signalés par la communauté, offrant une expérience plus fiable et fluide.\n \nSupport Étendu pour les Fichiers JAR : Les fonctionnalités de chargement et d'exécution des fichiers JAR ont été optimisées, permettant une compatibilité accrue avec des applications Java variées.\n \nInterface Utilisateur Améliorée : Des ajustements ont été apportés à l'interface pour la rendre plus intuitive et accessible, même pour les utilisateurs moins expérimentés.\n \nPerformances Boostées : Le temps de chargement des fichiers a été réduit, et l'exécution des applications est désormais plus rapide.\n \n \n\n \n \nNouvelles Fonctionnalités :\n \n- Un nouveau payload pour le jailbreak du processus BD-J : Ce fichier JAR définit l'utilisateur du processus comme \"root\" et redéfinit la racine du système de fichiers sur \"/\", permettant ainsi de s'échapper de la prison \"/app0\". Après l'exécution de ce payload, le serveur FTP pourra accéder à l'intégralité du système de fichiers.\n \n- Un autre payload pour récupérer le contenu de Klog via le réseau : Ce payload utilise des outils comme netcat pour récupérer les logs Klog à distance.\n \n- Exécution des payloads en arrière-plan : Le JAR loader peut maintenant exécuter des payloads en arrière-plan tout en acceptant d'autres fichiers JAR. Deux payloads ont été adaptés pour fonctionner en tâche de fond : le serveur FTP et le serveur Klog.\n \nCorrectifs :\n \n- Amélioration de la stabilité d'UMTX2 : Des problèmes de blocage (deadlocks) systématiques dans la dernière mise à jour ont été résolus, avec une stabilité espérée améliorée.\n \n- Revert des optimisations d'appels natifs : Des problèmes de stabilité liés aux optimisations des appels natifs dans la dernière version sont toujours en cours d'investigation. Pour l'instant, le code est revenu à un état proche de la version précédente.\n \nNotes :\n \nCompatibilité ascendante non garantie : Comme d'habitude, la compatibilité avec les versions précédentes du JAR loader n'est pas assurée.\n \nProblèmes persistants sur les firmwares 6.00 et ultérieurs : Tenter d'écrire dans certaines régions des données du kernel entraîne toujours un panic (crash) sur les firmwares 6.00 et supérieurs.\n \n \n \nTéléchargement : PS5 Jar Loader 3.1.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203195/in-ps5-ps5-jar-loader-310-disponible-1.jpeg"
        }
    },
    "news_16": {
        "title": "[Multi] Super Mario gagne contre Nintendo",
        "content": "Dans une décision surprenante, la National Register du Costa Rica a récemment tranché en faveur du supermarché \"Super Mario\" de San Ramón, après que Nintendo ait contesté l'utilisation de ce nom. La célèbre entreprise japonaise, connue pour ses jeux vidéo et ses personnages emblématiques, avait intenté une action en justice pour empêcher le supermarché de renouveler son enregistrement de nom (marque).\n \nLe supermarché \"Super Mario\", dirigé par Don José Mario Alfaro González, utilise ce nom depuis des décennies. Le magasin ne se sert d'aucun personnage ou logo de Nintendo dans ses promotions ou publicités, mais l'usage du nom a suffi à attirer l'attention de l'entreprise japonaise, dont la vigilance en matière de protection des marques est bien connue.\n \n \n \n\n \n \nLors de l'audience, les représentants de Nintendo ont soutenu que le nom \"Super Mario\" pourrait induire une confusion parmi les consommateurs, bien que le supermarché se limite à la vente de produits alimentaires et domestiques et n'ait aucun lien avec l'industrie du jeu vidéo. De leur côté, les avocats de Don José Mario ont souligné que le nom du magasin n'avait jamais été source de litige avant la tentative de renouvellement d'enregistrement, et que la marque \"Super Mario\" de Nintendo n'était pas enregistrée pour les supermarchés.\n \nFinalement, la National Register a conclu que Nintendo n'avait pas de droits exclusifs sur le nom \"Super Mario\" dans le contexte des supermarchés, permettant ainsi à Don José Mario de conserver le nom de son établissement. Ce verdict a été accueilli avec soulagement et joie par le propriétaire, qui a remercié la communauté locale pour son soutien tout au long de cette affaire.\n \n \n\n \n \nL'affaire a suscité un débat sur l'étendue de la protection des marques et la capacité des grandes entreprises à influencer les petites entreprises locales. Tandis que Nintendo est régulièrement impliquée dans des litiges concernant ses marques, cette décision montre que les tribunaux peuvent également statuer en faveur des plus petits opérateurs face aux géants industriels.\n \nAvec cette victoire, le supermarché \"Super Mario\" continue d'opérer sous son nom historique, apportant un service essentiel à sa communauté tout en affirmant sa propre identité face à l'industrie du jeu vidéo.\n \n \nTout est là : facebook.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203191/in-multi-super-mario-gagne-contre-nintendo-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203191/in-multi-super-mario-gagne-contre-nintendo-2.png"
        }
    },
    "news_17": {
        "title": "[DS/2DS/3DS] TWiLight Menu++ v27.12.4 et nds-bootstrap v2.4.0 disponibles",
        "content": " \nLe développeur RocketRobz dévoile de nouvelles versions de TWiLight Menu++ et de nds-bootstrap qui respectivement sont désormais proposées en v27.12.4 et v2.4.0.\n \nDe nouveaux paramètres de préchargement intégrés ont été ajoutés à nds-bootstrap pour les jeux suivants afin d'améliorer la vitesse de chargement ! (Cela ne s'applique pas aux ROMs piratées ou traduites, sauf indication contraire.)\n \n\n \nJeux :\n \n- Animal Crossing: Wild World (versions USA, Japon et Corée seulement) (3DS)\n- Castlevania: Dawn of Sorrow (3DS)\n- Castlevania: Portrait of Ruin (3DS)\n- Castlevania: Order of Ecclesia (3DS)\n- Classic Word Games (3DS, mode DSi)\n- Diddy Kong Racing DS (DSi)\n- English Training: Have Fun Improving Your Skills (DSi/3DS)\n- FabStyle (3DS)\n- Geometry Wars: Galaxies (DSi/3DS)\n- Juiced 2: Hot Import Nights (DSi)\n- Kirby Super Star Ultra (3DS)\n- The Legend of Zelda: Phantom Hourglass (3DS)\n- Mario Hoops 3 on 3 (versions USA et Japon seulement) (3DS)\n- Mario Kart DS (DSi)\n- MegaMan Zero Collection (3DS)\n- MegaMan ZX (3DS)\n- MegaMan ZX Advent (3DS)\n- Metal Slug 7 (DSi/3DS)\n- Metroid Prime Hunters (3DS)\n- New Super Mario Bros. (DSi)\n- Plants vs. Zombies (DSi/3DS)\n- Power Rangers: Samurai (3DS)\n- Professor Layton and the Curious Village (versions USA, Japon et Corée seulement) (3DS)\n- Sonic Colors (3DS)\n- Sonic Rush (3DS)\n- Sonic Rush Adventure (3DS)\n- Tomodachi Collection (versions originale et traduite en anglais) (DSi/3DS)\n- Yoshi Touch & Go (DSi)\n \nCorrectifs de Protection Antipiratage (AP) :\n \n- Ajout de correctifs AP pour les traductions anglaises de MapleStory DS.\n- Ajout d'un correctif AP pour la traduction italienne (Première Bêta !) de Tomodachi Collection (par @Peppe30brick).\n \nAméliorations Techniques :\n \n- DSi/3DS : Lors du préchargement d'une ROM contenant des overlays, le binaire ARM7 n'est plus préchargé (car déjà chargé à la destination RAM). Cela permet de précharger certaines ROMs autour de 12MB/28MB.\n- DSi/3DS : La WRAM partagée est désormais activée pour le préchargement des ROMs avec la WRAM DSi désactivée.\n- DSi/3DS : Utile pour le débogage, toute la RAM disponible est désormais explorable, que ce soit en mode DS ou DSi.\n- B4DS : Les correctifs de sauvegarde pour les titres DSiWare de 0/A à C ont été déplacés dans un nouveau fichier pack dans NitroFS. Cela réduit la taille du fichier nds-bootstrap d'environ 288KB.\n- DSi/3DS : En cas de crash dans Mario & Luigi: Bowser's Inside Story, le jeu redémarre au lieu d'afficher une erreur d'abandon des données.\n \nCorrections de Bugs :\n \n- DSi/3DS : La méthode de hooking pour lire les ROMs depuis la carte SD est revenue à la boucle principale/SWI Halt pour résoudre des problèmes de communication sans fil.\n- Pokémon Noir & Blanc 1 & 2 continueront d'utiliser la méthode de hooking IPC Sync qui a corrigé les crashs occasionnels.\n- Correction d'un bug ancien où Luminous Arc 2 se bloquait sur des écrans noirs au démarrage avec une nouvelle sauvegarde.\n- Mise à jour du correctif AP pour GoldenEye 007 pour éviter les crashs au démarrage.\n- DSi/3DS : Correction d'un bug où les fichiers ROM fragmentés dans le système de fichiers FAT ne se chargeaient pas.\n- B4DS : Correction de certains jeux SDK 5 qui ne chargeaient pas les données de sauvegarde avant les données de la ROM.\n \n \nChangelog TWiLightMenu++ : \n \n- Ajout du support pour les dossiers de skins imbriqués (ex. ../themes/Dark/Dark/ au lieu de ../themes/Dark/). Bien que non recommandé, cette fonctionnalité a été ajoutée principalement comme mesure à l’épreuve des débutants pour l'installation des skins.\n- Divers : Traductions mises à jour.\n \nCorrections de bugs :\n \n- Correction des paramètres non sauvegardés par jeu qui se rechargeaient à l'ouverture du menu des triches.\n- Thèmes basés sur DSi : Correction de la longueur de la barre de progression dépassant parfois l'icône de progression.\n \n \nTéléchargement : TWiLightMenu ++ / nds-bootstrap\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203181/in-ds2ds3ds-twilight-menu-v27124-et-nds-bootstrap-v240-disponibles-1.png"
        }
    },
    "news_18": {
        "title": "[PS4] Sony sort le firmware 12.02 pour la PS4",
        "content": "La mise à jour du firmware 12.02 pour la PS4 est maintenant disponible, cette mise à jour apporte principalement des correctifs de sécurité et quelques modifications mineures à l'interface et aux fonctionnalités. \n \nCependant, il semble que Sony se concentre davantage sur la PS5 ces derniers temps, délaissant la PS4 dans ses fonctionnalités, estimant en avoir fait le tour peut être pour que tout le monde bascule sur la nouvelle génération, qui a déjà 50 mois, soit plus de 4 ans déjà.\n \n \n \n\n \n \n \nIl faut compter environ 503 Mo pour la télécharger, ce qui va relativement vite, cependant si vous pouvez l'éviter, le temps que certains puissent vérifier si les dernières avancées en matière de hack fonctionnent. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203178/in-ps4-sony-sort-le-firmware-1202-pour-la-ps4-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] Fla_z détaille la gestion de la mémoire GPU, DMA, Bypass sur PS5",
        "content": "Le développeur Flat_z a récemment partagé de nouvelles informations sur la gestion de la mémoire GPU et l'Accès Direct à la Mémoire (DMA) sur les consoles PlayStation 5. Dans ses explications qu'il donne sur Discord, Flat_z a mis en avant l'importance de blocage et de déblocage de la mémoire pour éviter les bugs inattendus. En utilisant des techniques spécifiques pour obtenir les adresses physiques et modifier la table des pages, il a réussi à maintenir ses méthodes de gestion des opérations de mémoire avancées même sur les firmwares les plus récents.\n \nFlat_z a également souligné que cette technique pourrait être utilisée pour contourner les protections de sécurité et écrire directement dans des régions spécifiques de la mémoire, ce qui la rend particulièrement intéressante pour des scénarios liés aux systèmes AGX. En plus de tout cela, il a mentionné que les clés de sécurité de la PlayStation 5 sont générées de manière hiérarchique, rendant certains exploits plus difficiles à mettre en oeuvre.\n \n \n \n\n \n \n \n \nPour les débogages avancés, il utilise notamment UART et certaines fonctions personnalisées afin d'obtenir des résultats détaillés, y compris des backtraces.\n \nSon analyse se porte sur le code présent dans GpuMemoryUtil.java, le développeur continue de progresser ou donner des pistes, cela demandera une analyse plus approfondie pour pouvoir être exploitée. \n \nIl se permet de dévoiler cela ici sur Github : GpuMemoryUtil.java\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203162/in-ps5-fla-z-detaille-la-gestion-de-la-memoire-gpu-dma-bypass-sur-ps5-1.png"
        }
    },
    "news_20": {
        "title": "[PS4/PS5] GoldHEN Stage2 v1.04 disponible",
        "content": "Le développeur SiStr0 dévoile une nouvelle version de son plugin GolHEN stage 2 qui est désormais proposé en v1.04. \n \nCe loader ne prend en charge que les payloads avec un point d'entrée au kernel. La version personnalisée de stage2 recherche d'abord le payload dans le répertoire racine de la clé USB et, si elle est trouvée, elle est copiée sur le disque dur interne à ce chemin : /data/GoldHEN/payloads/goldhen.bin. Le payloads interne est alors chargé et n'est plus nécessaire sur la clé USB externe.\n\n \n \n \nLes versions prises en charge sont des firmwares :\n \nFW 9.00\nFW 9.03\nFW 9.60\nFW 10.00 / 10.01\nFW 10.50 / 10.70 / 10.71\nFW 11.00\n \nLes prochaines versions sont :\n \n- Version 7.XX du firmware\n- À déterminer\n \n \n \n \nTéléchargement : GoldHEN Stage2 1.04 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203125/in-ps4ps5-goldhen-stage2-v104-disponible-1.png"
        }
    }
}