{
    "news_1": {
        "title": "[PS4] Comment TheFlow a créé PPPwn en cassant KASLR de la PS4",
        "content": " \nKASLR est une fonctionnalité de sécurité standard du noyau Linux qui permet d'atténuer l'exposition aux vulnérabilités d'accès à la mémoire non encore découvertes et les conséquences de ces vulnérabilités en répartissant de manière aléatoire la valeur de l'adresse de base du noyau.\n \nTheFlow lors de sa présentation a montré comment il a pu créer PPPwn, en écrivant certaines parties du code en 5 minutes, et d'autres en plusieurs jours, et il explique comment il a contourné le KASLR sur PS4, sa démonstration ne fonctionnant que sur PS4, équipée de FreeBSD 9, alors que cela ne marchera pas sur PS5 équipée de FreeBSD 11. Entre les deux consoles, il y a quelques modifications de codes (syscalls, drivers) mais aussi une migration de la sécurité avec pour la PS5, des sécurités supplémentaires à passer comme celle de SMAP/SMEP, CFI et XOM. \n \n \n\n \n \n \nTheFlow explique qu'il dispose d'un client PPPoE et qu'il souhaite obtenir un serveur PPPoE afin d'y corrompre la mémoire. L'idée a été d'envoyer beaucoup de paquets d'adresse IPv6, avec une sollicitation importante, d'apporter une corruption, et d'envoyer des données contenant l'IPv6 voisine afin de créer le leak. \n \n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n \n \nL'obtention de la chaine ROP se fait en deux étapes, la copie de la chaine afin d'obtenir un pivot, puis la désactivation des protections d'écriture afin de pouvoir injecter le stage1 avec un payload. \n \n \n \n\n \n\n \n \n \nA la fin de sa présentation, il s'est amusé du fait que des dongles \"One-key JB Tool\" soient apparues en reprenant son travail pour une trentaine de dollars, des dongles fonctionnant sur firmwares 9.0 et 11.0.\n \n \n \n\n \n\n \n \nAndy Nguyen, après une référence à Specter et à la PS Vita, est revenu aussi sur le fait qu'il ne joue pas à des jeux, que son objectif est de trouver des failles dans la sécurité des systèmes, que c'est pour lui un passe-temps comme un autre, que ce n'est pas son travail principal, et qu'il publiera les sources de sa présentation, même si nous avons pu tout découvrir hier lors de la RomHack 2024 (intervention à partir de 7h10 jusqu' à la fin). \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-1.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-4.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-5.jpg",
            "image_7": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-6.jpg",
            "image_8": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-7.jpg",
            "image_9": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-8.jpg",
            "image_10": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-9.jpg",
            "image_11": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-10.jpg",
            "image_12": "https://www.logic-sunrise.com/images/news/1196183/in-ps4-comment-theflow-a-cree-pppwn-en-cassant-kaslr-de-la-ps4-11.jpg"
        }
    },
    "news_2": {
        "title": "[3DS] Luma3DS v13.2 disponible",
        "content": "Le développeur TuxSH a déployé une nouvelle version de Luma3DS, il a mis en ligne la version 13.2 du meilleur CFW de la Nintendo 3DS. Comme vous le savez Luma3DS est le CFW indispensable pour les 3DS et 2DS et l'arrivée d'une nouvelle version est toujours intéressante à suivre. \n \n \n\n \n \n \nLuma3DS apporte des améliorations dans les paramètres des langues de jeux, le débogage amélioré pour les développeurs, ou encore le déverrouillage de région, cette nouvelle version 13.2 apporte des changements dans le menu Rosalina (L + pavé de commande bas + SELECT), diverses informations sur le système , telles que le type d'écran, peuvent désormais être affichées. Il existe également une nouvelle option pour les filtres d'écran permettant de \"corriger\" la courbe de gradation (courbe de couleur) de l'écran supérieur, mais cela n'a de sens que pour les écrans IPS ( à voir ce que cela donne en réalité ).\n \nTuxSH a récemment procédé à une rétro-ingénierie du module du système QTM, responsable du suivi du visage pour la \"Super-Stable 3D\" sur la New3DS. Cela a abouti à un autre sous-menu dans Rosalina, avec lequel Super-Stable 3D peut être calibré plus en détail et peut être temporairement désactivé/activé.\n \nLes plugins peuvent désormais également accéder au stockage privé, ce qui facilite l'accès au réseau - il est donc recommandé de n'utiliser que des plugins de confiance . Enfin et surtout, la première fois que vous démarrez Luma3DS, le répertoire /luma/payloads sera créé automatiquement.\n \n \nChangelog :\n \n- Ajout du sous-menu Rosalina « Informations système », affichant diverses informations système, notamment les types d'écran (TN/IPS, pour chaque écran)\n- Dans le sous-menu « Filtres d'écran » de Rosalina, ajoutez une nouvelle option pour « corriger » la courbe de couleur de l'écran supérieur. Cela améliore considérablement la sortie couleur des écrans supérieurs IPS , les rapprochant assez des écrans sRGB normaux (bien que les couleurs paraissent légèrement plus sombres) :\n- tous les écrans 3DS (TN et IPS) sont calibrés selon une courbe de couleur unique aux systèmes 3DS qui s'adapte à la faible gamme de couleurs des écrans TN\n- Cette option est aléatoire sur les écrans TN et conduit souvent à des résultats étranges. En effet, les écrans TN sur 3DS ont une gamme de couleurs terrible, en particulier dans les verts et les jaunes, même selon les normes de 2011 (et les écrans TN 3DS ont également un temps de réponse bien pire que les écrans IPS 3DS)\n- cela ne résout pas le problème d'écrasement noir sur les écrans IPS 3DS, dans certains cas, cela peut légèrement aggraver la situation\n- cette option peut être conservée dans la configuration de Luma3DS via « Enregistrer les paramètres »\n- open_agb_firm a la même fonctionnalité, c'est de là que vient le LUT utilisé ici\n- Suite à mon travail de reverse engineering sur QTM (face tracking, 3D super-stable), dans le sous-menu \"New 3DS\" Rosalina :\n- Sous-menu pour activer/désactiver temporairement la fonction « super-stable 3D » (SS3D) des New 3DS. Les modifications apportées ne persistent pas, pour modifier le comportement au démarrage, vous devez toujours aller dans les paramètres système comme avant\n- ajout d'un sous-menu pour tester les 12 positions de barrière de parallaxe utilisées lorsque SS3D est actif. Les modifications sont annulées lorsque vous quittez le sous-menu\n- ajout d'un sous-menu pour calibrer SS3D. Même si les paramètres système ont une fonction similaire, celle-ci a moins de limitations et affiche plus d'informations sur le processus à l'écran\n- Réorganisation des entrées de l'écran supérieur du menu Rosalina pour faciliter l'utilisation des options les plus couramment utilisées ; fusionner « Éteindre » et « Redémarrer » dans un seul menu\n- Autorisation des plugins à utiliser la mémoire PRIVÉE au lieu de PARTAGÉE sur les requêtes ( #2086 , rapport de bogue et PR original merci à@LittlestCube). Cela permet aux plugins d'accéder plus facilement au réseau. Téléchargez uniquement des plugins provenant de sources fiables.\n- Lors du processus de « premier démarrage de Luma3DS/mise à niveau de Luma3DS », créez le répertoire des charges utiles s'il n'existe pas. Cela devrait simplifier encore davantage le processus de piratage de la 3DS\n- D'autres améliorations de la stabilité globale du système et d'autres ajustements mineurs ont été apportés pour améliorer l'expérience utilisateur\n \n \nTéléchargement : Luma3DS v13.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196154/in-3ds-luma3ds-v132-disponible-1.jpg"
        }
    },
    "news_3": {
        "title": "[2DS/3DS] nds-bootstrap 2.0.1 et TWiLight Menu++ v27.9.0",
        "content": "nds-bootstrap 2.0.1 et TWiLight Menu++ v27.9.0 viennent d'être mise en ligne par RocketRobz, ainsi le patch anti-piratage pour SaGa 3 a été corrigé et lors du démarrage d'une rom NDS, il est désormais vérifié si le dump est défectueux. La qualité sonore sur DSi et 3DS a également été corrigée et quelques corrections de bugs ont été apportées aux thèmes. \n \n\n \n \n \nQuoi de neuf sur TWiLight Menu++ ?\n \n- Le correctif AP pour SaGa 3 a été corrigé pour fonctionner sur nds-bootstrap !\n- Le correctif AP (par RetroGameFan) ne fonctionnait pas à cause du code de patch de nds-bootstrap. La version corrigée du correctif AP déplace le code de branchement vers une zone où il n'est pas affecté par le code de patch de nds-bootstrap.\n- Ajout d'un correctif AP pour Okamiden (traduction espagnole) !\n- Si un .ndsfichier corrompu a été détecté, un message s'affichera désormais indiquant que le titre et/ou la carte SD sont corrompus et empêchera le lancement.\n- Veuillez noter que le système de détection n'est pas parfait et que certains .ndsfichiers corrompus peuvent toujours être lancés.\n- La vitesse de défilement du menu DSi d'origine a été restaurée pour le thème DSi !\n- Des icônes personnalisées peuvent désormais être attribuées à des fichiers argv individuels !\n- Pour un démarrage plus rapide des anciens homebrews DS (ainsi que GBARunner2), le Load Bootloaderparamètre est désormais défini Directpar défaut.\n- Paramètre supprimé Slot-1 Touch Mode.\n- En raison des améliorations apportées au changement de fréquence sonore, le mode tactile DSi a provoqué une sortie sonore de très faible qualité lorsque nds-bootstrap passe en mode tactile DS.\n- Cela signifie malheureusement que les jeux exécutés en mode DSi via l'accès SCFG pour l'emplacement 1 ne peuvent plus utiliser les fonctionnalités de l'appareil photo. - Toute tentative d'utilisation des fonctionnalités de l'appareil photo entraînera désormais le plantage du jeu.\n \nCorrections de bugs\n \n- Correction de la mauvaise détection de Harvest Moon DS Cute en tant que homebrew.\n- Thème 3DS : bouton inférieur fixe STARTsur l'écran tactile qui ne fait rien.\n- Thème DSi : animation déroulante fixe jouant 5 images derrière un écran blanc.\n- Thème DSi : écran supérieur fixe apparaissant avec une teinte blanche.\n- Correction d'un problème de sortie sonore de faible qualité sur les consoles DSi/3DS.\n \n \nQuoi de neuf sur nds-bootstrap ?\n \n- Suppression de l'indicateur de préchargement pour les anciens homebrews DS, car il n'existe aucun frontend (connu) qui l'utilise.\n- Les anciennes versions de certaines applications système DSi démarrent désormais.\n \nCorrections de bugs\n \n- Le patch Nookingtons solo pour Animal Crossing: Wild World n'affiche plus d'écrans noirs en mode B4DS !\n- Correction du mauvais placement du drapeau de fréquence sonore empêchant le démarrage de l'ancien homebrew DS (ainsi que de GBARunner2).\n- Pour un changement correct de la fréquence sonore DSi/3DS, le codec est désormais écrit.\n- Les données indésirables restantes sont désormais effacées avant le démarrage lors de l'exécution à partir de l'emplacement 1 avec accès SCFG.\n- Quelques optimisations mineures.\n \nTéléchargement : ds-bootstrap 2.0.1 et TWiLight Menu++ v27.9.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196132/in-2ds3ds-nds-bootstrap-201-et-twilight-menu-v2790-1.png"
        }
    },
    "news_4": {
        "title": "[PS4] La conférence RomHack.io avec TheFlow c'est demain !",
        "content": "Pour rappel, mémoire ou information, c'est demain que si tiendra la conférence RomHack.io en Italie. C'est à Rome que se tiendra la RomHack Conference Training Camp où le gratin du hack mondial va présenter leur travaux en live. \n \nLe site internet parle de la plus grande édition de RomHack jamais proposée, avec une diffusion en direct en livestream sur Youtube ! \n \n \n\n \n \nSi tout est proposé en live, ce sera une première ! Nous aurons donc doit aux interventions en livestream, notamment de McCaulay Hudson, le développeur américain qui a proposé mast1c0re, mais surtout à la présentation de TheFlow (Andry nGuyen).\n \n \n\n \n \nNous allons enfin savoir ce que contient la présentation de TheFlow même si on en connait le fond, la \" PlayStation 4 Remote Kernel Exploitation \", il reste la forme à découvrir. \n \n \n\n \n \n \nTout se passera ici : \n \n \n\nhttps://www.youtube.com/live/u0vN74JgTGg?feature=shared\n \n\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196125/in-ps4-la-conference-romhackio-avec-theflow-cest-demain-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1196125/in-ps4-la-conference-romhackio-avec-theflow-cest-demain-1.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1196125/in-ps4-la-conference-romhackio-avec-theflow-cest-demain-2.png"
        }
    },
    "news_5": {
        "title": "[PS5] De nouveaux ELF du 1.xx au 4.xx sont disponibles et des tests sur 5.xx",
        "content": "De nouveaux fichiers ELF ont été produits par la communauté, notamment pour l'exploit UMTX à destination des firmwares 1.xx, 2.xx, 3.xx et 4.xx.\n \nCes ELF ont été proposés par sleirsgoevy, et permettent désormais de charger des payloads que vous ne pouviez pas charger auparavant, comme par exemple le ps5ftp de Sistr0, vous devriez maintenant pouvoir le faire, sur le port 9019.\n \nPour tester la chose, vous pouvez par exemple utiliser le site mis en place par Zecoxao : https://zecoxao.github.io/umtx2/ \n \nIl rajoute d'ailleurs que cela devrait également permettre de commencer à porter le Hen vers les firmwares 1.xx et 2.xx, afin de lancer votre distribution Linux préférée et démarrer le portage.\n \nA noter que les firmware 5.xx sont toujours sous la contrainte, pour le moment il reste complexe de développer des payloads pour ces firmwares, mais cela progresse ! \n \n \n\n \n \nComme promis Flat_Z vient de confirmer avoir corrigé le SDK pour les 5.xx. Il a travaillé cette nuit sur des payloads pour les firmwares 5.xx, ils sont en train d'être testés. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196092/in-ps5-de-nouveaux-elf-du-1xx-au-4xx-sont-disponibles-et-des-tests-sur-5xx-1.jpg"
        }
    },
    "news_6": {
        "title": "[PS4] PS4 PKG Tool v1.0 disponible",
        "content": "\nLe développeur Seregonwar propose de découvrir la version 1.00 de son outil PS4 PKG Tool, un utilitaire qui va vous permettre de simplifier la gestion des fichiers PKG sur votre PS4 ou PS4 Pro. \n \nInitialement déployé pour macOS, mais qui peut facilement être compilé pour Windows, ce logiciel permet de réaliser de nombreuses opérations d'extractions et de modifications.\n \nPS4 PKG Tool est un outil de manipulation des fichiers PKG de la PS4. Il vous permet d'extraire, d'injecter, de modifier et d'obtenir des informations sur les fichiers PKG.\n \n \n \n\n \n \n\n \n \nCaractéristiques :\n \n- Extraction : Extraire des fichiers spécifiques d'un PKG.\n- Injection : injecter de nouvelles données dans un fichier PKG existant.\n- Modification : Modifier l'en-tête d'un fichier PKG.\n- Dump : Effectue un dump complet du contenu d'un PKG.\n- Information : Obtenez des informations détaillées sur un fichier PKG.\n \nExigences :\n \n- Python 3.x\n- PyQt5\n- pyinstaller et cx_freeze (pour créer l'exécutable)\n \n \nTéléchargement : PS4PkgToolBox.exe v1.00\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1196071/in-ps4-ps4-pkg-tool-v10-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1196071/in-ps4-ps4-pkg-tool-v10-disponible-2.png"
        }
    },
    "news_7": {
        "title": "[Retro] Le projet Super Game Boy Plus (SGB+)",
        "content": " \nLa Super Game Boy, parfois appelée aussi SGB, était une cartouche spéciale à destination de la Super Nintendo et qui permettait de jouer à des jeux GameBoy originaux sur votre console favorite, en noir et blanc et même en couleurs. \n \nCertains jeux Game Boy peuvent même profiter des améliorations apportées par la SGB d'une manière que vous ne verriez pas sur une Game Boy, notamment des palettes de couleurs personnalisées, un son amélioré et des bordures d'écran. \n \n \n\n \n \nMalheureusement, la Super Game Boy originale avait un défaut « majeur ». La vitesse d'horloge était 2,4 % trop rapide. Pour la plupart des gens, cela ne fait aucune différence, mais pour les vrais joueurs, cela équivaut à un blasphème. L'effet secondaire de cela est que la Super Game Boy ne peut pas utiliser de câble de liaison pour se connecter à d'autres Game Boy, car les vitesses d'horloge seraient trop différentes. Le Japon a eu la Super Game Boy 2, qui a corrigé cet oubli et ajouté un port de liaison. Mais personne d'autre ne l'a jamais eu ! Ainsi, les vrais joueurs se sont mis au travail et ont créé des mods qui corrigent la vitesse d'horloge et ajoutent un port de liaison .\n \nUn autre type de mod qui a fait son apparition au fil des ans est celui des jeux SNES autonomes avec un seul jeu Game Boy à l'intérieur. Cela implique généralement de retirer le PCB d'un Super Game Boy, de retirer le PCB d'un jeu Game Boy (espérons une reproduction et non un original !), et de souder de manière permanente le PCB Game Boy à la carte SGB. \n \n \n\n \n \nLe problème avec tous ces différents mods SGB, c'est qu'ils sont constitués de cartes soudées ensemble sur une carte SGB d'origine. Il n'y avait pas de carte unique, propre et autonome qui intègre toutes ces fonctionnalités dans un package agréable et robuste.\n \n \n \n \n\n \n \n \n \nJusqu'à maintenant, jusqu'à la création de Super Game Boy Plus ou SGB+. Ce circuit imprimé peut effectuer les opérations suivantes :\n \n- Permet trois options d'horloge distinctes :\n-> la vitesse d'horloge \"erronée\" d'origine,\n-> la vitesse d'horloge correcte, ou\n-> la vitesse d'horloge correcte avec la possibilité d'overclocker et d'underclocker dans le jeu\n- Intègre le port de liaison sur la carte à l'aide d'une petite carte fille pour le décaler dans un emplacement parfait sur le bord d'une cartouche SNES standard (si vous utilisez une coque SGB2, elle s'adaptera sans la carte fille)\n- Vous permet en option de verrouiller la carte sur un jeu Game Boy spécifique au lieu d'utiliser le connecteur de cartouche - les données de sauvegarde peuvent être transplantées vers/depuis la cartouche via la puce FRAM\n- Peut être utilisé dans trois coques SNES différentes avec un minimum de découpe de coque requise :\n-> une coque originale de Super Game Boy avec le connecteur de cartouche,\n-> une coque SNES standard à 46 broches (nécessitera deux découpes sur le bas de la coque pour les broches supplémentaires du bord de la cartouche), et\n-> une coque SNES à 60 broches utilisée pour les jeux utilisant des puces d'amélioration comme le SA-1 ou le SuperFX\n- Il existe deux versions du Super Game Boy Plus : l'une peut être utilisée pour les jeux MBC3 autonomes (en cours de développement) et l'autre pour les jeux MBC5 autonomes . Si vous souhaitez uniquement un Super Game Boy amélioré sans le verrouiller sur un seul jeu, vous pouvez utiliser la variante MBC3 ou MBC5, peu importe celle que vous choisissez. Étant donné que ce projet est hautement personnalisable, vous devez suivre attentivement les instructions pour vous guider tout au long du processus en fonction de vos envies.\n \n \n\n \n \n \nCe projet nécessite de retirer certains composants d'une cartouche Super Game Boy d'origine. Cela nécessitera une station de retouche à air chaud ou une plaque chauffante. Cela nécessitera également des capacités de soudure étendues - ne tentez pas ce projet si vous n'avez pas suffisamment d'expérience en soudure. Si vous créez un jeu unique sans connecteur de cartouche, vous devez disposer d'un jeu Game Boy original qui utilise une puce de mappage MBC3 ou MBC5.\n \n \nSi le projet vous intéresse c'est par ici : Super-Game-Boy-Plus\n \n",
        "images": {
            "image_1": "https://nintendo-ds.logic-sunrise.com/images/validation/in-908717651.png",
            "image_2": "https://nintendo-ds.logic-sunrise.com/images/validation/in-1748905912.jpg",
            "image_3": "https://nintendo-ds.logic-sunrise.com/images/validation/in-1076744076.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1196064/in-retro-le-projet-super-game-boy-plus-sgb-1.png"
        }
    },
    "news_8": {
        "title": "[Switch] Un écran OLED + HDMI pour Switch Lite bientôt disponible !",
        "content": "La petite sœur de la console phare de Nintendo, la Switch Lite, sortie juste à temps pour le jeu The Legend of Zelda: Link's Awakening, en 2019, a été très bien reçue par son public. Elle offre toute la puissance de la console grand format à un coût réduit, avec des commandes intégrées et une croix directionnelle traditionnelle qui vient remplacer les boutons du joy-con gauche, le système s'est imposé comme le choix parfait pour ceux qui souhaitent voyager léger.\n \nCette portabilité a toutefois un prix, la console ne pouvant pas se connecter à un dock pour une expérience complète sur grand écran, et la manette intégrée sans possibilité de la changer. Nintendo a ensuite sorti la Switch OLED deux ans plus tard, laissant les fans imaginer que le choix du type d'écran pourrait aussi se faire sur la version mini de cette console. En 5 ans, aucune révision de ce type n'a finalement vu le jour, et seule l'option LCD subsiste. Mais les fans de la Lite vont enfin pouvoir se réconforter grâce à un projet innovant.\n \nL'écran OLED en action\n Teasé plus tôt cette année par le YouTuber Taki Udon, SUPER5 est un kit de transformation OLED pour la Switch Lite. Avec un prix d'appel à seulement $49,99 (ne proposant que l'écran et non le tactile) il promet un écran OLED facile à installer et sans soudure, avec une luminosité maximale de 600 Nits, une couverture sRGB et un rapport de contraste surpassant l'OLED officiel de la Switch.\n \nMais là ou le projet surprend, c'est dans sa proposition haut-de-gamme qui intègre une sortie HDMI (flux de sortie 1080p) !\n \nEn haut l'écran d'origine, en bas la version beta du kit OLED\n \n La liste complète des kits disponibles :\nKit de mise à niveau OLED (49,99 $)\nKit de mise à niveau OLED avec tactile (64,99 $)\nKit de mise à niveau OLED avec HDMI (69,99 $)\nKit de mise à niveau OLED avec tactile et HDMI (84,99 $)\nKit Mega OLED avec tactile et HDMI (109,99 $)\nChacun de ces kits de mise à niveau sera mis en vente le 26 septembre à 10h, heure de Hong Kong. Des coupons promotionnels seront disponibles les deux premiers jours pour réduire le prix de 5 à 10 $, bien qu'aucun chiffre précis n'ait été donné quant au nombre de kits disponibles. Un guide d'installation sera également mis en ligne plus tard cette semaine pour aider les acheteurs potentiels.D'après Taki Udon, ces kits sont prévus pour être solderless, et sont compatibles avec les Switch sous firmware officiel et custom. On regrettera toutefois que ce kit n'existe pas pour les millions de Switch non-OLED, et notamment les V1 qui ont sans doute besoin d'un petit rafraichissement après quelques années d'utilisation. \n \n Pour commander le kit, c'est ici !\n Mise à jour (26/09/2024) : \n \nLe youtubeur Taki Udon a publié un test de la version finale de ce mod sur sa chaîne secondaire , avec un tutoriel d'installation :\n \n\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195978/in-switch-un-ecran-oled-hdmi-pour-switch-lite-bientot-disponible-1.jpeg",
            "image_2": "https://www.logic-sunrise.com/images/news/1195978/in-switch-un-ecran-oled-hdmi-pour-switch-lite-bientot-disponible-2.jpeg",
            "image_3": "https://www.logic-sunrise.com/images/news/1195978/in-switch-un-ecran-oled-hdmi-pour-switch-lite-bientot-disponible-3.jpeg"
        }
    },
    "news_9": {
        "title": "[PS5] L'Hyperviseur serait accessible sur 3.xx selon Flat_z",
        "content": "Le développeur Flat_z informe sur les réseaux privés que l'hyperviseur fonctionne sur les firmwares 3.xx, et qu'il l'a testé récemment sur un firmware 3.21\". Comme vous le savez l'hyperviseur est une surcouche de protection comprise dans le kernel. \n \nIl faut se souvenir, en Juillet 2023, il y a plus d'un an, Specter nous impressionnait en montant comment fonctionne l'hyperviseur \"dans le kernel\" suite à sa présentation lors de sa conférence au Hardwear.io le 02 Juin 2023.\n \n \n\n \n \nIl avait alors confirmer que les firmwares inférieurs au 2.50 sont réellement différents que les firmware 3.xx et supérieur, mais là Flat_Z parle bien du fonctionnement sur 3.xx.\n \n \n \n\n \n \n \nFlat_z nous informe qu'il est actuellement en voyage et qu'en il rentrant il a l'intention de chercher à corriger la version BD-J UMTX pour d'autres firmwares, et il essayera de corriger le plus de firmwares possibles. \n \nIl pense que cela est possible sur 4.x à 5.x, mais seul le temps nous le dira. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-801541914.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1195933/in-ps5-lhyperviseur-serait-accessible-sur-3xx-selon-flat-z-1.png"
        }
    },
    "news_10": {
        "title": "[PS5] Specter a réussi à implémenter le support des firmwares 3.xx à 5.xx",
        "content": " \nIl a réussi, Specter a réussi à faire en sorte que l'exploit PS5 UMTX supporte les firmwares 3.xx à 5.xx (il a réussi à rajouter le support de tous les firmwares du 3.00 au 5.50). \n \nIl dévoile la version 1.2 de son exploit PS5 UMTX, l'exploit a été mis à jour avec une implémentation qui fonctionne sur 3.xx-5. xx, également un support pour d'autres firmware bas de gamme divers.\n \nLe loader et les payloads ELF ne fonctionneront pas sur la version 5.00+ pendant un certain temps en raison des modifications à apporter au dlsym. Le SDK de payload doit aussi être modifié.\n \n \n\n \n \nMais l'essentiel est là, le support de : \n \n- Ajout de la prise en charge des versions 5.00, 5.02, 5.10 et 5.50FW\n- Ajout de la prise en charge des versions 4.00, 4.02, 4.03 et 4.50FW\n- Ajout de la prise en charge des versions 3.00 et 3.20FW\n- Ajout de la prise en charge de 2.70 factory FW\n- Ajout du support pour les FW 1.00 et 1.02\n- Ajout de code pour faciliter le portage\n \nVoici donc la nouvelle liste de firmware supporté par cet exploit : \n \n\n\n1.00\n1.02\n1.05\n1.10\n1.11\n1.12\n1.13\n1.14\n2.00\n2.20\n2.25\n2.26\n2.30\n2.50\n2.70\n3.00\n3.20\n4.00\n4.02\n4.03\n4.50\n5.00\n5.02\n5.10\n5.50\n\n\n \n \n \nTout est là : PS5-UMTX-Jailbreak 1.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-878891952.png"
        }
    },
    "news_11": {
        "title": "[PS4] ShadPS4 0.3.0 disponible",
        "content": "Les développeurs en charge de ShadPS4 propose une nouvelle version de leur émulateur qui passe désormais en v0.3.0.\n \n \n\n \n \nLes développeurs ont apportés quelques nouvelles fonctionnalités à partager :\n \n- Support des Cheat/Patchs\n- Support des DLC\n- Nouvelles traductions (26 langues)\n- Support pour débloquer les trophées\n- Prise en charge de plus de manettes (Dualshock et Xbox)\n- Nombreuses améliorations de l'interface graphique\n- Lecteur AV\n- Et bien d'autres choses encore !\n \nL'émulateur peut démarrer des jeux notables avec un support pour les améliorations visuelles. Attention en raison des nouveaux changements, les anciens fichiers de sauvegarde peuvent ne plus être compatibles. Par conséquent, si vous tenez à votre progression actuelle, veuillez suivre ce guide avant de procéder à la mise à jour : discord.com.\n \n \nTéléchargement : ShadPS4 0.3.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195874/in-ps4-shadps4-030-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[PS4] L'interface Alchemist pour ShadPS4 disponible",
        "content": " \nUne interface pour l'émulateur ShadPS4 est accessible au grand public depuis quelques heures, bien entendu il s'agit d'une version Alpha qui n'a pas la prétention de faire tourner correctement les licences de la console, mais cela permet d'avoir une idée des réelles évolutions opérées en la matière. \n \nAlchemist est un gestionnaire de mods qui va vous permettre d'intégrer et de lancer des mods, mais aussi directement des jeux via l'émulateur auquel elle se destine, ShadPS4.\n \n \n\n \n \nLorsqu'un mod est proposé, il devient vite complexe de le mettre en oeuvre et de l'installer, et Alchimist permet de simplifier l'installation, il protège les fichiers en les renommant , il agit comme une copie physique protégeant ainsi les fichiers du répertoire en créant des pointeurs. Cela implique un espace occupé qui n'augmente pas, il na va créer des fichiers en double.\n \n \n\n \n\n \n \nSeule une préversion est disponible, elle est dépouillée et destinée à ceux qui sont prêts à l'utiliser telle qu'elle est actuellement et qui acceptent que des choses inattendues puissent se produire. Les fonctionnalités de base sont en place, l'activation et la désactivation des mods sont fonctionnelles ainsi que le lancement de jeux via shadPS4 Alchemist. Pour en profiter pleinement il faudra attendre que son développement avance, mais c'est déjà une belle initiative. \n \n \nTéléchargement : shadps4-alchemist\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195839/in-ps4-linterface-alchemist-pour-shadps4-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1195839/in-ps4-linterface-alchemist-pour-shadps4-disponible-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1195839/in-ps4-linterface-alchemist-pour-shadps4-disponible-2.png"
        }
    },
    "news_13": {
        "title": "[PS5] John Tornblom met à jour ftpsrv et websrv pour 1.xx et 2.xx",
        "content": " \nLe développeur John Tornblom a mis à jour ses payloads ftpsrv et websrv afin qu'ils supportent désormais à la fois les firmwares 2.xx mais aussi les firmwares 1.xx, l'intérêt étant de rendre accessible ces payloads aux premiers firmwares de la console PS5. \n \n \n\n \n \nBien entendu celui suit l'évolution de l'exploit UMTX qui lui même est désormais accessible sur tous ces firmwares, grâce à Specter, pour rappel, ces firmwares permettent d'établir un serveur web et un serveur ftp permettant de lancer quelques homebrews via le webkit ou bien à distance via un PC.\n \nEspérons que cela se débloque sur les firmwares au dessus du 2.50, mais encore une fois la balle est désormais entre les mains des chercheurs en sécurité, et non pas Specter qui a clairement dit que cela ne l'intéressait pas. \n \nTéléchargement : ftpsrv / websrv\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195836/in-ps5-john-tornblom-met-a-jour-ftpsrv-et-websrv-pour-1xx-et-2xx-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS3] L'émulateur PSN RPCN v1.3 est sorti avec le support de nombreux jeux",
        "content": "La team RPCS3 nous informe ici de la mise à jour de l'émulateur PSN de RPCN en version 1.3, il s'agit d'une nouvelle très importante pour les utilisateurs de Netplay car cette mise à jour apporte le support de nombreux jeux en ligne, avec des franchises telles que : \n \n- Armored Core 4\n- Dragon Ball Z : Burst Limit\n- Gran Turismo \n- Ridge Racer 7\n- Street Fighter \n- Tekken \n- Wangan Midnight \n \n \n\n \n \nBien entendu il faut mettre à jour RPCS3 pour en profiter, et de nombreux jeux nécessitent des serveurs personnalisés. Le côté réseau PS3 est déjà implémenté, mais il n'y a pas de serveur auquel le jeu peut se connecter. Il appartient à la communauté de procéder à une rétro-ingénierie des serveurs et de proposer des remplacements cela n’entre pas dans le cadre de RPCS3/RPCN.\n \n \nTéléchargement : RPCN 1.3  /  rpcs3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195816/in-ps3-lemulateur-psn-rpcn-v13-est-sorti-avec-le-support-de-nombreux-jeux-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS5] PS5-UMTX-Jailbreak v1.1 disponible",
        "content": " \nMalgré qu'il ne soit pas possible de lancer une exécution de code, l'exploit dévoilé permet la lecteur et l'écriture sur la PS5, nous ne pouvons pas \"encore\" dumper le code du kernel afin d'injecter des gadgets, les pages .text du kernel sont marquées comme eXecute Only Memory (XOM) et toute tentative de pointeurs .text provoque un kernel panic. \n \nL'hypervision (HV) est toujours là, et il est donc impossible d'installer de correctifs ou de hooks dans l'espace utilisateur du kernel. Quand bien même cela reste un exploit kernel, qui va permettre avec certitude de faire avancer le hack sur la console. \n \nIl est clair que pour comprendre pourquoi ce n'est accessible sur le firmware 7.61,  rien n'est très clair, entre les webkits exploits accessibles sur les firmwares récents, mais qui ne permettent pas de faire tourner l'exploit kernel qui sont pourtant en théorie accessible jusqu'au firmware 7.61, et cet exploit kernel qui reste sous une bulle des protections spécifiques à la PS5, il va falloir encore patienter. \n \nCela n'empêche pas à Specter de faire évoluer son exploit, en dévoilant la version 1.1, il a rajouté le support de tous les firmwares inférieurs au firmware 2.50. \n \n \n\n \n \nAinsi voici la liste des firmwares pris en charge désormais : \n \n- 1.05\n- 1.10\n- 1.11\n- 1.12\n- 1.13\n- 1.14\n- 2.00\n- 2.20\n- 2.25\n- 2.26\n- 2.30\n- 2.50\n \nCe n'est pas tout puisque des correctifs mineurs ont été apportés sur cette version. \n \nC'est quoi la suite ? \n \nLe support des firmwares 3.xx jusqu'au 5.xx devraient arriver dans les prochains jours ou semaines, mais pas par Specter, car il l'a déjà dit, il ne s'intéresse pas à ces firmwares, sous-entendu, il n'a pas de PS5 sous ces firmwares. Il l'a d'ailleurs une nouvelle fois affirmé, le support sur les firmwares supérieurs seront plus longs. \n \n \nTéléchargement : PS5-UMTX-Jailbreak v1.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195797/in-ps5-ps5-umtx-jailbreak-v11-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[PS4/PS5] Une scène PS4/PS5 en feu, une nouvelle récompense de 10 000 $",
        "content": "Et on continue sur la scène PS5 qui semble prise aux flammes, puisque c'est une nouvelle récompense qui vient de jaillir du programme bounty référencé sur le site hackerone.com. \n \nUn développeur ou un chercheur en sécurité répondant au pseudonyme de slidybat vient d'être récompensé d'une prime de 10 000 $, nous sommes habitués à ce que ce soit Theflow qui reçoive ce genre de \"gain\", mais c'est donc un petit nouveau qui entre dans la scène. \n \n \n\n \n \nJusqu'à présent ce développeur n'avait rapporté que des bugs pour la partie Valve, et c'est donc la première fois qu'il est récompensé pour la branche PlayStation. \n \n \n \n \n\n \n \n \nNous ne savons pas si son rapport de bug concerne la PS4 ou la PS5, et nous n'en n'avons pas encore le détail, mais une chose est sûre, ce genre de prime récompense souvent un bug très critique, du genre faille webkit ou faille kernel. \n \nTout est là : Hackerone.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195737/in-ps4ps5-une-scene-ps5-en-feu-une-nouvelle-recompense-de-10-000-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1195737/in-ps4ps5-une-scene-ps5-en-feu-une-nouvelle-recompense-de-10-000-2.png"
        }
    },
    "news_17": {
        "title": "[PS5] Specter confirme que le kexploit fonctionne sur les firmwares 2.x",
        "content": "Le développeur Specter, dont la réputation n'est plus à faire, vient de lâcher une image non équivoque avec notamment quelques informations en annexe. Il vient d'annoncer que le Kexploit sur la PS5 est bel et bien là et qu'il faut disposer d'un firmware 2.00 pour profiter du jailbreak lié à l'exploit PS5 UMTX. Il confirme donc que l'exploit complet (kernel + webkit) fonctionne sur PS5, son screen confirme que l'exploit fonctionne, puisqu'il montre l'exploit et l'hello world. \n \n \n \n\n \n \nIl nous informe sur les réseaux privés que l'exploit est compatible avec le firmware 2.00 et que son intention est de le porter sur le firmware 2.50 avant de rendre la chose publique, il souhaite d'abord rajouter quelques objects supplémentaires. \n \nSelon le développeur, le portage sur les firmware 3.xx jusqu'au 5.xx se fera plus tard, alors que pour le moment sur les firmware 6.xx et 7.xx il faudra attendre une autre implémentation de webkit, il semblerait donc qu'il soit pour l'heure impossible de faire le lien entre les exploits webkits et l'exploit kernel. Il rajoute qu'il pense que quelqu'un travaille sur la version BD-J sans pour autant dire si cela sera possible.\n \nEdit 13h00, voilà c'est fait, le support jusqu'au 2.50 a été réalisé, et comme promis Specter livre l'exploit intégral. \n \n\nCette vulnérabilité concerne les firmwares 1.00 à 7.61, mais les firmwares >= 3.00 semblent avoir des atténuations supplémentaires qui nécessitent une adaptation de l'exploit pour fonctionner. Specter ne s'intéresse qu'aux firmwares inférieurs, cet exploit ne prend pas en charge les firmwares >= 3.00 pour l'instant. De plus, la vulnérabilité WebKit qui est utilisée ici a été corrigée dans la version 6.00, donc un autre exploit WebKit qui permet la lecture/écriture en userland sera nécessaire pour ces systèmes. \n \n\n \nTout est disponible ici : https://github.com/PS5Dev/PS5-UMTX-Jailbreak\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195736/in-ps5-specter-confirme-que-le-kexploit-fonctionne-sur-le-firmware-200-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS5] Sony sort le firmware 10.01 pour la PS5",
        "content": "Sony a dévoilé hier un tout nouveau firmware pour la PS5, la mise à jour système numérotée 10.01 est un peu mystérieuse dans le sens où le 10.00 a apporté de nombreuses nouveautés, mais là très peu d'informations circulent.\n \nLa possibilité de modifier la lecture à distance, le paramétrage de la charge adaptative des DualSense sur le modèle slim et la PS5 Pro (oui on commence à en parler), l'amélioration de la personnalisation des profils audio 3D, le partage de Party, et l'amélioration de l'interface du centre d'accueil sont autant d'éléments qui ont été introduits, mais là le firmware 10.01 on ne sait pas du tout ce qu'il apporte. \n \nC'est pour le moins minimaliste, Sony annonce l'amélioration des performances et la stabilité du logiciel système, veuillez entendre une correction de failles ou une amélioration sécuritaire d'un exploit (webkit ou kernel), peut être suite à des publications ou des remontées récentes.\n \n \n\n \n \nQuoiqu'il en soit, il est possible aussi que ce firmware s'adresse aussi à la future PS5 Pro, le temps nous le dira, mais ce qui est certain c'est qu'aucune mise à jour n'a été dévoilé pour la PS4, donc les corrections sont spécifiques à la PS5. \n \n \n\n \n \nIl se murmure aussi que certains jeux, notamment Final Fantasy XVI n'aimait pas beaucoup les évolutions apportées par le firmware 10.00, il est possible que Sony tente de changer quelques lignes de code pour amener un peu de stabilité tout simplement. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195735/in-ps5-sony-sort-le-firmware-1001-pour-la-ps5-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1195735/in-ps5-sony-sort-le-firmware-1001-pour-la-ps5-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] AutoBackPort 1.11 mis à jour par Cyb1K",
        "content": "Le petit outil AutoBackPort, développé à l'origine par RetroGamer74 a été mis à jour par un certain Cyb1k que l'on ne présente plus. \n \nAu programme, la possibilité de backporter n'importe quel jeu disponible sur un firmware exploité vers le firmware 5.05, en fait ce sont tous les jeux dumpés à partir des firmwares 7.55, 7.51, 7.50, 7.02, et 6.72 qui sont backportables vers le 5.05. Le programme n'avait pas eu de mise à jour depuis mars 2021, la version de Cyb1k se base sur la dernière version 1.11. \n \n \n\n \n \nAinsi le développeur Cyb1K nous informe avoir réalisé quelques modifications sur AutoBackPort 1.11 pour pouvoir backporter les jeux dumpés les plus récents à la version 9.00. \n \nTout n'est pas parfait, il nous informe que l'automatisation ne peut pas faire de backports 5.05, mais cela devrait aider certains jeux 11.00 à passer sur le 9.00 avant qu'une mise à jour ne soit backportée. \n \nPour tout ce qui est inférieur à la 9.00, vous devez toujours attendre un backport réel de mise à jour. \n \n \n Télécharger : AutoBackPort_1.11_Firmware_9.00-CyB1K.rar (19.17 MB) / lien 1fichier / lien mediafire\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195712/in-ps4-autobackport-111-mis-a-jour-par-cyb1k-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] LightningMods va améliorer etaHEN sur le lancement de plugin et son interface",
        "content": "Le développeur LightningMods est en train de travailler sur l'amélioration d'etaHEN, l'idée est développer de nouvelles fonctions dans etaHEN pour les consoles PS5 jailbreakées. \n \nL'une des fonctionnalités est le lancement automatique des plugins, mais cela ne s'arrêta pas là. \n \n \n\n \n \nDeux options sont envisagées, la première est la mise à jour manuelle de la liste des plugins, il faut alors appuyer sur \"retour\" et sélectionner à nouveau les plugins pour voir apparaitre les modifications. La seconde option est un menu séparé, un nouveau menu dédié qui permettrait d'activer ou pas le démarrage automatique. \n \n\n \n \nCe n'est pas tout le développeur travaille aussi sur une interface de bureau qui s'approche beaucoup du style mmOS permettant une gestion poussée des fichiers PS5. \n \n \n\n \n \nBasé sur l'API graphique native de la console, l'AGC (Advanced Graphics Core), cette interface permettrait de gérer facilement les fichiers de la console.\n \n \n\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1195676/in-ps5-lightningmods-va-ameliorer-etahen-sur-le-lancement-de-plugin-et-son-interface-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1195676/in-ps5-lightningmods-va-ameliorer-etahen-sur-le-lancement-de-plugin-et-son-interface-2.jpg"
        }
    }
}