{
    "news_1": {
        "title": "[PS3] Movian M7 7.0.194 pour PS3 mis à jour par DeanK",
        "content": "La légendaire PS3 est toujours en vie, voilà que DeanK propose la mise à jour de Movian M7 en 7.0.194 pour la console de Sony. Il ne s'agit pas d'une simple mise à jour, mais d'une refonte complète qui rend l'expérience PS3 plus fluide, plus réactive et plus agréable que jamais. DeanK a optimisé le code pour tirer le meilleur parti des ressources limitées de la console, apportant ainsi des améliorations concrètes à tous les niveaux.\n \nMovian, connu anciennement sous le nom de ShowTime, est une version modifiée du media center original qui avait été lancé sur la PS3, et qui fonctionne aussi sur Android, Amazon Fire Stick, MacOS, Windows, Linux et Raspberry pi. Le media center s'appelait à l'origine \"Showtime\" sur la PS3 mais a été renommé \"Movian\" par le développeur original Andreas Oman.\n \n \n \n\n \n \n \nAu programme de cette mise à jour : \n \n- Exécutable 50 % plus petit, utilisation mémoire plus petite, optimisations\n- AUDIO : Transcodage corrigé\n- VIDÉO : Performances et indication de chargement améliorées\n- UI : La navigation dans les dossiers SMB/USB/locaux pendant la lecture vidéo fonctionne\n \n \nTéléchargement : Movian M7 7.0.194 (9.1 Mo)\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209981/in-ps3-movian-m7-70194-pour-ps3-mis-a-jour-par-deank-1.png"
        }
    },
    "news_2": {
        "title": "[Switch] SwitchThemeInjector v4.8.2 et NxThemes Installer v2.8.2",
        "content": "De nouvelles mises à jour pour SwitchThemeInjector et NxThemes Installer, le premier passe en v4.8.2 et le second en v2.8.2. Switch Theme Injector est chargé d'appliquer des corrections automatiques comme les applications sur les fichiers common.szs et remplace facilement le fichier bntx. NXThemes Installer quand à lui, comme son nom l'indique, permet d'installer les thèmes directement sur votre Nintendo Switch, il est compatible avec les NXThemes et szs.tv. \n \n \n \n\n \n \nChangelog :\n \n- Cette version implémente la nouvelle API Themezer, corrigeant le problème n°152 .\n- De nombreuses fonctionnalités de compatibilité avec le firmware 20.0 restent inchangées ; plus de détails sont disponibles dans l' article de la version précédente .\n \nTéléchargement : SwitchThemeInjector v4.8.2 et NxThemes Installer v2.8.2\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209976/in-switch-switchthemeinjector-v482-et-nxthemes-installer-v282-1.png"
        }
    },
    "news_3": {
        "title": "[PS4] L'interface GUI DroidPPPwn v1.4.2 disponible",
        "content": " \nDroidPPPwn est une nouvelle application Android qui permet d’exécuter l’exploit PPPwn sur la console PlayStation 4 en utilisant votre smartphone. \n \nDroidPPPwn est une interface graphique (GUI) pour l’exploit PPPwn sur PS4, elle inclut le binaire PPPwn_cpp spécifiquement compilé pour arm-android, ainsi que les fichiers stage1.bin et stage2.bin pour tous les firmwares pris en charge (du firmware 7.00 au 11.00). \n \nDans cette nouvelle version 1.4.2, tous les fichiers stage2.bin ont été mis à jour vers la version 1.05 afin de prendre en charge GoldHEN 2.4b18.5, ce qui active les supports des firmwares PS4 7.xx, 8.xx et 9.xx qui étaient jusqu'alors manquants.\n \n \n\n \n \nExigences :\n \n- Un téléphone Android récent rooté prenant en charge l’OTG.\n- Un câble ou un adaptateur USB OTG.\n- Un adaptateur USB Ethernet.\n- Un câble Ethernet.\n \n \nUtilisation :\n \n- Téléchargez la dernière version depuis ce dépôt et installez-la sur votre téléphone Android.\n- Sur votre PS4, suivez les instructions de l’exploit PPPwn original pour configurer la connexion Ethernet.\n- Lancez l’application DroidPPPwn et sélectionnez le firmware de votre PS4.\n- Appuyez sur le bouton “Start” dans l’application et simultanément sur la touche “X” de votre manette lorsque vous êtes sur l’écran de test de la connexion Internet.\n- Attendez que l’exploit atteigne l’étape 4 et que le message s’affiche sur votre écran. Si l’exploit échoue, appuyez à nouveau sur le bouton “Start” pour l’arrêter et répétez la dernière étape.\n \nTéléchargement : DroidPPPwn v1.4.2\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209742/in-ps4-linterface-gui-droidpppwn-v142-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[PS4] PS4_db_Rebuilder_EXT adapté au firmware 12.00 et 12.02",
        "content": "Un utilisateur de PS4, Dragonixplay, s'est demandé si PS4_db_Rebuilder_EXT était compatible avec les firmwares récents, après avoir effectué quelques tests sur le firmware 12.00 de sa PS4, il s'est apperçu que le programme ne fonctionne pas. \n \nSi vous reconstruisez la base de données et que les fichiers fpkg disparaissent, ce programme la reconstruira à nouveau, y compris les fichiers fpkg. Auparavant, cela n'était possible que jusqu'au firmware 11.00 de PS4.\n \n \n\n \n \nAprès avoir multiplié les échecs de restauration, il a adapté PS4_db_Rebuilder_EXT au firmware 12.00, et il propose aussi la version pour le firmware 12.02, mais il n'a pas pu la tester.\n \n \n \nTéléchargement :\n \nPS4_db_Rebuilder_EXT-0.1__--_12.00\n \nPS4_db_Rebuilder_EXT-0.1__--_12.02\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209735/in-ps4-ps4-db-rebuilder-ext-adapte-au-firmware-1200-et-1202-1.png"
        }
    },
    "news_5": {
        "title": "[PS4] PS4PKGinstaller v1.11 disponible",
        "content": "Le développeur CiborgEC vient de dévoiler une nouvelle version de son programme PS4PKGinstaller qui est maintenant affublé de la numérotation v1.11. \n \n \n\n \n \n \nChangelog : \n \n- Identique à la version 1.10EA.\n- Possibilité de le lancer à partir d'une clé USB.\n- Fonction de désinstallation intégrée pour les PKG installés sur une clé USB.\n- Correction d'un bug qui désinstallait le jeu de base lors de l'installation d'un DLC pkg.\n \nN'oubliez pas que si vous avez déplacé un paquet vers une clé USB, vous devez utiliser le programme de désinstallation PS4PKGinstaller ou déconnecter la clé USB avant de le désinstaller depuis le menu principal. Les paquets seront déplacés vers le dossier PS4_APPS, le programme de désinstallation les ramène à leur emplacement d'origine.\n \nPour rappel, la version 1.10EA avait amené : \n \n- Vous pouvez désormais déplacer un jeu déjà installé et sa mise à jour (en option) et y jouer depuis un périphérique USB, libérant ainsi de l'espace de stockage sur le disque dur. \n- Fonction de désinstallation intégrée pour les PKG installés sur une clé USB. \n \nCette version 1.10EA n'avait été accessible qu'aux contributeurs, là la v1.11 est accessible à toutes et tous. \n \n \nTéléchargement : PS4PKGinstaller v1.11 (93.38 MB)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209734/in-ps4-ps4pkginstaller-v111-disponible-1.jpg"
        }
    },
    "news_6": {
        "title": "[Switch] AtmoPack-Vanilla v3.0.6 disponible",
        "content": " \nLe développeur THZoria nous annonce la version 3.0.6 d'AtmoPack, AtmoPack est un pack tout-en-un qui permet de proposer tout ce qu'il y a de plus intéressant pour une Switch hackable. LS tient encore une fois à remercier la Team PoyoNX pour cette solution. \n \nDans cette nouvelle version 3.0.6, AtmoPack-Updaters a été mis à jour vers la version 2.0.3. AtmoPack-Updaters était auparavant développé par notre ami et partenaire PoloNX, mais comme il n'est plus actif sur la scène, l'homebrew a été repris et modifié.\n \nCode source : https://github.com/THZoria/AtmoPackUpdater\n \nPour refléter ce changement, nxlinks a également été mis à jour, ce qui permet aux updaters de détecter les mises à jour : https://github.com/THZoria/nx-links/\n \n- Projet entièrement déplacé sur mon propre GitHub afin que je puisse le gérer plus facilement (fork)\n- Modification des constantes en fonction du premier point\n- Modification du script de détection des mises à jour du Pack, des homebrews et du firmware, notamment pour utiliser mon GitHub au lieu de Codeberg pour AtmoPack-Vanilla (seule la dernière version est prise en compte pour le moment)\n- Mise à jour de la détection des homebrews et des sysmodules corrigée afin que si le dépôt a été supprimé/modifié ou défini comme privé, il soit ignoré.\n \n \n \n\n \n \n \nContenu de cette version 3.0.6 : \n \n- Atmosphere (v1.9.3)\n- Atmosphere-Fusee (v1.9.3\n- Hekate (v6.3.1)\n- 90DNSTester (v1.0.4)\n- DBI (v658en)\n- FTPD (v3.2.1)\n- JKSV (v11/05/2024)\n- EdiZon (v3.1.0)\n- Goldleaf (v1.0.0)\n- Sys-Patch (v1.5.6)\n- Atmosphere-Hekate-Config (v1.0.0)\n \n \nTéléchargement : AtmoPack-Vanilla v3.0.6\n \n \nMerci Linkynimes pour l'information\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1964465810.png"
        }
    },
    "news_7": {
        "title": "[Switch 2] Peta demande un retrait dans Mario Kart World",
        "content": "L'association PETA (Pour une Éthique dans le Traitement des Animaux) demande le retrait de l'anneau de la vache dans Mario Kart World, pour PETA cet anneau nasal est un outil de cruauté qui provoque douleur et inconfort.\n \n \n\n \n \nLe dernier opus de la franchise Mario Kart a ajouté plusieurs personnages uniques, dont la possibilité de piloter l'une des vaches du circuit de la Ferme Meuh-Meuh. PETA a adressé une lettre au président de Nintendo, Shuntaro Furukawa, pour lui demander de modifier le personnage. L'association rajoute que cela correspond à un acte de cruauté et qu'il ne devrait pas figurer dans le design du personnage.\n \n \nOn sait que Mario Kart World n'est qu'un jeu, et c'est précisément pour ça que l'anneau nasal de la Vache doit disparaître. Mario Kart est censé être une évasion amusante, pas un rappel des outils douloureux utilisés sur les vaches dans les industries de la viande et des produits laitiers. Personne n'a envie de penser à la souffrance animale en roulant sur un circuit.\n \n \n \n\n \n \n \nCe n'est pas nouveau non plus, PETA avait déjà dénoncé le traitement abusif envers les poissons et les insectes, où les joueurs peuvent arracher des animaux sauvages de leurs maisons et les exposer dans des vitrines exiguës dans un musée dans Animal Crossing: New Horizons.\n \nDans Palworld, où les joueurs battent et capturent des amis sauvages et les exploitent pour la nourriture et les vêtements, ou encore la maltraitance dans Pokemon Noir et Bleu. \n \n \nTout est là : peta-mario-kart-world-controversy-cow-nose\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209611/in-switch-2-peta-demande-un-retrait-dans-mario-kart-world-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1209611/in-switch-2-peta-demande-un-retrait-dans-mario-kart-world-2.png"
        }
    },
    "news_8": {
        "title": "[XB360] BadStick v1.4B pour simplifier l'exploit BadUpdate",
        "content": "Le développeur Klepto dévoile la version 1.4B de BadStick, l'outil qui permet de simplifier la création de la clé USB compatible FAT32 pour l'exploit BadUpdate pour les consoles Xbox 360.\n \nL'outil copie et configure automatiquement les fichiers essentiels, y compris la version d'essai gratuite de Rock Band Blitz , qui est nécessaire pour déclencher la vulnérabilité utilisée par l'exploit.\n \nBadStick inclut également XeXMenu 1.2 , l'un des dashboards et gestionnaires de fichiers homebrews les plus populaires pour les consoles Xbox 360 , et offre la possibilité d'ajouter des applications homebrew supplémentaires au choix de l'utilisateur, créant ainsi une configuration personnalisée et prête à l'emploi.\n \n \n\n \n \nChangelog v1.4B :\n \n- Options de support ajoutées.\n- Option ajoutée pour ignorer le formatage.\n- Option ajoutée pour ignorer les fichiers principaux.\n- Problème de sortie corrigé à la fin.\n- Correction d'un problème où le programme se fermait quels que soient les paramètres.\n- Correction d'une erreur qui apparaissait lorsque le périphérique USB avait un nom défini.\n- Correction de quelques fautes d'orthographe triviales (oups).\n- Correction de l'énorme logo  Xbox Live\n- Modifications mineures et changements d'interface.\n \n \nTéléchargement : BadStick v1.4B\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209608/in-xb360-badstick-v14b-pour-simplifier-lexploit-badupdate-1.png"
        }
    },
    "news_9": {
        "title": "[2DS/3DS] Snes9x 3DS v1.52 disponible",
        "content": " \nLe développeur matbo87, qui avait repris le travail de bubble2k16 sur une version personnalisée de l'émulateur Snes9x sur Nintendo 3DS, propose une nouvelle version de son émulateur qui est maintenant livré en v1.52. \n \nAu programme par rapport à la v1.51.1, une sécurité des threads améliorée pour éviter les plantages dus à l'accès simultané à la liste ROM, une amélioration de la stabilité de l'arrêt en corrigeant les problèmes de nettoyage des ressources, et enfin de nouvelles options d'affichage ajoutées.\n \n \n\n \n\n \n \nChangelog 1.52 : \n \nCorrections de bugs\n- Sécurité des threads : empêche le thread de cache d'accéder romFileNamespendant qu'il est modifié par le thread principal \n- Stabilité à l'arrêt : s'assure que tous les shops globaux/statiques sont correctement effacés à la sortie pour éviter les plantages tardifs liés à l'ordre de destruction \n- Mappage de la ROM : correction d'un mappage incorrect de la banque de mémoire pour Mega Man X (et probablement d'autres ROM) \n \nCaractéristiques\n- Étirement de l'écran : ajout de l'option de mise à l'échelle « 4:3 » \n- Filtre d'écran : ajout de l'option « filtrage linéaire » \n \nRefonte de code\n- Performances : annule le commit 8d50f5 en raison d'un impact négatif sur les performances \n- Shader : suppression des shaders inutilisés + ajustement du makefile \n \n \nDe quoi ressortir nos bonnes vieilles 3DS ou New3ds / New2DS ? \n \nTéléchargement : Snes9x 3DS v1.52\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209573/in-2ds3ds-snes9x-3ds-v152-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1209573/in-2ds3ds-snes9x-3ds-v152-disponible-2.png"
        }
    },
    "news_10": {
        "title": "[3DS] La version finale de l'émulateur 3DS Azahar est disponible en 2123",
        "content": "Après quelques bêtas, et quelques release candidate dont nous n'avons pas fait écho, voilà la version finale révision 2123 de l'émulateur 3DS Azahar issu d'un fork de Citra développé par PabloMK7 et Lime3DS.\n \nBeaucoup d'éléments ont évolué depuis la 2122, sur de nombreux correctifs généraux, mais aussi spécifiques à Android, MacOS, Windows ou bien même techniques comme en atteste le changelog.\n \n \n\n \n \n \nQuelques points importants : \n \n- Le cache des shaders sous Vulkan sera invalidé, donc le stuttering réapparaîtra sur les parties déjà jouées jusqu'à ce que le cache soit régénéré. \n- Comme d'habitude, les sauvegardes des versions précédentes cesseront de fonctionner \n \n \nTéléchargement : Azahar 2123\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209568/in-3ds-la-version-finale-de-lemulateur-3ds-azahar-est-disponible-en-2123-1.jpg"
        }
    },
    "news_11": {
        "title": "[PS4] PKG-BackUP supporte les firmwares 3.00 à 12.02",
        "content": "Comme chaque année depuis 3 ans, le développeur kmeps4 propose sa mise à jour de PKG-BackUP, il s'agit là de la version 1.3 qui amène le support des firmwares PS4 3.00 à 12.02.\n \nPKG-BackUP est une version modifiée d'App Dumper qui permet de sauvegarder les fichiers PKG sur un disque dur externe. \n \n \n\n \n \nVersion 1.0 :\n- Ajout de la possibilité d'automatiser et de copier la base, la mise à jour et le DLC PKG des applications/jeux déjà installés sur un disque dur externe.\n \nVersion 1.1 :\n- Ajout du fichier de configuration « config.cfg », cela permettra à l'utilisateur de configurer les paramètres suivants (vous devez ajouter ce fichier à la racine du disque dur externe) \n- Ajout de la compatibilité avec le lecteur de stockage étendu sur /mnt/ext0/..\n- Ajout d'une notification de progression du pourcentage de copie.\n \nVersion 1.3 : \n- Ajout de la prise en charge du firmware PS4 de 3.00 à 12.02\n \n \nTéléchargement : PKG-BackUP 1.3\n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209566/in-ps4-pkg-backup-supporte-les-firmwares-300-a-1202-1.png"
        }
    },
    "news_12": {
        "title": "[PS4/PS5] Laps3c0re une future possibilité de jeux PS2 sur PS4 et PS5",
        "content": "Le développeur iMrDJAi a dévoilé la version 1.0 de Laps3c0re, en développement depuis quelques semaines, il s'agit d'une fusion entre un portage de Lapse, l'implémentation d'abc, et de Mast1c0re, le point d'entrée de McCaulay. \n \nUn script qui se nomme mast1c0re-send-file.py permet lui d'envoyer les payloads, et certaines fonctions permettent elles d'agir sur les paquets réseaux et les mémoires tampons. \n \n \n\n \n \nSur PS4, les firmwares 9.00, 9.03, 9.04, 9.50, 9.51, 9.60, 10.00, 10.01, 10.50, 10.70, 10.71 et 11.00 sont pris en charge, ce n'est pas le cas des firmwares 11.02, 11.50, 11.52, 12.00 et 12.02 dont le développement est toujours en cours, les versions ultérieures, telles que 12.50 et supérieures, ne sont actuellement pas prises en charge.\n \nLe développeur l'a déjà annoncé, Laps3c0re sera disponible en standalone sans besoin de loader ELF, et il faut disposer d'une copie de Okage : Shadow King.\n \nL'idée première de Laps3c0re, tout comme celle de mast1c0re est d'apporter le support des backups PS2 sur PS4 et PS5, on s'en approche. \n \n \nTéléchargement : Laps3c0re v1.00\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209565/in-ps4ps5-laps3c0re-une-future-possibilite-de-jeux-ps2-sur-ps4-et-ps5-1.png"
        }
    },
    "news_13": {
        "title": "[Switch] NXMilk supporte désormais les CD, DVD et Blu-ray",
        "content": "L'homebrew NXMilk supporte désormais les CD audio, les DVD et les Blu-ray, de quoi apporter une réelle diversité de source à la Switch. \n \nComme vous pouvez vous en doutez, cela ne fonctionne qu'avec un lecteur de disque externe, mais le logiciel peut désormais lire les formats USB notamment avec l'appui de la bibliothèque libusbdvd.  \n \n \n\n \n \n \nEt NXMilk supporte dans sa version 0.3.0 : \n \n- Support USB-DVD USB-BD Drive\n- Support ISO9660 avec Joliet \n- Support RockRidge \n- Support UDF 1.02 \n- Support CD-ROM \n- Support DVD-ROM and \n- Support BD-ROM (BD lack UDF 2.60)\n \n \nTéléchargement : NXMilk 0.3.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209544/in-switch-nxmilk-supporte-desormais-les-cd-dvd-et-blu-ray-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] Le HEN 2.0 sera bientôt proposé par Flatz",
        "content": "Il est désormais acquis qu'un HEN 2.0 est dans les tuyaux, il s'agira d'un HEN qui fonctionnera sur PS5 et qui permettra de lancer des FPKG PS5, et qui permettra aussi de les installer en plus de les lancer. \n \nMême s'il est encore trop tôt pour en parles en détails, Zecoxao annonce que ce HEN 2.0 supportera les FPKG PS4 et PS5, il y aura aussi le support des DLC et des correctifs de mise à jour.\n \n \n\n \n \nSelon lui le HEN 2.0 sera en théorie accessible du firmware 1.xx au 10.01 sur PS5, ce sont les seuls qui sont sensibles, c'est d'ailleurs pour cela qu'il va être publié, c'est parce qu'aucune possibilité de le lancer sur un firmware plus récent n'est actuellement possible. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209542/in-ps5-le-hen-20-sera-bientot-propose-par-flatz-1.jpg"
        }
    },
    "news_15": {
        "title": "[3DS/2DS] Red Viper 1.1.0 disponible",
        "content": " \nLe développeur Skyfloogle propose une nouvelle version de son émulateur Virtual Boy, Red Viper, qui est maintenant proposé en v1.1.0. Red Viper c'est le meilleur émulateur de Virtual Boy sur les Nintendo 2DS et Nintendo 3DS, et cette version confirme encore que skyfloogle assure un soutien sans faille. \n \nDans cette version, le moteur de rendu logiciel a été amélioré et activé sur New3DS afin de corriger un bug graphique, et certains plantages ont été supprimés. \n \n \n \n\n \n \nChangelog : \n \n- Amélioration du moteur de rendu logiciel et activation de celui-ci pour la chambre de test sur la nouvelle 3DS, correction des murs noirs transparents\n- Correction de l'instruction XB qui ne s'enregistre pas lorsque le registre est en mémoire, ce qui entraîne des plantages dans le mini-jeu de tir de comètes dans l'étape Colony de Galactic Pinball (#87)\n- Nombreuses améliorations apportées à l'interprète\n- Ces modifications n'affectent aucun jeu existant, mais facilitent le test de l'émulateur dans des environnements alternatifs\n \nTéléchargement : Red Viper 1.1.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209532/in-3ds2ds-red-viper-110-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[Wii/GC] Swiss v0.6r1913 disponible",
        "content": " \nLe développeur Extrems vient de mettre en ligne une version importante de son outil Swiss, et il faut avouer qu'il n'a pas fait semblant, les nouveautés sont très nombreuses dans cette v0.6r1913.\n \n \n \n\n \n \n \n- Ignore le lecteur de disque dont la date de compilation du firmware est nulle.\n- Mise à jour l'apploader. (extremscorner/cubeboot-tools@d9d7ed6)\n- Paquet pour PicoLoader.\n- Mise à jour l'apploader. (extremscorner/cubeboot-tools@3452404)\n- Ajout d'une option de mode de démarrage du système.\n- Correction de la sélection du mode vidéo avec NTSC Revision 1.0.\n- Affichage de l'état de détection des emplacements mémoire A et B.\n- Mise à jour de l'apploader. (extremscorner/cubeboot-tools@a30f3ed)\n- Correction de la détection des cartes mémoire.\n- Ajustement pour les modifications libogc2.\n- Reconnaissance de la carte mémoire MemCard PRO GC.\n- Rapport cohérent du nombre de blocs de la carte mémoire.\n- Renommer le démarrage via IPL pour charger le menu principal GameCube.\n- Noircir la vidéo de manière cohérente.\n- Priorité réduite de la fonction de réinitialisation de l'ID du jeu.\n- Mise à jour de la base de données Redump. Une toute première version de l'émulateur Flycast est disponible.\n \n \nTéléchargement : Swiss v0.6r1913\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209529/in-wiigc-swiss-v06r1913-disponible-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] Remote Jar Loader v1.2 disponible avec Lapse 1.1",
        "content": "Le développeur Gezine propose la version 1.1 de Remote Jar Laoder, il s'agit en fait d'une mise à jour de l'exploit BD-JB-1250 qui intègre désormais la version 1.0 de Lapse, le Kexploit utilisé sur PS4 pour les firmwares compris entre le 9.00 et 12.02. \n \nLe taux de réussite de 90%, la rapidité et la stabilité font de cette implémentation l'une des meilleures permettant de profiter de charger les payloads, et notamment GoldHEN sur une clé USB. \n \n \n \n\n \n \n \nPour ce faire, il suffit de graver le fichier Lapse.iso sur un disque Blu-ray et d'insérer le payload, par exemple GoldHEN, sur une clé USB, en la renommant en payload.bin.\n \n \n \nTéléchargement : Remote Jar Loader 1.1 + Lapse 1.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209468/in-ps4-remote-jar-loader-v11-disponible-avec-lapse-10-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] switch_AIO_LS_pack 5.20.1 disponible (MAJ)",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.20.1.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format).\nLe mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.20.0:\nDernier firmware compatible mis à jour en version 20.3.0.\nMise à jour d'Atmosphere, de Ultrahand-overlay et de Status-Monitor-Overlay vers la dernière version de ceux-ci.\nAjout d'un package switch_AIO_LS_pack_Utilities pour Ultrahand-Overlay permettant d'effectuer certaines configurations ou actions (réglage de la détection du port cartouche, activation/désactivation des redirections vers le Homebrew Menu, activation/désactivation de l'auto-boot de Hekate et redémarrages divers).\nMise à jour du homebrew AIO_LS_pack_Updater en version 7.04.02 apportant les changements suivants:\nLa vérification des sha256 pour le téléchargement du homebrew, du pack ou du fichier zip complémentaire au pack sont maintenant insensibles à la casse. Notez que si vous avez fait la mise à jour du pack entre la version 5.19.3B et 5.19.6B inclus et/ou que vous avez le homebrew en version 7.04.00 ou 7.04.01 vous devrez réinstaller la dernière version du homebrew manuellement à cause de bugs qui se sont produits durant les mises à jour et qui ont provoqué des erreurs lors de la vérification des sha256.\nCorrection de bugs lors d'un échec de vérification du sha256 lors du téléchargement d'une mise à jour du homebrew, le traitement ne s'arrêtait pas malgré l'erreur.\n\n- Changelog pour la version 5.20.1:\nMise à jour de AIO_LS_pack_utilities en version 1.0.1, corrige une erreur sur le patch pour activer/désactiver le port cartouche, celui-ci était inversé et activait lorsqu'on désactivait et inversement.\nMise à jour de Status-Monitor-Overlay vers la dernière version de celui-ci.\nNote: Pour traiter les problèmes particuliers de lancement de la sysnand en firmwares 17.0.0 et supérieurs c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.\nNote 2: Les problèmes de chauffe et de consommation excessive de la batterie qui peuvent se produire sur une minorité de consoles sur les firmwares 19.0.0 et supérieurs ne sont pas du fait du pack, cela semble venir du firmware mais on arrive pas à savoir vraiment de quoi et se qu'il faut faire pour corriger le problème.\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets. Pour cela nous avons mis en place un questionnaire de satisfaction, en plus de pouvoir reporter les problèmes sur Github ou sur le forum vous pouvez utiliser ce questionnaire pour nous donner vos opinions de façon anonyme (pour des problèmes spécifiques il vaut mieux reporter sur Github ou ouvrir un sujet sur le forum, il y aura une réponse bien plus rapide et cela permet de demander plus de détails pour identifier et peut-être résoudre le possible problème.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe et vous avez aussi un tutoriel plus détaillé sur cette page, d'ailleurs ce dernier site contient aussi pas mal de tutoriels notamment sur la Switch. Enfin si vous souhaitez voir le changelog complet du pack il est consultable ici pour la version stable et ici pour la version beta.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_19": {
        "title": "[PS4] Lapse Kexploit serait opérationnel avec BD-JB de Gezine",
        "content": "Le développeur Gezine a dévoilé un screen qui montrerait qu'il aurait réussi à lancer de manière opérationnelle Lapse via un keploit, en le couplant avec son exploit BD-JB. \n \nIl disposerait donc d'un exploit complet entre son exploit BD-JB avec une utilisation conjointe de Lapse. \n \nBien entendu Lapse n'était compatible que jusqu'au firmware 12.02, cela ne fonctionnerait que jusque là, mais ce serait déjà exceptionnel. \n \n \n \n\n \n \n \nIl doit retravailler le bin loader, et aussi peut être proposé un HEN pour dévoiler son travail, c'est du moins ce qu'il a répondu à Zecoxao. \n \n \nTout est là : gezine_dev\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209372/in-ps5-lapse-kexploit-serait-operationnel-avec-bd-jb-de-gezine-1.png"
        }
    },
    "news_20": {
        "title": "[XB360] Xenia Manager v3.1.0 disponible",
        "content": "Une nouvelle mise à jour a été publiée pour Xenia Manager, le frontend conçu pour simplifier et améliorer l'utilisation de l' émulateur Xenia, dédié à la console  Xbox 360 est disponible en version 3.1.0. \n \nCette nouvelle version introduit le support de l'espagnol, avec la contribution d'ElTioRata, et implémente une gestion complète des profils, qui peuvent désormais être décryptés et cryptés directement depuis l'application, avec la possibilité de changer le Gamertag sans aucune étape externe.\n \n \n \n\n \n\n \n \n \nDe nouvelles fonctions de visionneuses de réussites au jeu ont été introduites, cette visionneuse affiche toutes les réussites déverrouillées et verrouillées, avec des descriptions visibles lorsque vous passez la souris dessus, et inclut également une fonction cachée pour les déverrouiller manuellement.\n \n \nTéléchargement : Xenia Manager v3.1.0\n \n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209359/in-xb360-xenia-manager-v310-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1209359/in-xb360-xenia-manager-v310-disponible-2.png"
        }
    }
}