{
    "news_1": {
        "title": "[PS5] Un nouveau projet PS5 PI Server pour Raspberry PI de Stooged",
        "content": "Le développeur Stooged vient de mettre à jour son script PS5 PI Server pour Raspberry PI. Il s'agit d'un nouveau script d'installation qui vous permet de configurer un serveur DNS afin de bloquer les mises à jours, un serveur web, et un hôte d'exploit le tout sur Raspberry PI.\n \nPour y parvenir le script se base sur PS5-Exploit-Host d'Idlesauce, un exploit compatible jusqu'au firmware 4.51.\n \n \n \n\n \n \n \nLes instructions d'installation sont présentes dans le github ci-dessous. \n \nTéléchargement : PS5-PI-Server\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184295/in-ps5-un-nouveau-projet-ps5-pi-server-pour-raspberry-pi-de-stooged-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS5] SelUtil-Patched compatible avec les fichiers PS5 fselfs",
        "content": "Le développeur CyB1K vient de mettre à jour l'utilitaire SelUtil-Patched, le programme permet désormais de créer des fichiers ELF compatible avec la PlayStation 5. \n \nPour la petite histoire, c'est pour patcher l'eboot de la démo de Wolverine que le développeur a du faire évoluer SelUtil-Patched.\n \nVous pouvez simplement glisser et déposer un eboot/prx dans l'exe pour en profiter. \n \n \n\n \n \nPour parler clair, la mise à jour vise à éliminer les informations en double avant le premier segment, et il a ajouté le segment des versions ainsi que de nouvelles options. \n \nChangelog : \n \nhttps://github.com/CyB1K/SelfUtil-Patched/blob/main/README.md\n \nLogiciel SelUtil-Patched :\n \nhttps://github.com/CyB1K/SelfUtil-Patched/blob/main/Debug/selfutil_PS5.exe\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184293/in-ps5-selutil-patched-compatible-avec-les-fichiers-ps5-fselfs-1.png"
        }
    },
    "news_3": {
        "title": "[PS4/PS5] Un nouveau kernel exploit sur PS4 ou PS5 pourrait arriver",
        "content": "Il semblerait qu'un nouvel exploit kernel soit dans les starting-blocks. C'est du moins ce que semble nous dire le développeur Jose Coixao, aussi connu sous le nom de Zecoxao.\n \nIl dévoile en effet que Theflow disposerait de ce nouvel exploit, et qu'il est en train de vérifier s'il est patché sur 11.02/8.40 ou sur 11.50/9.00.\n \n \n\n \n \nPour l'heure rien n'est divulgué, des tests sont en cours et il y a fort à parier que rien ne sorte avant un bon moment. \n \nCependant d'autres travaillent comme sleirsgoevy qui dévoile depuis quelques minutes une évolution de son implémentation.\n \nIl faut voir ces propositions à deux niveaux, cela permettrait de débloquer la PS4 sur 11.02 ou 11.50, et la PS5 sur 8.40 voir 9.00.\n \n \nEvolution sleirsgoevy : ps4jb-payloads\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184291/in-ps4ps5-un-nouveau-kernel-exploit-sur-ps4-ou-ps5-pourrait-arriver-1.png"
        }
    },
    "news_4": {
        "title": "[PS3] La génération PS3 sera toujours là en 2024",
        "content": "A quelques heures de la fin de l'année 2023, quoi dire au sujet de ceux qui pour parti ont marqué l'histoire de la PS3, cette console mal aimée à son lancement car trop chère était complexe à comprendre pour les développeurs car son architecture interne était trop évoluée pour l'époque, du moins trop avancée diront certains. \n \nFin Février 2023, Sony surprenait encore son monde en dévoilant la mise à jour du firmware 4.90, qui avait pour objectif de fournir les dernières clés blu-ray, soit, mais mise à jour quand même. \n \nEt bien sachez qu'en 2024, la PS3 va continuer à vivre au travers des traits de certains développeurs comme Aldo Vargas (aussi connu sous le nom d'Aldostools), ou encore Nathan Martin (alias Evilnat).\n \n \n \n\n \n \n \n \nNous ne citons pas ces développeurs par hasard, c'est surtout qu'ils travaillent activement à la scène PS3, ainsi Aldo Vargas vient de mettre à jour prepISO en version 1.31 afin qu'il permette la copie désormais la clé de chiffrement dans /dev_hdd0/tmp/wmtmp.\n \nCette option n'arrive pas seule puisqu'il propose une nouvelle version de webMAN MOD 1.47.45, avec des corrections d'un problème avec les mots de passe FTP de 20 caractères ou encore l'ajout d'une option pour sélectionner le fichier externe ps1_bios.bin (PSXONPSP660.BIN) dans /setup.ps3.\n \nCes avancées sont aussi effectué pour le prochain CFW qui sera proposé par Nathan Martin, qui vient d'envoyer la 23 ème version Bêta Test de son CFW Evilnat 4.90.2 qui apportera aussi des options nouvelles notamment sur la gestion des ISO 3k3y/Redump, cette gestion dans Cobra qui prend en charge les ISO cryptés sur les disques durs externes à système de fichiers NTFS/exFAT, sans compter les évolutions apportées à xai_plugin. \n \nComme on le voit la PS3 a encore de beaux restes en 2024, on estime qu'environ un peu moins de 3 millions de PS3 sont encore actives dans le monde malgré la fermeture chaotique successive des serveurs PS Store et des studios de développement limitant le jeu en ligne. \n \n \nSource : \n \nhttps://github.com/aldostools/webMAN-MOD/releases\n \nhttps://twitter.com/xXEvilnatXx\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184190/in-ps3-la-generation-ps3-sera-toujours-la-en-2024-1.png"
        }
    },
    "news_5": {
        "title": "[DSi] L'exploit et le dump du bootrom DSi de PoroCYon dévoilés à la 37C3",
        "content": "Nous vous en avions parlé le jour de Noël, ayant découvert la programmation de cette présentation un peu par hasard, mais voilà c'est fait, le développeur PoroCYon a dévoilé lors d'une conférence à la 37 ème édition de la CCC (Chaos Communication Congress), comment il a réussi à dumper le bootrom DSi et trouvé un nouvel exploit. \n \n \n\n \n \nD'une pierre deux coups, il dévoile le dump du bootrom mais aussi un nouvel exploit homebrew basé sur un exploit ARM9. \n \n \n\n \n\n \n \n\n \n\n \n \nLa vidéo complète de présentation se trouve ci-dessous ! \n \n \n\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184189/in-dsi-lexploit-et-le-dump-du-bootrom-dsi-de-porocyon-devoiles-a-la-37c3-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184189/in-dsi-lexploit-et-le-dump-du-bootrom-dsi-de-porocyon-devoiles-a-la-37c3-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1184189/in-dsi-lexploit-et-le-dump-du-bootrom-dsi-de-porocyon-devoiles-a-la-37c3-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1184189/in-dsi-lexploit-et-le-dump-du-bootrom-dsi-de-porocyon-devoiles-a-la-37c3-4.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1184189/in-dsi-lexploit-et-le-dump-du-bootrom-dsi-de-porocyon-devoiles-a-la-37c3-5.png"
        }
    },
    "news_6": {
        "title": "[Switch] Le linker se nomme Mig Switch et son annonce officielle est là",
        "content": "Nous n'en attendions pas grand chose, mais au final voilà donc l'annonce officielle de ce nouveau linker qui devrait être lancé en Janvier 2024. \n \nAprès la vidéo de démonstration voilà donc que des informations complémentaires fleurissent toujours sur le compte Twitter/X d'After Time X.\n \nLe premier linker de la Switch se nommerait donc Mig Switch, et la communication autour de ce linker est donc désormais officielle et se fait via un site internet : https://migswitch.com/#/ \n \n \n\n \n \n \nIl y aura quelques spécificités à ce linker, à commencer par la manière dont il faudra lancer les jeux, et surtout les dumps devront être fait avec NXDumpTools Rewrite, et il faudrait intégrer le certificat (ce qui n'est que rarement le cas dans les dumps pour éviter les risques de ban). \n \n \n \n\n \n \nConcernant le fait d'enlever et remettre le linker pour changer de jeu, il s'agissait d'un prototype, la version finale ne fonctionne pas comme cela, et qu'ils réfléchissent déjà à une V2 disposant d'un interrupteur. Sur ce dernier point il y a une forme de réticence du fait de la fragilité à long terme sur ce genre de composant. Une solution software serait préférable avec un menu mais peut être que cela n'est techniquement pas réalisable. \n \nBien entendu ce linker serait évolutif, flashable, et indétectable, bon cela reste à voir. La Team accepte dès maintenant les précommandes, et les livraisons commenceront en Janvier 2024. Le gros volume est attendu pour Mars 2024, la Team précise qu'elle ne vend pas au détail, et pas aux utilisateurs finaux. Dernière chose, tout ceci semble russe, encore quelques semaines à attendre et nous serons définitivement fixés. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184126/in-switch-le-linker-se-nomme-migswitch-et-son-annonce-officielle-est-la-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1184126/in-switch-le-linker-se-nomme-migswitch-et-son-annonce-officielle-est-la-2.png"
        }
    },
    "news_7": {
        "title": "[Wii/NC] Swiss v0.6 r1562 disponible",
        "content": "Le développeur Extrems propose une mise à jour de son outil Swiss afin d'apporter des corrections indispensables. \n \nComme vous le savez probablement Swiss est le digne successeur de SD-boot, il permet de lancer les homebrews GameCube mais aussi les backups stockés sur carte SD ou un disque dur, SDGecko, WODE, Wiikey Fusion et bien d'autres solutions. \n \nCette nouvelle version v0.6 r1562 apporte pas mal de nouveautés ! \n \n \n\n \n \nChangements apportés par emukidid :\n \n- Correction de la navigation vers le haut d'un répertoire avec X sur les disques ISO9660\n \nChangements apportés par Extrems :\n \n- Optimisation supplémentaire de l'écriture à travers le cache FAT.\n- Invalider la page de cache en cas d'erreur de lecture.\n- Mise à jour de la base de données Redump.\n- Correction d'un bug IDCT dans la première bibliothèque THP.\n- Rendre GC Loader HW2 1.0.0 inéligible en tant que dispositif de correction.\n- Signaler CUBEODE comme \"compatible avec GC Loader\".\n- Utiliser les commandes de lecture de disque après l'installation du fragment pour tester les eaux.\n- Mieux initialiser les structures de gestion des périphériques.\n- Garder une trace de certaines bizarreries de GC Loader.\n- Ajustement pour les changements de libogc2.\n- Corriger le problème pour de vrai, en quelque sorte.\n- N'afficher l'entrée du jeu DVD que dans le répertoire racine.\n- Améliorer quelque peu la détection de la Wii.\n- Mise à jour de la base de données No-Intro.\n \nTéléchargement : Swiss v0.6 r1562\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184077/in-wiinc-swiss-v06-r1562-disponible-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] NS-USBloader v7.1 disponible",
        "content": "Le développeur developersu propose la version 7.1 de NS-USBloader, pour rappel NS-USBloader se charge de se substituer au script de python de Tinfoil, et qui est proposé en java pour être lancé sous Windows, Linux et MacOS.\n \nUn programme qui continue de convaincre, malgré que quelques alternatives existent comme DBI, NS-Usbloader reste un programme d'installation NSP Adubbz / TinFoil et GoldLeaf (USB) du côté du PC, avec une interface graphique et les cookies.\n \n \n\n \n \nChangelog : \n \n- Pilotes ajoutés au programme d'installation de Windows. L'application vérifie s'il y a des pilotes dans le dossier de l'application et essaie de les télécharger uniquement s'ils sont absents. Important pour certaines personnes. #156\n- Prise en charge HiDPI ! Eh bien, en quelque sorte vous pouvez modifier la police et la taille de l'application dans les paramètres. Cela a du sens pour les utilisateurs de Rectify11. #153\n- Correction du traitement des paramètres régionaux. Important pour certains utilisateurs Linux. #139\n- Traduction chinoise simplifiée mise à jour par @exiori. Merci!\n- Traduction française mise à jour par @requinDr. Merci!\n- Traduction coréenne mise à jour par @DDinghoya. Merci!\n- justindhillon a corrigé les liens brisés dans 'readme' et 'pom'. Merci!\n \n \n \nTéléchargement : ns-usbloader 7.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184076/in-switch-ns-usbloader-v71-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[Multi] Le code source de GTA V leakée mais pas que...",
        "content": "Rockstar a une nouvelle fois été la cible d'un vol de données, décidemment le studio n'est pas épargné, après le hack qui a permis de dévoiler environ une centaine de vidéos de GTA VI, la bande annonce dévoilée plus tôt, voilà que c'est le code source de GTA V qui a été rendu public contre 2000 $. \n \n \n\n \n \nLe code source a été fourni par un groupe de personnes dans un contexte privé puis le code a été vendu pour une bouchée de pain, avec des modèles et des ressources internes de Rockstar. \n \n\n \n\n \n \nCe serait environ 200 Go de données qui ont été divulguées, en plus du code source il y aurait même quelques allusions à Bully 2, Midnight Club 5 ou encore GTA VI avec des listes de diffusions, des noms complets de 1158 employés de Rockstar Games ou encore certains fichiers sensibles des prochains jeux. \n \n \n\n \nBien entendu Rockstar a supprimé depuis les liens et l'accès aux fichiers mais c'est déjà trop tard, environ 117 nouveaux éléments ont été divulgués lors de la fuite du code source de GTA 5, notamment des vidéos de développement, des captures d'écran et des documents.\n \n \n\n \n \n \nLa source ici : twitter.com/GTAFocal/\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-607508196.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1753973593.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1711829397.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-1439781616.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-483826025.png"
        }
    },
    "news_10": {
        "title": "[NDS/2DS/3DS] TWiLight Menu++ v26.4.0 et Bootstrap v1.1.0 disponibles",
        "content": "Le développeur RocketRobz propose les versions Christmas de TWiLight Menu++ et Bootstrap, l'occasion de mettre à jour ses logiciels. \n \n \n\n \n \nQuoi de neuf dans TWiLight Menu++ :\n \n- DeadSkullzJr : Mise à jour du correctif AP pour Pokémon : Refined Gold Overhaul (v3.1).\n- Ajout d'un message de limitation de RAM (pas de musique) pour Glory Days : Tactical Defense sur DS.\n- DieGo367 : Thèmes basés sur la DSi : Ajustement des conditions du jingle / de la musique de démarrage (#2336).\n- Divers : Mise à jour des traductions.\n \nCorrections de bugs :\n- Correction du fait que le son DSi ne soit pas automatiquement défini comme ROM donneuse afin que les jeux DSi-Enhanced fonctionnent en mode DSi dans les exploits DSiWare (tels que Memory Pit, Flipnote Lenny, stylehax, etc.).\nO- btenir la région SysNAND et les paramètres de l'application launcher fonctionne à nouveau.\n- DieGo367 : Correction du Slot-1 qui ne se chargeait pas dans le menu DS Classic (#2335).\n- DieGo367 : Thèmes basés sur la DSi : Correction de l'effacement de la boîte et des boîtes manquantes (#2338).\n- NightScript370 : Le thème est maintenant l'option musicale par défaut.\n- Correction du jingle de démarrage ne jouant pas dans le thème 3DS avec la musique du menu 3DS réglée.\n \n \nNouveautés de Bootstrap :\n \n- Mode B4DS : La musique est désormais jouée dans Pop Island : Paperfield & Glory Days : Tactical Defense lorsqu'ils sont joués sur des consoles DS debug/dev.\n \nCorrections de bugs :\n- Correction du dysfonctionnement du cloneboot dans certains titres DSiWare.\n- Correction de la lecture du drapeau cloneboot à une adresse de fin de ROM invalide, ce qui empêchait certains ROM hacks de démarrer.\n- Une partie de la RAM utilisée pour les captures d'écran est désormais sauvegardée avant de prendre une capture d'écran. Ceci corrige le cas où un jeu se plantait après avoir pris une capture d'écran.\n- L'accès au Slot-1 est désormais activé pour le DS Download Play.\n \n \nTéléchargement : \n \n \nhttps://github.com/DS-Homebrew/TWiLightMenu/releases\n \n \nhttps://github.com/DS-Homebrew/nds-bootstrap/releases\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184014/in-nds2ds3ds-twilight-menu-v2640-et-bootstrap-v110-disponibles-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] Itemzflow disponible en v1.0.3 avec support des backups PS5",
        "content": "A l'occasion de Noël 2023, le développeur LighninsMods dévoile la version 1.0.3 de son manager Itemzflow, et cette version c'est clairement du lourd. \n \n \n\n \n \nPrincipales fonctionnalités incluses dans cette version :\n \n- Applications PS5\n- Game Dumper\n- Installateur PKG interne\n- Lecture MP3\n- Plus d'informations\n \n \nPour l'heure, cela est limité au firmware 4.03, 4.50 et 4.51, ce qui est déjà pas mal. \n \n\n \n \nTout une liste de jeux sont donc désormais jouables sur PS5 : \n \nGhost of Tsushima (63.47 GB)\nBack 4 Blood (31.84 GB)\nLittleBigPlanet Sackboy: A Big Adventure (26.15 GB)\nMarvel's Guardians of the Galaxy (38.10 GB)\nSTAR WARS Jedi: Fallen Order (49.47 GB)\nWWE 2K22 (47.45 GB)\nSTRANGER OF PARADISE FINAL FANTASY ORIGIN (59.63 GB)\nSifu (6.15 GB)\nAlan Wake Remastered (27.34 GB)\nGhostwire: Tokyo (17.48 GB)\nThe Pathless (6.62 GB)\nGuilty Gear -Strive- (13.86 GB)\nTales of Arise (31.22 GB)\nLife is Strange: True Colors (11.32 GB)\nThe Persistence Enhanced Edition (1.89 GB)\nKena: Bridge of Spirits (16.63 GB)\nGrand Theft Auto III: The Definitive Edition (4.55 GB)\nGrand Theft Auto: San Andreas: The Definitive Edition (20.71 GB)\nGrand Theft Auto: Vice City: The Definitive Edition (10.01 GB)\n \n \nTéléchargement : \n \nhttps://twitter.com/LightningMods_/status/1739509549537665215\n \n \nhttps://pkg-zone.com/details/ITEM00001\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-922050178.jpg"
        }
    },
    "news_12": {
        "title": "[PS5] Une nouvelle version d'etaHEN avec itemzflow disponible",
        "content": "Clairement c'est du côté de Lightning Mods que cela se passe actuellement, tous nos espoirs de voir débarquer un véritable hack exploitable sur PS5 viennent d'etaHEN couplé avec itemzflow, et l'arrivée d'une nouvelle version est toujours appréciable. \n \nIl teste actuellement une nouvelle version de etaHEN intégrant une nouvelle version d'itemzflow, de quoi nous faire patienter encore un peu en attendant un véritable hack permettant d'exécuter les dumps PS5. \n \nLightning Mods informe le monde qu'il prépare la version 1.2B d'etaHEN qui va permettre de nouvelles fonctionnalités : \n \n \n\n\n \n\n \n\n \n \nNouvelles fonctionnalités clés :\n \n- Version personnalisée du système\n- Un fichier de configuration\n- Ajout IF à la base de données si sur m.2\n- Corrections de bogues\n- Réécriture du payload du serveur \n- Les cheats ne sont plus un payload indépendant\n\n \nA noter que le Store PKG a été mis à jour pour fonctionner avec etaHEN 1. 2B l'ancien PKG ne fonctionnera PAS avec cette version d'etaHEN, assurez-vous de retélécharger le PKG.\n \nTéléchargement : etaHEN 1.2B\n \nUne liste de compatibilité est disponible ici : Liste\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183964/in-ps5-une-nouvelle-version-detahen-avec-itemzflow-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1183964/in-ps5-une-nouvelle-version-detahen-avec-itemzflow-disponible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1183964/in-ps5-une-nouvelle-version-detahen-avec-itemzflow-disponible-1.jpg"
        }
    },
    "news_13": {
        "title": "[DSi] Un hack de la Nintendo DSi à la 37C3 dans 3 jours",
        "content": "Noël est passé et comme un premier cadeau voilà qu'arrive la conférence 37C3, l'un des rassemblements des meilleurs développeurs et hackers. \n \nLes nouveautés lors de la \"Chaos Communication Congress\" sont toujours intéressantes, comme vous le savez il s'agit d'un salon qui se tiendra cette année encore à Hambourg.\n \nUne des présentations attire notre regard, il s'agit de celle de PoroCYon qui s'est intéressé à la Nintendo DSi.\n \nSelon la description, la présentation expliquera comment la ROM de démarrage de la Nintendo DSi a été extraite et comment de nouveaux exploits peuvent être utilisés pour obtenir un accès plus approfondi au système, ainsi il aussi possible de réparer une console dont la puce eMMC NAND a été corrompue.\n \n \n\n \n \n \nL'évènement commence le  28 décembre 2023 à 14h45 ; la conférence durera environ une heure.\n \n \nTout est là : https://events.ccc.de/congress/2023/infos/startpage.html\n \net le programme est là : \n \nhttps://fahrplan.events.ccc.de/congress/2023/fahrplan/events/11736.html\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1428018082.png"
        }
    },
    "news_14": {
        "title": "[PS4] Textures Converter UE4 v1.0: PC vers PS4",
        "content": "Je commence les hostilités, voici un premier outil que je vous partage pour Noël, à la base je ne devais pas le partager (c'était un outil personnel)  mais après plusieurs demandes, voici une version exploitable pour tous... Il y a quelques temps je publiais un créateur de MODs pour les jeux Unreal Engine 4, mais comme précisé dans la news correspondante, vous deviez avant convertir vos textures PC au format PS4, c'est ici qu'intervient ce nouveau script.  En effet, grâce à ce petit outil, vous pourrez maintenant convertir les textures des jeux Unreal Engine 4 PC vers PS4 et ainsi les utiliser dans UE4 mod builder v1.0. Cet outil n 'est pas compatible pour TOUS les jeux Unreal Engine 4 mais fonctionne pour une grande partie, comme Dragon ball Fighter Z, Sifu ou encore Stray.  Le fonctionnement n' est pas compliqué mais il vous faudra cependant d' autres outils pour son bon fonctionnement, Umodel.exe, Uviewer.exe et upak-master.De plus il vous faudra posséder certains fichiers du SDK PS4 à placer dans le dossier tools/convert/... que je ne peux malheureusement pas vous partager qui sont: - libSceGnm.dll- libSceGpuAddress.dll- libSceTextureTool.dll- orbis-image2gnf.exe Vous devrez donc déchiffrer le mod PC avec Umodel.exe, extraire les textures au format .png ou .dds, puis utiliser mon script pour les convertir au format PS4, puis repacker le tous en .pak avec upak-master. Je ferais un tuto vidéo prochainement expliquant toute la manipulation du Mod pc vers PS4.  Tuto: - Déchiffrer votre mod PC avec Umodel.exe- Extraire les textures PC avec Umodel.exe (Export folder content)- Sauvegarder les textures PC avec Umodel.exe (Save folder packages)- Copier mon outil (dossier tools/ et .bat) dans UmodelExport- Lancer le .bat et patienter- Copier/coller les textures tous juste convertis dans le dossier Save folder packages- Reconstruire le .pak avec upak-master- Votre mod PS4 est prêt. Télécharger Textures Converter v1.0",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183911/in-ps4-textures-converter-ue4-v10-pc-vers-ps4-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1183911/in-ps4-textures-converter-ue4-v10-pc-vers-ps4-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1183911/in-ps4-textures-converter-ue4-v10-pc-vers-ps4-1.png"
        }
    },
    "news_15": {
        "title": "[Multi] Joyeux Noël à toutes et tous !",
        "content": "Les ami(e)s sunriseurs et sunriseuses il est venu le temps pour nous de vous souhaiter un excellent Noël, que ces quelques heures vous apporte tout ce que vous désirez, mais surtout que vous puissiez profiter de vos proches ou des personnes que vous aimez. \n \nAlors que les rues s'illuminent de l'éclat des décorations festives et que l'air est imprégné de l'esprit joyeux de Noël, l'industrie du jeu vidéo célèbre également la saison des fêtes avec une panoplie de surprises pour les joueurs du monde entier, l'occasion pour nous de faire un peu la fête qu'elle soit physique ou vidéoludique, virtuelle ou avec vos proches. \n \nEn ce 24 décembre 2023, nous sommes désormais à quelques heures de la plus grande fête de l'année, et cette année encore gageons qu'elle fera des heureux et des heureuses, que ce soit au travers des cadeaux, ou bien car vous profiterez de vos proches. \n \n \n\n \n \n \nAu nom de toute l'équipe, Logic-Sunrise.com vous souhaite un Joyeux Noël !\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183874/in-multi-joyeux-noel-a-toutes-et-tous-1.png"
        }
    },
    "news_16": {
        "title": "[Multi] DS4Windows 3.3.2 disponible",
        "content": "Le développeur Ryochan7 dévoile ce qui sera certainement l'une des dernières versions de DS4Windows, nous avons de la chance de pouvoir profiter de dernières versions de dernières minutes, rappelons que le développement s'arrêtera après la fin du mois. \n \nComme vous le savez probablement DS4Windows est une interface efficace pour paramétrer une manette sur PC, il est basé sur un fork de Jays2Kings. Pour en profiter cela passe par un câble micro-USB, mais il est aussi possible de s'en servir sans fils avec quelques adaptateurs Bluetooth 2.1 (ou supérieur). \n \n \n\n \n \nChangelog : \n \n- Diverses corrections pour la classe ProfileDTO afin de corriger la lecture des profils rétro\n- Correction de la zone maximale par défaut pour TouchMouseStick\n- Ajout d'un test pour vérifier la chaîne XML de sortie après la migration du profil\n- Correction des paramètres du profil hip fire time\n- Correction de certaines clés de traduction dans l'éditeur de profil\n \nTéléchargement : DS4Windows 3.3.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183872/in-multi-ds4windows-332-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[PS4/PS5] PS Multi Tools v13.4 disponible",
        "content": "SvenGDK vient de mettre à jour PS Multi Tools, notamment pour ajouter un menu contextuel à la bibliothèque de jeux PS5. \n \nAprès avoir travaillé une version Mac, il fait une nouvelle fois évoluer son outil qui comme vous le savez est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n\n \n \nChangelog PS Multi Tools :\n \n- Ajout d'un menu contextuel à la bibliothèque de jeux PS5 avec les options suivantes :\n- Copy To -> Copie le jeu sélectionné vers un lecteur ou un dossier de destination\n- Play Soundtrack -> Joue la bande son at9 incluse du jeu (si disponible)\n- Check for updates -> Vérifie la disponibilité des correctifs de jeu.\n- Le téléchargement de correctifs de jeux est désormais possible dans PS Multi Tools.\n- Les PKG peuvent être téléchargés directement ou ajoutés à une file d'attente.\n- Il est possible de télécharger plusieurs fichiers .pkg\n- Corrections de bugs mineurs\n \n \nTéléchargement : PS Multi Tools v13.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183865/in-ps4ps5-ps-multi-tools-v133-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] Un linker en phase de test sur Switch ?",
        "content": "Les pincettes pour cette news sont de sorties, sous entendu prenez cette news avec du recul, seul le temps nous dira ce qu'il en est, cependant il semblerait qu'une sorte de linker soit en train d'être développé et testé sur Nintendo Switch. \n \nOn en a vu d'autres comme cela avec récemment les RP2040, au début personne n'y croyait, et pourtant c'est arrivé, bon là c'est un peu différent dans le sens où c'est un utilisateur de Twitter qui aurait entre ses mains une sorte de linker ou de Sky3DS pour la Nintendo Switch. \n \nIl serait bêta-testeur de la solution, il s'agirait d'un linker qui prendrait en charge tous les firmwares et tous les types de consoles, ainsi que toutes les régions. Pour le moment il est difficile de se faire une opinion mais il a diffusé une vidéo. \n \n\n \n \nSi le produit venait à être finalisé, il pourrait être lancé dès le mois prochain, en Janvier 2024, bref nous serons vite fixé sur la légitimité de cette proposition. \n \n \n\n \n \n \nSi on rentre un peu dans le détail nous voyons que le linker dispose d'une micro-sd qui doit contenir les jeux, et qu'il suffit d'insérer et d'éjecter le linker pour changer de jeu. \n \nLa news et la vidéo sont en provenance de AfterTimeX.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183805/in-switch-un-linker-en-phase-de-test-sur-switch-1.png"
        }
    },
    "news_19": {
        "title": "[PS4/PS5] PS4 et PS5 Wee Tools se mettent à jour",
        "content": "Les logiciels PS4 et PS5 Wee Tools ont été mis à jour par le dévelopeur Andy_maN, le premier pour la PS4 est proposée en v0.9.9 alors que le second pour la PS5 débarque en v0.1.7.\n \n \n\n \n \nPS5 Wee Tool v0.1.7 :\n- EMC errlog reader (lecture et nettoyage des codes actuels)\n- Visualisation du journal EMC\n- Description de 614 codes\n- Correction de bugs\n \n\n \n \nPS4 Wee Tool v0.9.9 : \n- Support du firmware 11.02\n- Récupération des zones NVS\n- Informations complémentaires pour validation\n- Optimisation du langage\n- Indicateurs de résolution\n- Correction de bugs liés au récepteur-émetteur asynchrone universel (UART)\n- Mise à jour des ressources\n- Correction de bugs liés au chemin racine\n \n \nTéléchargement : \n \nhttps://ko-fi.com/s/269af2412b\n \nhttps://ko-fi.com/s/4a865eaf62\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183802/in-ps4ps5-ps4-et-ps5-wee-tools-se-mettent-a-jour-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1183802/in-ps4ps5-ps4-et-ps5-wee-tools-se-mettent-a-jour-2.png"
        }
    },
    "news_20": {
        "title": "[PS5] Un PKG pour installer un navigateur web sur PS5",
        "content": "Le développeur Mouuu vient de mettre en ligne un fichier PKG sur PlayStation 5 qui permet d'installer un navigateur web sur la dernière console de salon de Sony. \n \nComme vous le savez, Sony a fait le choix, probablement pour limiter le piratage, de n'intégrer aucun navigateur web sur sa console, mais il existe cependant des moyens d'accéder à une sorte de navigateur en détournant des pages d'aide avec des faux DNS.\n \nLe fichier PKG proposé par le développeur Mouuu permet donc d'intégrer un accès direct à ce navigateur web depuis le dashboard d'accueil, il permet ainsi d'accéder également à des raccourcis et des historiques d'URL avec barre d'adresse et tout ce qui va bien pour profiter pleinement des capacités de sa console. \n \n \n \n\n \n \n \nAttention, la procédure implique probablement de restaurer la sauvegarde, toutes les données stockées sur la console, les jeux, les applications et les sauvegardes seront donc perdues. \n \nLe développeur Master a pu tester et nous informe que cela fonctionne jusqu'au / ou sur le firmware 8.40, il faut bien entendu disposer d'une PS5 jailbreakée au niveau de son webkit. \n \n \nTéléchargement : Internet Browser PS5 PKG (35.89 MB)\n \n \n",
        "images": {}
    }
}