{
    "news_1": {
        "title": "[PS5] PSFree amélioré dans PS5-UMTX-Jailbreak",
        "content": "Le développeur idlesauce propose depuis quelques heures une mise à jour de PS5-UMTX-Jailbreak, il s'agit là de mettre à jour l'exploit webkit PSFree.\n \nAinsi dans cette version, qui se destine à la PS5, il a amélioré PSFree afin que l'exploit soit plus rapide et plus stable, le développeur idlesauce annonce qu'il y a moins de crashs avec cette version. \n \n \nTout est là : \n \nhttps://github.com/idlesauce/PS5-UMTX-Jailbreak/tree/psfree-150b\n \n \n \n\n \n \nAu chapitre des bonnes nouvelles, nous venons d'apprendre que l'actualisation d'etaHEN 1.9B sera disponible avant la fin de l'année, c'est LightningMods qui s'est engagé sur ce délai. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201578/in-ps5-psfree-ameliore-dans-ps5-umtx-jailbreak-1.png"
        }
    },
    "news_2": {
        "title": "[PS4] PS4 Fake PKG Tools 3.87 v7 mis à jour par CyB1K",
        "content": "Le développeur CyB1K a décidé de mettre à jour PS4 Fake PKG Tools 3.87 en v7, comme vous le savez il avait déjà fait l'effort il y a tout juste un an de proposé la v6.0.0, et bien voilà la v7.0.0.\n \nComme vous le savez cet outil permet de compiler des fake PKG qui pourront tourner sur votre PS4. Cette nouvelle version V7 proposée par CyB1K a corrigé un bug d'affichage.\n \n \n\n \n \nChangelog : \n \n- Correction de la vérification du firmware minimum afin que les packages ne s'affichent plus comme nécessitant la version 7.50. Il devrait s'afficher comme 5.05 !\n \n \nTéléchargement : PS4 Fake PKG Tools v3.87 v7.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201576/in-ps4-ps4-fake-pkg-tools-387-v7-mis-a-jour-par-cyb1k-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS5] PS5 Remoteplay-Get-Pin v0.1 disponible",
        "content": " \nLe développeur slowsauce vient de publier une toute première version de PS5 Remoteplay-get-pin, il s'agit là d'un outil qui permet d'obtenir le code PIN du remote play sur les consoles PS5 pour les comptes activés hors ligne.\n \nSans avoir besoin d'aucun patch, la fonction sceRemoteplayGeneratePinCode permet de générer le code PIN, et ceci même sur les consoles non jailbreakées. \n \n \n \n\n \n \n \nQuelques étapes sont nécessaires pour y parvenir : \n \n1.Activez votre compte hors ligne en utilisant offact .\n- Téléchargement : https://github.com/ps5-payload-dev/websrv/releases/\n- Vous pouvez suivre ce tutoriel de Modded Warfare pour savoir comment configurer cela : https://youtu.be/CFTIWX0JJRI?t=202\n- La description de la vidéo contient un lien vers le référentiel offact, mais vous devez télécharger offact à partir de la page des versions websrv car ce sont des versions plus récentes.\n- L'identifiant généré automatiquement peut être utilisé, vous n'avez pas besoin d'un véritable identifiant PSN.\n- Sur les firmwares très bas de gamme, l'interface websrv peut être cassée dans le navigateur de la ps5, pour le moment vous pouvez ouvrir offact en allant http://<yourps5ip>:8080/sur votre pc.\n2.Redémarrez la console si vous ne l’avez pas fait depuis que vous avez activé votre compte hors ligne.\n3.Injectez ce payload en utilisant le chargeur elf de john-tornblom sur le port 9021.\n- La broche d'appairage et l'ID codé en base64 seront affichés dans une notification et imprimés sur stdout.\n- Pour voir stdout, vous pouvez injecter comme ceci : socat -t 99999999 - TCP:<yourps5ip>:9021 < rp-get-pin.elf\n- Seul l'identifiant de compte affiché sera accepté lors de l'appairage, c'est-à-dire l'utilisateur actuellement connecté.\n- Si vous souhaitez annuler le couplage, vous pouvez renvoyer la charge utile.\n4.Connectez-vous avec chiaki ou chiaki-ng\n- L'application officielle Remote Play peut également fonctionner. Pour cela, vous devrez définir votre identifiant de compte approprié associé à votre compte PSN dans Offfact.\n \n \nTéléchargement : PS5 Remoteplay-Get-Pin v0.1\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201572/in-ps5-ps5-remoteplay-get-pin-v01-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[PS4] HB2 v1.03 disponible avec le cinquième chapitre",
        "content": " \n \nEt voilà que le développeur Lapy propose la version 1.03 de son adaptation de Hellblade II sur PS4. \n \n \n\n \n \n \nComme vous le savez désormais, il s'agit davantage d'un film interactif plutôt que le jeu original, un film découpé en plusieurs parties proposant quelques scènes en QTE pour amener une interactivité avec le \"joueur\". \n \nLa version 1.03 ajoute le chapitre 5, il faut disposer du dossier HB2 disponible ici : \n \net du PKG : pkg-zone.com/details/LAPY10025\n \nil reste possible d'attendre la version PKG complète proposée par dravszoo1. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201558/in-ps4-hb2-v103-disponible-avec-le-cinquieme-chapitre-1.png"
        }
    },
    "news_5": {
        "title": "[PS4] L'alternative à Gamebato est là",
        "content": "Gamebato, un store permettant de télécharger des jeux, vient de voir débarquer de la concurrence, une alternative à ce store vient de naitre sous le nom de Game-Changing PS4 Fake PKG Store de Super PSX.\n \n \n\n \n \n \nTout comme Gamebato, il s'agit d'un store alternatif permettant de télécharger des jeux directement sur votre PS4. \n \n \n \n\n \n \n \nCe système innovant vous permet de télécharger et d'installer des jeux, des mises à jour et des DLC directement via le navigateur de votre PS4. Pas besoin d'étapes manuelles fastidieuses ni d'outils tiers (à l'exception de l'indispensable RPI). Le processus est conçu pour maximiser la commodité et minimiser les tracas, tout en utilisant pleinement la vitesse maximale de votre connexion, c'est du moins ce qu'annonce Super PSX.\n \n \n \n\n \n \n \n \nQuelques caractéristiques : \n \nInstallation directe par navigateur :\n- Ouvrez simplement votre navigateur PS4, sélectionnez le jeu, la mise à jour ou le DLC que vous souhaitez et installez-le directement. Aucune étape ou dispositif supplémentaire n'est nécessaire.\nLarge compatibilité avec les firmwares :\n- Que votre PS4 utilise le firmware 5.05 ou 11.00, ce système prend en charge toutes les versions. Vous n'avez pas à vous soucier des problèmes de compatibilité.\nTéléchargements rapides comme l'éclair :\n- Contrairement aux méthodes traditionnelles, ce système vous garantit la meilleure vitesse possible de votre connexion Internet, ce qui réduit considérablement les temps d'attente.\nFini les problèmes de matériel :\n- Dites adieu à la configuration de routeurs haut de gamme, aux câbles et aux périphériques de stockage externes. Cette approche rationalisée élimine les complications inutiles.\n \nGamebato a rapidement évolué vers un modèle payant pour pouvoir offrir à ses membres une capacité de téléchargement optimale. Reste à voir ce que va réellement proposé ce Game-Changing PS4 Fake PKG Store. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201523/in-ps4-lalternative-a-gamebato-est-la-1.png"
        }
    },
    "news_6": {
        "title": "[Switch] ftpsrv v1.0.0 disponible",
        "content": " \nLe développeur TotalJustice propose la version 1.0.0 de ftpsrv, comme vous le savez il s'agit d'un nouveau serveur FTP ultra léger, simple et rapide, écrit en langage C pour certaines consoles Nintendo comme la Wii, 3DS, DS ou encore la Switch. \n \nDéveloppé pour apprendre le protocole FTP, et afin de proposer un serveur avec une faible utilisation de la mémoire, ftpsrv ne s'appuie sur aucune allocation dynamique, tout en gardant une grande capacité de configuration avec le fichier config.ini modifiable. Pour information, ftpsrv utilise 592 ko de mémoire.\n \nIl existe quelques protections, comme sur la Nintendo Switch où il est obligatoire de définir un nom d'utilisateur et un mot de passe sauf si l'option anonyme est activée. \n \n \n\n \n \nChangelog : \n \n- ajout de la commande OPTS, permet aux clients de prendre en charge UTF8.\n- remplacement de sscanf par snprintf / strtoull.\n- ajout du délai d'expiration de session, peut être défini dans config.ini.\n- rendre tous les sockets non bloquants. auparavant, accept et connect pouvaient bloquer.\n- suppression du code de décimale virtuelle du serveur ftp, à la place, laissez le backend vfs gérer tous les périphériques virtuels.\n- correction de l'interrogation PORT.\n- [Unistd] correction de la fermeture du socket, voir commit pour plus de détails.\n- [Nx] sysmod est 3 fois plus rapide (10 Mio en lecture, 6 Mio en écriture).\n- [Nx] option pour définir un port différent pour app/sysmod dans config.ini.\n- [Nx] ajout de la liste de sauvegarde / montage.\n- [Nx] correction des sockets sysmod à court de mémoire, provoquant un blocage.\n- [Nx] la LED clignote maintenant pendant le transfert de données.\n- [Nx] ferme le fichier journal à la sortie dans la version de l'application.\n- [Nx] ajout du montage du stockage de contenu.\n- [Nx] ajout du montage de la carte de jeu, vous permet de vider le certificat, le ticket et le ncas.\n- [Nx] ajout de la prise en charge du fichier de stockage bis.\n- [Nx] ajout du montage du disque dur, disponible uniquement dans la version de l'application.\n- [Nx] montage du romfs de l'application, s'il est lancé via le remplacement du titre (en maintenant R), vous pouvez monter le romfs du titre actuel, disponible uniquement dans la version de l'application.\n- [Nx] montage du romfs qlaunch (menu d'accueil), disponible uniquement dans la version de l'application.\n- [Nx] offre des sauvegardes sous forme de fichiers zip.\n \n \n \nTéléchargement : ftpsrv v1.0.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201517/in-switch-ftpsrv-v100-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[PS4/PS5] La prochaine version d'etaHEN se dévoile",
        "content": " \nLe développeur LightningMods nous amène quelques informations sur la prochaine version d'etaHEN, le payload qui permet de profiter de fonctions avancées comme celle de Game Dumper ou encore les Debug Settings dans Itemzflow. \n \nLe développeur nous montre le nouveau logo et la nouvelle icône d'etaHEN, et la mise à jour pourrait introduire de nouvelles fonctionnalités comme par exemple des plugins à lancement automatique, ou encore une interface de bureau inspirée de mmOS. \n \n \n \n\n \n \nBien entendu l'une des plus grandes innovations sera le support du SDK de John Tornblom afin de compiler un payload, avec une telle évolution cela permettra d'améliorer la stabilité.\n \netaHen verra aussi arriver la suppression du patch Syscore, ce qui aura pour effet d'augmenter légèrement le temps de chargement, mais là aussi au profit d'une stabilité accrue. \n\n \nLe support des firmwares 5.xx sera aussi de la partie, avec notamment le loader ELF du SDK, et là aussi le payload sera corrigé afin d'apporter un peu plus de flexibilité. Bien entendu, il faudra revoir certains plugins en relation avec le SDK, tout cela semble très prometteur. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201513/in-ps4ps5-la-prochaine-version-detahen-se-devoile-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201513/in-ps4ps5-la-prochaine-version-detahen-se-devoile-2.png"
        }
    },
    "news_8": {
        "title": "[PS3] RPCS3 désormais comptatible avec ARM64",
        "content": "L'équipe en charge du développement de l'émulateur RPCS3, le meilleur émulateur de PS3, vient de faire une grande annonce. La team vient en effet de teaser depuis plusieurs jours une annonce qui vient d'être dévoilée, il s'agit du support de l'architecture ARM64. \n \nCe support est très important pour RPCS3 puisqu'il permet désormais de lancer l'émulateur sur des possibilités beaucoup plus modernes, des appareils dotés de puces Mac (Apple Silicon) ou encore les appareils Android avec puce ARM. \n \n \n\n \n \n \nAinsi l'émulateur ne se contente plus d'être accessible uniquement sur les architectures x86-64, les appareils ARM sont donc désormais supportés et les performances sont là. \n \nAinsi les Apple M1, M2 et versions ultérieures sont accessibles auparavant seul les appareils équipés du Rosetta 2 l'étaient.\n \n \n \n\n \n \n \nLes smartphones ou tablettes équipés de puces haut de gamme comme le Snapdragon 8 Gen 2 ou Exynos 2400 sont aussi de la partie.\n \nCette fonctionnalité majeure a fait l’objet d’un travail intensif au cours des derniers mois et permet à RPCS3 de fonctionner nativement sur les appareils Linux, macOS et Windows arm64 !\n \n \nL'équipe dévoile un énorme article de lancement : rpcs3.net\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201479/in-ps3-rpcs3-desormais-comptatible-avec-arm64-1.jpg"
        }
    },
    "news_9": {
        "title": "[Switch] switch_AIO_LS_pack 5.16.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.16.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format).\nLe mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.16.0:\nPassage aux outils basés sur Libultrahand pour lancer les overlays au lieu de Libtesla qui n'est plus mis à jour depuis un moment. De fait les raccourcis pour lancer le menu des overlays devient \"ZL+ZR+croix directionnelle vers le bas\".\nSuppression des fichiers de configuration liés au menu des overlays basé sur Tesla.\nMise à jour de Sys-patch, de JKSV, de Status-monitor-overlay et de de EdiZon-Overlay vers la dernière version de ceux-ci.\nMise à jour des crédits.\nMise à jour du homebrew AIO_LS_pack_Updater en version 7.00.00 contenant les évolutions suivantes:\nNouvelle fonction permettant d'afficher le dernier changelog du pack via le homebrew en appuyant sur \"LS\" sur le menu principal ou sur \"X\" lorsque cela est proposé durant la mise à jour du pack (lancement du homebrew hors mode applet et connexion à internet requis).\nAjout d'une option dans le menu pour synchroniser l'heure de la console.\nSynchronisation de l'heure de la console avec des serveurs distants avant l'affichage du changelog.\nLa connexion à internet est vérifiée avant de lancer les fonctions la nécessitant.\n\nNote: Pour traiter les problèmes particuliers de lancement de la sysnand en firmwares 17.0.0 et supérieurs c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets. Pour cela nous avons mis en place un questionnaire de satisfaction, en plus de pouvoir reporter les problèmes sur Github ou sur le forum vous pouvez utiliser ce questionnaire pour nous donner vos opinions de façon anonyme (pour des problèmes spécifiques il vaut mieux reporter sur Github ou ouvrir un sujet sur le forum, il y aura une réponse bien plus rapide et cela permet de demander plus de détails pour identifier et peut-être résoudre le possible problème.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe et vous avez aussi un tutoriel plus détaillé sur cette page, d'ailleurs ce dernier site contient aussi pas mal de tutoriels notamment sur la Switch.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_10": {
        "title": "[PS4] Oblitération : le kernel open source PS4",
        "content": "Nous découvrons l'existence d'Obliteration, un kernel expérimental de la PS4, entièrement gratuit et open-source écrit en Rust. \n \nRust est un langage de programmation compilé multi-paradigme qui met l'accent sur la performance, la sûreté des types et la concurrence. Il assure la sécurité mémoire (en), ce qui signifie que toutes les références pointent vers une mémoire valide, sans nécessiter l'utilisation de techniques de gestion de la mémoire automatisée.\n \nPour simplifier Oblitération est un émulateur assez proche de ShadPS4, même s'il n'est pas encore à son niveau. \n \n \n \n\n \n\n \n \n \nLe projet est en cours de développement et ne peut pas encore exécuter de jeux. Ce projet a commencé comme un hard-fork de Kyty . Les développeurs ont ensuite décidé de réécrire l'ensemble du projet à partir de zéro en utilisant Kyty et Uplift comme référence.\n \n \nTéléchargement : Oblitération\n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201471/in-ps4-obliteration-le-kernel-open-source-ps4-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] Fuite de documents confidentiels et d'outils de la PS5",
        "content": "Le site Wololo.net nous informe que des dossiers confidentiels concernant la PS5 ont été leakés, c'est le développeur Zecoxao qui en parle et qui informe de l'accès à ces fichiers qui sont datés de 2020 / 2021, donc assez anciens, mais qui restent tout de même assez intéressant.\n \nCes documents semblent légitimes et provenir de SIE (Sony Interactive Entertainment), ils contiennent de nombreux PDF, des présentations PowerPoint, apportent des solutions à certains problèmes matériels, sur la manière de les prendre en charge, de les gérer ou encore des tutoriels complets permettant de résoudre de nombreuses erreurs. \n \n \n\n \n\n \n\n \n\n \n \n \nLes archives contiennent plusieurs révisions d'un outil « JIG » appelé Mapps, et qui nécessite des connexions aux serveurs de Sony pour pouvoir les exploiter.\n \nL'archive pèse un peu plus de 1 Go, et semble avoir été déposée d'abord sur un site d'hébergement russe. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201449/in-ps5-fuite-de-documents-confidentiels-et-doutils-de-la-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1201449/in-ps5-fuite-de-documents-confidentiels-et-doutils-de-la-ps5-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1201449/in-ps5-fuite-de-documents-confidentiels-et-doutils-de-la-ps5-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1201449/in-ps5-fuite-de-documents-confidentiels-et-doutils-de-la-ps5-4.png"
        }
    },
    "news_12": {
        "title": "[3DS] 3DSident v0.9.2 disponible",
        "content": "Le développeur Joel16 est de retour avec une nouvelle version 0.9.2 de 3DSident, il s'agit pour rappel d'une application 3DS qui est inspirée de PSPident et de PS2ident, et qui est destinée à afficher un grand nombre d'informations sur la console sur lequel elle est lancée.\n \n3DSident, un peu comme un CPU-Z ou un GPU-Z sur PC, le logiciel va vous permettre d'obtenir facilement des informations critiques comme le modèle, la langue, le firmware installé avec la version du Kernel, l'adresse MAC , le statut de la batterie, et le programme évolue encore plus avec l'arrivée de cette version.\n \n \n\n \n \n \nChangelog : \n \n- Correction d'une divergence avec les chiffres de contrôle lorsqu'un numéro de série contient plus de deux lettres.\n- Afficher la date de fabrication sous la catégorie Divers.\n \n \nTéléchargement : 3DSident v0.9.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201441/in-3ds-3dsident-v092-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[Multi] mGBA v0.10.4 disponible",
        "content": "Lancée en Avril 2013, il y a plus de 11 ans, mGBA est l'un des meilleurs émulateurs de Game Boy Advance, et il évolue une nouvelle fois avec de nouvelles corrections de bugs, dont l'un d'entre eux est sur le lancement de la version Wii. \n \nLa gestion audio a été améliorée, tout comme le comportement d'accès aux E/S, et cette version vient corrigée l'état des registres GPIO.\n \nLa gestion de la mémoire, les plantages liés à la synchronisation audio et d'autres bugs affectant la stabilité ont été corrigés. \n \n \n\n \n \n \n \nCorrections d'émulation :\nGB Audio : correction de la réinitialisation trop fréquente de la synchronisation de l'enveloppe audio (correctifs #3164 )\nGB I/O : correction des conditions de déclenchement IRQ d'écriture STAT (corrections #2501 )\nGBA GPIO : correction du démarrage de la lecture du gyroscope (correctifs #3141 )\nGBA I/O : correction du comportement d'accès HALTCNT (correctifs #2309 )\nE/S GBA : correction du comportement d'écriture 8 bits du registre audio (correctifs #3086 )\nSérialisation GBA : restaurer correctement l'état du registre GPIO (correctifs #3294 )\nGBA SIO : correction des écritures du bit 7 SIOCNT en mode MULTI sur les GBA secondaires (correctifs n° 3110 )\n \nAutres correctifs :\nNoyau : Correction du chargement automatique des correctifs qui divulguent le descripteur de fichier\nFR : Correction des données de sauvegarde non initialisées lors du chargement de sauvegardes temporaires sous-dimensionnées\nGB, GBA Core : correction d'une fuite de mémoire lors du rechargement des symboles de débogage\nGB Serialize : Empêcher le chargement d'états non valides où LY >= 144 dans des modes autres que 1\nAudio GBA : correction du crash si les FIFO et les minuteurs audio ne sont pas synchronisés\nGBA Audio : correction d'un crash dans le sous-échantillonnage audio en cas de rupture du timing\nGBA Core : corrige le chargement des symboles à partir des fichiers ELF si le fichier ne se termine pas par .elf\nMémoire GBA : autoriser l'accès brut à lire les adresses MMIO élevées\nQt : correction d'un crash lors de l'application de modifications aux registres d'E/S GB dans la vue E/S\nQt : correction du bit de priorité/d'activation d'arrière-plan LCDC mal mappé dans la vue E/S\nQt : correction de l'échec de l'enregistrement des états nommés lorsque les états de capture d'écran sont désactivés (correctifs #3320 )\nQt : Correction d'un crash potentiel sur Wayland avec OpenGL (correctifs #3276 )\nQt : corrige les mises à jour du programme d'installation si un numéro de version est dans le nom de fichier (correctifs #3109 )\nMise à jour : correction de la mise à jour de l'image de l'application sur les systèmes de fichiers\n \nDivers :\nQt : Rendre les coins des fenêtres carrés sous Windows 11 (correctifs #3285 )\nSwitch : Ajouter une option de filtrage bilinéaire (ferme #3111 )\nVita : Ajout de la prise en charge des points de montage imc0 et xmc0\n \n \n \nTéléchargement : mGBA 0.10.4\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201439/in-multi-mgba-v0104-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[Switch/PS4] SwitchFin 0.6.0 disponible",
        "content": " \nLe développeur dragonflylee propose une nouvelle version de Switchfin, l'interface tierce dédiée à Jellyfin à destination de la Switch, des PC et de la PS4.  Si vous ne connaissez pas Jellyfin, il s'agit d'un serveur de contenus, un serveur multimédia open source et gratuit, offrant la possibilité de naviguer et lire les flux multimédia de toutes natures :\n \n- conteneurs : mkv, mov, mp4, avi\n- codecs vidéo : H.264, H.265, VP8, VP9, AV1\n- codecs audio : Opus, FLAC, MP3, AAC, AC-3, E-AC-3, TrueHD, DTS, DTS-HD\n- sous-titres : SRT, VTT, SSA/ASS, DVDSUB\n \n \n \n\n \n \nCette version 0.6.0 apporte pas mal de nouveautés.\n \nAjout : \n- Ajout de la localisation japonaise (@yyoossk)\n- Ajout de la localisation vietnamienne (@tlover-code)\n- Support de la modification de l'url du serveur\n- Ajout du support ftp/sftp à distance\n- Ajout de l'historique de la reprise à distance\n \nCorrections :\n- Chargement de l'osd lors d'un changement d'épisode\n- Mise à jour des informations sur le serveur lors de la vérification de la connexion\n- Echec du chargement audio lorsque le proxy est activé\n- Navigation dans la vue vidéo\n- logique de mise au point du bouton de verrouillage\n \nNouveaux contributeurs :\n- yyoossk a fait sa première contribution \n \n \nTéléchargement : SwitchFin v0.6.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201435/in-switchps4-switchfin-060-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[WiiU] Cemu mis à jour en v2.5 disponible",
        "content": "Le développeur ExZap vient de mettre en ligne une nouvelle version de l'émulateur Cemu, le meilleur émulateur de la Nintendo Wii U sur PC, MacOS et Linux. \n \nAvec cette version 2.5, les options d'augmentation et de réduction d'échelle dans les paramètres graphiques fonctionnent désormais correctement sur Vulkna, ont été résolus le problème qui limitait l'utilisation des filtres bicubiques sous OpenGL, en s'appuyant notamment sur un retour silencieux au filtrage bilinéaire de Vulkan. \n \n \n\n \n \nLa prise en charge des shaders personnalisables dans les packs graphiques a été révisée, Vulkan et OpenGL poseront moins de problèmes. Les erreurs de répertoire MLC s'afficheront dans Cemu, des solutions de contournement seront proposées. \n \nEnfin la v2.5 introduit la prise en charge de la connexion des Wiimotes via L2CAP sous Linux, et MacOS indique la bonne version. \nEnfin, les langues arabe, allemand, russe et suédois ont été mise à jour. \n \n \nTéléchargement : Cemu 2.5\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201434/in-wiiu-cemu-mis-a-jour-en-v25-disponible-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS4/PS5] PS Remote Lua Loader 1.8 disponible",
        "content": "Le développeur Master-s propose la version 1.2 de PS Remote Lua Loader, il s'agit d'un outil permettant de lancer à distance la faille Lua récemment découverte, basé sur la découverte de gezine qui permet aux jeux créés avec le moteur Artemis de charger des fichiers lua arbitraires. Le loader ne dépend pas du firmware et a été testé avec succès sur PS5 Pro 10.20, ou bien même la PS4 sous firmware 12.00. \n \n \n \n\n \n \n \nActuellement, ce loader est spécifique à la liste de jeux suivante :\n \n- Raspberry Cube (CUSA16074)\n- Aibeya (CUSA17068)\n- Hamidashi Creative (CUSA27389)\n- Hamidashi Creative Demo (CUSA27390) - nécessite le dernier firmware\n- Aikagi Kimi to Issho ni Pack (CUSA16229)\n \nPS Remote Lua Loader intègre les payloads suivants : \n \n- hello_world.lua - Imprime les informations de base du processus de jeu - son identifiant de processus, la base de l'eboot, de la libc et de la libkernel.\n- sigsegv_crash_trigger.lua - Déclenche un crash SIGSEGV qui doit être géré sans faire planter le processus de jeu.\n- sigbus_crash_trigger.lua - Déclenche un crash SIGBUS qui doit être géré sans faire planter le processus de jeu.\n- notification_popup.lua - (Actuellement uniquement sur PS4) Déclenche une fenêtre contextuelle de notification avec « Hello World » sur la PlayStation.\n \n \nEdit 10.12.24 :\n \nTéléchargement : PS Remote Lua Loader v1.8\n \n \n \n \n",
        "images": {}
    },
    "news_17": {
        "title": "[Switch] Sys-patch Sysmodule 1.5.5 disponible",
        "content": "Le développeur impreeza a repris le travail initié par ITotalJustice , suivi de Mrdude et josete2k, sur le sysmodule Sys-Patch et en propose une mise à jour depuis quelques jours. \n \nsys-patch est un sysmodule qui va s'exécuter au démarrage de votre Switch et il va corriger automatiquement à la fois le FS et l'ES du firmware, ainsi que le laoder d'Atmosphere pour donner essentiellement le même effet que ce que font les patchs signature, sans avoir besoin de s'appuyer sur la présence des patchs sur la carte SD, il faut donc l'utiliser avec prudence !\n \n\n \n\n \n \nIl est complet avec l'historique complet de GIT et les sous-modules. Il existe même une branche appelée \"HabilitarForwarders\" qui introduit un nouveau patch permettant d'exécuter les anciens Forwarders sur Atmosphère 1.8.0 ou supérieur.\n \nCette version a un nouveau code très optimisé, certains ensembles de modèles ont été combinés et un nouvel ensemble de noms plus cohérents a été ajouté.\n \nDe plus, de nouveaux patchs ont été créés, par exemple un permet d'éviter le crash de l'écran bleu introduit sur le firmware 17 lorsque l'utilisateur a son Prodinfor masqué, via incognito / Atmosphère Blanker / Hekate cal0 Blanker. \n \n \nChangelog 1.5.5 : \n \n- Fusion de la demande d'extraction n°9 de borntohonk/master\n- Contient un correctif de condition BL, un changement sur la mémoire tampon, les patchs ca_verification et un changement de workflow\n- Combinaison de certains PR et ajout des patchs SSL.\n \n \nTout est là : Sys-patch version 1.5.5\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201417/in-switch-sys-patch-sysmodule-155-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1201417/in-switch-sys-patch-sysmodule-155-disponible-2.jpg"
        }
    },
    "news_18": {
        "title": "[PS4] Le Factory Service et le firmware 4.07 exploitable",
        "content": "On en apprend tous les jours, le développeur Zecoxao a reçu une console PlayStation 4 de la part de LightningMods, qui la lui a vendu, et nous venons d'apprendre que cette console tourne sous le firmware 4.07. \n \nJusqu' à là rien de surprenant, mais lorsque Zecoxao l'a allumé il s'est aperçu que cette console était un peu spéciale, à savoir qu'elle démarre sur le Factory Service Mode (FSM), un état de fonctionnement assez spécial qui est généralement utilisé pour réaliser des tests de diagnostics. \n \nLe mode FSM n'est pas le mode de fonctionnement commercial (retail) de la console, il permet un accès approfondi aux fonctions du système, mais pour pouvoir l'utiliser à ses pleines capacités, il faut installer quelques fichiers spécifiques. \n \n \n\n \n \nLes fichiers seuls ne suffisent pas, il faut en plus disposer d'un client-serveur, Zecoxao se rapprochant de LightningMods, nous apprenons donc qu'un exploit spécifique existe ici. \n \nLightningMods a partagé avec Zecoxao des fichiers permettant de backporter l'exploit du firmware 5.05 vers le 4.07, et ainsi profiter du hack sur le firmware 4.07 sans devoir monter sur le 5.05.\n \nIl a informé Zecoxao que cette console a permis de réaliser des dumps de kernels, de certains modules, et aussi de lancer les payloads dans le mode FSM, un mode jusqu'alors inconnu pour le hack PS4. \n \nIl semblerait que cela fonctionne aussi en 4.06, mais peut être aussi sur d'autres firmwares, cela ouvre aussi la porte à certaines consoles qui ne pourraient plus être mise à jour à cause de leur lecteur bluray HS ou manquant. \n \nTout est là : Exploit PS4 5.05 backporté pour le 4.07 en mode FSM\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201413/in-ps4-le-factory-service-et-le-firmware-407-exploitable-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS5] Save Mounter v1.3.1 R2 pour PS5 de idlesauce disponible",
        "content": " \nLe développeur idlesauce vient de mettre en ligne la R2 de la version 1.3.1 de Save Mounter, il s'agit de la deuxième version de Save Mounter taillée pour la PS5 alors que jusqu'à présent cet utilitaire était réservé aux utilisateurs de la PS4. \n \n \n\n \n \nMais avant de rentrer dans le détail, rappelons ce qu'est Save Mounter, il s'agit d'un outil proposé à l'origine par ChendoChap, un utilitaire d'édition est un assistant d'enregistrement. Vous pouvez créer, modifier, déchiffrer des sauvegardes de votre PlayStation, exactement comme un éditeur, pour par exemple pour gagner plus d'argent, des munitions ou augmenter les statistiques de vos personnages. \n \n \nAvec ce soft vous pouvez :\n \n- Faites des copies décryptées de vos sauvegardes\n- Remplacer les sauvegardes par des sauvegardes modifiées\n- Remplacer les fichiers de sauvegarde par les fichiers de sauvegarde de quelqu'un d'autre (partager les sauvegardes)\n- Créer de nouvelles sauvegardes\n- A noter qu'il n'est pas possible de remplacer les fichiers de sauvegarde par une sauvegarde cryptée, ni d'utiliser une console qui ne dispose pas d'un exploit\n \n \n \n\n \n \n \n \n \nChangelog :\n \n- Ajout du support du firmware 5.50 (a les mêmes offsets que le firmware 5.10)\n- Ajout du support du firmware 4.50 (a les mêmes offsets que le firmware 4.03)\n \n \n \nTéléchargement : Save Mounter v1.3.1 R2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201391/in-ps5-save-mounter-v131-r2-pour-ps5-de-idlesauce-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS4/PS5] Call of Duty Black Ops 6 proposé par CyB1k",
        "content": "Le développeur CyB1k montre une nouvelle fois qu'il est l'un des meilleurs de la scène PlayStation 4, il vient en effet de mettre en ligne la première release de Call of Duty Black Ops 6 pour la PS4. \n \nCe sont deux versions qui sont proposées, la version US CUSA23827 et la version EU CUSA34029, et il faut avouer que les modifications qu'il a du effectuer pour y parvenir sont nombreuses et cela a été très difficile.\n \n\n \n \n \nQuelques 327 patchs ont été nécessaires, et il vous faudra un peu de place sur le disque dur si vous souhaitez installer tous les jeux, quelques 350 Go, \"seulement\" 86 Go pour juste Call of Duty Black Ops 6. \n \n \n\n \n \nIl vous faudra installer tous les DLC, et le titre a été patché tout comme les précédents jeux, pour les firmwares 5.05 / 6.72 / 7.02 / 7.55 / 9.00 et 11.00. \n \n \n \n\n \n \n \n \nCall of Duty : Black Ops 6 est sorti le vendredi 25 octobre sur Xbox One, Xbox Series X|S, PlayStation 4, PlayStation 5 et PC, avec un budget marketing estimé entre 150 à 200 millions de $.\n \nComme toujours, merci de ne pas mettre de lien de téléchargement dans les commentaires. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1201389/in-ps4ps5-call-of-duty-black-ops-6-propose-par-cyb1k-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1201389/in-ps4ps5-call-of-duty-black-ops-6-propose-par-cyb1k-2.jpg"
        }
    }
}