{
    "news_1": {
        "title": "[PS4] Remote Jar Loader v1.2 disponible avec Lapse 1.1",
        "content": "Le développeur Gezine propose la version 1.1 de Remote Jar Laoder, il s'agit en fait d'une mise à jour de l'exploit BD-JB-1250 qui intègre désormais la version 1.0 de Lapse, le Kexploit utilisé sur PS4 pour les firmwares compris entre le 9.00 et 12.02. \n \nLe taux de réussite de 90%, la rapidité et la stabilité font de cette implémentation l'une des meilleures permettant de profiter de charger les payloads, et notamment GoldHEN sur une clé USB. \n \n \n \n\n \n \n \nPour ce faire, il suffit de graver le fichier Lapse.iso sur un disque Blu-ray et d'insérer le payload, par exemple GoldHEN, sur une clé USB, en la renommant en payload.bin.\n \n \n \nTéléchargement : Remote Jar Loader 1.1 + Lapse 1.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209468/in-ps4-remote-jar-loader-v11-disponible-avec-lapse-10-1.png"
        }
    },
    "news_2": {
        "title": "[Switch] switch_AIO_LS_pack 5.20.1 disponible (MAJ)",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.20.1.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format).\nLe mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.20.0:\nDernier firmware compatible mis à jour en version 20.3.0.\nMise à jour d'Atmosphere, de Ultrahand-overlay et de Status-Monitor-Overlay vers la dernière version de ceux-ci.\nAjout d'un package switch_AIO_LS_pack_Utilities pour Ultrahand-Overlay permettant d'effectuer certaines configurations ou actions (réglage de la détection du port cartouche, activation/désactivation des redirections vers le Homebrew Menu, activation/désactivation de l'auto-boot de Hekate et redémarrages divers).\nMise à jour du homebrew AIO_LS_pack_Updater en version 7.04.02 apportant les changements suivants:\nLa vérification des sha256 pour le téléchargement du homebrew, du pack ou du fichier zip complémentaire au pack sont maintenant insensibles à la casse. Notez que si vous avez fait la mise à jour du pack entre la version 5.19.3B et 5.19.6B inclus et/ou que vous avez le homebrew en version 7.04.00 ou 7.04.01 vous devrez réinstaller la dernière version du homebrew manuellement à cause de bugs qui se sont produits durant les mises à jour et qui ont provoqué des erreurs lors de la vérification des sha256.\nCorrection de bugs lors d'un échec de vérification du sha256 lors du téléchargement d'une mise à jour du homebrew, le traitement ne s'arrêtait pas malgré l'erreur.\n\n- Changelog pour la version 5.20.1:\nMise à jour de AIO_LS_pack_utilities en version 1.0.1, corrige une erreur sur le patch pour activer/désactiver le port cartouche, celui-ci était inversé et activait lorsqu'on désactivait et inversement.\nMise à jour de Status-Monitor-Overlay vers la dernière version de celui-ci.\nNote: Pour traiter les problèmes particuliers de lancement de la sysnand en firmwares 17.0.0 et supérieurs c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.\nNote 2: Les problèmes de chauffe et de consommation excessive de la batterie qui peuvent se produire sur une minorité de consoles sur les firmwares 19.0.0 et supérieurs ne sont pas du fait du pack, cela semble venir du firmware mais on arrive pas à savoir vraiment de quoi et se qu'il faut faire pour corriger le problème.\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets. Pour cela nous avons mis en place un questionnaire de satisfaction, en plus de pouvoir reporter les problèmes sur Github ou sur le forum vous pouvez utiliser ce questionnaire pour nous donner vos opinions de façon anonyme (pour des problèmes spécifiques il vaut mieux reporter sur Github ou ouvrir un sujet sur le forum, il y aura une réponse bien plus rapide et cela permet de demander plus de détails pour identifier et peut-être résoudre le possible problème.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe et vous avez aussi un tutoriel plus détaillé sur cette page, d'ailleurs ce dernier site contient aussi pas mal de tutoriels notamment sur la Switch. Enfin si vous souhaitez voir le changelog complet du pack il est consultable ici pour la version stable et ici pour la version beta.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_3": {
        "title": "[PS4] Lapse Kexploit serait opérationnel avec BD-JB de Gezine",
        "content": "Le développeur Gezine a dévoilé un screen qui montrerait qu'il aurait réussi à lancer de manière opérationnelle Lapse via un keploit, en le couplant avec son exploit BD-JB. \n \nIl disposerait donc d'un exploit complet entre son exploit BD-JB avec une utilisation conjointe de Lapse. \n \nBien entendu Lapse n'était compatible que jusqu'au firmware 12.02, cela ne fonctionnerait que jusque là, mais ce serait déjà exceptionnel. \n \n \n \n\n \n \n \nIl doit retravailler le bin loader, et aussi peut être proposé un HEN pour dévoiler son travail, c'est du moins ce qu'il a répondu à Zecoxao. \n \n \nTout est là : gezine_dev\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209372/in-ps5-lapse-kexploit-serait-operationnel-avec-bd-jb-de-gezine-1.png"
        }
    },
    "news_4": {
        "title": "[XB360] Xenia Manager v3.1.0 disponible",
        "content": "Une nouvelle mise à jour a été publiée pour Xenia Manager, le frontend conçu pour simplifier et améliorer l'utilisation de l' émulateur Xenia, dédié à la console  Xbox 360 est disponible en version 3.1.0. \n \nCette nouvelle version introduit le support de l'espagnol, avec la contribution d'ElTioRata, et implémente une gestion complète des profils, qui peuvent désormais être décryptés et cryptés directement depuis l'application, avec la possibilité de changer le Gamertag sans aucune étape externe.\n \n \n \n\n \n\n \n \n \nDe nouvelles fonctions de visionneuses de réussites au jeu ont été introduites, cette visionneuse affiche toutes les réussites déverrouillées et verrouillées, avec des descriptions visibles lorsque vous passez la souris dessus, et inclut également une fonction cachée pour les déverrouiller manuellement.\n \n \nTéléchargement : Xenia Manager v3.1.0\n \n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209359/in-xb360-xenia-manager-v310-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1209359/in-xb360-xenia-manager-v310-disponible-2.png"
        }
    },
    "news_5": {
        "title": "[PS5] PS5 Shop Appkg disponible",
        "content": " \nLe développeur m0ur0ne propose son Shop pour la PS5 sous le nom de \" PS5 Shop Appkg \".\n \n \n\n \n\n \n\n \n \nCe shop PS5 permet de télécharger facilement des jeux depuis votre navigateur PS5, et d'installer facilement de nombreuses applications. D'ailleurs récemment de nouvelles fonctionnalités ont été rajoutées tandis que d'autres seront rajoutées à son retour de vacances. \n \n \n \n\n \n \n \n \n \nURL : https://ps5shopappkg.pages.dev \n \nPKG : https://github.com/ps5xploit/ps5shopappkg/releases/download/ps5shopappkg/PS5-SHOP-APPKG.pkg\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209353/in-ps5-ps5-shop-appkg-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1209353/in-ps5-ps5-shop-appkg-disponible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1209353/in-ps5-ps5-shop-appkg-disponible-3.png"
        }
    },
    "news_6": {
        "title": "[Multi] TheFlow dévoile une chaîne ROP pour exploiter Retbleed",
        "content": " \nLes développeurs Matteo Rizzo et Andy Nguyen viennent de dévoiler un nouvel article sur le blog Bug Hunter de Google. Leur chaîne ROP permet d'utiliser l'exploit Retbleed découvert en 2022 qui est basée sur une vulnérabilité affectant notamment les AMD Zen et Zen 2, les architectures CPU utilisées dans les PS4, PS5 et Xbox One et series S et X. \n \n \n\n \n \n \nLes détails proposées ici se basent sur PC, pas directement sur les consoles, Retbleed nécessitant un environnement réaliste et sécurisé pour être exploité. Retbleed est une vulnérabilité CPU découverte en 2022 par des chercheurs de l'ETH Zurich et affectant les processeurs modernes. \n \n \n \n \n \n\n \n \n \n \n\n \n \n \n\" En résumé, nous avons démontré avec succès un accès arbitraire en lecture à la mémoire physique depuis un processus sandboxé et non privilégié, et depuis une machine virtuelle. Notre exploit s'appuie sur la version publique originale de Retbleed, améliorant ainsi la fiabilité, la vitesse et la compatibilité dans les environnements restrictifs.\n \nRetbleed implique une exécution spéculative : les processeurs prédisent et exécutent des instructions avant de confirmer la validité de la prédiction, ce qui entraîne une fuite de données depuis une adresse sélectionnée par l'attaquant. Les attaquants entraînent des prédicteurs de branche pour contrôler le code exécuté par le processeur de manière spéculative et utilisent des canaux de cache cachés pour extraire les données divulguées. Retbleed cible les instructions de retour et permet aux attaquants de lire toutes les données de la mémoire physique de l'hôte.\n \nLa stratégie d'exploitation consiste à pirater les KASLR virtuels et physiques à l'aide de canaux auxiliaires microarchitecturaux et à créer des dispositifs de divulgation idéaux grâce à la programmation orientée retour (ROP) spéculative. Nous avons obtenu une fuite de données à environ 13 Ko/s avec une grande précision. Cela suffit pour répertorier les processus et les machines virtuelles en cours d'exécution sur la machine hôte et en extraire des données sensibles de manière ciblée (par exemple, des clés cryptographiques). L'exploitation fonctionne également depuis l'intérieur des machines virtuelles, permettant ainsi la fuite de données de la machine hôte. Les mesures d'atténuation sont coûteuses et impactent considérablement les performances. \"\n \n \n\n \n \n \nSon travail de compilation et d'explication se trouve ici : Exploiting-retbleed-in-the-real-world\n \nWikipedia : Retbleed\n \nKaspersky.fr : Retbleed-vulnerability\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209339/in-multi-theflow-devoile-une-chaine-rop-pour-exploiter-retbleed-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1209339/in-multi-theflow-devoile-une-chaine-rop-pour-exploiter-retbleed-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1209339/in-multi-theflow-devoile-une-chaine-rop-pour-exploiter-retbleed-2.png"
        }
    },
    "news_7": {
        "title": "[Switch] Un rapport Hackerone dévoilé chez Nintendo",
        "content": " \nLe chercheur en sécurité Yannik Marchand (kinnay), spécialisé dans le retro engineering de code Nintendo, a publié un rapport HackerOne le 06 Juin 2025, ce rapport vient d'être dévoilé 2 mois après et il concerne Nintendo. Le développeur dispose d'un site ici pour découvrir ses travaux : https://reversing.live/\n \nAprès quelques échanges avec Nintendo, c'est donc le 15 Juillet 2025 que son bug a été résolu. Il s'agissait d'une \"erreur logique dans le sys-module qui permet de fournir un certificat de serveur falsifié aux applications\". \n \n \n\n \n \nUne faille logique dans le sslmodule système permettait de fournir un faux certificat de serveur aux applications. Un attaquant pouvait ainsi lire et/ou modifier le trafic entre la console et un serveur, ce qui pouvait divulguer des informations confidentielles et ouvrir de nouveaux vecteurs d'attaque au système. Toutes les applications utilisant cette fonction nn::ssl::Context::ImportServerPki ont été affectées.\n \nComme vous pouvez vous en doutez, cette ImportServerPki se trouve sur Switch, il s'agit d'un tampon qui permet d'importer un maximum de 71 objets (Les certificats peuvent être des CA ou des certificats de serveur (pas de clés publiques)). \n \nDe ce que l'on comprend, c'est que Nintendo a corrigé ce bug dans une mise à jour firmware. \n \nLe rapport est là : hackerone.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209338/in-switch-un-rapport-hackerone-devoile-chez-nintendo-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS4] PlaySon 3.7.27 Beta mis à jour",
        "content": "Le développeur Sondio propose la miseà jour de la version 3.7.27 de PlaySon, une application Android distribuée sous format APK afin de lancer le hack facilement sur PlayStation 4 sous tous les firmwares exploitables de la console.\n \nDans cette version, le développeur a intégré les dernières évolutions : \n \n- Ajout de GoldHEN 2.4b18.5\n- Ajout du stage2.bin v1.05 de SiSTRo (FW 7.00-11.00)\n- Ajout de PS4Debug 1.1.19\n \n \nQuand le développeur fait référence au stage2.bin 1.05 de SisTRo, il faut entendre : FW 7.00 7.01 7.02 7.50 7.51 7.55 8.00 8.01 8.03 8.50 8.52 9.00 9.03 9.50 9.51 9.60 10.00 10.01 10.50 10.70 10.71 11.00 .\n \n \n \n \n \n\n \n \n \n \nDeux type d'accès sont accessibles selon que l'appareil Android soit rooté ou pas, car sans accès root seul psfree est utilisable. \n \n \nPrise en charge d'Android à partir de l'API 19, avec/sans accès root :\n- Serveur local\n- Expéditeur de la charge utile\n- Installer/mettre à jour les Pkg/Cheats/Patches\n- Affichage des paquets\n- Prise en charge du thème/Dlc/App/jeu pour l'installation/désinstallation/vérification\n- Modifier/sauvegarder/restaurer le nom/avatar du profil de l'utilisateur PS4\n- (avec root) Créer/Formater une clé USB avec goldhen.bin ou exfathax_pico.img\n- Activer/désactiver les patchs GoldHEN\n- Visionneuse de klog de GoldHEN\n- Supporte la dernière version de GoldHEN 2.4b18\n- Support de deux types de JB : \navec accès Root et adaptateur OTG-LAN -> exploit PPPwn et bloqueur DNS avec les derniers stage1 et stage2 (1.05 de SISTR0) \n \nsans accès Root -> psfree uniquement (pour l'instant) :\nFW 7.00 au 9.60\n \n \nTéléchargement : PlaySon 3.7.27 Beta (version du 05/08/2025)\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209337/in-ps4-playson-3727-beta-mis-a-jour-1.png"
        }
    },
    "news_9": {
        "title": "[Switch] ldn_mitm supporte désormais le firmware 20.3.0",
        "content": " \nLe développeur MasonT8198, qui a repris le flambeau de spacemeowx2 sur ldn_mitm propose une nouvelle version de cet utilitaire destiné aux Switchs exploitables de première génération. Le module ldn_mitm, si votre console est bannie ou que vous souhaitez tout simplement vous protéger d'un éventuel ban, vous permet de prendre en charge presque tous les jeux supportant le réseau sans fil local. Ce fichier KIP, nommé Ldn_mitm, vient en complément de switch-lan-play. \n \n \n \n \n\n \n \n \n \nChangelog : \n \n- Support du firmware 20.3.0\n- Ajour de la prise en charge d'Atmosphere 1.9.3\n- Sous-module : déplacement dans Atmosphere-libs de af10bca à bc7a0fc\n \n \nTéléchargement : ldn_mitm 1.20.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209336/in-switch-ldn-mitm-supporte-desormais-le-firmware-2030-1.png"
        }
    },
    "news_10": {
        "title": "[PS5] PS5_EZ_Host_v1.0.2 disponible",
        "content": "Le développeur stuey81 propose une nouvelle version de son outil pour ceux qui disposent d'une PS5 sensible, il dévoile en effet PS5_EZ_Host dans sa version 1.0.2. A noter que si vous utilisez un firmware version 5.50 ou antérieure, optez pour cet hôte ESP; il est basé sur UMTX2, dispose des derniers payloads et d'un gestionnaire de fichiers d'administration fonctionnel ! Vous pouvez désormais supprimer n'importe quel payload (y compris celles pré-flashées) ou en ajouter de nouveaux.\n \n \n\n \n \nCette version 1.02 fait preuve de nombreuses évolutions, notamment certaines parties du code qui ont été réécrites. \n \nChangelog 1.0.2 : \n \n- Le gestionnaire de fichiers a maintenant été entièrement réécrit,\n- Lecture/écriture/suppression SPIFFS complète : supprimez, téléchargez et téléchargez n'importe quelle charge utile, y compris les fichiers préchargés.\n- Transfert de payload PC ↔ ESP — téléchargement du PC vers l'ESP et téléchargement de l'ESP vers le PC.\n- Téléchargements — de nouveaux fichiers apparaissent dans le gestionnaire de fichiers après une actualisation de la page une fois le téléchargement terminé.\n- AppCache désactivé — chargements plus rapides et aucune erreur manifeste, tout en autorisant la mise en cache des messages du site lorsque des mises à jour sont détectées.\n \n \nTéléchargement : PS5_EZ_Host_v1.0.2\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209335/in-ps5-ps5-ez-host-v102-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[Xbox 360] BadBuilder v0.31 disponible",
        "content": " \nLe développeur Pdawg-bytes propose une mise à jour de son outil BadBuilder qui est maintenant updaté en v0.31. BadBuilder qui va permettre de simplifier la création d'une clé USB compatible avec l'exploit BadUpdate, ainsi vous pourrez exécuter du code non signé et des applications homebrews sur votre Xbox 360 si vous disposez de tout ce qu'exige BadUpdate.\n \nBadBuilder va formater la clé USB, il va créer les dossiers, télécharger les fichiers nécessaires, ou les mettre à jour, enfin l'outil permet de spécifier manuellement les chemins de fichiers dynamiquement. \n \n \n\n \n \nIl s'agit d'une version mineure, toutes les fonctionnalités de la version précédente sont conservées : si vous rencontrez des problèmes, veuillez les signaler en créant un nouveau ticket. Le programme est fourni sous forme de build à fichier unique, mais assurez-vous que .NET 8.0 Desktop Runtime est installé avant de l'exécuter.\n \n \nChangelog : \n \n- Liens mis à jour vers des ressources externes \n- Correction des erreurs de téléchargement\n \n \nTéléchargement : BadBuilder v0.31\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209283/in-xbox-360-badbuilder-v031-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[PS3] PS3Xploit Donations pour 2025 à 2028",
        "content": "Le développeur esc0rtd3w vient hier de faire un appel aux dons pour maintenir le support de l'ensemble des sites liés ou proches de tous les exploits utilisés pour PS3Xploit, de nombreux développeurs très connus de la scène comme zecoxao, MrMario2011, Aldostools et bien d'autres se font le relai de cette information ou demande à toute personne qui pourrait donner même quelques euros, de le faire. \n \n \n \n\n \n \n \nLe message de esc0rtd3w\n \nIl est temps de demander de l'aide à la communauté. Tous les sites PS3Xploit (ps3xploit.me, ps3toolset.com etc...) seront hors ligne dans moins d'une semaine, à moins que nous puissions obtenir les fonds pour le prolonger. Il nous manque actuellement plusieurs centaines de dollars pour renouveler l'hébergement, le SSL, les domaines, etc. Bien que nous ayons reçu des dons, ils ne couvrent qu'une partie des dépenses totales. La durée du renouvellement est de 3 ans.\n \nVous pouvez faire un don via un paiement Paypal à team@ps3toolset.com\n \nVous pouvez également utiliser https//paypal.me/nopsn\n \nOu les crypto vers des liens proposés en ETH via ERC20, ou encore en BTC via BECH32 BTC via P2PKH. \n \nMerci à tous ceux qui ont fait un don dans le passé et ont aidé à maintenir le projet en vie. Si les sites sont hors ligne, les domaines devraient au moins rester, mais il faudrait déplacer l'hébergement vers un hébergement temporaire, ce qui est une énorme perte de temps. \n \n \nSite officiel : https://ps3xploit.me/\n \nMessage de esc0rtd3w : https://www.psx-place.com/threads/ps3xploit-donations-for-2025-2028.48183/\n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209262/in-ps3-ps3xploit-donations-pour-2025-a-2028-1.png"
        }
    },
    "news_13": {
        "title": "[PS4] John Tornblom retravaille sur PS4 avec PS4 Elf Loader et ps4-payload-sdk",
        "content": "Deux propositions du développeur John Tornblom viennent d'être effectuées à destination des possesseurs de PS4, d'un côté la mise à jour du Elf Loader et de l'autre la mise à jour du SDK PS4. \n \nSa proposition consiste à offrir un ELF loader pour PS4 qui a été jailbreakée à l'aide de remote_lua_loader. Il prend en charge la liaison dynamique avec les fichiers SPRX et la résolution automatique des symboles lors de l'exécution. Les payloads sont exécutés dans des processus distincts.\n \n \nTéléchargement : elfldr\n \n \n \n\n \n \n \nLa seconde offre de John Tornblom est l'arrivée du nouveau SDK PS4 disponible en v0.1, là aussi il permet de télécharger un exemple dans lequel il a modifié le code VSCode et cela permet le débogage à distance de hello_cmake.\n \nRécemment il avait confirmé que ce SDK supportait le firmware 5.05, ce qui est plutôt une bonne nouvelle sachant qu'il restera le golden firmware sur PS4. \n \nOn le voit les évolutions récentes sur PS4, que ce soit l'arrivée de Lapse, ou encore de nouveaux points d'entrée comme le Blu-ray relance un peu l'intérêt de la PS4 aux yeux des développeurs. \n \n \nTéléchargement : ps4-payload-sdk v0.1\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209261/in-ps4-john-tornblom-retravaille-sur-ps4-avec-ps4-elf-loader-et-ps4-payload-sdk-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] SaltyNX 1.4.5 disponible",
        "content": " \nLe développeur Masagrator reprend son travail sur la Nintendo Switch, et propose une nouvelle version de SaltyNX à l'origine proposée par shinyquagsire23.\n \nLancé il y a un peu moins de 5 ans, le plugin SaltyNX facilite la gestion du processus qui nous permet d'envoyer des commandes en arrière-plan pour éditer des fichiers et du code sous Nintendo Switch. \n \nAvec cette version 1.4.4, le programme a connu de nombreuses évolutions ces derniers jours, il faut dire que les versions se sont largement enchaînées, ce sont pas moins de 4 versions qui ont été proposées. \n \n \n\n \n \n \n \nSaltyNX 1.4.0 :\n- Lire séparément les cibles FPS pour les appareils ancrés et portables à partir de la sauvegarde FPSLocker (nécessite FPSLocker 2.3.0+)\n- Ajout de la version SaltyNX aux journaux de sysmodule et de Cores\n- Correction d'un problème avec le module système qui n'injectait plus Core dans les jeux suivants si l'initialisation de Core échouait, ce qui entraînait un crash du jeu avant que Core n'ait eu la possibilité de fermer la connexion\n- Amélioration des rapports de statistiques PFPS de NX-FPS\n- Lecture des paramètres d'overclocking séparés pour 720p (nécessite FPSLocker 2.3.0+)\n- Désormais, la vitesse de lecture du jeu dans Core est désactivée au lieu d'être activée (pour obtenir la vitesse de lecture du jeu, utilisez Status Monitor Overlay 1.2.0+)\n- Correction de certains correctifs FPSLocker ne fonctionnant pas avec les jeux 32 bits\n \nSaltyNX 1.4.1\n- Activaction des instructions à virgule flottante matérielles dans Core32 pour de meilleures performances dans les jeux 32 bits, mais utilisez toujours les conventions d'appel à virgule flottante logicielle pour des raisons de compatibilité.\n \nSaltyNX 1.4.1a\n- Correction d'un problème où l'ordinateur de poche conservera le taux de rafraîchissement attendu du mode ancré si le mode portable n'a pas de cible FPS définie dans FPSLocker alors qu'il est en mode dock\n \nSaltyNX 1.4.2\n- Correction d'un problème avec Red Dead Redemption qui ne détectait pas correctement s'il était en mode ancré ou portable pour une utilisation interne NX-FPS, provoquant des problèmes de verrouillage FPS en mode ancré\n- Optimisation des résolutions de dumps\n \nSaltyNX 1.4.3\n- Ajout d'une option pour toujours forcer 60 Hz dans le menu ACCUEIL lorsque la synchronisation d'affichage est activée (nécessite FPSLocker 2.3.1+)\n- Ajout de la prise en charge du remplacement de la résolution d'affichage par défaut (nécessite ReverseNX-RT 2.3.0+)\n- Correction d'un problème pour les modèles V1 et V2 qui, en mode ancré, signalaient 0 Hz si l'utilisateur n'utilisait pas la synchronisation d'affichage\n- Correction du problème ReverseNX-RT qui ne fonctionne pas dans CelDamage HD\n- Mise à jour Shadow 05.08.2025 07:16 GMT : Correction d'un problème où la désactivation du contrôle du système dans ReverseNX-RT ne mettait pas à jour le DDR personnalisé dans le jeu.\n \nSaltyNX 1.4.4  \n- Correction d'un problème où GetDefaultDisplayResolution pouvait renvoyer 0x0 dans certains cas, entraînant un plantage du jeu.\n \n \nEdit 07.08.2025\n \nTéléchargement : SaltyNX 1.4.5\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209249/in-switch-saltynx-144-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS5] PS5_EZ_Host v1.0.1 disponible",
        "content": "Le développeur stuey81 propose un nouvel outil pour ceux qui disposent d'une PS5 sensible, il dévoile en effet PS5_EZ_Host dans sa version 1.0.1.\n \n \n \n\n \n \n \nPS5_EZ_Host est une plateforme de jailbreak autonome et simple d'utilisation pour les firmwares 1.xx à 5.xx sur PS5, basée sur l'exploit webkit UMTX2 et optimisée pour les cartes ESP32-S3 (16 Mo de mémoire flash). Il s'agit de la seule offre hôte connue proposant :\n \n- Une interface utilisateur d'exploit en deux étapes (lancement → payloads)\n- Gestionnaire de fichiers intégré (/admin.html) pour le remplacement à chaud des payloads .bin / .elf\n- Hébergement basé sur SPIFFS — aucune carte SD nécessaire\n- Prise en charge des payloads compatibles Gzip\n- Flashage automatique via auto_flash.exe (aucun Arduino ou Python requis)\n- Compatible avec toute carte ESP32-S3 de 16 Mo utilisant CP210x USB\n \n \n \nMode d'emploi :\n \n1. Flash firmware + SPIFFS à l'aide de Auto_Flash.exe ou esptool\n2. Connectez-vous au point d'accès Wi-Fi : PS5_EZ_HOST\n3. Ouvrez : http://10.1.1.1 sur le navigateur PS5\n4. Utilisez /admin.html pour gérer les payloads\n \n \n \nTéléchargement : PS5_EZ_Host v1.0.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209241/in-ps5-ps5-ez-host-v101-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[Wii] Un mod Super Mario Galaxy 2 qui vaut le détour",
        "content": "Le développeur SPG64 vient de sortir son mod appelé Super Mario Galaxy 63, il s'agit d'un mod pour Super Mario Galaxy 2 sur Nintendo Wii, mais qui vaut largement le coup d'oeil. \n \n \n \n\n \n \n \n \nSuper Mario Galaxy 63 est un mod est en développement depuis 2020. Cela représente environ 5 années entières passées à élaborer soigneusement cette lettre d'amour non seulement au jeu flash Super Mario 63 original de 2009, mais aussi à la communauté Super Mario Galaxy.\n \n \n \n\n \n \n \n \nCe projet est mené par Alex SMG avec l'aide de nombreux talents de la communauté de modding Super Mario Galaxy. Il s'agit d'une réinvention 3D de Super Mario 63. Il comprend un Hubworld personnalisé, plus de 30 galaxies à explorer, 60  Shine Sprites et 120 pièces étoiles à trouver !\n \n \nTéléchargement : Super Mario Galaxy 63\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209221/in-wii-un-mod-super-mario-galaxy-2-qui-vaut-le-detour-1.jpg"
        }
    },
    "news_17": {
        "title": "[XB360] L'exploit Xbox360BadUpdate mis à jour",
        "content": " \nLe développeur kmx360 propose une mise à jour de l'exploit Xbox360BadUpdate proposé à l'origine par grimdoomer, le développeur kmx360 forke donc la solution originale en proposant une amélioration de la vitesse et du taux de réussite du stage 3, de façon importante. \n \nComme vous le savez Bad Update est un programme d'exploitation non persistant pour l'hyperviseur de la Xbox 360 qui fonctionne sur la dernière version du logiciel (17559). Il peut être utilisé pour exécuter du code non signé sur Xbox 360,  en utilisant une vulnérabilité dans l'hyperviseur, avec le jeu Tony Hawk's American Wasteland (NTSC).\n \n \n \n\n \n \n \nLes améliorations de kmx360 sont expliquées dans un billet spécifique : \n \n \n \nIl s’agit d’une évolution élaborée pour améliorer la vitesse et le taux de réussite du stage 3.\n \nAu lieu d'enregistrer le texte chiffré de l'oracle + le remplacement pour une seule valeur de blanchiment, je précalcule ceci pour essentiellement toutes (ou presque toutes) les valeurs de blanchiment possibles.\n \nEnsuite, dans le thread d'écrasement, au lieu de faire l'écrasement si un texte chiffré spécifique correspond, je peux faire une recherche et si je trouve _un_ texte chiffré correspondant, je peux faire l'attaque.\n \nJ'ai néanmoins réussi à remporter la condition de concurrence avec la boucle d'écrasement plus lente en créant une table de correspondance indexée par certains bits du texte chiffré (j'appelle cela une « pseudo-table de hachage » dans le code). Avec ce schéma, une correspondance se résume à un chargement unique qui devrait toujours atteindre le cache L2. Avec un nombre soigneusement choisi de bits du texte chiffré, je peux intégrer cette table dans le cache du processeur et y conserver la quasi-totalité des paires texte chiffré + remplacement.\n \nJe n'ai pas encore réussi à éliminer les plantages, mais même sans cela, le taux de réussite est d'environ 80 %, chaque exécution à partir du stage 3 prenant environ 15 secondes. Ces résultats sont basés sur mes propres tests et sur une preuve de concept préliminaire partagée avec les utilisateurs du serveur Discord Xbox 360 Hub, qui ont obtenu des résultats similaires.\n \nMa théorie sur les plantages actuels est que les deux threads se désynchronisent (mais cela n'a pas encore fait l'objet d'une vérification approfondie) :\n \n- l'ovewriter détectant une correspondance canari et écrivant le remplacement correspondant, et effectuant l'écrasement du texte chiffré\n- mais à ce moment-là, l'autre thread voit cette valeur, il se trouve sur une itération différente du payload XKE et ce texte chiffré n'est plus valide.\n- l'écriture d'un texte chiffré non valide entraîne la lecture par le HV d'un pointeur indésirable et l'écriture des données LZX décompressées à cet endroit, ce qui entraîne une erreur.\n \nJe publie ceci pour lancer une discussion sur la possibilité de l'upstreamer ou de poursuivre le développement via un fork. J'ai également apporté quelques modifications au code à mon goût au cours du développement, donc je n'ai malheureusement pas de delta minimal qui contienne simplement la nouvelle stratégie de recherche de texte chiffré. De plus, je développe ce code uniquement avec un compilateur C et un éditeur de liens personnalisé que j'ai écrit en Go ; je ne dispose donc pas de fichier ASM intermédiaire à fournir.\n \n \n \n\n \n \n \nA noter que la même stratégie pourrait également être utilisée pour que le stage 2 prenne moins de 50 ms, le développeur a créé un PoC en C, mais il ne l'a pas encore converti en chaîne ROP. Les améliorations sont excellentes, et se retrouve compilée ici. \n \n \nTéléchargement : Xbox360BadUpdate\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209216/in-xb360-lexploit-xbox360badupdate-mis-a-jour-1.png"
        }
    },
    "news_18": {
        "title": "[BD-JB-1250] Le nouvel exploit blu-ray BD-JB-1250 pour PS4 a été release",
        "content": "Le développeur Gezine a rendu disponible son exploit blu-ray nommé BD-JB-1250 puisque accessible jusqu'au firmware 12.50, le célèbre développeur TheFlow a confirmé qu'il ne s'agit pas de son exploit, et que comme nous vous l'avons déjà dit précédemment, il n'est pas compatible avec la PS5. Il fonctionne uniquement via un disque Blu-Ray gravé et permet l'exécution de code natif (espace utilisateur, pas au niveau du kernel, du moins pour le moment).\n \nAttention, pour le moment, Lapse n'est compatible que jusqu'au 12.02, donc l'exploit bluray n'est qu'un point d'entrée pas un exploit kernel. \n \n \n\n \n \n \n \nRemarques :\n \n- Modifier l'adresse IP de Status.java pour la journalisation réseau.\n- La valeur par défaut est 192.168.2.1\n- Pour la compilation, il recommande d'utiliser le bdj-sdk de john-tornblom\n- N'oubliez pas de remplacer le fichier bdjo par BDMV\n \nTéléchargement : Le nouvel exploit blu-ray BD-JB-1250\n \n \n \n \n \n \n",
        "images": {}
    },
    "news_19": {
        "title": "[Switch] EmmcHaccGen mis à jour pour une expérience améliorée",
        "content": "EmmcHaccGen est probablement l'un des plus célèbres outils pour la Nintendo Switch, proposé à l'origine par suchmememanyskill, l'outil permet de remplacer l'outil ChoiDujour, avec quelques options supplémentaires. \n \nLe développeur sthetix a modifié la version originale d'EmmcHaccGen et l'a renommé EmmcHaccGen-UX - il est utilisé pour mettre à jour ou débloquer la Nintendo Switch dans son guide de niveau 1. \n \n \n \n\n \n \n \n \nChangelog : \n \n- Améliorations de l'expérience utilisateur (UX) : l'interface utilisateur a été simplifiée pour plus de clarté et de facilité d'utilisation, remplace le bouton Erista/Mariko par un menu déroulant clair. \n- Effacer la sélection de la console : remplacement du bouton « Générer le micrologiciel Mariko » par un simple menu déroulant permettant de sélectionner entre les types de console Erista et Mariko.\n- AutoRCM supprimé : l'option AutoRCM a été supprimée de l'interface graphique pour éviter toute confusion de l'utilisateur et le risque que la console ne réponde pas.\n- Prise en charge automatique d'ExFAT : tous les micrologiciels générés incluent désormais automatiquement la prise en charge d'ExFAT, éliminant ainsi le besoin d'une bascule manuelle.\n- Mise à jour des dépendances : le projet a été mis à niveau vers un framework .NET plus récent et pris en charge (8.0) pour une meilleure sécurité et de meilleures performances.\n \nComment utiliser :\n \nInterface graphique Windows : Téléchargez et extrayez EmmcHaccGen-UX-GUI.zip. Exécutez EmmcHaccGen.GUI.exe.\nLigne de commande (CLI) : Téléchargez et extrayez EmmcHaccGen.CLI.zip. Suivez les instructions pour README.md utiliser les options de ligne de commande.\n \n \n \nTéléchargement : EmmcHaccGen-UX v1.0.0\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209200/in-switch-emmchaccgen-mis-a-jour-pour-une-experience-amelioree-1.png"
        }
    },
    "news_20": {
        "title": "[Switch 2] Un exploit webkit sur Switch 2 aurait été trouvé",
        "content": "zecoxao, figure bien connue de la scène hacking, a indiqué que comex, un développeur et chercheur en vulnérabilités ayant notamment marqué la communauté iOS, aurait découvert un exploit WebKit sur la Switch 2. Cette révélation a immédiatement attiré l’attention de la communauté underground, un exploit webkit a déjà été une porte d’entrée pour des exploits sur la Switch originale. L’utilisation du navigateur — souvent accessible via la page d’authentification Wi-Fi — en fait une cible privilégiée pour les chercheurs en sécurité, cependant la présence d’un exploit WebKit ne signifie pas automatiquement qu’un piratage complet de la console est possible. À ce stade, rien ne confirme que cette faille permet un accès au kernel du système, ni qu’elle est capable de briser la TrustZone ou équivalent, ou les multiples couches de sécurité mises en place par Nintendo.\n \n \n\n \n \nLes détails techniques restent confidentiels, il pourrait constituer la première étape vers un éventuel jailbreak. Cependant, il est tout aussi probable qu’il reste limité à un \"userland exploit\", sans escalade de privilèges, donc sans réelle implication pour un hack complet.\n \n \n\n \n \nNintendo, qui a renforcé sa politique de bug bounty via la plateforme HackerOne, n’a pas encore réagi à cette information. L’entreprise japonaise est connue pour réagir rapidement dès qu’une faille critique est identifiée, si l’information est confirmée, cela pourrait avoir un impact sur la sortie d'un nouveau firmware de la console ou accélérer la mise en place de correctifs. Pour l’instant, la prudence reste de mise : il ne s’agit que d’un premier pas, et non d’un hack effectif de la Switch 2.\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1209196/in-switch-2-un-exploit-webkit-sur-switch-2-aurait-ete-trouve-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1209196/in-switch-2-un-exploit-webkit-sur-switch-2-aurait-ete-trouve-1.jpg"
        }
    }
}