{
    "news_1": {
        "title": "[PSP] L'unbricker Aiseirigh dévoilé par Davee",
        "content": "Comme nous en informe Wololo.net, le développeur Davee dévoile Aiseirigh, son unbricker permettant de prendre en charge tous les modèles PSP, rien que ça ! Utilisé en couplage avec BaryonSweeper, Aiseirigh peut débloquer ainsi  débloquer n'importe quelle PSP et la restaurer vers le firmware 6.61.\n \nAiseirigh qui se prononce \" ash-er-eye \" est un mot gaélique écossais signifiant \" résurrection \", et il est parfaitement compatible avec les outils Pandora et DDC (Despertar del Cementerio).\n \nLe code source se trouve ici : Aiseirigh\n \n \n\n \n \n\n \n\n \n \nNécessaires :\n \n- une Memory Stick Pro Duo (PSP) ou une Memory Stick Micro (PSPgo) avec suffisamment d'espace dans le secteur IPL\n- un BaryonSweeper physique (obligatoire pour les PSP 3000 03g, 3000 04g, 3000 07g, 3000 09g, PSPgo et PSP E1000 ; fonctionne également pour les PSP 1000 et 2000)\n- une batterie Pandora classique (uniquement pour les PSP 1000 et 2000, y compris 2000 88v3 !)\n- un logiciel qui peut interagir avec BaryonSweeper, tel que pySweeper\n- pySweeper nécessite que Python3 soit correctement installé et configuré, ainsi que les paquets pip suivants : \"pycryptodome\", \"tk\", \"pyserial\" et \"requests\".\n- Les fichiers de mise à jour du firmware 6.61 pour les PSP ordinaires ou la PSPgo (correspondant à votre modèle)\n- le fichier IPL Aiseirigh unbricker\n- un moyen d'injecter le fichier IPL Aiseirigh dans la clé USB (par exemple Rains IPL Tool via PC ou PSP-Tool via PSP)\n- un peu de compréhension de la lecture du tutoriel disponible ici.\n \n \n \n\n \n \n \nLa mise en oeuvre n'est pas simple, il vous faudra un BaryonSweeper, pas mal de connaissances, ou bien d'une batterie Pandora selon votre modèle de PSP. \n \n \nTéléchargement : Aiseirigh v0.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189513/in-psp-lunbricker-aiseirigh-devoile-par-davee-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1189513/in-psp-lunbricker-aiseirigh-devoile-par-davee-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1189513/in-psp-lunbricker-aiseirigh-devoile-par-davee-3.png"
        }
    },
    "news_2": {
        "title": "[PS4] Le store GameBato améliore ses performances et stabilité",
        "content": "Le store décrié GameBato a été mis à jour en version 1.99, il est comme vous le savez question d'un store qui met à disposition plus de 2000 jeux qui sont directement accessibles sur la PlayStation 4 et PlayStation 4 Pro, avec les DLC et les mises à jour, et tout cela d'un simple clic. \n \n \n \n\n \n \n \nChangelog Version 1.99 :\n \nAmélioration des performances :\n- Amélioration de la stabilité de l'application.\n- Réduction de l'utilisation du processeur de l'application de ~270%.\n \nAmélioration de l'interface utilisateur :\n- Normalisation de la vitesse d'exploration dans l'application.\n- Changement de l'image de fond de la section des téléchargements.\n- Ajout d'un avis de téléchargement pour certains jeux qui ne peuvent pas être exécutés sans installer les paquets de mise à jour, afin de rappeler aux utilisateurs de télécharger les paquets de mise à jour pour ces jeux.\n \n- Correction de quelques problèmes mineurs.\n \n \nTéléchargement : GameBato\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189503/in-ps4-le-store-gamebato-ameliore-ses-performances-et-stabilite-1.png"
        }
    },
    "news_3": {
        "title": "[Vita] RetroFlow-Launcher 7.0.1 disponible",
        "content": "Le développeur jimbob4000 vient de publier RetroFlow-Launcher dans sa version 7.0.0. Pour rappel, RetroFlow-Launcher est une jolie petite interface graphique permettant de parcourir et delancer vos jeux Retro sur la PS Vita, et est à l'origine un fork de HexFlow-Launcher par VitaHEX.\n \nIl s'agit d'une version modifiée de HexFlow Launcher, un coverflow 3D comme un lanceur pour PS Vita. Cette version comprend des catégories de jeux rétro qui peuvent être lancées sans bulles pour RetroArch, DaedalusX64 et Flycast. Les jeux Playstation et PSP peuvent également être lancés sans avoir à créer de bulles pour chaque jeu. Vous l'aurez compris RetroFlow remplacera le Menu Bull avec le plus bel effet. \n \n \n\n \n \n \nChangelog 7.0.1 : \n \nCorrections de bugs\n \nCorrection d'un problème avec les jeux Adrenaline, le 'boot.bin' généré était mal formé. Cela provoquerait un crash lors de l'accès aux paramètres de démarrage pendant que le jeu était en cours d'exécution, ainsi que d'éventuels problèmes de performances dans le jeu.\n \n \nChangelog 7.0.0 : \n \nAperçu\nLes notes de version sont longues, voici donc un bref résumé.\n \nMeilleures illustrations pour les jeux rétro .\nDes vérifications CRC de fichiers ont été ajoutées pour aider à identifier davantage de jeux. Elles ne sont pas disponibles pour tous les systèmes, mais la plupart des systèmes non basés sur CD ont été ajoutés.\n \nInstallation et configuration plus faciles lors de l'utilisation d'Adrenaline .\nAdrenaline bubble booter et le vpk RetroFlow Adrenaline Launcher sont installés automatiquement si vous utilisez Adrenaline. Ceci est effectué lors de la première configuration et également vérifié lors de l'analyse des jeux.\n \nNouveau\nMeilleure identification du jeu pour les téléchargements d’illustrations de jeux rétro.\nDes vérifications de fichiers CRC ont été ajoutées pour une meilleure correspondance des illustrations pour la plupart des systèmes non basés sur CD. Zip et rar sont pris en charge mais ne sont pas recommandés car l'application doit les extraire pour vérifier le CRC. 7z n'est pas pris en charge. Pour plus d'informations sur la prise en charge du CRC, voir ici . CRC a été rendu possible grâce à l'utilisation du code de « Adrenaline bubble manager » de l'équipe ONElua.\n \nNouveau téléchargeur d'œuvres d'art.\nUn nouveau téléchargeur d'illustrations a été conçu pour fonctionner avec les nouveaux contrôles CRC du jeu. Le téléchargeur essaiera d'abord de télécharger l'illustration en fonction du nom de fichier du jeu, puis tentera d'identifier le jeu à l'aide de sa somme de contrôle CRC si rien n'est trouvé. L'illustration téléchargée est maintenant affichée sur l'écran de progression. Il y a également une meilleure gestion de l'énergie, la Vita ne peut pas se mettre en veille (ce qui mettrait les téléchargements en pause), l'écran s'éteindra après un certain temps et se rallumera une fois le téléchargement de l'illustration terminé.\n \nPossibilité d'utiliser l'ancien téléchargeur d'œuvres d'art.\nVous pouvez utiliser l'ancien téléchargeur en désactivant le paramètre « Illustration > Télécharger à l'aide du CRC », mais il risque de trouver moins d'illustrations. L’option permettant de télécharger des illustrations système par système a été supprimée pour simplifier l’expérience utilisateur et le code.\n \nInstallation automatique de RetroFlow Adrenaline Launcher.\nLe VPK sera installé automatiquement lors de l'analyse des jeux (à condition qu'Adrenaline soit installé).\n \nInstallation automatique du booter Adrenaline Bubble.\nL'application va maintenant vérifier si Adrenaline bubble booter est installé (nécessaire pour lancer les jeux Adrenaline), s'il n'est pas installé ou si le CRC des fichiers est différent, alors Adrenaline bubble booter sera installé et vous serez invité à redémarrer la vita. Cela devrait simplifier le processus de configuration. Cela a été rendu possible grâce à l'utilisation du code de « Adrenaline bubble manager » de l'équipe ONElua, « Adrenaline bubble booter ». par Leecherman.\n \nPlus d'options de jeu Adrenaline ajoutées pour les jeux PSP.\nDes paramètres supplémentaires ont été ajoutés pour les plugins, la vitesse du processeur, la mémoire élevée, le moteur NoDRM et les threads de suspension. Toutes les options d'ABM sont désormais disponibles ici également.\n \nPrise en charge des noms de fichiers Amiga WHD ajoutée.\nL'application recherchera les titres de jeux en fonction des noms de fichiers WHD courants.\n \nHorloge au format 12 heures.\nAjout d'une option pour utiliser une horloge au format 12 heures. Accédez à « Autres paramètres > Heure » pour modifier.\n \nAméliorations\nIllustration - Extraire les arrière-plans PSP - L'illustration est désormais affichée à l'écran pendant le processus.\n \nTraductions polonaises mises à jour grâce à SK00RUPA.\n \nPositionnement des icônes en haut de l'écran lorsque l'icône Wi-Fi n'est pas affichée.\n \nCorrections de bugs\nCorrection des couvertures PS1 personnalisées ne s'affichant pas pour certains jeux Retroarch PS1.\n \nExtraire les icônes et les arrière-plans Vita - J'ai utilisé les copyicons de cy33hc pour plus de stabilité. Ma version avait des fonctionnalités supplémentaires mais comportait des bugs.\n \nLa description de ScummVM a été supprimée car elle peut provoquer une erreur Lua.\n \n \n \nTéléchargement : RetroFlow-Launcher 7.0.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189464/in-vita-retroflow-launcher-701-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[PS3] Custom firmware Evilnat 4.91.2 CEX/PEX/D-PEX avec Cobra 8.5 Bêta 5",
        "content": "Le développeur Nathan Martin vient de mettre en ligne une nouvelle version de son Custom Firmware Evilnat en 4.91.2, il s'agit comme d'habitude des versions PEX et D-PEX qui sont proposées, et il a intégré les fonctions Cobra dans leur mouture 8.5. \n \n \n \n\n \n \n \nCette Bêta 5 a pour ambition d'apporter 3 corrections que nous pouvons retrouver dans le changelog (en plus des éléments déjà précédents). \n \n- Correction de la vitesse maximale du FAN, qui affiche désormais 0xFF et 100 % \n- Désactivation temporaire de \"Load External Cobra\" \n- Inversion du code pour cobra dans le kernel\n \nA noter que la version CEX sera publiée normalement dans l'après-midi. \n \n \nTéléchargement : CFW Evilnat 4.91.2 PEX/D-PEX avec Cobra 8.5 Bêta 5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189443/in-ps3-custom-firmware-evilnat-4912-pexd-pex-avec-cobra-85-beta-5-1.jpg"
        }
    },
    "news_5": {
        "title": "[Switch] Les samples (échantillons) d'UnlockSwitch sont en route",
        "content": "La team UnlockSwitch vient à priori de finaliser le packaging de sa solution, clone du Mig Switch mais qui coutera plus de 2 fois moins cher. \n \nElle montre donc quelques photos de ce packaging même si elle précise que ce sont des samples (les échantillons) qui sont en route ! \n \nElle tient à préciser plusieurs choses, déjà qu'il ne s'agit pas de la version finale, et que les futurs propriétaires seront ravis. \n \n \n \n\n \n\n \n\n \n \nElle a rappelé une nouvelle fois que de nombreux scammers tentent avec des mails bien rédigés de contourner les commandes, il y a même des Youtubers qui font la promotion de sites web frauduleux. Elle confirme que pour l'heure aucune précommande n'existe car la production de masse n'a pas été lancée, à la question de savoir quand les précommandes seront effectives, la team répond \"très bientôt\". \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189432/in-switch-les-samples-echantillons-dunlockswitch-sont-en-route-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1189432/in-switch-les-samples-echantillons-dunlockswitch-sont-en-route-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1189432/in-switch-les-samples-echantillons-dunlockswitch-sont-en-route-3.jpg"
        }
    },
    "news_6": {
        "title": "[Switch] Lakka v5.0 disponible",
        "content": " \nEt ben dit donc, on a failli l'oublié lui, Lakka, vient d'être mis à jour, il faut dire que l'OS Switch n'avait pas été updaté depuis Janvier 2023 !\n \nPour bénéficier de Lakka sur votre Switch, il suffit de le placer sur une carte SD formatée en FAT32, rappelons que Lakka est une distribution Linux spécialement taillée pour intégrer RetroArch sur Nintendo Switch, cette distribution est notamment optimisée pour émuler les jeux Dreamcast, N64, Saturn, GameCube et Wii profitant de meilleures performances que le système classique.\n \n \n\n \n \nCette version 5.0 est basée sur la dernière version de RetroArch, la 1.17.0 et permet donc de profiter de l'ensemble de ses améliorations. \n \nLe changelog intégral est disponible ici.\n\n \nChangelog mini : \n \n- Based on LibreELEC 11.0 build system\n- RetroArch updated to 1.17.0\n- Cores updated to their most recent versions\n- New cores added:\ndirksimple: Dragon’s Lair player\ndosbox-core: DOSBox\nep128emu: Enterprise 64/128, Videoton TVC, Amstrad CPC and ZX Spectrum\ngeolith: Neo Geo AES and MVS Cartridge Systems\njaxe: XO-CHIP/S-CHIP/CHIP-8\nnumero: TI-83\nthepowdertoy: The Powder Toy\nvice_xpet: Commodore PET\nvircon32: Virtual Game Console inspired by 16/32-bit systems\nvitaquake2: Quake II\n- Mesa updated to 24.0.4\n- Updated Linux kernel\nmainline: 6.1.84\nraspberry: 6.1.77\namlogic: 6.1.38\n- Added images for following devices\nRaspberry Pi 5\nRaspberry Pi Zero 2 in Retroflag GPI Case 2W\nRaspberry Pi Compute Module 4 in Retroflag GPI Case 2\n- Generic PC:\nSupport for nVidia GPUs (using proprietary nVidia driver, separate image)\n- Allwinner SOC:\nOrangePi Zero2\nOrangePi 3 LTS\n- Amlogic SOC:\nBananaPi CM4\nBananaPi M2 Pro\nBananaPi M2S\nBananaPi M5\nRadxa Zero\nRadxa Zero2\nWeTek Core\nWeTek Hub\nWeTek Play 2\n- Rockchip SOC:\nFirefly ROC-PC Plus\nOrangePi 4 LTS\nRadxa Rock Pi 4 Plus\nRadxa Rock Pi 4 C Plus\n- Retrorama - theme and dynamic wallpapers for XMB\n \n \n\n \n\n \nTéléchargement : Lakka-5.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189367/in-switch-lakka-v50-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[Switch] L'UnlockSwitch à moins de 40 $ mais attention aux scammers",
        "content": "La Team UnlockSwitch vient d'annoncer que de nombreux sites internet essayent de tirer profit de leurs premières livraisons en essaynt déjà de contourner ceux qui acheteraient le linker. De nombreux sites se font donc passer pour le site officiel, mais pour le moment aucun d'entre eux n'est revendeur de la solution.\n \nCe sont donc uniquement des scammers ou des sites qui vous promettent que vous recevrez votre exemplaire, mais il n'en est rien. \n \n \n\n \n \nDeuxième information importante, la team s'exprime sur le prix est annoncé qu'elle est heureuse de vous confirmer que le prix attendu pour l'utilisateur final (et non pas les revendeurs) sera approximativement de 39 $, soit moins de 40 $, sachant que le Mig Switch lui est plutôt vendu plus du double.\n \nPour le moment, l'UnlockSwitch n'est pas encore lancé en production, et l'équipe demande même quelle couleur vous souhaiteriez pour l'emballage final via un sondage .\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189366/in-switch-lunlockswitch-a-moins-de-40-mais-attention-aux-scammers-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] Suyu 0.0.3 disponible",
        "content": "Malgré la tourmente et aussi surprenant que cela puisse paraître, l'équipe en charge du développement de Suyu a réussi à créer une nouvelle version de leur émulateur Switch. \n \nAprès Github, après Gitlab, c'est au discord que Nintendo s'est attaqué, et l'a fait disparaitre. Cependant tout cela n'entache en rien la motivation de ceux qui ont pris la relève de Yuzu et propose donc des correctifs pour le firmware 18.0.0, mais aussi des améliorations du support de Princess Peach : Showtime !, ou encore cette version vient corriger des problèmes avec certains fichiers NRO provoquant des plantages. \n \n \n\n \n \nCertains supports ont été améliorés comme ceux des appareils Android, ou encore FSR Sharp ou encore l'audio. A noter qu'officiellement le firmware 18.0.0 n'est pas supporté, il s'agit du firware 17.0.0. \n \n \nTout est là : Suyu v0.0.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189348/in-switch-suyu-003-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[PS4/PC] OrbisPro Beta v0.2 disponible",
        "content": "Le développeur SvenGDK a publié la seconde mouture de OrbisPro en version Bêta v0.2. Sous ce nom se cache un Media Center qui permet de lancer les jeux Windows le tout avec une interface très proche de celle de la PS4. \n \n \n\n \n\n \n \nChangelog : \n \nMises à jour :\n- Projet mis à jour de .NET Framework 4.8 à .NET 8\n- Pour utiliser OrbisPro avec cette mise à jour, il faut que le .NET Desktop Runtime 8 soit installé.\n- Remplacement de FontAwesome.WPF par FontAwesome.Sharp\n- Remplacement de la bibliothèque libhook par OrbisKeyboardHook\n- Ajustement du message de bienvenue lors de la première exécution\n- OrbisPro récupère maintenant la taille de l'écran et se met à l'échelle automatiquement (définissez un facteur d'échelle de 100% dans vos paramètres d'affichage)\n- Ajout d'un indicateur du nom du Wifi et de la qualité du signal sur l'écran d'accueil (si connecté)\n- Ajout d'un indicateur de niveau de batterie sur l'écran d'accueil (si la batterie est présente)\n- Ajout d'une nouvelle horloge système qui suit l'état du Wifi et de la batterie (si elle est connectée et présente)\n- Mise à jour toutes les 45 secondes pour le moment (sera augmentée dans la prochaine mise à jour)\n- Ajout d'une combinaison de touches L+R pour recharger l'écran d'accueil (F1 sur le clavier)\n- Nouveaux paramètres d'affichage\n- Les \"Paramètres d'arrière-plan\" ont été déplacés vers les \"Paramètres d'affichage\"\n- Désactiver la mise à l'échelle automatique et ajuster manuellement la résolution de l'écran\n- La fonction Suspension et Reprise a été ajustée pour une meilleure réactivité\n- L'utilisation de la mémoire d'OrbisPro sera désormais réduite lors du démarrage d'un jeu ou d'une application\n- OrbisPro restaure désormais l'écran d'accueil lorsque le jeu ou l'application lancé a été quitté.\n- Le sélecteur d'application se ferme désormais automatiquement si le jeu ou l'application lancé(e) est tué(e).\n- Changement d'arrière-plan du jeu plus fluide (mise à jour de CacheOption & CreateOptions of BitmapImage)\n \nCorrections :\n- Presque \"plus\" de décalage d'entrée pour les manettes de jeu\n- Un délai de 60 ms est fixé (peut être ajusté manuellement dans \\System\\Settings.ini)\n- Navigation plus fluide sur l'écran d'accueil\n- Empêche le passage à l'élément suivant tant que la dernière animation n'est pas terminée\n- Empêche la saisie de données pour passer à l'élément suivant tant que la dernière animation n'est pas terminée\n- Ces délais (minimes) devraient permettre à l'écran d'accueil de rester propre.\n- Correction de la saisie au clavier\n- L'affectation des touches du clavier n'était pas correcte dans certaines fenêtres.\n- Corrigé : FocusVisualStyle des éléments dans le sélecteur d'application\n- Ajustements et corrections du sélecteur d'application\n- Corrigé : Crash lors de la recherche de jeux. Vérifie maintenant si les dossiers de jeux existent avant de vérifier leur contenu.\n- Correction : Écran noir (pas de vidéo d'installation) lors du premier démarrage d'OrbisPro sur le ROG Ally\n- Corrigé : Déconnexion d'un réseau WiFi\n \nChangements internes :\n- Suppression du code inutilisé\n- Remplacement de If/ElseIf par Select Case pour la saisie au clavier\n- Suppression d'un fil supplémentaire pour certaines animations\n- Le taux d'interrogation du Gamepad ne sera plus ajusté en fonction de la fréquence du moniteur\n- Mise à jour d'OrbisAudio\n- Utilitaires de réglage du volume (MasterVolumeUp, MasterVolumeDown, MuteMasterVolume)\n- Utilitaire GetCurrentMasterVolume\n- Ajouté OrbisDisplay\n- Utilitaire GetMonitorFrequency\n- Utilitaire SetScaling\n- Mise à jour d'OrbisNetwork\n- Nouvel utilitaire GetWiFiSignalStrenght (avec GetWiFiSignalImage)\n- Mise à jour de ProcessUtils\n- Ajouté ActiveProcess (gère le démarrage et la sortie d'un jeu ou d'une application)\n- Ajout de l'événement ActiveProcess_Exited\n- Mise à jour de OrbisPowerUtils\n- Ajout de l'utilitaire GetBatteryImage manquant\n \nRemarque :\n- Le Wifi et la batterie s'afficheront (même si le Wifi est éteint et qu'il n'y a pas de batterie) après la première installation mais disparaîtront au bout de 45 secondes.\n- Ceci sera corrigé dans la prochaine mise à jour\n \nMise à jour Hotfix v0.2.2 :\n- S'installera lors de la première exécution ou lors de la vérification des mises à jour.\n- Correction d'un crash possible lorsqu'aucun jeu ou application n'était détecté.\n- Correction : Pas de saisie possible lorsqu'aucun jeu ou application n'est détecté.\n \nTéléchargement : OrbisPro Beta v0.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189310/in-ps4pc-orbispro-beta-v02-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1189310/in-ps4pc-orbispro-beta-v02-disponible-2.png"
        }
    },
    "news_10": {
        "title": "[Switch] UnlockSwitch dévoile une vidéo sous 18.0.0",
        "content": "La Team UnlockSwitch dévoile une nouvelle vidéo de leur périphérique en fonctionnement sous le firmware 18.0.0.\n \n \n\n \n \nAu programme, la puce, son habillage, un tournevis et une Switch sous firmware 18.0.0, le tout en fonctionnement, le tout en haute résolution.\n \n \n\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189264/in-switch-unlock-switch-devoile-une-video-sous-1800-1.jpg"
        }
    },
    "news_11": {
        "title": "[Switch] MigDumpTool v0.0.2 disponible",
        "content": "Une nouvelle version de l'outil MigDumpTool, similaire de nxdumptool, vient d'être dévoilée par la Team Mig Switch. \n \nL'outil comme le savez est couplé avec le MigDumpTool, et permet de dumper les cartouches de jeux via la console Switch. Un seul clic suffit pour dumper tous les fichiers nécessaires au fonctionnement des jeux via le Mig Switch. \n \nLa mise à jour apporte certaines améliorations de la dernière révision de nxdumptool, mais vise aussi à corriger la génération du chemin de dumps des jeux. \n \n \n\n \n \n \nChangelog :\n \n- Implémentation des améliorations de la dernière révision de nxdumptool.\n- Correction de la génération du chemin de dumps pour les cartes de jeu à plusieurs titres.\n \n \nTéléchargement : MigDumpTool v0.0.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189262/in-switch-migdumptool-v002-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] Les échantillons du UnlockSwitch entrent en production",
        "content": "Même si certains doutent de la réalité de l'UnlockSwitch, toute comme cela avait le cas lors de l'annonce du Mig Switch, voilà que le profil officiel du clone du Mig dévoile les photos des échantillons qui vont être proposés. \n \n\n \n \nIl est temps également de déployer le site officiel https://unlockswitch.com/ qui reste toujours \"en construction\", mais une chose après l'autre. Ce n'est pas avec la cinquantaine d'unités produites qu'ils vont pouvoir contenter tout ceux qui veulent soit tester soit mettre en avant le produit, il va falloir patienter encore un peu. \n \n \n\n \n\n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189210/in-switch-les-echantillons-du-unlock-switch-entrent-en-production-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1189210/in-switch-les-echantillons-du-unlock-switch-entrent-en-production-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1189210/in-switch-les-echantillons-du-unlock-switch-entrent-en-production-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1189210/in-switch-les-echantillons-du-unlock-switch-entrent-en-production-4.jpg"
        }
    },
    "news_13": {
        "title": "[Wii] WiiFlow Lite v5.5.4-1 disponible",
        "content": "Le développeur Fledge68 vient de mettre en ligne il y a quelques minutes la nouvelle version de WiiFlow Lite, il s'agit de la v5.5.4-1, la version précédente avait été proposée il y a plus de 8 mois. \n \nCela reste étonnant de voir que de nombreux homebrews et utilitaires de la Nintendo Wii sont toujours supportés, il faut avouer que la Wii est toujours une console qui donne envie d'être relancé, surtout que ceux qui ont connu la console à son lancement en 2006 la font désormais connaitre à leurs enfants, ou en rétrogaming. Il n'y a pas que la Switch dans le monde des jeux vidéos ! \n \n \n \n\n \n \n \nChangelog v5.5.4-1 version du 09 avril 2024 :\n \n- Correction de l'option IOS 'auto' du jeu. dans la v5.5.4 'auto' fait que le jeu utilise une base 38 cios d2x si vous l'avez installée, ce qui empêche le jeu de démarrer. cette correction empêche que cela se produise.\n \n\n \n \n \nTéléchargement : WiiFlow Lite v5.5.4-1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189207/in-wii-wiiflow-lite-v554-1-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1189207/in-wii-wiiflow-lite-v554-1-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[XBO] Modxo pour convertir Raspberry Pi Pico en modchip Xbox",
        "content": "Le développeur Shalx propose la première version de sa solution Modxo, un custom firmware qui va vous permettre de convertir un Raspberry Pi Pico en modchip pour la Xbox originale, en s'appuyant sur une émulation permettant d'exécuter un bios. \n \nLe processus d'installation est largement simplifié car il ne nécessite pas de fil LFrame pour les versions 1.0 à 1.5, et dans le futur le développeur souhaite améliorer la communication avec l'appareil, notamment au travers d'un écran LCD.\n \n \n \n\n \n \n \n \nNouvelles fonctionnalités :\n \n- Ne nécessite pas de fil LFrame pour les versions 1.0-1.5\n- La broche D0 peut être contrôlée par GPIO (Cela permettra dans le futur d'activer/désactiver le BIOS Tsop interne).\n- Il y a un nouveau générateur UF2 basé sur javascript, donc maintenant les images uf2 du bios peuvent être générées en utilisant un navigateur. (https://shalxmva.github.io/modxo/) \n- Le projet a maintenant un logo, c'est un Axolotl, donc modxo se prononce comme \"Modsho\"\n- C'est un grand pas pour Modxo, car il est maintenant plus facile à installer sur toutes les versions, et un seul schéma de câblage est utilisé (https://github.com/shalxmva/modxo). \n \n \n\n \n \n \nTéléchargement : Modxo v0.1\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189206/in-xbo-modxo-pour-convertir-raspberry-pi-pico-en-modchip-xbox-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1189206/in-xbo-modxo-pour-convertir-raspberry-pi-pico-en-modchip-xbox-2.png"
        }
    },
    "news_15": {
        "title": "[Switch] Le clone du Mig Switch ne sera pas disponible avant fin avril",
        "content": "Hier nous vous informions que le premier clone du Mig Switch était annoncé sous le nom de Unlock Switch, suite à un nouveau message officiel, voilà qu'une bride de planning est avancée. \n \nLa Team explique que l'Unlock Switch n'est pour le moment qu'à l'étape de développement, il faut entendre par là qu'un premier exemplaire fonctionnel a été déployé, mais qu'il reste encore de nombreuses étapes avant la disponibilité. \n \n \n\n \nUnlock Switch n'est pas encore disponible à la vente, ni même en précommande tout simplement parce que la version finale n'est pas encore terminée. Plusieurs phases de développement, de tests et de finalisation du produit sont encore nécessaires.\n \n \n\n \n \nL'équipe espère pouvoir livrer les premiers échantillons disponibles afin de présenter sa solution, s'en suivra une phase de bêta test avant la mise en production finale prévue en Avril, mais tout cela ne se fera certainement pas avant fin Avril, vu que le tiers du mois est quasiment passé. \n \nUne production de masse ne devrait pas intervenir avant le mois de Mai ou de Juin selon ce planning, comme cela avait le cas pour le Mig Switch où il avait fallu attendre 2 à 3 mois avant une réelle disponibilité chez les revendeurs.  \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189154/in-switch-le-clone-du-mig-switch-ne-sera-pas-disponible-avant-fin-avril-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1189154/in-switch-le-clone-du-mig-switch-ne-sera-pas-disponible-avant-fin-avril-2.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] Le clone du Mig Switch se nomme UnlockSwitch",
        "content": "Voilà, cela devait arriver, voilà ce qui serait le premier clone du Mig Switch, il s'agit du UnlockSwitch.\n\n\n\n\n\nUnlockSwitch représente la solution unique pour sauvegarder et de profiter de toutes les consoles Nintendo Switch, quels que soient leur version, firmware ou type spécifique, qu'il soit OLED, standard ou Lite, ça c'est le discours officiel, mais sans aucun filtre la team explique que ce linker bénéficie d'une LED verte.\n\n\n\n\n\nOui ! Nous avons hacké et cloné le Mig Switch, aujourd'hui nous l'améliorons et vous présenterons prochainement notre évolution ! Notre solution UnlockSwitch est 100% compatible avec toutes les consoles Nintendo Switch, jusqu'au firmware en version 18.0.0.\n\n\n\n\n\n \n\n\n\n\nLa Team va un peu plus loin en montrant l'UnlockSwitch dans une vidéo que l'on vous propose !\n\n\n \n\n\n\nTout est là :\n\nhttps://twitter.com/UnlockSwitch/status/1777044534737736029\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189141/in-switch-le-clone-du-mig-switch-se-nomme-unlock-switch-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1189141/in-switch-le-clone-du-mig-switch-se-nomme-unlock-switch-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1189141/in-switch-le-clone-du-mig-switch-se-nomme-unlock-switch-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1189141/in-switch-le-clone-du-mig-switch-se-nomme-unlock-switch-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1189141/in-switch-le-clone-du-mig-switch-se-nomme-unlock-switch-5.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1189141/in-switch-le-clone-du-mig-switch-se-nomme-unlock-switch-6.jpg"
        }
    },
    "news_17": {
        "title": "[3DS] Lime3DS 2107 disponible",
        "content": "Une nouvelle version de Lime3DS vient de paraitre, comme vous le savez il s'agit de l'émulateur qui a succédé à Citra3DS, le célèbre émulateur de Tropic Haze qui n'a pas survécu à l'accord avec Nintendo sur Yuzu. \n \n \n\n \n \nLime3DS 2107 :\n \n- Android : Améliorations majeures de la stabilité du moteur de rendu Vulkan (Merci GPUCode !)\n- Activation de l'optimisation SPIR-V, permettant de compiler des shaders Vulkan plus petits.\n- Android : Ajout d'un bouton de superposition pour changer d'écran\n- Ce bouton est désactivé par défaut, et doit être activé dans Overlay Options --> Toggle Controls\n- Android : Le tiroir latéral est désormais verrouillé par défaut\n- Le nom d'utilisateur par défaut du système est désormais \"LIME3DS\".\n- Le nombre de pièces de jeu par défaut a été mis à jour à 300.\n- Correction de la touche de raccourci Quitter qui ne fonctionne pas correctement\n \n \n\n \n \nLime3DS 2106 :\n \n- Mise à jour de la disposition des commandes tactiles par défaut sur Android pour les rendre beaucoup plus ergonomiques.\n- Voir cette comparaison : https://imgur.com/a/LHbt6vP\n- Désactivation des fonctions de télémétrie laissées par Citra et suppression des paramètres correspondants\n- Suppression des paramètres liés au Citra Web Service, car les serveurs n'existent plus.\n- Les versions MSYS2 pour Windows sont désormais disponibles\n- Correction de la marque manquante sur MacOS\n- Mise à jour de l'identifiant du paquet Android, pour la dernière fois, espérons-le.\n- Les builds produits à partir d'archives de sources unifiées affichent désormais le numéro de version correspondant dans l'application.\n \n \n\n \n \nTéléchargement : Lime3DS 2107\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189140/in-3ds-lime3ds-2107-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1189140/in-3ds-lime3ds-2107-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1189140/in-3ds-lime3ds-2107-disponible-3.jpg"
        }
    },
    "news_18": {
        "title": "[Switch] Sudachi implémente QLaunch",
        "content": "Comme vous le savez, Yuzu a tenté d'implémenté QLaunch, mais avant la fin de son explication cela n'avait pas été le cas, il avait fallu que les développeurs de Suyu le fasse en exclusivité. Mais ce sont désormais les développeurs de Sudachi qui ont réussi à faire cela avec la dernière version. \n \n \n\n \n\n \n \nSudachi, successeur de Yuzu, a implémenté la prise en charge de QLaunch, permettant d'utiliser le menu d'accueil de la Nintendo Switch. La prise en charge du firmware 18.0.0 a également été ajoutée.\n \n \n \n\n \n \n \nTéléchargement : sudachi\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189130/in-githubcomsudachi-emusudachireleases-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1189130/in-githubcomsudachi-emusudachireleases-2.png"
        }
    },
    "news_19": {
        "title": "[PS5] ps4-eboot-dlc-patcher passe en standalone avec la v1.0.1",
        "content": "Il y a quelques heures, le développeur idlesauce dévoilait une nouvelle version de son outil ps4-eboot-dlc-patcher. Comme vous le savez cet outil permet d'appliquer des correctifs au fichier eboot pour charger un fichier .prx contenant les ID des DLC, et certaines autres fonctions comme libSceAppContent par exemple.\n \n \n\n \n \nCette nouvelle version est spéciale, elle permet à ps4-eboot-dlc-patcher de devenir un standalone, il est plus rapide, et les scripts d'extraction sont plus efficaces, il utilise automatiquement les véritables clés de droit des paquets.\n \n \n \nTéléchargement : ps4-eboot-dlc-patcher v1.0.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189113/in-ps5-ps4-eboot-dlc-patcher-passe-en-standalone-avec-la-v101-1.gif"
        }
    },
    "news_20": {
        "title": "[PS5] Le nouveau dumper pour la PS5 arrive dans le prochain Itemzflow",
        "content": "Le développeur LightningMods vient d'annoncer que le vote est désormais clôturé, vous avez choisi c'est une nouvelle version mise à jour d'Itemzflow qui va être dévoilé pour la PS5. \n \n \n\n \n \nCette nouvelle version intègrera la nouvelle mouture du dumper PS5 dans sa deuxième version, il est largement plus rapide, les dumps prennent donc beaucoup moins de temps car les vitesses de lecture et d'écriture sont beaucoup plus hautes. Le développeur dit \"c'est une version améliorée de l'autre dumper, c'est principalement pour les performances et pour fournir plus de détails pendant le processus de dump au lieu d'avoir à se fier aux notifications pour savoir ce qu'il fait actuellement\". \n \n \n \n\n \n \n \nTout est là : twitter.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1189065/in-ps5-le-nouveau-dumper-pour-la-ps5-arrive-dans-le-prochain-itemzflow-1.jpg"
        }
    }
}