{
    "news_1": {
        "title": "[PS3] Le CFW Evinat Custom Firmware 4.90.2 en bêta 3",
        "content": "Le développeur Nathan Martin vient de publier un post informant que l'envoi d'une troisième bêta de son Custom Firmware Evilnat 4.90.2 pour la console PlayStation 3 vient d'être effectué à certains testeurs privilégiés.\n \nEnfin privilégiés, le Custom Firmware sera envoyé à tous ceux qui en auront fait la demande dans un précédent tweet, à noter qu'il est souhaitable de disposer d'une solution de flash hardware, type E3 flasher.\n \nLes nouvelles options du Custom Firmware devraient vous permettre d'installer un vrai firmware DEX original sur une console PlayStation 3 convertie .\n \n \n\n \n \nLe développeur rappelle que la version la plus sûre d'OFW DEX à installer est la 3.55, l'installation d'une version inférieure peut être dangereuse car elle dépend de la version minimale de la PS3.\n \nAttention si vous avez accès à cette bêta, l'activation de la prise en charge du DEX OFW créera un dump de 0x200 octets de la section EID0 sur un périphérique USB connecté, surtout ne supprimez pas ce fichier car vous ne pouvez désactiver le DEX qu'avec lui !\n \nIl y a un mois, la Bêta 2 avait été annoncée mais finalement elle ne sera pas proposée au grand public, espérons que cette version arrive rapidement.\n \nTout est là : twitter.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172404/in-ps3-le-cfw-evinat-custom-firmware-4902-en-beta-3-1.png"
        }
    },
    "news_2": {
        "title": "[PS4] Apollo Save Tool PS4 v1.4.0 disponible",
        "content": "C'est au tour de la version PS4 d'Apollo Save Tool d'être proposée par Damián Parrino, aussi connu sous le pseudonyme de Bucanero, il livre une grosse mise à jour pour la PlayStation 4. \n \nLa mise à jour ajoute un éditeur hexadécimal pour l'édition interne des données de sauvegarde et améliore le serveur Web interne avec prise en charge de la base de données en ligne. Il est désormais possible de personnaliser l'activation du compte d'identification en ligne grâce à un clavier à l'écran plus confortable.\n \n \n\n \n \nChangelog 1.4.0 : \n \nAjout :\n- Outils réseau\n- Outil de téléchargement d'URL (téléchargement de liens http/https/ftp/ftps)\n- Serveur Web local simple (accès complet aux lecteurs de la console)\n- Désactivation de l'historique du navigateur Web\n- Éditeur hexadécimal pour les fichiers de sauvegarde\n- Clavier à l'écran (pour la saisie de texte)\n- Activation des comptes hors ligne avec des identifiants de compte définis par l'utilisateur (clavier à l'écran)\n- Serveur Web interne amélioré (prise en charge de la base de données en ligne)\n- URL de la base de données en ligne définie par l'utilisateur (paramètres)\n- Reconstruction DLC améliorée (lecture des détails du contenu du fichier .pkg)\n- Vérification explicite du micrologiciel lors de l'importation de sauvegardes cryptées\n \nDivers\n- Mise à jour du moteur de patch Apollo v0.4.1\n- Saut de la recherche si le motif n'a pas été trouvé\n- Amélioration des types de code 9, B, D\n- Ajout de la prise en charge de la soustraction de valeur (BSD)\n \n \nTéléchargement : Apollo Save Tool PS4 v1.4.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172399/in-ps4-apollo-save-tool-ps4-v140-disponible-1.jpg"
        }
    },
    "news_3": {
        "title": "[Switch] Un guide PicoFly pour toutes les Switch",
        "content": "Les informations sont nombreuses sur PicoFly, la solution basée sur un RP2040 qui permet de profiter au mieux des capacités de votre Switch. \n \nPour y voir plus clair, lightninjay a rassemblé l'ensemble de ces informations, du moins les plus importantes, afin d'établir un PDF qui regroupe dans un seul document les principales données sur PicoFly. \n \n \n \n \n\n \n \n \nCela passe par la partie hardware, avec les bases de configuration de la puce, et précisant comment installer la puce, quel matériel il est préférable d'utiliser et surtout cela concerne tous les modèles de Switch, et tous les firmwares. \n \nComme la plupart des solutions, PicoFly est un modchip basé sur un microcontrôleur RP2040 qui, s'il est installé, vous permettra d'effectuer un bug sur le CPU, en chargeant un loader avant le démarrage du logiciel Nintendo.\n \n \n \n \n\n \n \n \nLe PDF fait la part belle également aux vidéos d'installation disponibles sur Youtube avec notamment pas mal de référence à l'installation de HWFLY. \n \n \n\n \n \nTout cela commence à se structurer ici sur le forum GBAtemp.net.\n \nLien vers le PDF : A definitive PicoFly install guide V.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172351/in-switch-un-guide-picofly-pour-toutes-les-switch-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1172351/in-switch-un-guide-picofly-pour-toutes-les-switch-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1172351/in-switch-un-guide-picofly-pour-toutes-les-switch-3.png"
        }
    },
    "news_4": {
        "title": "[PS4] GoldHEN payload v2.4b13 disponible",
        "content": "Le développeur SiSTRo a enchainé les versions de son payload GoldHen, imaginez ce sont pas moins de 8 versions qui se sont succédées depuis la précédente. \n \nAu programme, de nouvelles fonctionnalités, avec un support serveur FTP intégré, les correctifs de illusion0002. Taillé pour la plupart des firmwares sensibles de la PS4, le payload a été particulièrement mis à jour pour les 5.05, 6.72 et 9.00 avec notamment les GoldHEN_Plugins_SDK et un dépôt liés aux GoldHEN Plugins. \n \nUne mise à jour qui récupère quelques correctifs également adressés lors des bêta 10, 11 et 12, cela signifie que trois versions bêta ont été réalisées en plus de cette dernière version.\n \nIl y a deux nouvelles entrées dans le menu de Debug Settings, Search Subdirectories et Show Package Path. Il existe également plusieurs améliorations dans l'analyseur XML/SHN, la fonctionnalité de source de package récemment introduite dans la version bêta 11 et le décryptage automatique FTP.\n \n \n\n \n \nChangelog v2.4b13\n \n- Analyseur xml/shn amélioré.\n- Le répertoire /discet le fichier $RECYCLE.BIN sont désormais ignorés lors de la recherche de sous-répertoires de pkg.\n \nJournal des modifications v2.4b12\n- Correction du chemin de sous-répertoire USB.\n \nChangelog v2.4b11\n \n- Correction de la fonction \"Rechercher dans les sous-répertoires\".\n- Amélioration de la fonction \"Source du paquet\".\n \nChangelog v2.4b10\n \n- Amélioration de l'auto-déchiffrement FTP.\n- Correction de la navigation de triche après le mode repos.\n- Ajout des fonctionnalités \"Rechercher dans les sous-répertoires\" et \"Afficher le chemin du package\" dans les paramètres de débogage.\n \n \nPour avoir le loisir de profiter de cette nouvelle version il suffit de supporter le développeur ci-dessous.\n \nTout est là : https://ko-fi.com/s/82e3cab517\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172347/in-ps4-goldhen-payload-v24b13-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] SysDVR 5.5 disponible",
        "content": "Exelix11 reviens aujourd'hui avec une nouvelle version de sysdvr pour notre plus grand plaisir. Pour rappel sysdvr permet de streamer l'écran directement sur son ordi via le wifi ou via un cable. Il est possible d'utiliser sysdvr sur windows, linux et macos.\nVoici un guide de comment l'utiliser : Wiki\n \n\n \n \nChangelog v5.5 :\n \n\n \n\nCompletely fixed USB mode crashes and stuck in \"switching modes\" issues, for real this time.\nThe communication protocol changed, make sure to update both the client on your pc and the sysmodule on your console.\nAfter copying the sysmodule reboot your console.\nOn Windows now we use a new WinUSB driver signed by Google.\nSysDVR will appear as an android device using standard ADB drivers\nIn practice this won't change anything except that now installing drivers is much more streamlined and they come from a more trusted source.\nMemory usage of the full version of SysDVR has been substantially reduced.\nIn general this means SysDVR should cause less crashes when used with other sysmodules\nIf you were using the usb only version due to memory concerns give the full version another chance.\nNow SysDVR-Client is also distributed as a flatpak, this should make installing it on linux much easier solving all dependency issues\nFor the time being flatpak support is considered experimental due to limited testing, let me know of any issues\nInstructions to install the flatpak version have been added to the guide\nFix connection issues when in TCP Bridge mode\nFix libusb errors on arm macs\nMinor bug fixes\n\n \n\n \n \nEn clair, vous aurez (normalement) plus de crash avec le mode usb. Les drivers sur windows ne sont plus les même, il faut donc les reinstaller pour cette version. Sysdvr utilisera moins de mémoire, Sysdvr-client est maintenant distribué sous forme de flatpak pour linux (c'est encore expérimental). Et quelques bugs on été corrigés\nTéléchargement : Sysdvr 5.5\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172306/in-switch-sysdvr-55-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[Vita] SMB2SE Vita v1.0 disponible",
        "content": "Les jeux et homebrews PlayStation Vita continuent de sortir, même si la console n'a pas connue un succès énormissime, il s'est vendue environ 18 millions de consoles, ce qui n'est pas rien non plus. \n \nC'est surtout grâce à sa communauté de développeurs que la PlayStation Vita se démarque, ils sont toujours actifs 12 ans après le lancement de la console, comme Rinnegatamante, un italien qui n'a de cesse de proposer des nouveautés, des utilitaires, des homebrews ou des jeux. \n \nEn voilà un nouveau, Super Monkey Ball 2 Sakura Edition,  il s'agit d'un nouveau portage Android \"direct to Vita\" utilisant le wrapper de TheFlow. Comme vous le savez la solution proposée par TheFlow a permi de proposer de nombreux portages comme The Conduit , Mass Effect Infiltrator , Dead Space , Fahrenheit , Thimbleweed Park , Bully et GTA San Andreas ou encore certains Final Fantasy. \n \n \n\n \n \nSMB2SE Vita v1.0 est un wrapper/portage de Super Monkey Ball 2 : Sakura Edition pour la PlayStation Vita. Le portage fonctionne en chargeant l'exécutable officiel Android ARMv7 en mémoire, en résolvant ses importations avec des fonctions natives et en le patchant pour qu'il fonctionne correctement. En faisant cela, c'est comme si nous émulions un environnement Android minimaliste dans lequel nous exécutons nativement l'exécutable tel quel.\n \n \nTéléchargement : SMB2SE Vita v1.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172285/in-vita-smb2se-vita-v10-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[Wii U] Une puce en développement pour la Wii U",
        "content": "Développer une solution hardware, de type puce, pour la Nintendo Wii U, cela peut paraitre étrange, mais c'est choix qui a été fait par le développeur shinyquagsire23.\n \nLe projet est open-source, heureusement, et permet d'ouvrir l'exécution de boot1 avec un glitch juste après le démarrage de la console, mais avant qu'elle ne commence à exécuter du code. \n \nPour expliquer l'histoire de la puce, il s'agit de la de_Fuse qui a vue le jour sur la Wii Mini, une console qui contrairement à la Wii n'avait pas de hack lors de son arrivée sur le marché. \n \nQuelques semaines après le lancement de la de_Fuse, le développeur a confirmé que son fonctionnement de base était aussi possible sur la console Wii U, avec cependant quelques limites, comme l'impossibilité de réaliser les dumps OTP. \n \n \n\n \n \nMalgré cela la puce permettrait de démarrer directement sur la carte SD, sans passer par l'eMMC interne à la console, une bonne aubaine pour ceux qui aujourd'hui subissent la mort prématurée de leur console. \n \n \n\n \n \nPour le moment, la puce est en développement le développeur s'appuie sur un FPGA pour y arriver, mais cela n'est en rien le design final de la puce, qui pourrait tourner autour des 25 à 35 euros, de toute façon au delà de ce prix, il n'est pas certain qu'elle suscite un grand engouement. \n \n\n \n \n \nLe Github est disponible ici : wii_u_modchip\n \n \n \n\n \n \n \nL'article est disponible ici : defuse-the-one-true-pwn\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172254/in-wii-u-une-puce-en-developpement-pour-la-wii-u-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1172254/in-wii-u-une-puce-en-developpement-pour-la-wii-u-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1172254/in-wii-u-une-puce-en-developpement-pour-la-wii-u-3.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] Ls-News 1.0.0 disponible",
        "content": "Salut à tous, aujourd'hui je vous annonce la sortie de mon nouvel homebrew qui vous permettra de consulter les dernières news de logic-sunrise. Celui-ci est restreint aux 20 dernières news du site car le flux rss du site ne permet pas plus\n \n \nSi vous avez des bugs/recommandations veuillez les mettre ici\n \nTéléchargement : Ls-News 1.0.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172229/in-switch-ls-news-100-disponible-1.jpg"
        }
    },
    "news_9": {
        "title": "[Vita] Apollo Save Tool v.1.2.4 disponible",
        "content": "Le développeur Damian Parrino, connu sous le pseudo Bucanero, propose une nouvelle version d'Apollo Save Tool pour la dernière console portable de Sony, la PlayStation Vita, en attendant la PS5 \"portable\" dont il est rumeur depuis quelques jours.\n \nRappelons pour la forme que Apollo Save Tool est une application qui vous permet de gérer les fichiers de sauvegarde de jeu sur PlayStation Vita et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur votre Vita et de la PSP émulée via Adrenaline.\n \n \n\n \n\n \n \nChangelog : \n \nAjout :\n- Éditeur hexagonal pour les fichiers de sauvegarde (Vita, PSP, PS1)\n- Amélioration du serveur Web interne (prise en charge de la base de données en ligne)\n- URL de la base de données en ligne définie par l'utilisateur (paramètres)\n- Plugin de transfert de clés de sauvegarde de jeux PSP intégré\n- Installer ou désactiver le plugin à partir des outils de l'utilisateur\n \nCorrection :\n- Correction d'un bug lors de l'application de tricheries aux fichiers de sauvegarde PSP\n- Correction d'un gel possible lors de l'utilisation du clavier à l'écran\n \nDivers :\n- Mise à jour du moteur de patch Apollo v0.4.1\n- Sauter la recherche si le motif n'a pas été trouvé\n- Amélioration des types de code 9, B, D\n- Ajout de la prise en charge de la soustraction de valeur (BSD)\n \n \nTéléchargement : Apollo Save Tool v.1.2.4\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172200/in-vita-apollo-save-tool-v124-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1172200/in-vita-apollo-save-tool-v124-disponible-2.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] ZNullPtr partage une mise à jour de ses connaissances",
        "content": "Petit récapitulatif, l'année dernière un exploit a été découvert permettant d'avoir accès au debug settings de la PS5, cependant nous avons eu la confirmation que la sécurité de la PS5 est assez différente de celle de la PS4, Sony ayant appris de ses erreurs passées. \n \nUn exploit kernel n'est désormais plus suffisant pour pouvoir jailbreaker la console, et cela grâce à sont hyperviseur.\n \nLe développeur ZNullPtr avait cependant fait appel à des dons afin de pouvoir acquérir tout un tas de matériel permettant de réaliser certaines recherches spécifiques.\n \nPuis est sorti Mast1c0re qui a monopolisé l'attention, avec logique car il permet tout de même de profiter d'élément sympathique comme l'émulation.\n \n \n\n \n \nMais le développeur ZNullPtr vient d'annoncer sur Twitter que pendant que certains se sont penchés sur le contrôle total de la PS5, lui a réussi quelques progrès sur une solution qui permettra l'arrivée des homebrews. Il n'en dévoile pas plus, mais cela suffit pour créer l'engouement.\n \nBien entendu nous ne savons pas encore si \"cette solution\" sera proposée à un large public, donc \"wait and see\" comme disait l'autre. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172166/in-ps5-znullptr-partage-une-mise-a-jour-de-ses-connaissances-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] Switch L4T Ubuntu v5.1.0 disponible",
        "content": "Comme vous le savez L4T Ubuntu (ou \"Linux 4 Tegra Ubuntu\") est une distribution Linux personnalisée pour les appareils Tegra de NVIDIA, tels que la console de jeu Nintendo Switch. \n \nCette nouvelle version corrige une multitude de bugs et ajoute le support des cartes SD UHS DDR200 qui garantissent des vitesses de lecture jusqu'à 200 Mo/s sur le bus UHS-I (jusqu'à 104 Mo/s).\n \nHekate, qui est considéré comme l'une des principales contributions de CTCaer n'est pas son seul projet. CTCaer a commencé à travailler sur des projets pour la Switch peu de temps après sa sortie en 2017, et L4T Ubuntu est l'un de ces projet open-source populaire. \n \n \n\n \n \nL4T Ubuntu 5.1.0 est maintenant disponible !\n \n- Améliorations extrêmes des performances SD/eMMC\n- Amélioration spectaculaire du mode veille profonde pour T210B01\n- Plus d'options d'overclocking GPU pour T210B01\n- Streaming Widevine\n- Nombreuses améliorations/corrections\n- Mise à jour via \"Software Updater\"\n \nChangelog intégral ici :  ubuchangelog\n \n \nTéléchargement : L4T Ubuntu v5.1.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172154/in-switch-switch-l4t-ubuntu-v510-disponible-1.jpg"
        }
    },
    "news_12": {
        "title": "[Switch/Vita] Take-Two stoppe son procès contre les 4 moddeurs connus de GTA",
        "content": "Comme vous l'avez suivi sur LS, Take-Two avait intenté un procès à 14 moddeurs de GTA, un groupe de 14 personnes qui avait publié des projets de fans, plutôt des solutions de portages de Grand Theft Auto 3 et Grand Theft Auto: Vice City, respectivement re3 et reVC, qui contenait du code signé ou rétroporté sur Nintendo Switch et Sony PlayStation Vita. \n \nL'éditeur Take-Two, travaillant lui même sur son propre remaster officiel de Vice City et de San Andreas, avait décidé d'intenter un procès après avoir fait retirer les pages GitHub de re3 et reVC.\n \n \n\n \nSur les 14 personnes, 4 avaient été nommées (Angelo Papenhoff, Theo Morra, Adrian Graber, Eray  Orçunus) et 10 autres personnes sont jusqu'à présent restées dans l'ombre de l'anonymat. Après des mois de litige devant les tribunaux et un rapport sur un éventuel règlement, les deux parties ont soudainement décidé d'un commun accord de rejeter le procès.\n \nAinsi les avocats de Take Two Interactive Software et l'avocat des défendeurs viennent de convenir que l'ensemble des réclamations formulées dans l'action sont rejetées avec préjudice, chaque partie supportant ses propres frais, dépenses et honoraires d'avocat. Fait intéressant, il est noté dans le document juridique que le rejet de la plainte de Take-Two contre les moddeurs ne s'applique qu'aux défendeurs nommés.\n \nLes 10 autres personnes, qui ne sont pas citées, ne sont donc pas à l'abri de nouvelles poursuites que Take-Two pourraient engager à leur encontre, cependant l'éditeur semble avoir saisi que cela ne lui donnerait pas forcément une bonne image, de plus les regards sont davantage tournés vers GTA 6, et ses problèmes de leaks. \n \n \nDocument disponible ici : Take-Two-v-Papenhoff-Joint-Stipulation-for-Dismissal\n \nPour rappel, Take-Two avait fait de même avec de nombreux moddeurs de GTA V. \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172150/in-switchvita-take-two-stoppe-son-proces-contre-les-4-moddeurs-connus-de-gta-1.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] Les améliorations de Yuzu reportées",
        "content": "Les développeurs de Yuzu viennent de mettre en ligne leur rapport de Mars, c'est à dire la compilation de leur plus grande évolution apportées à leur émulateur Switch sur le mois de Mars. \n \nLa Team concurrente, Ryujinx, n'a pas encore dévoilé de rapport de compilation, elle est moins régulière sur ce point que celle développant Yuzu qui dévoile réellement un rapport mensuellement. \n \n\n \n \n \n \nAinsi la Team Yuzu rapport des améliorations au niveau des performances, des graphiques, de l'audio, de la précision du CPU, des entrées, l'un des changements les plus importants de ce mois est l'ensemble des améliorations apportées à la précision du processeur, et notamment la limite vient rapidement du CPU.\n \n \n\n \n \nEnsuite ils expliquent comment ils ont réussi à améliorer les graphismes, la partie audio, et la gestion des pilotes AMD. Maide travaille sur d'autres améliorations pour la série Xenoblade, comme la correction du scintillement des nuages dans Xenoblade Chronicles 2, des effets de particules dans Xenoblade Chronicles 3 et du scintillement des textures qui affecte l'ensemble de la saga et certains autres jeux. Cependant, ces corrections ont un coût en termes de performances, et il a donc besoin de l'aide d'un autre développeur de GPU pour les optimiser. Peut-être que Blinkhawk pourrait lui donner un coup de main.\n \nNintendo a contribué à la publication du Saint-Graal des extensions Vulkan, VK_EXT_shader_object. Cette extension promet de réduire considérablement la quantité de travail nécessaire à la construction et la gestion des shaders, comme le suggèrent ses dépendances, en exigeant la prise en charge de toutes les extensions d'état dynamique précédentes. Nintendo a probablement l'intention de l'utiliser pour ses émulateurs internes, peut-être pour des raisons de \"compatibilité ascendante\".\n \nEn ce qui concerne le projet Gaia, il est toujours en cours de développement, quant au projet Lime, il en est au stade de la version candidate et fait l'objet de tests internes intensifs.\n \nTout est là : yuzu-emu.org\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1702534560.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1445745528.png"
        }
    },
    "news_14": {
        "title": "[PS4] Duck Hunt Remake VR disponible",
        "content": "Le développeur Lapy propose un tout nouvel homebrew à destination de la PlayStation 4 et PlayStation 4 Pro, à condition de disposer d'un kit PSVR car c'est un jeu VR qui est dévoilé, Duck Hunt Remake avait lui était proposé par Lapy il y a presque 4 ans.  \n \nC'est Duck Hunt Remake VR qui a été mis en ligne, il tient à remercier LightningMods pour avoir documenté l'homebrew, il remercie également VitaHex pour lui avoir indiqué où trouver de très bons modèles 3D, et également megadjx13, un ami qui lui a offert son kit PSVR. \n \n \n\n \n \nBien entendu pour en profiter il faut disposer d'un contrôleur PSMove.\n \n \nTéléchargement : Duck Hunt Remake VR\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172113/in-ps4-duck-hunt-remake-vr-disponible-1.jpg"
        }
    },
    "news_15": {
        "title": "[PS4/PS5] OkageLibrary Mobile 1.0 disponible",
        "content": "Le développeur SvenGDK propose un petit utilitaire qui permet d'envoyer des ELFs et donc de charger des fichiers ISO sur PS4 et PS5 via l'exploit mast1c0re le tout sur un téléphone ou une tablette Android. \n \nIl s'agit là d'une version mobile de OkageLibrary. \n \n \n\n \n \nFonctionnalités de la version 1.0 :\n \n- Envoi d'ELF avec le loader d'ELF en version réseau de mast1c0re\n- Envoi de jeux PS2 au Network Game Loader de mast1c0re\n- Permet d'envoyer les fichiers de configuration \"GAME-ID_cli.conf\" après le transfert d'un jeu (nécessite la dernière version de Network Game Loader)\n- Gestionnaire de sauvegarde PS2\n- Affiche le titre et la couverture du jeu à partir de PSXDatacenter si l'ID du jeu est pris en charge\n \n \nTéléchargement : OkageLibrary Mobile 1.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172089/in-ps4ps5-okagelibrary-mobile-10-disponible-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS3] Apollo Save Tool 1.8.4 disponible",
        "content": "Le développeur Bucanero repart aux sources en proposant une nouvelle version d'Apollo Save Tool pour la PlayStation 3, il vient en effet de mettre à jour son superbe gestionnaire de sauvegardes qui devrait être livré par défaut avec toutes les consoles Sony tellement il est efficace et simple d'utilisation. Ce serait vraiment dommage de se priver de son utilisation si vous disposez d'une console récente Sony. \n \nCette nouvelle version 1.8.4, qui est dédiée à Luna et Leon, apporte pas mal de nouveautés dans l'éditeur hexadécimal, corrige quelques bugs sur certains jeux comme Final Fantasy XIII ou Dai-3-Ji Super Robot Taisen Z, et a mis à jour certains moteurs de vérifications. \n \n \n \n\n \n \nChangelog 1.8.4 : \n \nAjouts\n- Éditeur hexadécimal pour les fichiers de sauvegarde\n- Amélioration du serveur Web interne (prise en charge de la base de données en ligne)\n- Activation personnalisée de l'ID de compte hors ligne (clavier à l'écran)\n- URL de la base de données en ligne définie par l'utilisateur (paramètres)\nCorrections\n- Correction d'un bug de décryptage des sauvegardes de Final Fantasy XIII\nDivers\n- Mise à jour du moteur de patch Apollo v0.4.1\n- Passer la recherche si le motif n'a pas été trouvé\n- Amélioration des types de code 9, B, D\n- Correction du bug de cryptage de Final Fantasy XIII sur PS3\n- Prise en charge de la soustraction de valeur (BSD)\n- Contrôle personnalisée sur Dai-3-Ji Super Robot Taisen Z\n \n \nTéléchargement : Apollo Save Tool 1.8.4\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172085/in-ps3-apollo-save-tool-184-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[Switch] Goldleaf 0.10.1 disponible",
        "content": "Le développeur XorTroll fait son retour sur la scène Switch en proposant une nouvelle version de Goldleaf.\n \nRappelons que Goldleaf, l'équivalent de FBI pour Nintendo Switch, revient avec une nouvelle version qui corrige quelques bugs et apporte le support des derniers firmwares 16.0.0 et 16.0.1. \n \nComme vous le savez Goldleaf est un concurrent à Tinfoil, l'application comprend plusieurs utilitaires, tels que la navigation NAND / SD, l'installation de fichiers NSP et la gestion du contenu ou des tickets.\n \n \n \n \n\n \nChangelog 0.10.1 : \n \n- Mise à jour avec la dernière version de libnx, supportant correctement les firmwares jusqu'à 16.0.1\nGoldleaf \n- Correction d'un bug où l'emplacement de plusieurs installations de NSP était incorrectement sélectionné.\n- La navigation dans le menu de contenu a été améliorée (quitter ne revient pas soudainement au menu principal, etc.)\n- Ajout de la prise en charge du chinois traditionnel\n- Mise à jour des informations sur la génération des clés (pour les dernières versions du système)\n- Les options du menu de contenu sont maintenant correctement définies : le contenu des cartes de jeu a maintenant des options correctes, et d'autres corrections/améliorations dans le code des options.\n- Le dumping est maintenant appelé export, et le contenu exporté va maintenant dans /export au lieu de /dump.\n- Ajout d'un menu pour les paramètres propres à Goldleaf, qui ne permet pour l'instant que de sélectionner la langue personnalisée et d'ignorer les versions de firmware requises lors de l'installation de contenus.\n- Le dumping d'amiibo a été amélioré, permettant maintenant de dumper la zone d'application de l'amiibo (données sauvegardées du jeu) si elle existe, et son mii dans l'ancien format 3DS.\n- Refonte du menu des tickets (tous les tickets, même ceux utilisés, sont désormais affichés), ajout de la possibilité de les exporter.\n- Correction d'un problème où l'annulation de la saisie d'une URL lors de la consultation d'une page web tentait d'ouvrir quand même le navigateur web.\n- Ajout de la prise en charge des icônes spécifiques à une langue dans les installations NSP, de sorte que Goldleaf tente désormais de trouver et d'afficher l'icône correspondant à la langue de Goldleaf (qui est par défaut la langue du système).\n- Correction des valeurs invalides/insensées de \"jeu joué depuis\".\n- A partir de maintenant, Quack et Goldleaf suivront la même numérotation de version : ce sera donc moins confus à partir de maintenant, par conséquent, Quark passe de 0.5 à 0.10.1 dans cette version.\n \n \nTéléchargement : Goldleaf 0.10.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172084/in-switch-goldleaf-0101-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[3DS/Switch] PKHeX du 06 Avril 2023 disponible",
        "content": "Les développeurs de PKHeX viennent de mettre en ligne une nouvelle version de leur outil à destination de la Nintendo 3DS, Switch, et Gamecube. \n \nComme vous le savez avec lui les utilisateurs peuvent manipuler divers fichiers de sauvegarde, y compris : .sav,.dsv,.dat,.gci,.raw et.bin. PKHeX peut également lire et écrire les fichiers.pk, qui sont des fichiers Pokémon individuels, et les fichiers .pgt,.pcd,.pgf,.wc, qui sont des fichiers Mystery Gift.\n \n \n\n \nChangelog : \n \n- Modifié : Les régions Vivillon 3DS fonctionnent. Merci @abcboy101 !\n- Corrigé : Les vérifications BDSP sont correctes\n- Corrigé : Les captures de parcours de Pokéwalker Gen4 sont maintenant autorisées pour toutes les versions.\n- Ajouté : L'éditeur PKM affiche maintenant le type d'élément pour les déplacements.\n- Ajouté : PKM Editor montre maintenant le ruban apposé (ou si un ruban peut être apposé) sur l'onglet cosmétique.\n- Ajouté : Cliquez sur l'indicateur de ruban apposé pour ouvrir l'éditeur de ruban (comme le bouton).\n- Ajouté : Cliquez sur un sprite de ruban dans l'éditeur de ruban pour l'apposer rapidement.\n- Ajouté : La date d'inscription au SV peut maintenant être changée via l'éditeur de blocs. Merci @foohyfooh !\n- Ajouté : Plus de fonctionnalités Gen3 Mystery Gift API ajoutées. Merci @Bl4ckSh4rk !\n- Corrigé : L'importation de Cadeaux Mystères dans le 11ème emplacement de la liste de Cadeaux Mystères de l'interface graphique du fichier de sauvegarde fonctionne maintenant comme prévu.\n- Corrigé : L'Œuf de Manaphy Gen4 est maintenant généré correctement à partir de la base de données des rencontres.\n- Corrigé : Gen4/5 Country/Region ne génère plus d'erreur pour certains pays.\n- Corrigé : Les statistiques de la Gen1/2 se calculent maintenant correctement (EVs à racine carrée parfaite).\n- Modifié : Mise à jour de la manipulation pour générer et vérifier correctement la taille des entités WC9.\n- Modifié : Plus d'améliorations de performance réduisant les allocations.\n \n \nTéléchargement : PKHeX 23.04.06\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-909709169.png"
        }
    },
    "news_19": {
        "title": "[Gamecube] Installer un SSD dans sa console sera bientôt possible",
        "content": "Il aura finalement fallu que le cube préféré des gamers atteigne sa vingtaine pour connaître un très fort regain d'intérêt dans le monde du hacking. Ces trois dernières années ont en effet été très prolifiques en matière de hack sur la Nintendo Gamecube : PicoBoot, SD2SP2, PlutoGC HDMI, KunaiGC, MemCard Pro GC, BlueRetro, sans compter les mises à jour très fréquentes de Swiss, l'outil indispensable pour tout hacker Gamecube.\n \nCette période hautement productive semble également stimuler considérablement la créativité des hackers. En effet, ils ne se limitent pas à optimiser les réalisations existantes, mais recherchent constamment de nouvelles approches pour moderniser la console et résoudre des problèmes récurrents. A ce titre, la question du stockage et des vitesses de transfert demeure toujours d'actualité : même avec les configurations actuelles, il est impossible d'atteindre des performances équivalentes à celles d'un disque de jeu lorsqu'on charge une copie de sauvegarde depuis une carte mémoire (via le lecteur de cartes mémoire ou un SD2SP2). Le hacker WebHDX, connu pour être à l'origine du PicoBoot, mais aussi du WiiMini-SDRST, s'est attardé sur ce sujet et a élaboré une nouvelle solution baptisée M.2 Loader. \n \n\n \nCe kit à installer dans le port série 1 (SP1), permet de connecter un SSD au format M.2 (non NVMe) à votre console, afin d'y lire vos copies de sauvegardes de jeux Gamecube sous tous les formats supportés par Swiss. Le célèbre logiciel supportera nativement le M.2 Loader, grâce à un travail collaboratif entre WebHDX et emukidid.\n \nSur le plan technique, il est intéressant de noter que les ports de carte mémoire Gamecube, le port SP1 et le port SP2 sont tous gérés par le même bus (qui permet le transfert des données), à savoir le \"Exi Bus\". Pour autant, si les SD2SP2 et SD Gecko ne font que transférer leurs données directement à ce bus, le M.2 Loader est bien mieux pensé, exploitant une puce (de type CPLD, donc programmable) pour opérer au transfert des données jusqu'à la console. Cela permet donc un meilleur traitement et une meilleur optimisation dans les transferts, ce qui résulte en des performances accrues. Lorsque le M.2 Loader sera produit pour le grand public, il est prévu que cette puce soit celle du Raspberry Pi Pico (encore lui !), certainement pour son accessibilité et son coût faible. \n \nLe youtubeur Macho Nacho a eu la possibilité de tester le M.2 Loader en exclusivité. Une vidéo de présentation détaillée et d'installation est d'ores et déjà disponible sur sa chaîne. \n \nhttps://youtu.be/1uxu8anymDg\n \nAffaire à suivre ! ",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172034/in-gamecube-installer-un-ssd-dans-sa-console-sera-bientot-possible-1.jpg"
        }
    },
    "news_20": {
        "title": "[XBS/XBX/XBO] Microsoft bloque les émulateurs en Retail",
        "content": "Triste nouvelle que l' on apprend aujourd'hui, Microsoft vient en effet de déclarer vouloir combattre les applications non officiel en mode retail, ce qui implique donc les émulateurs et autre homebrew disponible depuis un petit moment sur nos Xbox One et Séries.\n \n\n \nSuite à cette déclaration, le simple fait de se connecter au Xbox Live, toutes les applications non officielles installés en mode retail vous donneront maintenant une erreur 0x87e1002d, comme vous pouvez le voir ci dessous, le message est clair.\n \n\n\n\n\"0x87e1002d \nThis game or app can't be launched as it violates the Microsoft Store Policy.\"\n \n\n\n\n \nMalgré cette mauvaise nouvelle, il vous sera toujours possible de lancer des émus sur vos Xbox:\n \n- Soit en mode dev, ce qui implique bien sur de posséder un compte développeur afin de switcher dans ce mode pour exécuter vos homebrews et émulateurs.\n \n- Soit d' utiliser les sites d'hébergement online d' émulateurs comme je vous l' informait il y a peu avec cette news: https://xbox-360.logic-sunrise.com/news-1166940-xbsxbxxbo-emulateurs-sans-dev-mode-ni-installation-ni-ftp.html\n \nPetite note personnelle,comme me l'a fait remarquer mon grand ami Hyndrid, l' arrivé de Xenia sur Xbox doit y est grandement pour quelque chose, pouvoir lancer des isos XBOX 360 depuis le mode retail n' a pas du plaire à Microsoft, qui avant çela n'était pas déranger sur  le fait que l' on puisse lancer des émulateurs D AUTRES CONSTRTUCTEURS sur leur console.\n \nBref de ce fait, les Xbox One et Séries perdent un atouts majeur face à leur concurrentes, même si je le rappelle il est toujours possible de lancer nos homebrews en dev mod.\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-452068714.png"
        }
    }
}