{
    "news_1": {
        "title": "[Switch] Mig Switch devient Mig Flash et dévoile son nouveau site",
        "content": "Après plusieurs jours d'absence, voilà que la team Mig Switch est de retour, après avoir mis temporairement en ligne le site www.migswitchru.com début Juillet afin de contrer l'action de Nintendo, la team vient d'annoncer son changement de nom. \n \nDans un message livré sur un nouveau site internet, la team Mig Switch annonce qu'il faut désormais l'appeler Mig Flash, et elle s'explique sur ce changement. \n \n \n\n \n \n \n15/07/2024 : CHANGEMENT DE NOM, NOUS SOMMES MAINTENANT MIG FLASH !\n \nNous devenons Mig Flash. La raison en est encore une fois le puissant lobbying (la corruption dans la plupart des cas) entre les grandes entreprises et les législateurs de certains pays puissants (nous ne donnerons aucun nom, tout le monde le sait ) .\n \nPour une raison quelconque, le mot « Switch » ne peut désormais plus être utilisé sans le consentement de la société Nintendo©. Même si c'est juste pour expliquer qu'un produit est fait pour (ou compatible avec) un appareil fabriqué par une autre société.\n \nPour nous, c'est scandaleux. Mais c'est comme ça, et bien que nous ne soyons pas situés aux États-Unis, puisqu'ils semblent contrôler l'ICANN et quelques autres institutions avec lesquelles nous devons opérer, nous avons décidé de changer notre nom en Mig Flash.\n \nVeuillez noter qu'il n'y a pas d'autre changement que ce changement cosmétique. Le produit est le même et fonctionne de la même manière, nouveau ou ancien.\n \nDésolé pour cela, et nous continuerons à vous apporter de bonnes surprises à l'avenir.\n \n \n \nTout est là désormais : https://migflash.com/\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193739/in-switch-mig-switch-devient-mig-flash-et-devoile-son-nouveau-site-1.png"
        }
    },
    "news_2": {
        "title": "[Switch] L'UnlockSwitch livré mais pour le moment inutilisable",
        "content": " \nL'UnlockSwitch commence à être livré à tous ceux qui ont la chance de le recevoir en exclusivité, ou qui ont payé les droits de douanes parfois conséquents, une quarantaine d'euros, pour passer les frontières, mais ça y est il commence à être livré dans sa version PCB violet. \n \n \n\n \n \n \nEn conséquence, les premières vidéos de unboxing commencent à tourner, mais par contre pour l'heure la partie logicielle n'est pas fournie, de fait il est impossible pour le moment de l'utiliser en l'état puisqu'il n'est pas fourni avec le code source. \n \nNiveau packaging, ils ont bien fait les choses, le linker, son programmeur, et son câble flex sont bien protégés dans la boite plastique, qui ne porte aucune étiquette, aucune référence si ce n'est \"Unlock Switch\" sur le dessus de la boite.\n \n \n\n \n \nPour le reste, il faudra attendre que la team propose au téléchargement le logiciel firmware pour flasher le linker et enfin pouvoir le mettre dans la console. Si vous aussi vous avez reçu votre UnlockSwitch, n'hésitez pas à faire tourner quelques photos. \n \n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193660/in-switch-lunlockswitch-livre-mais-pour-le-moment-inutilisable-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1193660/in-switch-lunlockswitch-livre-mais-pour-le-moment-inutilisable-1.png"
        }
    },
    "news_3": {
        "title": "[PS3] IrisMan 4.91.1 mis à jour par Aldostools",
        "content": " \nLe développeur Aldostools nous propose une mise à jour du loader IrisMan, comme vous le savez, IrisMAN est un fork d'Iris Manager du développeur Estwald mais bénéficiant de nombreuses fonctionnalités et entièrement open-source. Il s'agit ni plus ni moins du deuxième gestionnaire de backups le plus utilisé après multiMAN sur la PS3.\n \n \n\n \n \nLa mise à jour intègre la toute dernière version de Mamba 8.4, mais aussi exFAT Manager en version 0.9, une nouvelle couleur de thème, mais ce n'est pas tout le développeur a intégré aussi une nouvelle police et a corrigé des bugs dans le gestionnaire de fichiers.\n \n \n\n \n \nTéléchargement : IRISMAN 4.91.1 (update du 23/07/24)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193634/in-ps3-irisman-4911-mis-a-jour-par-aldostools-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1193634/in-ps3-irisman-4911-mis-a-jour-par-aldostools-2.png"
        }
    },
    "news_4": {
        "title": "[PS5] Sony sort le firmware 9.60 pour la PS5",
        "content": "Sony vient de mettre en ligne un nouveau firmware il y a quelques heures pour la PS5, il s'agit de la version 24.05-09.60.00.04-00.00.00.0.1 de la mise à jour système. \n \nUn peu plus d'un mois après le firmware 9.40, Sony dégaine le 9.60, et pour ne rien vous cachez il y a très peu d'informations à son sujet, cette mise à jour semble apporter quelques améliorations mineures notamment liées à des sessions de jeux. \n \n \n\n \n \nVersion : 24.05-09.60.00 :\n \n- Vous pouvez inviter d'autres joueurs à des sessions de jeu en partageant une URL menant à la session en question. \n- Pour inviter d'autres joueurs, ouvrez la carte d'action de la session de jeu, puis sélectionnez Partager le lien. Ensuite, scannez le code QR avec votre appareil mobile pour partager le lien.\n- Cette fonctionnalité est uniquement disponible pour les sessions ouvertes accessibles à tous. \n- Cette fonctionnalité sera progressivement disponible pour tous les joueurs d'ici au 24 juillet.\n- La commande vocale permet désormais d'ouvrir les cartes d'action Aide au jeu. Pour ce faire, dites \"Show Game Help\" (Afficher l'Aide au jeu). \n \n- Pour le moment, l'option Commande vocale (Aperçu) n'est disponible qu'en anglais pour les joueurs disposant d'un compte pour le PSN enregistré aux États-Unis et au Royaume-Uni. \n- Nous avons amélioré les performances et la stabilité du logiciel système. \n- Nous avons mis à jour le logiciel de certaines manettes sans fil DualSense afin d'améliorer leur stabilité. \n- Nous avons amélioré les messages et l'ergonomie de certains écrans.\n \nTaille maximale de fichier : 1,192,286,720 octets\n \n \n \nAu niveau du hack, il est trop tôt pour dire si ce firmware 9.60 corrige une faille, mais il semble plus amener des améliorations que des corrections. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193633/in-ps5-sony-sort-le-firmware-960-pour-la-ps5-1.png"
        }
    },
    "news_5": {
        "title": "[WiiU] Bloopair v1.0.0 disponible avec Koopair",
        "content": " \nLe développeur GaryOderNichts propose depuis quelques heures une nouvelle version de Bloopair qui est maintenant proposé en v1.0.0. \n \nPour rappel, il s'agit d'un homebrew qui donne le pouvoir d'utiliser divers contrôleurs Bluetooth directement sur la Wii U en tant que contrôleur Wii U Pro sans logiciel ou matériel supplémentaire. Bloopair se charge de patcher temporairement le module IOS-PAD et s'assure qu'il accepte tous les contrôleurs Bluetooth. De plus, il convertit les requêtes HID reçues (boutons, etc.) en conséquence. Jusqu'à quatre contrôleurs peuvent être connectés, les vibrations et l'indicateur de batterie fonctionnent.\n \n \n\n \n\n \n \nAprès plus d'un an, voici l'une des plus grosses mises à jour de Bloopair !\n \nChangelog :\n \n- Bloopair dispose maintenant d'un système de configuration, qui peut charger les options du contrôleur et les mappages des boutons depuis la carte SD.\n- Les sticks peuvent être mappés comme des boutons et les boutons peuvent être mappés comme des sticks.\n- Les axes des sticks peuvent être inversés.\n- Chaque bouton/bâton peut être associé à plusieurs boutons/bâtons aux deux extrémités.\n- Les configurations peuvent être appliquées à un contrôleur spécifique ou à tous les contrôleurs d'un type spécifique.\n- Les configurations sont stockées sous wiiu/bloopair sur la carte SD.\n- Une nouvelle application compagnon Bloopair est maintenant fournie avec la version 1.0.0 : Koopair !\n \nKoopair peut :\n \n- Tester les boutons et les sticks des manettes à l'aide du testeur de manettes intégré.\n- Editer et créer des mappings de contrôleurs.\n- Modifier les options des contrôleurs.\n- Gérer les configurations de manettes sauvegardées.\n- Appairer les manettes DualShock3 via USB. L'ancienne application d'appairage a été abandonnée et supprimée des versions en faveur de Koopair.\n- et bien plus encore dans un futur proche...\n \n \nTéléchargement : Bloopair v1.0.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193559/in-wiiu-bloopair-v100-disponible-avec-koopair-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1193559/in-wiiu-bloopair-v100-disponible-avec-koopair-2.png"
        }
    },
    "news_6": {
        "title": "[PS3/PS4/Vita] Apollo CLI tools v1.1.0 disponible",
        "content": "Le développeur Bucanero propose une nouvelle version de son outil appelé Apollo CLI tools, comme vous le savez Bucanero est à l'origine d'Apollo Save Tool sur PS3, PS4 et Vita, mais là c'est un peu particulier puisque CLI Tools est multiplateforme. \n \nCLI Tools permet d'appliquer l'assistant de sauvegarde et les codes de patch BSD à un fichier de données. La bibliothèque et les outils de ligne de commande implémentent un moteur de sauvegarde de données qui prend en charge les codes Save Wizard/Game Genie et les scripts Bruteforce Save Data.\n \n \n\n \n \nCette nouvelle version ajoute la prise en charge d'AES CBC avec la commande de script BSD script aes_cbc(key, iv), mais cette version améliore aussi deux autres commandes de sous-types. \n \n \nTéléchargement : Apollo CLI tools v1.1.0\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193558/in-ps3ps4vita-apollo-cli-tools-v110-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[PS4/PS5] FetchPKG proposé par John Tornblom pour builder les mises à jour officielles facilement",
        "content": " \nLe développeur John Tornblom propose depuis quelques heures FetchPKG sous ce nom se cache un nouveau programme permet de construire des PKG pour les PlayStation 4 et PlayStation 5. \n \nSelon l'auteur, il s'agit d'un outil simple basé sur cURL ( https://curl.se/ ) pour télécharger les mises à jour officielles des jeux Sony Playstation 4 et 5, et ainsi créer très simplement un fichier PKG.\n \n \n\n \n \nFetchPKG est disponible pour GNU/Linux, Windows (64bit), et les PS5 jailbreakées. Les mises à jour de jeux qui sont réparties sur plusieurs fichiers sont fusionnées automatiquement pendant le téléchargement. Si vous êtes derrière un pare-feu, vous pouvez télécharger les mises à jour via un serveur proxy, ce qui est pratique lorsque vous utilisez une PS5 jailbreakée qui est protégée de l'internet.\n \nPour exécuter Fetchpkg sur PS5, vous devez le charger avec un loader ELF qui fournit une interface de ligne de commande, par exemple, shsrv, et les moyens de transférer l'ELF vers la ps5, par exemple, ftpsrv. Il vous faudra lancer les commandes qui téléchargeront le fichier ELF dans /data, qui se connecteront à shsrv et qui téléchargeront un fichier pkg dans /mnt/usb0 via un serveur proxy.\n \n \nTéléchargement : fetchpkg v0.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193489/in-ps4ps5-fetchpkg-propose-par-john-tornblom-pour-builder-les-mises-a-jour-officielles-facilement-1.png"
        }
    },
    "news_8": {
        "title": "[XBO/XBS/XBX] Carrot c4k3 met à jour un script de son exploit kernel",
        "content": " \nCarrot c4k3 nous informe qu'il réfléchit sur son exploit, un exploit kernel qui aura secoué une scène Microsoft qui dormait depuis plus de 10 ans, ce n'est donc pas rien. Le développeur est mécontent du point d'entrée, et pour cause, pour pouvoir profiter de son exploit, il faut avoir téléchargé l'app Game Script qui a été retirée. Cela a pour effet de limiter directement le nombre de personnes qui peuvent accéder à l'exploit. \n \n \n\n \n \nIl n'est cependant pas interdit de chercher des optimisations, et c'est ce qu'à fait Carrot c4k3, il a fait évoluer son script afin qu'il ne soit plus nécessaire d'utiliser \"adv file explorer\". Il l'affirme, cet outil n'est plus nécessaire pour exécuter \"Collateral damage\", il a fallu pour cela utiliser une version du script au format rubber ducky.\n \nEn fait il faut utiliser un payload spécifique taillé par exemple pour un émulateur de périphérique, comme le permet par exemple un Flipper Zero qu'il a utilisé pour l'occasion, d'où l'arrivée de cette version \"remote\". \n \n \nTéléchargement : collateral_damage_v1_remote\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193438/in-xboxbsxbx-carrot-c4k3-met-a-jour-un-script-de-son-exploit-kernel-1.png"
        }
    },
    "news_9": {
        "title": "[PS3] CFW Flash Writer d'Aldostools pour le firmware 4.91",
        "content": "Le développeur Aldostools propose sa version de CFW Flash Writer supportant HFW 4.91 pour la PlayStation 3. Bien entendu, il s'agit d'une version non officielle, le logiciel étant à l'origine proposé par esc0rtd3w \n \n Cela peut être un candidat secondaire pour permettre l'installation de Custom Firmware lorsque le PS3Toolset de bguerville (https://www.ps3toolset.com/bgtoolset/) n'est pas accessible ou une option hors ligne d'auto-hébergement. \n \n \n\n \n \nFlash writer permet d'installer un CFW à partir du 4.91 OFW une fois le firmware hybride installé, cependant, Ps3toolset reste la méthode préférée et la plus sûre lorsqu'il est disponible pour pirater votre modèle de PS3 afin qu'il soit prêt pour les installations de Custom Firmware PS3.\n \nCette version de \"PS3Xploit\" Flashwriter 4.91 préparée par Aldostools a été testée sur NOR et NAND. \n \n \nTéléchargement : CFW Flash Writer d'Aldostools pour l'HFW 4.91\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193436/in-ps3-cfw-flash-writer-daldostools-pour-le-firmware-491-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS4/PS5] Pourquoi TheFlow ou TyphoonCon ne publient rien au sujet de la conférence PS4 et PS5",
        "content": "La conférence Typhoon aura largement attiré les regards, il faut dire que le plus célèbre des hackers, TheFlow, y a participé pour tenir une présentation qu'on se délectait de découvrir, cependant rien n'a été dévoilé ou juste une photo que nous vous avions montré, avec la vision sur un slide de la trentaine que doit contenir celle de TheFlow. \n \n \n\n \n \nPourquoi presque 2 mois après la présentation rien n'a été dévoilé ? \n \nLa première des explications est que TyphoonCon, malgré le fait d'avoir bien entendu filmé avec deux caméras (une en face, et une sur le côté droit de TheFlow), n'a pas obtenu encore l'autorisation du hacker. La seconde est que TheFlow lui même n'a pas encore donné son accord de diffusion. Il l'a fait précédemment en dévoilant directement ses présentations sur son github, il le fera mais pas encore. \n \n \n\n \n \nMais pourquoi alors ne pas diffuser ? \n \nEn cherchant un peu des nouvelles images de cette présentation, nous sommes tombés sur les Highlights de la TyphoonCon qui pour rappel s'est tenue du 30 au 31 Mai 2024 à Séoul.\n \n \n\n \n \nDans cette vidéo, on voit bien à 01.00 min de la vidéo ci-dessous que TheFlow est filmé sous un autre angle que celui de la photo officielle, ce qui confirme la présence de la seconde caméra. \n \n \n \n\n \n \n \nMais alors pourquoi ne pas dévoiler ses vidéos ou sa présentation ? \n \nCe n'est pas la peur de Sony ou la remontée des failles, car ça on a bien compris depuis longtemps que TheFlow et Sony sont en lien de coopération, Sony préférant rémunérer les génies plutôt que de leur faire des procès comme Nintendo. Cependant la seule explication rationnelle que l'on peut admettre est que TheFlow a une autre présentation le 28 Septembre 2024. \n \n \n\n \n \nEn effet se tient une autre conférence, la RomHack 2024 à Rome (Italie) où TheFlow va intervenir pour présenter la \" PlayStation 4 Remote Kernel Exploitation \", probablement la même présentation que celle qu'il a effectué à la TyphoonCon. A noter aussi la présence de celui qui a proposé mast1c0re, McCaulay Hudson, même si sa présentation n'aura aucun lien avec son exploit. \n \n \n \n\n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193404/in-ps4ps5-pourquoi-theflow-ou-typhooncon-ne-publient-rien-au-sujet-de-la-conference-ps4-et-ps5-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1193404/in-ps4ps5-pourquoi-theflow-ou-typhooncon-ne-publient-rien-au-sujet-de-la-conference-ps4-et-ps5-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1193404/in-ps4ps5-pourquoi-theflow-ou-typhooncon-ne-publient-rien-au-sujet-de-la-conference-ps4-et-ps5-1.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1193404/in-ps4ps5-pourquoi-theflow-ou-typhooncon-ne-publient-rien-au-sujet-de-la-conference-ps4-et-ps5-2.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1193404/in-ps4ps5-pourquoi-theflow-ou-typhooncon-ne-publient-rien-au-sujet-de-la-conference-ps4-et-ps5-3.png",
            "image_6": "https://www.logic-sunrise.com/images/news/1193404/in-ps4ps5-pourquoi-theflow-ou-typhooncon-ne-publient-rien-au-sujet-de-la-conference-ps4-et-ps5-3.jpg"
        }
    },
    "news_11": {
        "title": "[PS4] Sony sort le firmware officiel 11.52 pour la PS4",
        "content": "Sony vient de mettre en ligne une mise à jour pour nos PS4, il s'agit du firmware 11.52, certains utilisateurs PS4 Pro se plaignent déjà de cette mise à jour les obligeant à passer en mode sans échec pour faire l'update via une clé USB. Il peut s'agir de cas isolés, mais sachez qu'une fois n'est pas coutume Sony a publié un changelog. \n \n \n\n \n \nNotes de patch Version 11.52 :\n \n- Nous avons amélioré les messages et la convivialité sur certains écrans.\n- Nous avons apporté quelques correctifs de sécurité au logiciel système.\n \nBon, pas de quoi s'extasier non plus, mais il est probable que cette mise à jour vise à corriger une faille.\n \n \nComme toujours, le mieux est de ne pas mettre à jour votre console en la débranchant d'internet et en la protégeant avec un bloquer de mise à jour proposé dans n'importe quel bon host. Il ne serait pas étonnant de voir débarquer une mise à jour PS5, ce serait alors signe qu'une faille aurait été corrigée également, seul le temps nous le dira. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193400/in-ps4-sony-sort-le-firmware-officiel-1152-pour-la-ps4-1.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] L'UnlockSwitch sera proposé à 24.90 $, l'Xtractor à 34.90 $ et le kit à 59.90 $",
        "content": " \n \nLa Team UnlockSwitch vient de dévoiler les prix auquel sa solution sera proposée, à l'origine l'équipe avait l'intention de proposer l'UnlockSwitch PBS a 29.90 $, mais cela a déjà été corrigé puisque son prix sera finalement de 24.90 $.*\n \nPlusieurs informations importants ont été communiquées par l'équipe, la première d'entre elles est que les premiers modèles envoyés aux bêta-testeurs ne sont que des prototypes de démonstration et pas la version finale qui sera encore améliorée. Les images et les vidéos de la version finale seront proposées avant le lancement officiel.\n \n \n\n \n \nLa production des 10 000 premières unités de l'UnlockSwitch PBS ainsi que son programmateur débutera le 01 Août 2024. La team rappelle que l'éditeur sera disponible en kit avec l'Xtractor, rendant impossible l'achat séparé. \n \nMalheureusement, l'antenne Wifi ne sera pas intégrée dans l'UnlockSwitch PBS, le constructeur faisant étant d'un retard de livraison, dommage. La conséquence est la baisse du prix de vente à 24.90 $ au lieu des 29.90 $.\n \nVoici enfin les prix finaux des produits :\n \n- La commercialisation et l'expédition commenceront vers le 15-20 août.\n- L'UnlockSwitch PBS sera vendu à 24.90 USD (en raison de l'absence d'antenne WiFi)\n- L'Xtractor seul sera vendu au prix de 34,90 USD.\n- Le kit, comprenant l'UnlockSwitch PBS, le programmateur et l'Xtractor, sera vendu au prix de 59,90 USD.\n \nAutre petit point noir, peu de détail sur Xtractor, si ce n'est qu'il est presque terminé, des échantillons de test devraient arriver d'ici la fin du mois de Juillet, les spécifications ne sont pas encore totalement arrêtées et seront dévoilées lors d'une présentation officielle. \n \nAu sujet de l'antenne WiFi l'équipe dit avoir commandé 50 000 puces mais que le fabricant ne les livrera pas à temps pour qu'elles puissent être intégrées, c'est quand même un peu dommage, sachant que la team a toujours revendiqué le fait de ne pas être pressée, finalement cela semble un peu changer sur cet aspect, il faut dire que Nintendo fait désormais pression sur ce type de linker. \n \nSi on se résume, la production de 10 000 unités ne comprenant pas le WiFi sera vendue autour du 15 Août 2024 à 24.90 $, mais qu'ensuite seule la version à 59.90 $ sera commercialisée, vendu avec Xtractor. Vu que la team a commandé 50 000 puces WiFi il y a fort à parier qu'une version améliorée verra rapidement le jour intégrant le WiFi. \n \nTout est là : x.com/UnlockSwitch\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193209/in-switch-lunlockswitch-sera-propose-a-2490-lxtractor-a-3490-et-le-kit-a-5990-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS3] La dixième Bêta du CFW Evilnat 4.91.2 PEX/D-PEX avec Cobra 8.5 disponible",
        "content": " \nPlus de 2 mois se sont écoulés depuis la neuvième version du célèbre CFW de Nathan Martin, voilà que débarque la dixième version bêta du CFW Evilnat 4.91.2, espérons que cela soit la dernière avant la version finale. \n \nCette version vient intégrer le plugin de téléchargement étendu de DeViL303 et a remplacé le plugin DEX game_ext_plugin.sprx par celui du CEX afin d'éviter les problèmes avec PS Plus. \n \n \n \n\n \n \n \n \nSeules les versions PEX et D-PEX sont proposées, le développeur précisant que les autres variantes seront livrées avec la version finale, faut-il y voir enfin la délivrance de la version stable ? \n \n \nChangelog CFW Evilnat 4.91.2 [BETA 10] :\n \n- Ajout du plugin de téléchargement étendu par DeViL3O3\n- CEX game_ext_plugin.sprx remplace la version DEX pour éviter les problèmes avec PS Plus\n \n \nTéléchargement : CFW Evilnat 4.91.2 PEX / D-PEX avec Cobra 8.5\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193203/in-ps3-la-dixieme-beta-du-cfw-evilnat-4912-pexd-pex-avec-cobra-85-disponible-1.jpg"
        }
    },
    "news_14": {
        "title": "[3DS/2DS] Red Viper v0.9.6 disponible",
        "content": " \nNotre ami sunriseur Wargla nous propose de découvrir Red Viper, sous ce nom se cache un émulateur de Virtual Boy, le Virtual Boy est une console de jeux vidéo créée par Nintendo en 1995 au Japon et aux États-Unis, se présentant sous la forme d'un visiocasque 3D.\n \nTentant l'innovation avec un affichage stéréoscopique, la console est finalement un échec commercial. Malgré plusieurs baisses de prix, les ventes ne décollent pas et la commercialisation de la console en Europe sera annulée. Le projet est alors abandonné par Nintendo en 1996, par contre ce sont 770 000 unités vendues, et 22 jeux, et désormais cette console se négocie à plus de 500 euros (environ 200 euros à l'origine bien trop cher pour l'époque). \n \n \n\n \n \n \nAfin de vivre ou revivre l'expérience à moindre frais, il est possible de découvrir la console via l'émulation. Red Viper est l'une des meilleures solution de restitution actuelle, devançant même celle de RetroArch par exemple.\n \nNotre ami sunriseur nous propose de le découvrir car il tourne à la perfection sur la OLD 3DS, sans ralentissement, et techniquement parlant il s'appuie sur les aspects 3D de la 3DS à la perfection. \n \n \n \n\n \n \n \nLa dernière version disponible est sortie il y a quelques jours, la version 0.9.6 :\n \n- Ce patch ajoute un mode anti-scintillement et un affichage d'entrée.\n- Ajout d'une option anti-scintillement pour atténuer les problèmes de rétention d'image, en particulier sur les modèles IPS.\n- Ajout d'une nouvelle entrée sur l'affichage (les boutons s'allument en rouge si le mode turbo est activé et en bleu si le mode bascule est activé)\n- Correction d'un bug critique où l'émulateur se bloque au démarrage d'un jeu si le répertoire d'accueil n'existe pas.\n \nTéléchargement : Red Viper v0.9.6\n \nMerci Wargla pour l'information en MP. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193197/in-3ds2ds-red-viper-v096-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[XBO/XBS/XBX] Carrot c4k3 publie son exploit kernel pour Xbox One et Series S/X",
        "content": "Le développeur Carrot c4k3 dévoile enfin son exploit kernel à destination de la Xbox One et des Xbox Series S et Series X. \n \nLes premiers retours nous informe qu'il est possible de lire les sauvegardes de jeux en les ouvrant en mode développeur. \n \nL'exploit a été appelé \"Collateral Damage\", il s'agit du premier exploit kernel public pour Xbox utilisant le systemOS s'appuyant sur la faille CVE-2024-30088. L'exploit kernel est fonctionnel sous les mises à jour 25398.4478, 25398.4908, et 25398.4909.\n \n \n\n \n \nLe point d'entrée initial est l'application Game Script UWP.\n \nCet exploit a été développé par Emma Kirkpatrick (découvert et exploit des vulnérabilités) et Lander Brandt (développement de loaders PE).\n \n\nComme vous pouvez le voir l'exploit est numéroté v1 cela signifie forcément qu'il va évoluer avec le temps. \n \nCette version initiale est principalement destinée aux développeurs. Actuellement, un moyen de placer des fichiers dans le répertoire LocalState de Game Script est nécessaire via une application telle que Adv File Explorer (FullTrust). Ceci est dû à la nécessité de placer les fichiers stage2.bin et run.exe dans le répertoire LocalState. Dans un avenir proche, un payload sera fourni pour charger ces fichiers sur le réseau, de sorte que le payload initial sera simplement un script qui peut être saisi via un émulateur de clavier USB.\n \nL'exemple de reverse shell fourni ici nécessite que votre console soit connectée à un réseau. Lorsque vous connectez votre console à un réseau, veillez à ne pas vous connecter à Internet et aux mises à jour. Essayez de bloquer la connectivité à Xbox LIVE autant que possible, au moins en réglant vos DNS sur des serveurs non valides.\n \nCet exploit n'est pas totalement fiable. Il s'appuie sur un canal latéral du processeur ainsi que sur une condition de course, qui peuvent tous deux échouer. En cas d'échec, l'exploit peut vous en avertir par le biais d'une sortie réseau, ou la console elle-même peut se bloquer et redémarrer.\n\n \nUsage \n \n\n- Modifiez la ligne 7 de gamescript_autosave.txt pour qu'elle contienne l'IP locale de votre PC.\n- Copiez gamescript_autosave.txt, stage2.bin et run.exe dans le répertoire LocalState de l'application Game Script sur votre console (Q:\\NUsers\\NUserMgr0\\NAppData\\NLocal\\NPackages\\27878ConstantineTarasenko.458004FD2C47C_c8b3w9r5va522\\NLocalState\\N).\n- Lire le port 7070 sur votre PC à l'aide de netcat ou d'un outil similaire (exemple de commande : nc64.exe -lvnp 7070)\n- Ouvrez l'application Game Script sur votre console, sélectionnez \"Show Code Run window\" et cliquez sur \"Run code once\".\n\nSi l'exploit réussit, vous devriez voir apparaître sur votre PC un message ressemblant à ce qui suit :\n \nlistening on [any] 7070 ...\nconnect to [192.168.0.61] from (UNKNOWN) [192.168.0.130] 49665\nCollateral Damage - @carrot_c4k3 & @landaire (exploits.forsale)\nBuild number: 25398.4478\nAttempting to find kernel base...\nFound likely kernel base: FFFFF80AF9800000\nAttempting exploit...\nExploit succeeded! Running payload!\n\nMicrosoft Windows [Version 10.0.25398.4478]\nCopyright © Microsoft Corporation. All rights reserved.\n\nS:\\>\n \n \n \nBeaucoup de travail supplémentaire est nécessaire pour faire de cet outil, un outil convivial de chargement d'homebrews sur Xbox, mais il est déjà un bon point de départ. Si vous souhaitez vous amuser à exécuter du code en tant que SYSTEM, vous pouvez mettre votre code dans la fonction post_exploit dans post_exploit.c.\n\n \nIl y a encore beaucoup à faire sur ce sujet, mais comme la partie kernel est terminée, Carrot c4k3 voulait la partager avec la communauté pour que les développeurs puissent commencer à utiliser les privilèges SYSTEM. Voici quelques éléments qu'il espère encore ajouté dans l'avenir :\n \n- Support du chargement latéral\n- Lancement de processus non-signés non-UWP\n- Support SSH\n\n \n \nTout est là : Dommage Collatéral\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193194/in-xboxbsxbx-carrot-c4k3-publie-son-exploit-kernel-pour-xbox-one-et-series-sx-1.jpg"
        }
    },
    "news_16": {
        "title": "[XBS/XBX] L'app Game Script pourrait revenir mais attention au ban",
        "content": " \nComme vous le savez, l'exploit kernel pour les Xbox (One, series X et series S) va être proposé dans les jours qui viennent, cependant pour en profiter il faudra disposer de l'application Game Script qui a rapidement été retirée par Microsoft. \n \nDe nombreux utilisateurs n'ont pas eu le temps de la télécharger avant qu'elle ne soit retirée, ce qui fait que certains se demandent comment l'obtenir. Il reste encore un peu d'espoir, mais pour cela il faudrait disposer d'un compte partenaire Microsoft. \n \nPour redonner de l'espoir le développeur Khaled Ahmed par exemple nous informe que lui même a été confronté à cette incapacité technique de télécharger l'app game script. \n \n \n\n \n \nAprès avoir envoyé sa console en réparation, elle s'est retrouvée en configuration d'usine, perdant l'intégralité de ses données, mais il souhaitait retrouvé l'application game script et a creusé la question. Il a alors trouvé un article dans lequel il a trouvé un processus pour réinstaller l'application en mode retail via un compte développeur Microsoft. \n \nCe processus risqué pourrait entrainer un ban, \"c'est un choix difficile, mais j'ai payé 20 $ pour obtenir le compte développeurs et j'ai suivi les étapes nécessaires pour republier l'application, cela impliquait la création de groupes privés, et le téléchargement de l'application via un processus complexe\". \n \n \n \n\n \n \n \nOn comprend en substance, qu'il a réussi à télécharger l'app game script en utilisant probablement un serveur privé, mais que cela risque de déboucher sur un ban de la console et du compte développeur. Il a décidé de partager son expérience dans une vidéo qui sera probablement retirée rapidement.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193128/in-xbsxbx-lapp-game-script-pourrait-revenir-mais-attention-au-ban-1.jpg"
        }
    },
    "news_17": {
        "title": "[WiiU] Aroma 22 et Tiramisu 0.1.4 disponibles",
        "content": " \nDepuis quelques jours, une grosse semaine pour être plus précis, le développeur Maschell a dévoilé une nouvelle version de Aroma, pour ceux qui se demandent ce que c'est qu'Aroma, il s'agit d'un environnement de hack pour la Wii U.\n \n \n\n \n \nAroma qui est l'environnement homebrew pour la Wii U, évolue une nouvelle fois avec de nouvelles options et corrections, notamment pour le démarrage d'Aroma, la gestion du menu de démarrage rapide du gamepad a été améliorée, et un écran de démarrage personnalisé peut être affiché (un fichier image 1280x720 ou 1920x1080 pixels est nécessaire). \n \n \nChangelog : \n \n- Éviter/réduire la corruption de l'écran lors du démarrage dans Aroma\n- Fermer le menu de démarrage rapide sur la manette de jeu s'il ne démarre pas automatiquement dans un environnement\n- Rendre les titres à démarrage rapide plus cohérents si la sélection des titres prend plus de 5 à 10 secondes\n- Le lancement du titre via le menu de démarrage rapide affichera désormais l'écran de démarrage correct et jouera l'audio de transition\n- Ajouter une option pour afficher un écran de démarrage personnalisé au démarrage. Il sera chargé depuis sd:/wiiu/environments/aroma/splash.png. La résolution recommandée est 1280x720 ou 1920x1080\n- Rendre l'ouverture du menu de configuration un peu plus stable\n- Correction de l'ouverture du menu de configuration avec les contrôleurs Motion Plus dans certains scénarios (merci @Andrew1Hawes)\n- Utilisez une horloge stable/monotone pour les minuteries dans NotificationModule (merci @dkosmari)\n- Mocha : ajoutez un groupe d'autorisations DLP aux titres homebrew\n- Correction du démarrage dans vWII HBC à partir d'AutobootModule\n \nTéléchargement : Aroma 21\n \nEdit 15.07.24 : Aroma 22\n \n \nPour compléter le repas, Maschell propose une nouvelle version de Tiramisu qui passe en v0.1.4. \n \nCette mise à jour n'ajoute aucune nouvelle fonctionnalité. Elle met simplement à jour l'EnvrionmentLoader et l'AutobootModule pour utiliser la même version dans Aroma et Tiramisu. Elle inclut quelques petites corrections de bugs.\n \nTéléchargement : Tiramisu 0.1.4\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193125/in-wiiu-aroma-21-et-tiramisu-014-disponibles-1.jpg"
        }
    },
    "news_18": {
        "title": "[DS/2DS/3DS] TWiLightMenu++ 27.5.2 et nds-bootstrap 1.5.4 disponibles",
        "content": " \nLe développeur RocketRobz propose une nouvelle version de TWiLightMenu++ et de nds-bootstrap, de petites versions puisque les changements ne sont pas nombreux. \n \n \n \n\n \n \n \nComme vous le savez, TWiLight Menu ++ est une mise à niveau, à code source ouvert, du menu et de l'interface DSi pour nds-bootstrap (compatible 3DS/2DS/DS/DSi). Ce programme va aussi vous permettre de jouer aux homebrews DS, jeux DSiWare et roms .nds et aux roms de la GameBoy (.gb), GameBoy Advance (.gba) et Nes (.nes) depuis votre carte SD.\n \n \nChangelog :\n \n- DeadSkullzJr : v3.3 de Pokémon : Refined Gold Overhaul est maintenant AP-patché.\n- mentusfentus : Thème DSi : Ajout de plus d'animations de liste déroulante ! (#2434)\n \nCorrections de bugs :\n \n- Quelques titres DSiWare tels que Petit Computer démarrent à nouveau sur des cartes SD de moins de 32 Go !\n- Suppression de nds-bootstrap.7z à l'intérieur de nds-bootstrap.zip\n \n \n \nTéléchargement : TWiLightMenu++ 27.5.2 et nds-bootstrap 1.5.4\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193098/in-ds2ds3ds-twilightmenu-2752-et-nds-bootstrap-154-disponibles-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] PS5 offline account activation disponible",
        "content": " \nLe développeur John Tornblom a décidé de travailler sur un nouveau payload pour la scène PS5 nous permettant d'activer une console PS5 sans avoir besoin de la connecter au PlayStation Network. \n \nUn outil un peu similaire existait déjà, PS4OfflineAccountActivator, cependant il est limité aux firmwares 4.xx, et il est impossible de copier des sauvegardes sur une clé ou un disque dur USB, de fait le programme n'a jamais été rendu public. \n \n \n\n \n \nLe programme prend la forme d'un fichier OffAct.elf qui permet donc d'activer votre PS5.\n \nTéléchargement : PS5 offline account activation\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1193097/in-ps5-ps5-offline-account-activation-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[XBS/XBX] L'exploit Xbox One fonctionne aussi sur le firmware 4909",
        "content": "Carrot_c4k3 nous confirme que l'exploit Xbox One fonctionne sur le dernier firmware 4909, il dévoile une vidéo dans laquelle le reverse shell est lancé sur Xbox One X en retail mode, la vidéo démarre juste au moment où l'exploit démarre. \n \n \n\n \n \nIl annonce aussi qu'il a lancé l'exploit sur Xbox One S, cela prend beaucoup plus de temps, au delà de la minute pour le lancer.\n \n \n\n \n \n \nTout est là : carrot_c4k3\n \n \nA la question, quand est ce que l'exploit sera disponible, il répond très bientôt, ce n'est probablement plus qu'une question de jours. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1931649245.png"
        }
    }
}