{
    "news_1": {
        "title": "[PS5] PS5 Homebrew Apps 1.3 disponible",
        "content": "Le développeur Master-s propose de découvrir une nouvelle version de son outils PS5 Homebrew Apps qui est maintenant estampillé 1.3.\n \nDans cette nouvelle version le développeur a ajouté etaHEN 2.0, comme vous le savez, PS5 Homebrew Apps est un ensemble d'homebrews qui fonctionne avec websrv. websrv est un serveur Web simple qui peut être exécuté sur une Playstation 5 jailbreakée via les points d'entrée BD-J ou Webkit . Il peut être utilisé pour lancer des homebrews via le navigateur Webkit intégré à la PS5, ou à distance depuis votre PC, téléphone, etc.\n \n \n\n \n \nAvec cette modernisation avec etaHEN 2.0, l'outil intègre les toutes dernières avancées sur PS5.\n \n \n\n \n \nTéléchargement : PS5 Homebrew Apps 1.3\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202868/in-ps5-ps5-homebrew-apps-13-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202868/in-ps5-ps5-homebrew-apps-13-disponible-2.png"
        }
    },
    "news_2": {
        "title": "[PS3] Nathan Martin propose la deuxième Bêta de son CFW Evilnat 4.91.3",
        "content": "Le développeur Nathan Martin offre sur PS3 une nouvelle version de son custom firmware CFW Evilnat 4.91.3, il s'agit de la deuxième Bêta de cette série.\n \nLa disponibilité se limite pour l'heure à la version PEX, incluant les modules et kernel DEX à partir du DEX 4.84, bien qu'il utilise le CEX par défaut bien entendu.\n \n \n \n\n \n \nL'update permet notamment l'introduction de nouvelles fonctionnalités comme la prise en charge du CFW 4.84 DECR. Certaines options ont été reclassées afin de les rendre plus faciles à utliser, et les fonctionnalités liées au licences ont été améliorées.\n \nCela passe par exemple par l'ajout des mises à jour des options d'importations, et d'exportation de licence au format rap.bin, qui est plus simple à exploiter. \n \n \n\n \n \nPour ceux qui ont une ancienne version du CFW, installez le CFW complet 4.91.3 [BETA 2], pour les autres qui ont une version plus récente vous pouvez simplement mettre à jour xai_plugin mais uniquement pour PEX. \n \nTéléchargement : CFW 4.91.3 Evilnat Cobra 8.5 [PEX] [BETA 2].rar (202.4 Mo)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202859/in-ps3-nathan-martin-propose-la-deuxieme-beta-de-son-cfw-evilnat-4913-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202859/in-ps3-nathan-martin-propose-la-deuxieme-beta-de-son-cfw-evilnat-4913-1.png"
        }
    },
    "news_3": {
        "title": "[PS4/SP5] LightningMods commence les tests d'etaHEN 2.0 Bêta",
        "content": "Le développeur LightningMods fait savoir qu'il teste actuellement le prochain etaHEN 2.0B, et bonne nouvelle il lance un test public de cette nouvelle version. Ainsi si vous souhaitez y participer il faut accéder au serveur discord PKG-Zone.\n \nDans cette nouvelle version d'etaHEN 2.0B (pour Bêta) il a introduit des nouvelles fonctionnalités liés aux code des triches, un nouveau système est en effet pris en charge, avec notamment la gestion des formats MC4, JSON et SHN. Il en a profité aussi pour mettre à jour la toolbox, l'objectif étant de limiter les problèmes de freezes. \n \n \n\n \n \nSi cela vous intéresse c'est par ici : Discord.com\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202849/in-ps4sp5-lightningmods-commence-les-tests-detahen-20-beta-1.png"
        }
    },
    "news_4": {
        "title": "[PS4/PS5] theflow0 récompensé une nouvelle fois avec 10 000 $",
        "content": "Nous venons d'apprendre que theflow0 a une nouvelle fois signalé un bug sur hackerone. L'information jusqu'alors l'information était restée secrète, ce qui nous met la puce à l'oreille, car le dépôt de cette faille remonte à environ 5 mois, et n'avait pas été divulguée. \n \nPlus besoin de rappeler qui est theflow0, mais si cette remontée de faille remonte à 5 mois, il se pourrait qu'il s'agisse du firmware 12.00 de la PS4 ou bien du firmware 24.06-10.00.00 de la PS5, les firmwares récents.\n \n \n\n \n \nCe bug a permis à theflow0 d'obtenir une récompense de 10 000 $, probablement un exploit kernel. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202793/in-ps4ps5-theflow0-recompense-une-nouvelle-fois-avec-10-000-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] MigFlash et UnlockSwitch vous souhaitent une bonne année",
        "content": "Depuis quelques mois nous n'avons que très peu de nouvelles des teams MigFlash (ex Mig Switch) et UnlockSwitch, cependant les équipes sont toujours là et vous souhaitent une agréable année 2025. \n \nLa team MigFlash vient de proposer un nouveau post sur son site, tout d'abord elle souhaite une bonne année à toutes et tous, même si elle ne parle pas beaucoup elle travaille et elle annonce déjà des mises à jour pour 2025.\n \nElle annonce par ailleurs recevoir des centaines de demandes par e-mail pour convertir la MigCard v1 (le modèle sans commutateur) pour la passer en MigCard v2, celle qui dipose de l'interrupteur qui permet de passer d'un jeu à un autre. \n \nBien qu'elle dit ne pas recommander la modification, elle donne tout de même le lien vers le guide qui permet de le faire, et ainsi modifier la MigCard. Malheureusement ce lien ne semble pas accessible, ou bloquer derrière un proxy russe. \n \n \n\n \n \nDe son côté la team UnlockSwitch elle aussi vous souhaite une excellente année 2025, elle informe qu'elle n'a rien publié, ce qui est il faut le reconnaitre assez étrange, mais elle a dévoilé une vidéo de packaging. \n \n \n\n \n \nMaintenant que la Switch 2 est annoncée avec la rétrocompatibilité avec la Switch première version, il est possible que ce genre de solution soit fonctionnelle sur la Switch 2, reste à voir si les jeux Switch 2 auront le même format que ceux de la Switch 1, il y a fort à parier que Nintendo ait revu sa copie niveau sécurité de la console. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202787/in-switch-migflash-et-unlockswitch-vous-souhaitent-une-bonne-annee-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202787/in-switch-migflash-et-unlockswitch-vous-souhaitent-une-bonne-annee-2.png"
        }
    },
    "news_6": {
        "title": "[Switch] Sphaira v0.6.1 disponible",
        "content": "Le développeur TotalJustice propose déjà sa seconde mise à jour de 2025 de Sphaira, la solution de remplacement du hbmenu proposant des fonctionnalités inédites, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \nLes changements dans cette version sont là encore assez nombreux, cela passe par l'optimisation du mode dock suite au correctif apporté par deko3d, par des correctifs sur des crashs et des leaks de mémoire, sur des bugs et autres petites mises à jour. \n \n \n\n \n \nChangelog : \n \n- Correction d'un leak de mémoire deko3d lors de l'utilisation du mode ancré.\n- Correction du crash du mode applet s'il est lancé avec un jeu qui utilise plusieurs services Audren. L'audio est actuellement désactivé en mode applet jusqu'à ce que j'écrive un pilote audio pour libpulsar.\n- Correction d'un crash dans l'option « restaurer hbmenu » où l'option ne se déclenchait pas si /hbmenu.nroelle n'existait pas.\n- ftpsrv mis à jour de 1.2.1 à 1.2.2\n- Correction d'un bug avec l'Appstore où si un champ n'était pas trouvé dans le repo.json, il était défini sur une valeur indésirable. Cela n'affectait que le tri via les téléchargements.\n- Ajout de nouvelles chaînes et mettre à jour ko.json, ja.json \n- Mise à jour es.json \n- Mise à jour pt.json \n- Mise à jour de la langue française\n- Correction de la faute de frappe \"descendant\"\n- Mise à jour du « de.json » avec les traductions manquantes\n \n \nTéléchargement : Sphaira v0.6.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202754/in-switch-sphaira-v061-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[PS4/PS5] PS Remote Lua Loader v3.3 disponible",
        "content": "Le développeur Master-S propose une nouvelle version de PS Remote Lua Loader, qui désormais est estampillé 3.3. Comme vous le savez Remote Lua Loader est un script python déployé pour la PS4 et PS5 (et leur versions pro), permettant de charger des fichiers via l'utilisation de Lua dans les jeux construits autour du moteur Artemis. \n \nLe point d'entrée étant un jeu, ce loader ne dépend pas de la version du firmware installée, et fonctionne donc sur tous les firmwares, il a ainsi été testé avec succès sur le dernier firmware de la PS5 et de la PS5 Pro, pareil pour la PS4 et PS4 Pro. \n \n \n\n \n \nDans cette version 3.3, le développeur a apporté une correction et a permet de dump la libkernel de base. \n \n \nTéléchargement : PS Remote Lua Loader v3.3\n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202735/in-ps4ps5-ps-remote-lua-loader-v33-disponible-1.jpg"
        }
    },
    "news_8": {
        "title": "[PS5] BD-J UMTX HEN de John Tornblom disponible",
        "content": "Le développeur John Tornblom continue de marquer l'histoire BD-J de la PS5, il propose BD-J UMTX HEN, il s'agit ni plus ni moins d'un Xlet BD-J qui permet l'exécution des payloads ELF sur les consoles PS5 exécutant les firmwares 3.00 à 4.51.\n \nLe Xlet utilise une vulnérabilité d'escalade de privilèges découverte par theflow , qui a ensuite été reproduite pour la PS4 par sleirsgoevy . Pour échapper au sandbox Java, le Xlet utilise cette vulnérabilité pour désactiver le gestionnaire de sécurité à l'aide d'une technique découverte par sleirsgoevy.\n \n \n\n \n \nLe Xlet doit être gravé sur un disque Blu-ray et comprend un certain nombre de payloads, par exemple un serveur FTP et un serveur Telnet. Si votre PS5 est connectée à Internet, ces payloads peuvent être téléchargées directement depuis le Web, ce qui vous évite d'avoir à graver un nouveau disque lorsque les payloads sont mis à jour.\n \n \nTéléchargement : bdj-umtx-hen.iso\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202732/in-ps5-bd-j-umtx-hen-de-john-tornblom-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[Switch 2] Nintendo annonce enfin la Switch 2 !",
        "content": "Ah la voilà enfin officiellement, Nintendo vient d'annoncer officiellement la Nintendo Switch 2. \n \nLa console est donc plus grande, elle permet de jouer aux jeux physiques et numériques de la première Switch, Nintendo précisant que certains titres ne pourraient pas être compatibles. Tous les leaks qui ont eu lieu récemment se révèlent être exact, il est fort à parier que les spécifications récentes découvertes soient également justes. \n \n \n\n \n \nL'écran qui passe donc d'un 7 pouces à un 8 pouces, un nouveau port USB-C, un port arrière en forme de U, les nouveaux joy-con magnétiques qui auront des fonctions souris avec l'infrarouge, le nouveau bouton sur le joy-con droit.  \n \n \n\n \n\n \n \n\n \n \n \nNintendo annonce un Nintendo Direct pour le 02 Avril 2025, la date, les spécifications et le prix pourraient alors être annoncés à ce moment là, et du 04 au 06 avril 2025, au grand palais à Paris, il y a des possibilités d'essayer la console. \n \n \n \n\n \n \n \nOn découvre sur les images, un teaser du prochain Mario Kart, probablement Mario Kart 9,  et des images de Mario Wonder, même s'il s'agit de la version Switch première du nom. \n \nTout est là : nintendo.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202691/in-switch-2-nintendo-annonce-enfin-la-switch-2-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202691/in-switch-2-nintendo-annonce-enfin-la-switch-2-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1202691/in-switch-2-nintendo-annonce-enfin-la-switch-2-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1202691/in-switch-2-nintendo-annonce-enfin-la-switch-2-3.png"
        }
    },
    "news_10": {
        "title": "[Multi] Un avocat de Nintendo explique qu'un émulateur n'est pas illégal mais...",
        "content": " \nLors d'une conférence organisée par l'association japonaise du droit d'auteur pour les logiciels informatiques, certains avocats se sont réunis pour discuter des fondements de certains brevets et autorisations. L'événement « Tokyo eSports Festa » s'est tenu pendant trois jours du 10 au 12 janvier dans les halls 1 et 2 du Tokyo Big Sight South . Le premier jour, la table ronde organisée sur la scène principale était « Table ronde de l'ACCS sur l'importance des droits de propriété intellectuelle dans l'industrie du jeu » .\n \n \n\n \n \nBien que réunissant notamment les dirigeants de propriété intellectuelle d'entreprise telle que Sega, Capcom, ou encore Konami, une autre personne, répondant au nom de Koji Nishiura, directeur général du département de propriété intellectuelle de Nintendo, a répondu a quelques questions intéressantes. \n \nKoji Nishiura a expliqué que même si les émulateurs eux-mêmes ne sont pas illégaux par définition, ils peuvent le devenir s'ils fonctionnent d'une manière qui porte atteinte aux droits d'une entreprise.\n \n \n \n\n \n \n \n \nPour commencer, les émulateurs sont-ils illégaux ou non ?\n \n\" Koji Nishiura a répondu : C'est un point souvent débattu. Bien qu'on ne puisse pas immédiatement affirmer qu'un émulateur est illégal en soi, il peut le devenir en fonction de la manière dont il est utilisé.\" \n \nSelon lui \" si un émulateur qui imite un appareil de jeu peut être légal sur papier, si l'émulateur copie également un programme appartenant à cet appareil, cela peut constituer une violation du droit d'auteur. Si l'émulateur désactive également les mesures de sécurité comme le cryptage, cela pourrait également être considéré comme illégal. \"\n \nCela vaut pour d'autres méthodes telles que les linkers, citant l'utilisation des linkers Nintendo DS (comme la R4) qui contournent la sécurité en imitant un jeu DS légitime. \n \nIl a souligné que Nintendo et plus de 50 autres fabricants de logiciels ont intenté une action en justice conjointe contre les vendeurs de linkers et ont obtenu un jugement selon lequel ils violaient la loi japonaise sur la prévention de la concurrence déloyale. \n \nA juste titre, selon Nishiura, si un émulateur relie les utilisateurs à des ressources où des jeux piratés peuvent être téléchargés, cela est également considéré comme une violation du droit d'auteur. On se souvient tous de la lutte de Nintendo pour stoper la propagation des émulateurs Yuzu et Ryujinx à grands coups de DMCA. \n \nLa suppression de l'émulateur Yuzu, suite à un retrait DMCA sur Github, a entraîné la suppression de plus de 8 500 référentiels contenant un ou des versions de l'émulateur. \n \n \n\n \n \nNintendo a pris pour exemple également la propriété intellectuelle sur la manette de la Switch, le Joy-Con, de nombreuses imitations sont apparues avec des formes et des boutons différents. Concernant le design du Joy-Con, Nintendo a déposé le design original ainsi que quelques variantes.\n \nLes droits de conception peuvent être utilisés pour des produits contrefaits de forme similaire , mais il est difficile de les appliquer pour des produits contrefaits dont la forme est très différente. Les droits de brevet, qui protègent les conceptions techniques, éliminent toutes ces variations de conception comme rappelle Nintendo. \n \n \nSi l'article vous intéresse c'est par ici et c'est très instructif : news.denfaminicogamer.jp\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202690/in-multi-un-avocat-de-nintendo-explique-quun-emulateur-nest-pas-illegal-mais-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202690/in-multi-un-avocat-de-nintendo-explique-quun-emulateur-nest-pas-illegal-mais-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1202690/in-multi-un-avocat-de-nintendo-explique-quun-emulateur-nest-pas-illegal-mais-3.png"
        }
    },
    "news_11": {
        "title": "[WiiU] Cemu Graphics Packs v930 disponible",
        "content": "Pour ceux qui profitent de l'émulateur Wii U Cemu, il est possible de profiter de packs graphiques qui améliorent, selon la configuration de votre Pc, la restitution et l'affichage de la console de Nintendo. \n \nCe pack graphique communautaire permet la mise à l'échelle, de modifier et d'améliorer la plupart des jeux Wii U et leur fonctionnement sous Cemu. \n \n \n\n \n \nChangelog v930 :\n \n- Améliorations des pièges de Skylanders\n- Correction d'un crash dans le mod Arts\n- Pack de résolution pour Transformers Prime\n \n \n \nTéléchargement : Cemu Graphics Packs v930\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202647/in-wiiu-cemu-graphics-packs-v930-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[2DS/3DS/WiiU] Nintendo recommande de ne pas utiliser Pretendo sur Wii U",
        "content": "Nintendo vient de laisser un message sur X en demandant aux utilisateurs de Wii U de ne pas utiliser les services de Pretendo, le service de substitution pour le jeu en ligne pour la Nintendo Wii U et pour la Nintendo 3DS. \n \nLe géant japonais explique que sur le réseau social X ce service Pretendo non officiel peut présenter \"des risques de sécurité inattendus\", le revers de la médaille est que Nintendo a arrêté les services en ligne pour la 3DS et la Wii U le 09 Avril 2024, cette solution alternative ne concurrence en rien la proposition de Nintendo qui n'existe plus du tout. \n \n \n\n \n \nBien entendu, il reste possible que Nintendo puisse bannir les consoles utilisant ce type de service, un peu comme Wimmmfi pour la Wii, mais cela reste dommage que Nintendo commence à s'attaquer à ces services qui ne viennent que proposer une alternative à ce qui n'est plus dans l'offre. \n \nIl n'empêche que ce type de services s'appuient nécessairement sur des failles de la console ou du navigateur, mais c'est surtout face à des problématiques comme ENLBufferPwn que Nintendo tente de justifier la non utilisation d'homebrews, rappelons simplement que maintenir les serveurs et les services en ligne engendrent des coûts importants que Nintendo ne souhaite plus assumer. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202644/in-2ds3dswiiu-nintendo-recommande-de-ne-pas-utiliser-pretendo-sur-wii-u-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS5] PS5 Edit Profile v1.5 disponible",
        "content": "Le développeur Master-s propose un nouvel outil pour la PS5, il s'agit de PS5 Edit Profile qui après avoir été proposé en v1.0 il y a quelques jours a rapidement évolué vers la version 1.4.\n \nComme son nom l'indique il s'agit d'un programme qui permet d'éditer le profil de votre PS5 afin d'y ajouter de la personnalisation, comme changer l'icône, des profils par défaut, des avatars.\n \n \n\n \n \nLa version 1.4 introduit des avatars, le profil hors-ligne, et vous pouvez changer le nom. De nombreux profils et avatars sont intégrés comme ceux de DragonBallZKakarot, TheWitcher3WildHunt, Assassin's Creed, Read Dead Redemption 2, CrashBandicoot 4, ForHonor\n \nedit 17.01.2025\n \nTéléchargement : PS5 Edit Profile v1.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202636/in-ps5-ps5-edit-profile-v14-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] Sudachi 1.0.12 disponible",
        "content": "Sudachi est un émulateur Nintendo Switch pour Android, Linux, macOS et Windows écrit en C++ et basé sur Yuzu. Bien qu'il soit sous le retrait DMCA, le développement de Sudachi continue, le développeur Jarrod Norwell ne semble pas se soucier des injonctions de Nintendo et propose une mise à jour de son émulateur qui a la spécificité d'être proposé sur Windows, MacOS et Android, même si toutes les versions ne se suivent pas au même moment. \n \nLes versions Linux dt Windows ont été revues et corrigé notamment en ajoutant le support de Donkey Kong Country Returns HD, mais cette version ajoute aussi un correctif audio du firmware 19.0.0.\n \n \n\n \n \n \n \nChangelog : \n \n \nLinux\n \n- Ajout de la prise en charge de Donkey Kong Country™ Returns HD\n \n- Suppression des changements audio cassés de la version 19.0.0+.\n \nWindows\n \n- Ajout de la prise en charge de Donkey Kong Country™ Returns HD\n \n- Suppression des modifications audio de la version 19.0.0 et suivantes.\n \n \nTéléchargement : https://sudachi.emuplace.app/\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202635/in-switch-sudachi-1012-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[Wii] NUSGET v1.3.0 disponible",
        "content": "Le développeur NinjaCheetah propose une nouvelle version de NUSGET qui est maintenant proposé en v1.3.0, il s'agit de la première version de 2025 de cet outil qui permet de télécharger des contenus Nintendo. \n \nS'appuyant sur Python et Qt6, NUSGET s'emploie avec des bibliothèques libWiiPy et libTWLPy afin de proposer une solution moderne. NUSGet est écrit en Python et fonctionne sous Windows, MacOS, ou Linux, contrairement à NUS Downloader qui ne fonctionne que sous Windows, et surtout il comporte moins de bugs. NUSGet peut aussi vous permettre d'accéder à des titres vWii, de regrouper des titres DSi sous le nom de TAD. \n \n \n\n \n \nVoici quelques possibilités de NUSGet : \n \n- Interface utilisateur graphique multiplateforme\n- Téléchargez n'importe quel titre à partir des serveurs de mise à jour Wii, vWii ou DSi\n- Bases de données de titres pour la Wii, la vWii et la DSi avec tous les titres système, les titres préinstallés et les chaînes Wii répertoriés (WiiWare et la console virtuelle ne sont pas encore dans la base de données en raison de la taille énorme de ces listes)\n- Possibilité de sauvegarder le contenu crypté de n'importe quel titre\n- Possibilité de décrypter le contenu des titres Wii, vWii et DSi s'ils disposent d'un ticket commun disponible\n- Possibilité d'emballer un WAD pour n'importe quel titre Wii ou vWii, ou un TAD pour n'importe quel titre DSi si un ticket commun est disponible\n- Possibilité de recrypter n'importe quel titre vWii avec la clé commune Wii pour permettre sa modification avec des outils standards, son installation depuis la vWii sur une Wii U et son installation dans Dolphin (aucun dump NAND Wii U requis !) si un ticket commun est disponible\n \n \nParmi les nouveautés on découvre un nouveau format de script basé sur JSON, qui permet de combiner les titres Wii, vWii et DSi grâce à la touche optionnelle \"Console\". Les scripts ainsi conçus n'ont pas besoin non plus d'être répertoriés dans la base de données, d'ailleurs la gestion des scripts elle même a été améliorée. \n \nChangelog : \n \n- La prise en charge d'un nouveau format de script basé sur JSON a été ajoutée ! Ce format facilite grandement le suivi des titres et des versions téléchargés et permet de mélanger les titres Wii, vWii et DSi avec une Console:clé facultative. Vous pouvez consulter example-script.jsonla racine du référentiel comme exemple de la manière dont ces nouveaux scripts doivent être formatés.\n- Les titres dans les scripts n'ont plus besoin d'exister dans la base de données.\n- La gestion des erreurs de script est désormais plus robuste. Les scripts continueront désormais à s'exécuter même en cas d'erreur, et un résumé des problèmes rencontrés sera affiché à la fin des téléchargements.\n- La prise en charge du format de script NUSD, introduite dans la version 1.2.0 en guise de solution provisoire, a été entièrement supprimée en raison de l'introduction du nouveau format.\n- Tous les titres WiiWare et Virtual Console (au moins ceux listés sur WiiBrew) sont désormais présents dans la base de données ! Notez que comme ces titres ne sont pas gratuits, vous ne pourrez télécharger que leurs TMD et contenus cryptés, car il n'y a pas de tickets disponibles pour eux sur le NUS.\n- Le backend de l'arborescence de la base de données des titres a été entièrement réécrit ! Cela devrait améliorer les performances et résoudre également certains problèmes visuels résultant du système précédent.\n- Une barre de recherche a été ajoutée au-dessus de l'arborescence des titres, vous permettant de filtrer les titres affichés. Cela devrait permettre de trouver un titre particulier dans l'arborescence beaucoup plus rapidement.\n- Cliquer sur les étiquettes à côté des cases à cocher permet désormais de réactiver les cases à cocher (ce n'était pas le cas dans la version 1.2.0 en raison d'un changement dans la façon dont les étiquettes étaient incluses dans l'interface utilisateur).\n- Les titres seront désormais téléchargés dans un dossier nommé NUSGet Downloadsau lieu de NUSGet. Ce dossier sera toujours dans votre dossier de téléchargements local. Une prise en charge appropriée du choix d'un emplacement de téléchargement sera ajoutée à l'avenir, mais pour l'instant, cela résout le problème où le binaire NUSGetentre en conflit avec le répertoire NUSGetlors de l'exécution de l'application à partir de votre dossier de téléchargements sous Linux.\n \n \nNUSGet est également disponible dans les langues suivantes :\n \n- Anglais\n- Allemand \n- Coréen \n- Italien  \n- Norvégien  \n- Roumain   \n \n \nTéléchargement : NUSGET 1.3.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202629/in-wii-nusget-v130-disponible-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS3] webMAN Mod 1.47.47m disponible",
        "content": "Le développeur Aldostools, de son vrai nom Aldo Vargas, propose la mise à jour de webMAN Mod, son plugin développé par Deank qui permet de lancer des backups de jeux PS3, PS2, PS1, PSP ainsi que des Blu-ray ou des DVD, stocké sur disque dur (y compris en NTFS) ou sur le réseau local, au format JB ou ISO. M@tsumot0 et Aldostools ont proposé une version MOD de webMan, apportant notamment le support de 21 langages utilisant des fichiers externes, un installer/updater pour CFW Cobra et NonCobra, le spoof IDPS/PSID, la désactivation des syscalls du cfw, et de nombreuses autres évolutions qui se sont succédées.\n \nAvec cette version 1.47.47m, le développeur a corrigé une régression découverte dans l'affichage de /setup.ps3, mais aussi corrigé un bug de détection dans la gestion des Rom de Mame. \n \n \n\n \n \n \nChangelog 1.47.47m\n \n- Régression corrigée dans l'affichage de /setup.ps3\n- Tentative de correction de la détection de nom partielle dans les ROM MAME\n \n \nTéléchargement : webMAN Mod 1.47.47m\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202599/in-ps3-webman-mod-14747m-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[Switch] switch_AIO_LS_pack 5.17.0 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.17.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format).\nLe mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\n- Changelog pour la version 5.17.0:\nAjout de Sphaira qui remplace le Homebrew Menu, une sauvegarde de ce dernier se trouve au chemin \"switch/hbmenu.nro\" qui peut être restauré via les options de Sphaira.\nMise à jour de Status-monitor-overlay.\nMise à jour du homebrew AIO_LS_pack_Updater en version 7.01.00 contenant les évolutions suivantes:\nOptimisation de l'écriture des logs.\nAjout de fonctions pouvant servir plus tard.\nQuelques autres corrections mineures.\n\nNote: Pour traiter les problèmes particuliers de lancement de la sysnand en firmwares 17.0.0 et supérieurs c'est très simple via ce pack. Une fois le pack mis en place sur la SD on boot sous Hekate (avec une puce ça se fera tout seul), à l'affichage du tout premier logo on appui sur \"vol-\" pour annuler l'auto-boot réglé dans Hekate par défaut dans mon pack, on clique sur \"launch\" et enfin sur \"Atmosphere sysnand\", une fois le système lancé on peut éteindre la console et voilà, la sysnand refonctionnera ensuite comme avant.\nN'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets. Pour cela nous avons mis en place un questionnaire de satisfaction, en plus de pouvoir reporter les problèmes sur Github ou sur le forum vous pouvez utiliser ce questionnaire pour nous donner vos opinions de façon anonyme (pour des problèmes spécifiques il vaut mieux reporter sur Github ou ouvrir un sujet sur le forum, il y aura une réponse bien plus rapide et cela permet de demander plus de détails pour identifier et peut-être résoudre le possible problème.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe et vous avez aussi un tutoriel plus détaillé sur cette page, d'ailleurs ce dernier site contient aussi pas mal de tutoriels notamment sur la Switch. Enfin si vous souhaitez voir le changelog complet du pack il est consultable ici.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_18": {
        "title": "[PS3] Il est désormais possible d'utiliser la PS3Eye comme une webcam",
        "content": "Le développeur Seregon vient de dévoiler il y a quelques instants un nouveau programme qui permet d'utiliser la webcam PS3 Eye comme une webcam normale, pour ceux qui veulent l'essayer il n'a pas encore été compilé, et certaines librairies sont nécessaires. \n \nPs3EyeManager est un programme qui permet d'utiliser le périphérique PS3 Eye sur n'importe quel PC Windows. Il a été testé avec le AY0140890 et est entièrement fonctionnel.\n \n \n \n\n \n \n \nIl nécessite le pilote de test CL-Eye, le pilote personnalisé ps3eye_virtual_camera.dll, indispensable pour virtualiser la caméra pour les applications comme Discord, et OpenCV, une bibliothèque essentielle pour la gestion d'images et de vidéos.\n \nBien entendu l'indispensable Python sera également de la partie.\n \nTéléchargement : Ps3EyeManager\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202593/in-ps3-il-est-desormais-possible-dutiliser-la-ps3eye-comme-une-webcam-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] Linux pourrait arriver rapidement sur PS5",
        "content": "Le développeur Jose Coixao, plus connu sous le pseudonyme de Zecoxao, vient d'annoncer qu'un autre développeur de la scène PlayStation, Sleirgoevy, travaille sur le portage ou une adaptation de Linux sur PS5.\n \nComme nous en avons désormais l'habitude il est possible que cela passe par un loader. Concernant l'éventail des firmwares accessibles, Zecoxao précise que Linux devrait pouvoir se lancer sur tous les firmwares qui permettent de lancer kstuff. \n \n\n \n \nEnfin au niveau de la disponibilité il semblerait que cela soit assez proche, annonçant un \"soon\" via son profil X.com .  \n \n \nMerci Linkynimes pour l'information \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202591/in-ps5-linux-pourrait-arriver-rapidement-sur-ps5-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] Sphaira v0.6.0 disponible",
        "content": " \nLe développeur TotalJustice propose une mise à jour importante de Sphaira, la solution de remplacement du hbmenu proposant des fonctionnalités inédites, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \nLes changements dans cette version sont très nombreux, cela passe par l'optimisation du téléchargement, du serveur FTP, il a ajouté la prise en charge de l'écran tactile, ou encore une option pour restaurer hbmenu lors de la désactivation de l'option \" Remplacer hbmenu à la sortie \". \n \n \n\n \n\n \n \n \nChangelog :\n \n- Ajout d'un téléchargeur github, ajouter des entrées dans/config/sphaira/github/name.json\n- Correction d'un bug de l'Appstore où j'ai oublié d'ajouter une pause dans un cas de commutation.\n- Optimisation considérable du téléchargement des ressources en utilisant des etags pour mettre en cache toutes les ressources et en ne retéléchargeant que lorsque l'etag change.\n- Tous les événements internes ont désormais un délai d'attente, ce qui signifie que si de nombreux événements se produisent en même temps, ils ne traiteront que la quantité maximale possible dans la tranche de temps donnée.\n- Les images à chargement paresseux sont désormais limitées à 2 par image. Cela supprime les pertes d'images lors du défilement dans l'App Store (en raison d'une E/S lente).\n- La détection de Daybreak prend désormais en charge les chemins personnalisés.\n- Le serveur ftp utilise désormais la configuration ftpsrv et tous ses points de sortie.\n- La vitesse de téléchargement (écriture) du serveur ftp a été grandement améliorée grâce à l'utilisation du code io ftpsrv.\n- Option pour restaurer hbmenu lors de la désactivation de l'option « Remplacer hbmenu à la sortie ».\n- Ajout des points de montage personnalisés pour le système de fichiers (sd et image).\n- Patch forwarder npdm pour prendre en charge les nouveaux indicateurs de débogage.\n- Ajout de la prise en charge de l'écran tactile.\n- Amélioration du temps de chargement de libpulsar (lib de chargement du son).\n- Option pour définir la musique de fond par défaut, placer le fichier dans/config/sphaira/themes/default_music.bfstm\n- Repenser les thèmes, désormais plus personnalisables.\n- Ajout l'héritage de thème, simplifiant grandement la création de nouveaux thèmes.\n- Correction de la liste contextuelle dessinée hors écran.\n- Correction de la barre de défilement dessinée hors de l'écran.\n- Le texte de la barre latérale défilera désormais si la longueur du texte est trop grande pour la région.\n \n \nModifications générées via github\n- Mettre à jour es.json \n- Traduire les champs manquants (portugais)\n- Mettre à jour ko.json et ja.json \n- Mettre à jour ko.json\n- Correction de certaines traductions de ko.json \n- Mettre à jour pt.json \n- Ajout de la prise en charge de la recherche de Daybreak dans les chemins non standard \n- Mise à jour de la langue française. \n- Mise à jour des langues coréenne et japonaise. \n- Ajout du support tactile \n- Ajout une nouvelle chaîne à tous les lang.json \n- corvée : mettre à jour pt.json \n- Créer vi.json \n- Traductions italiennes mises à jour \n- Mettre à jour zh.json \n- Changer quelques couleurs du thème. \n- Mettre à jour pt.json\n- Thème v2 \n- Correction de la fonction \"Mise à jour de l'application\" \n \n \nTéléchargement : Sphaira v0.6.0\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202574/in-switch-sphaira-v060-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202574/in-switch-sphaira-v060-disponible-2.jpg"
        }
    }
}