{
    "news_1": {
        "title": "[Multi] EasyRPG Player 0.8 disponible",
        "content": "EasyRPG Player est de retour et maintient presque toutes les fonctionnalités de la conception originale RPG Maker 2000 et RPG Maker 2003.\n \nComme toutes les plates-formes sont concernées, notamment PC et Linux, il est bon de rappeler que pour nos consoles ce programme concerne les Nintendo Switch, la Nintendo 3DS et ses dérivées, la Nintendo Wii, et la PlayStation Vita.\n \n \n\n \n \nCette nouvelle version 0.8 affublée du nom de code \"Paralyze\" arrive 18 mois sans nouvelle version, mais le projet n'est pas mort ! A l'origine une nouvelle version intermédiaire était prévue début 2022, mais l'équipe était épuisée. Cependant, cette nouvelle version compensera cette longue attente.\n \nCette version marque un changement dans l'équipe de développement : Après 12 ans, l'un de nos développeurs principaux (Ghabry) va faire une pause dans le développement d'EasyRPG Player pour se concentrer sur l'EasyRPG Editor (enfin !) et d'autres projets annexes non liés à EasyRPG. \n \nComme il est l'un des contributeurs les plus actifs le développement du Player va ralentir encore plus. Ne vous attendez pas à des mises à jour gigantesques dans les années à venir. EasyRPG Player est un projet open source, cette nouvelle version corrige de nombreux bugs. \n \nUn nouveau logo a été introduit, des paramètres vidéos plus importants, des modifications d'audio encore plus poussées, et de nombreuses maintenances pour chaque plate-forme spécifique. \n \nSur 3DS, le système audio a été réécrit de fond en comble pour corriger de nombreux glitchs. En outre, l'écran inférieur affiche désormais l'état actuel de la batterie.\n \nSur la Switch, le docking/déstockage de la console et l'appel du menu HOME sont désormais correctement gérés.\n \nSur la Wii, le chargement des sauvegardes a été corrigé.\n \nBref, vous l'aurez compris, cette version sera probablement l'une des dernières avant un bon moment !\n \n \nTéléchargement : EasyRPG Player 0.8\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173008/in-multi-easyrpg-player-08-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[Switch] SysDVR 5.5.5 disponible",
        "content": "Exelix11 vient de mettre à jour SysDVR, pour rappel sysdvr permet de streamer l'écran directement sur son PC via le wifi ou via un câble. A noter qu'il est possible d'utiliser SysDVR sur windows, Linux et Mac OS.\n \nLe développeur propose un guide utilisateur ici.\n \n \n\n \n \nChangelog : \n \n- Correction du problème de déconnexion du mode réseau #226\n- Ce problème a nécessité l'augmentation de la taille des tampons des sockets, ce qui fait que SysDVR utilise maintenant plus de mémoire que la v5.5, malheureusement je n'ai pas pu trouver de solution, c'est toujours mieux que la 5.4 et la version précédente mais pas aussi bien que la 5.5.\n- Ajout d'un écran de démarrage pour remplacer l'écran blanc affiché lors de la connexion\n- Introduction de la synchronisation des flux audio/vidéo dans le lecteur intégré : - Le SysDVR tentera automatiquement de synchroniser les flux pour éviter les retards.\n- Le délai de correction augmente en fonction du nombre d'erreurs détectées. En cas de mauvaises conditions de réseau, vous pouvez ressentir un certain retard car le lecteur renonce à la synchronisation pour éviter les bégaiements ; l'ouverture du menu d'accueil à tout moment permet de resynchroniser les flux.\n- Si vous rencontrez des bégaiements, cette fonctionnalité peut être désactivée dans les paramètres avancés de l'interface graphique ou avec l'argument de ligne de commande --debug nosync.\n- Introduction de la suppression des images clés en double : Lorsque SysDVR sur la console détecte de nombreux paquets dupliqués dans un court laps de temps, il arrête de les envoyer afin d'économiser la bande passante et de réduire le délai.\n- L'efficacité de cette fonctionnalité dépend du jeu, puisqu'elle peut causer des artefacts visuels. Cette fonctionnalité peut être désactivée dans les paramètres avancés du homebrew SysDVR-Settings.\n- Amélioration de la programmation des images vidéo dans le lecteur intégré : réduction des bégaiements occasionnels qui n'étaient pas liés à la bande passante du canal.\n- Amélioration de la gestion des fichiers de lancement .bat créés par l'interface graphique : ils peuvent désormais être placés n'importe où et vérifier correctement l'existence des chemins d'accès nécessaires.\n- Certains arguments de la ligne de commande ont été modifiés, en particulier l'option --print-stats a été renommée en --debug stats.\n \nLe développeur souhaite remercier quelques personnes du discord qui font du support utilisateur et pour les tests approfondis effectués sur les versions beta de SysDVR qui ont conduit à cette version, en espérant que cela élimine tous les bugs de streaming restants, rendant l'expérience de l'utilisateur plus fluide que jamais.\n \n \nTéléchargement : SysDVR 5.5.5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173001/in-switch-sysdvr-555-disponible-1.png"
        }
    },
    "news_3": {
        "title": "[Wii] Swiss et WiiSX se mettent à jour",
        "content": "Extrems vient de mettre à jour son outil Swiss qui est désormais proposé en version 0.6r1458. \n \n\n \nChangelog :\n \n- Ajustement pour les changements de libogc2.\n- Ajout d'une correspondance de caractères génériques pour l'entrée de l'autoload.\n- Utilisation de caractères génériques pour l'entrée DVD game.\n- Ajustement pour la version 42 de devkitPPC.\n- Correction de la compilation CI.\n- Ajout de sommes de contrôle pour la mise à jour de GC Loader.\n- Ajout de l'autoload pour l'updater GC Loader.\n- Mise à jour de la base de données Redump.\n- Correction de linkscript.\n- Suppression de certains travaux en double.\n- Utilisation d'un nouveau packer exécutable.\n- Utilisation de l'exécutable packer directement pour Action Replay.\n- Activation du chargement de SDLOADER.BIN pour le débogage.\n- Utiliser le nouveau killswitch de l'hyperviseur.\n- Activation de -fipa-pta pour le stub de rechargement.\n- Correction de l'écriture sur un fichier executable.xz existant.\n- Correction d'un problème empêchant l'activation de -msdata.\n- Mise à jour de .gitignore.\n- Build du moteur de triche à partir des sources.\n \n \nA noter qu'Emukidid lui a mis à jour Wii SX / Cube SX Beta en version 3.0 de retour après près de 13 ans avec une nouvelle version officielle !\n \n \n\n \n \nCe qui a changé : \n \n- Nouveau dynarec implémenté grâce au lightrec de pcercuei.\n- Remplace complètement l'ancien dynarec.\n- Augmente considérablement la compatibilité et la vitesse.\n- Synchronisé avec pcsx-ReARMed en amont.\n- Élimine complètement le ralentissement XA/CDDA sur la Wii et ces titres tournent à pleine vitesse.\n- Plugin audio dfsound.\n- Amélioration de la qualité du son et de la compatibilité.\n- Amélioration de la vitesse dans le plugin graphique soft grâce aux conseils de @extremscorner\n- Augmentation de la vitesse de 15% sur l'ensemble des titres.\n- Compilé avec libOGC2\n- Support de SD2SP2 sur GameCube\n- Correction des bugs de l'interface utilisateur et des fuites de mémoire.\n \nTéléchargement : Swiss / Wii SX Cube SX Beta 3.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1680965510.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1612910601.jpg"
        }
    },
    "news_4": {
        "title": "[Switch] MissionControl améliore le support de la DualShock 3",
        "content": "Comme vous le savez, l'avant dernière version de MissionControl (la version 0.9.1) a apporté le support de la Sony DualShock 3, une petite révolution dans le millieu, car cela faisait un moment que nous attendions cela. \n \nBref, c'est désormais l'heure d'en améliorer le support, ndeadly vient de mettre en ligne la version 0.9.2 qui apporte donc des optimisations, même si elles sont faibles, elles ont le méritent d'être là, il s'agit de la dix-neuvième version officielle de Mission Control.\n \n \n\n \n \nCette version résout quelques problèmes critiques introduits dans la version précédente avec la gestion de la DualShock 3. Un problème causé par la configuration d'un filtre d'interface USB avec les mêmes paramètres que ceux utilisés par le module hid. Le module hid ne recevait alors plus d'événements de connexion USB, ce qui interrompait la prise en charge des contrôleurs câblés et des dongles USB officiels et tiers. \n \nUn problème où MissionControl plantait si la base de données d'appairage Bluetooth était pleine en essayant d'appairer une manette Dualshock 3.\n \n \nChangelog :\n \n- Modification du filtre de l'interface usb utilisé dans l'appairage de la Dualshock 3 afin de ne pas entrer en conflit avec le filtre par défaut utilisé par le module HID.\n- Correction d'un problème où le système plantait lors de la tentative d'appairage d'une manette Dualshock 3 lorsque la base de données d'appairage Bluetooth contenait le nombre maximum d'appareils HID appariés.\n \n \nTéléchargement : MissionControl 0.9.2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172911/in-switch-missioncontrol-ameliore-le-support-de-la-dualshock-3-1.jpg"
        }
    },
    "news_5": {
        "title": "[Vita] Vita Moonlight v0.9.3 disponible",
        "content": "Le développeur d3m3vilurr propose une nouvelle version de Vita Moonlight pour la PlayStation Vita, comme vous le savez Moonlight permet de streamer votre pc sur l'écran de votre onsole. Pour rappel, ce logiciel est basé sur nVidia Gamestreams.\n \nS'agissant d'un homebrew vous aurez besoin d'une PlayStation Vita avec HENkaku et VitaShell d'installés, d'un client FTP et surtout votre ordinateur devra être sous Windows et être équipé d'une carte graphique nVidia (minimum GTX 650).\n \nCe code de cette nouvelle version 0.9.3 a été vérifié par Fewnity. Il a également corrigé un ancien problème d'appariement. Si vous rencontrez un problème, merci de lui signaler.\n \n \n\n \n \n \nChangelog : \n- Correction du problème d'appariement  \n- Mise à jour de moonlight-common-c & enet  \n- Mise à jour de la dernière version de libgamestream  \n \nProblèmes connus :\n- Un problème de handshake pourrait être toujours présent. Il doit être corrigé dans le jeu de code handshaking ou dans la partie vitasdk.\n \n \n \nTéléchargement : Vita Moonlight v0.9.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172906/in-vita-vita-moonlight-v093-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[WiiU] de_Fuse v0.3 disponible",
        "content": "Le développeur Max Thomas, connu aussi sous le nom de shinyquagsire23, propose une nouvelle version de de_Fuse qui est désormais proposée en version 0.3 après avoir proposée une version 0.2.\n \n \n\n \n \nde_Fuse est une version initiale pour les premiers utilisateurs qui veulent savoir si leur RPi Pico est correctement câblé pour de_Fuse. Beaucoup de choses ne sont pas encore implémentées et/ou ont besoin d'être améliorées. Cependant, ce qui est fourni est suffisant pour vérifier que le Pico est installé correctement. Comme vous le savez de_Fuse est une puce (en work in progress) pour la Wii U basée sur de_Fuse, une faille dans la machine d'état de lecture OTP eFuse de la Wii U.\n \n \nChangelog 0.3 :\n \n- Nouveautés de l'application\n- boot1.img vérifie maintenant le CRC32 du BoardConfig, et s'il n'est pas valide, la DRAM est initialisée en utilisant les valeurs par défaut.\n- Ajout du support du dumping OTP basé sur PRSHhax pour toutes les versions de boot1 disponibles sur CDN (prod et dev).\n- Ajout du dumping et de la restauration de BOOT1_SLC.RAW\n- Ajout de la prise en charge de la restauration du fichier seeprom.bin\n- Cette option peut résulter en une impossibilité de dumper l'OTP via PRSH hax si vous faites quelque chose de stupide !\n- J'ai ajouté autant de mesures de vérification/sécurité que possible pour m'assurer que PRSH hax ne serait pas bloqué, mais à la fin de la journée, c'est la responsabilité de l'utilisateur de garder otp.bin et seeprom.bin sauvegardés et en sécurité.\n- Une liste incomplète de choses qui peuvent cesser de fonctionner irrémédiablement si vous perdez votre sauvegarde seeprom.bin et que vous flashez quelque chose d'incorrect comprend :\n- Le lecteur de disque\n- Les sauvegardes stockées sur des clés USB\n- Ajout d'un support pour synchroniser les versions SEEPROM boot1 avec la NAND après avoir flashé BOOT1_SLC.RAW.\n- Cette option nécessite une copie de otp.bin depuis la même console (et ceci est vérifié).\n- Ajustement du partitionnement de redNAND pour placer 1MiB d'espace libre au début de la carte SD pour les images Ancast.\n- Améliorations diverses de la fiabilité\n \n \nChangelog 0.2 : \n \n- Correctif : Correction du fait que l'OTP n'est pas téléchargé sans otp.bin sur la carte SD (lol)\nDump OTP via Backup and Restore > Dump OTP via PRSHhax\nRestauration de SLC.RAW et SLCCMPT.RAW, via Backup and Restore.\nEntrée console série plus rapide et plus fiable.\nUn chainloader fw.img série pour minute_minute dev\nDéfinir la variable env MINUTE_MINUTE_FW_IMG au chemin absolu de fw.img.\nINSTRUCTIONS D'INSTALLATION\nIl s'agit d'une version initiale pour les premiers utilisateurs qui veulent savoir si leur RPi Pico est correctement câblé pour de_Fuse. Beaucoup de choses ne sont pas encore implémentées et/ou ont besoin d'être améliorées. Cependant, ce qui est fourni est suffisant pour vérifier que le Pico est installé correctement.\n \n \nTéléchargement : de_Fuse v0.2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172901/in-wiiu-de-fuse-v03-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[WiiU] Wii-U Nand-AID pour faire revivre une Nintendo Wii U",
        "content": "Le développeur Voultar vient de finaliser son projet de résurrection de Nand de Nintendo Wii U, et pour cela il a eu l'idée de créer une mini board prenant place sur un PCB pour remplacer la Nand par une micro SD pour sauver les Wii U qui ont leur Nand HS.\n \nL'idée est de proposer une solution open-source afin que chacun puisse soit profiter de ses plans, soit créer son propre PCB, c'est surtout de proposer une solution contre quelques euros pour réparer une Nand. \n \n \n\n \n \n \nSous le nom de Wii-U Nand-AID se cache un convertisseur eMMC/NAND permettant de réaliser une récupération/remplacement pour la Wii-U. Ce PCB est conçu pour s'insérer proprement sur la carte mère de la Wii-U sans nécessiter l'installation d'un module eMMC BGA et sans que l'installateur n'ait à retirer le module BGA eMMC. Cet outil vous permet de lire/décharger plus facilement l'eMMC existante et de remplacer l'eMMC via MicroSD.\n \n \n \n\n \n \n \nL'idée est aussi de proposer deux types de PCB, un de 0.6 mm ou un de 0.8 mm, avec un isolement spécifique sur le bas du circuit. La nomenclature est incluse dans le fichier zip. Ces choses sont extrêmement bon marché à fabriquer, donc cela ne devrait pas coûter beaucoup d'argent.\n \nLe cavalier \"DIS\" relie l'horloge de l'eNAND/eMMC à la masse afin qu'elle ne flotte pas. Vous devrez le laisser ouvert lorsque vous dumperez l'eMMC et le court-circuiter une fois que vous aurez terminé avec l'eMMC originale afin qu'il ait un état logique défini.\n \nLe développeur annonce qu'il ne maintiendra pas à jour un github par manque de temps, mais qu'il rendra ses travaux publics afin que tout le monde puisse réparer sa Wii U. \n \n \nTout est là : GBAtemp.net\n \nMerci HoYoHoYo pour l'information\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172900/in-wiiu-wii-u-nand-aid-pour-faire-revivre-une-nintendo-wii-u-1.jpg"
        }
    },
    "news_8": {
        "title": "[Wii] WiiStation améliore l'émulation PS1 avec un nouveau recompilateur dynamique",
        "content": "Voilà que débarque la version 2.0 de l'émulation PS1 sur Wii, une toute nouvelle version 2.0 vient en effet de paraitre dans les lignes de code de WiiStation, WiiStation, anciennement connu sous le nom de \"WiiSX RX 2022\", a été modifié par son développeur pour être largement améliorée. \n \n \nLes modifications sont nombreuses et méritent le coup d'oeil puisque xjsxjs197 a changé la méthode de restitution et de compilation en utilisant désormais Lightrec, un nouveau recompilateur dynamique, ce qui devrait augmenter considérablement les performances.\n \n \n \n \n \n\n \n \n \n \n \nAinsi de nombreux jeux devraient désormais fonctionner à pleine vitesse, le journal de jeu sur le mur Wii sera mis à jour après le jeu et le moteur du code de PCSX-ReARMed sera utilisé, ainsi des jeux comme Batman Beyond : Return of the Joker et Driver 2 ne plante plus.\n \n \n \n\n \n \nWiiStation Changelog Ver 2.0 :\n \n- Utilisation d'une nouvelle méthode de compilation dynamique (dynarec) Lightrec, une méthode super cool.\n- De nombreux jeux peuvent maintenant tourner à pleine vitesse.\n- Ajout du support du Wii Message Board pour l'écriture du playlog (Merci SuperrSonic et saulfabregwiivc).\n- Importation du code GTE de PCSX-ReARMed.\n- Correction de problèmes sur Batman Beyond : Return of the Joker qui ne pouvait pas être joué et sur Driver 2 dont une mission ne pouvait être émulée. \n- Modification du code pour supporter les versions supérieures de Devkitppc.\n- Note : Pour le numéro 81, la dernière version haute de Libogc doit être utilisée.\n \n \nTéléchargement : WiiStation Version 2.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1278342954.png"
        }
    },
    "news_9": {
        "title": "[PS4] Noob404 propose la mise à jour de Puppy Linux pour PS4 et PS4 Pro",
        "content": "Le développeur Noob404 propose de découvrir la nouvelle version de Puppy Linux, une version optimisée de Linux pour PS4 et PS4 Pro et qui nécessite moins de 240 Mo de Ram pour fonctionner. \n \nCette distribution est très légère, fonctionnelle et assez simple d'utilisation, elle est capable de faire tourner la plupart des jeux Linux, et se base sur Ubuntu 22.04, son nom de code est \"Bolt Pup\". Cette moture corrige les bugs audio et supporte Vulkan.\n \n \n\n \n \nSi vous rencontrez un écran noir au démarrage, il existe une marche à suivre, c'est un problème très courant. Pour  réparer l'écran noir sur Puppy Linux pour PS4 , suivez ces instructions :\n \n- Déconnectez et reconnectez le câble HDMI.\n- Appuyez sur Ctrl + Alt + F2 pour accéder au shell TTY.\n- Connectez-vous avec le nom d'utilisateur et le mot de passe indiqués ci-dessus.\n- Tapez startxet appuyez sur Entrée\n \n \nTéléchargement : Puppy Linux pour PS4 – Bolt Pup / Forum PS4linux.com\n \n",
        "images": {}
    },
    "news_10": {
        "title": "[PS3] PS3HEN v3.2.2 disponible",
        "content": "Voilà que débarque une nouvelle version de PS3HEN qui est désormais proposée en version 3.2.2 ! Oui il s'agit d'une nouvelle version officielle proposée par la team PS3Xploit. \n \nAvec l'arrivée du firmware 4.90, les développeurs Joonie et esc0rtd3w ont mis à jour Ps3HEN vers la version 3.2.2, Ps3HEN est un Enabler Homebrew qui est un exploit alternatif au custom firmware (cfw) pour les modèles qui ne peuvent pas installer de CFW. \n \n \n \n\n \n \n \n \nCette nouvelle version 3.2.2 est impressionnante ! \n \n \nChangements globaux\n- Ajout de la prise en charge des firmwares 4.80 et 4.81 CEX\n- Ajout de la prise en charge du firmware 4.82 DEX\n- Les mises à jour automatiques sont désormais désactivées par défaut. Vous pouvez utiliser HFW Tools->Maintenance et les activer/désactiver.\nChangements dans le plugin HEN\n- Ajout du support pour les sons RCO et le statut des LEDs (merci @aldostools)\n- Mise à jour de la méthode de détection de fin d'installation (merci @aldostools)\n- Mise à jour et nettoyage de la fonction downloadPKG_thread2\n- Ajout de la détection de la bascule dev_build pour usb000 et usb001\nChangements dans le payload \n- Correction de la fonction Pad pour qu'elle ne se bloque pas lorsque plus d'un périphérique est connecté (merci @aldostools)\n- Désactivation de VSH Attach To Debugger par défaut, pour ne pas entrer en conflit avec certains CFW (4.82/4.84 DEX)\n- Mises à jour multiples : blacklistage du loader PSP + plus (merci @aldostools)\n- Ajout d'une L2 pour désactiver le mappath remap au lancement de la poule\nChangements dans les ressources\n- Mise à jour du message software_update_plugin.rco pour afficher le domaine .me au lieu de .com\n- Ajout de l'option *Désinstaller HEN* dans Outils HFW->Maintenance\n- Ajout de l'option *Désactiver le remappage au prochain redémarrage* dans Outils HFW->Maintenance. Cela désactivera les fichiers remappés de mappath afin que ces fichiers puissent être gérés et que les utilisateurs puissent également utiliser l'option de sauvegarde/restauration du XMB (merci @Fredy66).\n- Ajout de l'option *Toggle Hotkey Polling* dans HFW Tools->Maintenance. Cela activera/désactivera la fonction check_combo_buttons au lancement de HEN. (merci @FFF256)\n- Ajout de l'option *Toggle app_home Support* dans HFW Tools->Maintenance. Cela met à jour le xml contenant les entrées seg_gamedebug (merci @Fredy66)\n- Ajout de l'option *Enable Quick Preview Option On XMB* dans HFW Tools->Developer. Cela permet d'échanger le fichier explore_plugin.sprx entre les versions CEX et DEX.\n \n \nTéléchargement : PS3Hen 3.2.2 / PS3HEN\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172785/in-ps3-ps3hen-v322-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[Multi] mGBA 0.10.2 disponible",
        "content": "Le développeur endrift vient de publier une nouvelle version de son émulateur multiplateforme mBGA, la grande bibliothèque de la GameBoy Advance, mGBA permet pour rappel d'émuler une Game Boy, Game Boy Advance ou Game Boy Color sous PC, 3DS, Nintendo Wii, PlayStation Vita, et Nintendo Switch. \n \nPlus de 3 mois après la version précédente les progrès n'ont pas cessé, cette version ne fait pas exception, et comme d'habitude les corrections et les changements sont nombreux. Les corrections importantes concernent le plantage au démarrage sur de très vieilles cartes graphiques et des problèmes de scintillement sur les GPU Nvidia lors de l'utilisation du moteur de rendu OpenGL. Une liste complète des changements est disponible ci-dessous. \n \n \n \n\n \n \n \nCorrections sur l'émulation :\n \nAudio GBA : Correction de la désérialisation incorrecte des registres audio GB (corrige #2793)\nGBA Audio : Effacer l'état de l'audio GB lorsqu'il est désactivé\nMémoire GBA : Faire en sorte que les stalls d'accès à la VRAM ne s'appliquent qu'à la RAM BG\nGBA Overrides : Correction de la sauvegarde dans PMD:RRT (JP) (corrige #2862)\nGBA SIO : Correction de la valeur du pin SIOCNT SI après avoir attaché le joueur 2 (corrige #2805)\nGBA SIO : Correction du bit SIOCNT SI en mode normal non connecté (corrige #2810)\nGBA SIO : Les transferts en mode normal sans horloge ne devraient pas se terminer (correctif #2811)\nGBA Timers : Les timers en cascade ne cochent pas lorsqu'ils sont désactivés (correctif #2812)\nVidéo GBA : Correction des problèmes d'interpolation avec le moteur de rendu OpenGL\n \nAutres corrections :\nCore : Permet d'envoyer des requêtes de threads à un core crashé (correctif #2784)\nFFmpeg : Force un taux d'échantillonnage plus bas pour les codecs ne supportant pas les taux élevés (correctif #2869)\nQt : Correction d'un crash lors de l'utilisation d'OpenGL 2.1 à 3.1 (correctif #2794)\nQt : Désactiver la synchronisation lors de l'exécution de scripts à partir du thread principal (corrige #2738)\nQt : Cap correctement le nombre de joueurs attachés par plateforme (correctif #2807)\nQt : Désactiver les tentatives de liaison entre plateformes incompatibles (correctif #2702)\nQt : Correction des noms de touches modificatrices dans l'éditeur de raccourcis (correctif #2817)\nQt : Corrige quelques cas de figure avec les visionneuses graphiques (correctif #2827)\nQt : Correction du rembobinage de la mémoire tampon\nQt : Correction d'un crash si le chargement d'un shader échoue\nQt : Correction de l'écran noir au démarrage d'un jeu (correctif #2781)\nQt : OSD sur macOS moderne (correctif #2736)\nQt : Correction de l'état vérifié de l'option de menu mute au chargement (correctif #2701)\nQt : Suppression du thread de proxy OpenGL et remplacement de SwapInterval par une surcharge directe\nScripting : Correction de la réception de paquets pour les sockets clients\nScripting : Correction des appels de réception vides retournant une erreur inconnue sous Windows\nScripting : Retourner le bon ID de callback depuis socket.add\nVita : Contournement de l'implémentation cassée de mktime dans le SDK Vita (correctif #2876)\n \nDivers :\nQt : Intègre QPA dans AppImage (correctif #2796)\nQt : Stopper les évènements liés à l'action de la clé bootlean (correctif #2636)\nQt : Changer automatiquement l'extension des fichiers vidéo si nécessaire\nQt : Echange les sauvegardes de P1 et de l'autre joueur si P1 l'a chargé en premier (correctif #2750)\n \n \nTéléchargement : mGBA 0.10.2\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1175880681.png"
        }
    },
    "news_12": {
        "title": "[Switch] Status Monitor Overlay v0.9.0 disponible",
        "content": "Le développeur masagrator propose une nouvelle version de Status Monitor qui est disponible en version 0.9.0. Comme son nom l'indique il s'agit d'un overlay Tesla permettant sous Atmosphere de surveiller le statut et la charge des différents composants de la Switch.\n \nL'application permet de surveiller la console Switch pendant le jeu en cours en affichant la fréquence du CPU, du GPU et de la RAM, ainsi que la température et le niveau de rotation du ventilateur. L'outil propose à ce titre six modes (profils) différents à choisir dans le menu principal, Complet , Mini , Micro , Compteur FPS , Batterie et Divers.\n \nLa mise à jour ajoute une nouvelle fonction présente dans Switch-OC-Suite pour lire certains registres et corriger quelques bugs. \n \n \n \n\n \n \n \nChangelog 0.9.0 : \n \n- Correction du calcul du flux de puissance de la batterie\n- La lecture des statistiques de la batterie a été modifiée pour passer à 2 lectures par seconde. Le courant, la tension et le flux d'énergie sont maintenant calculés à partir des 10 dernières lectures.\n- Modification du calcul de la moyenne des FPS avec 10 dernières lectures au lieu d'une moyenne constante.\n- Ajout d'un onglet Graphiques avec pour l'instant uniquement les FPS disponibles (l'onglet Graphiques ne s'affichera pas pour l'instant si vous n'avez pas SaltyNX d'installé)\n- Déplacement des onglets Batterie/Chargeur + Divers sous l'onglet \"Autres\".\n- Vous pouvez maintenant déplacer le compteur de FPS + le graphique de FPS en bas et en haut de l'écran en appuyant sur ZR + R + D-Pad Down/Up.\n- Pour les relevés de FPS, il est nécessaire de mettre à jour NX-FPS à la version 1.4.0+.\n \n \nTéléchargement : Status-Monitor-Overlay 0.9.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172750/in-switch-status-monitor-overlay-v090-disponible-1.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] AtmoPackUpdater passe en version 1.8.0",
        "content": "Bonjour à tous, aujourd'hui j'ai mis à jour mon homebrew AtmoPackUpdater en 1.8.0 afin de rajouter quelques nouveautés intéressantes. Les deux principales nouveautés ont été proposé par des personnes de la communauté donc merci à vous! Si vous avez d'autres idées pour l'homebrew faites les moi parvenir, j'essayerai de rajouter ces nouvelles fonctionnalités.\n \nChangelog 1.6.0 :\n- Ajout d'un fix pour le téléchargement du fiwmare quand vous en avez déjà un dans sdmc:/firmware/\n \nChangelog 1.7.0 :\n- Ajout d'une option pour redémarrer sur hekate dans l'onglet paramètres\n \n- Correction d'une coquille (#9 merci Gum)\n \nChangelog 1.8.0 :\n- Ajout d'un onglet pour mettre à jour les homebrews du pack si le pack lui n'a pas encore été mis à jour avec les dernières versions des homebrews (Merci Zoria pour l'idée)\n \n- Ajout d'une détection des sysmodules lors de la mise à jour du firmware afin de pouvoir les supprimer pour éviter tous les problèmes de compatibilité (Merci Jones pour l'idée)\n- Ajout d'un fix pour toujours avoir un \"v\" devant la version du dernier pack disponible\n \n \nMerci à tous pour votre soutiens et vos remerciements c'est grâce à ça que je trouve la motivation pour continuer ce projet.\nTéléchargement : AtmoPackUpdater 1.8.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172737/in-switch-atmopackupdater-passe-en-version-180-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] Saturn2Nsp V1.2",
        "content": "Après la 1ére version de Saturn2PKG pour PS4, voici une petite mise à jour du même script mais cette fois ci pour Switch qui passe donc en version 1.2.\n \n\n \nEn effet, grâce à ce script il vous sera possible de profiter des vos jeux Sega Saturn sur votre Switch. Vous pourrez ainsi jouez à un grand nombre de titre Saturn en plein écran si vous le désirez, garder à l esprit par contre que certains titres ne seront pas compatibles et que d'autres fonctionneront plus ou moins bien...\n \nJ'ai mis en place ce petit homebrew pour faciliter la création des nsp, son utilisation est très simple, vous avez juste à suivre les instructions et rien d' autre. Il vous faudra cependant posséder le nsp de base COTTOn Boomerang - Saturn tribute et votre fichier prod.keys, sans cela le script ne fonctionnera pas et vous demandera d' ajouter ces 2 fichiers...\n \n\n \nCette version 1.2 vient corriger un bug (reporté par DED FR) avec le menu in-game qui était complètement buggé, elle ajoute également un nouveau boot-logo grandement inspiré de la version PS4 expliquant la configuration des touches, mais aussi les crédits disponible dans le menu in-game.\n \nAttention !!! Il se peut que votre jeu ne fonctionne pas alors qu' il est compatible, il vous faudra alors tester une autre version du même jeu, par exemple il m a fallu tester 4 versions différentes de Dragon Ball Z la légende avant d' en trouver une fonctionnelle...\n \n\n \nTélécharger Saturn2Nsp v1.2\n \n \nUn petit don pour me soutenir est toujours le bienvenue ^^:https://www.paypal.com/paypalme/markus00095\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172726/in-switch-saturn2nsp-v12-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1172726/in-switch-saturn2nsp-v12-2.png"
        }
    },
    "news_15": {
        "title": "[Vita] RetroFlow-Launcher en version 6.0.0",
        "content": "Le développeur jimbob4000 vient de publier RetroFlow-Launcher dans sa version 6.0.0. Pour rappel, RetroFlow-Launcher est une jolie petite interface graphique permettant de parcourir et delancer vos jeux Retro sur la PS Vita, et est à l'origine un fork de HexFlow-Launcher par VitaHEX.\n \nIl s'agit d'une version modifiée de HexFlow Launcher, un coverflow 3D comme un lanceur pour PS Vita. Cette version comprend des catégories de jeux rétro qui peuvent être lancées sans bulles pour RetroArch, DaedalusX64 et Flycast. Les jeux Playstation et PSP peuvent également être lancés sans avoir à créer de bulles pour chaque jeu.\n \n \n\n \n \nLe lancement d'un jeu ou d'une application à partir de  RetroFlow Launcher fermera automatiquement le lanceur sans demander, et il créera également des catégories pour les favoris et les jeux récemment joués.\n \nDans cette nouvelle version 6.0.0, il vous sera possible d'ajouter vos propres catégories personnalisées (Collections). Cette version propose de nouveaux systèmes, fonctionnalités et améliorations.\n \n \n\n \n \n \nNouveautés :\n \n- Catégories personnalisées (Collections) : Ajout de la prise en charge des catégories personnalisées. Créez une collection en appuyant sur le bouton triangulaire d'un jeu, puis appuyez à nouveau sur le bouton triangulaire pour afficher le mini-menu. Les collections peuvent être renommées/supprimées en allant dans le menu des paramètres principaux \"Autres paramètres > Modifier les collections\".\n \n- Nouveaux systèmes : ScummVM, PICO-8 et PlayStation Mobile ajoutés.\n \n- Nouvelles langues : Portugais (brésilien) et hongrois.\n \n- Défilement fluide : Les transitions entre les couvertures de jeux sont plus fluides lorsque l'on parcourt les jeux. Peut être désactivé en allant dans les paramètres du thème.\n \n- Adrénaline : Option permettant d'inclure les jeux de toutes les partitions disponibles. (C'est maintenant le réglage par défaut).\n \n- D-Pad Up : Sauter à la catégorie des jeux récemment joués / favoris, ou filtrer les catégories pour n'afficher que les collections.\n \n- Cacher les couvertures manquantes : Paramètre permettant de masquer les jeux dont la couverture est manquante. Allez dans le menu des paramètres principaux \"Autres paramètres > Afficher les couvertures manquantes\". La première fois que vous faites cela, il se peut que le scan soit refait.\n \n- N64 et SNES : Support ajouté pour les boîtes japonaises de N64 et SNES (supprimez vos anciennes pochettes de N64 et SNES et téléchargez à nouveau).\n \n- Vita : Option pour extraire les images d'arrière-plan. Réalisé en intégrant une version modifiée de copyicons par cy33hc. Les fonctions normales de copyicons sont également exécutées.\n \n- PICO-8 : Option pour extraire les images d'arrière-plan de PICO-8 (utilise l'image au centre du chariot de jeu).\n \nAméliorations :\n \n- Meilleure méthode de lancement : Suppression de la dépendance à l'égard du plugin repatch et des fichiers bin de lancement.\n \n- Taille des images de la boîte : Nouvelle approche, la taille de l'image est vérifiée et la taille de la boîte la plus proche est attribuée (l'ajout de vos propres couvertures devrait donner de meilleurs résultats).\n \n- Boîtes de cassettes : Les boîtes apparaissent maintenant plus grandes dans leurs propres catégories (C64, MSX, MSX2, Spectrum).\n \n- Reflets de la boîte : Amélioration des reflets du jeu, suppression d'un petit écart.\n \n- PSTV : L'icône de la batterie et le pourcentage ont été supprimés.\n \n- PSP : L'extraction d'images ne récupère plus que les images manquantes, ce qui accélère le processus. Les images ne sont plus affichées pendant l'extraction afin d'éviter d'épuiser les ressources.\n \n- Amélioration des traductions : Polonais et français.\n \n- Langues : Classées par ordre alphabétique.\n \nCorrections de bugs :\n \n- Erreur de paramétrage des fichiers : Correction de l'erreur de sauvegarde lors de l'appui répété et très rapide sur les boutons.\n \n- PSP et PS1 : Correction d'une erreur avec les mauvais titres de jeux qui contenaient des guillemets doubles. (Correction de PES C19).\n \n- PSP : Extraction de l'arrière-plan de la PSP, correction de C2-12828-1, les images ne sont plus affichées lors de l'extraction.\n \n- Jeux cachés : Les jeux cachés apparaissaient lors du rescanning, l'approche globale a été revue.\n \n- Beaucoup de corrections mineures qui ne valent pas la peine d'être mentionnées, voir la nightly build pour plus d'informations.\n \nTéléchargement : RetroFlow-Launcher 6.0.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172703/in-vita-retroflow-launcher-en-version-600-1.png"
        }
    },
    "news_16": {
        "title": "[XB] L'émulateur Dolphin en UWP v1.1.5.1 disponible",
        "content": "Après l'émualtion Xbox 360, voilà que c'est désormais l'émulation de la GameCube et de la Wii qui sont au programme de SirMangler.\n \nDéjà à l'origine du portage UWP de Xenia, voilà qu'il propose désormais une nouvelle version de Dolphin, qui passe en version 1.1.5.1.\n \nComme vous le savez, le portage UWP va fonctionner sur Xbox One et Xbox Series X ou Series S.\n \nLa mise à jour ajoute un véritable menu à partir duquel il est possible de sélectionner les profils de manette et deux nouveaux profils par défaut pour la lecture Wii, \"Classic\" et \"Sideways Wiimote\".\n \n \n\n \n\n \n\n \n \nChangelog :\n \n- Menu de sélection du profil de la manette !\n- Profils par défaut de la manette classique et de la Wiimote latérale !\n- Options de mappage de pad pour Netplay !\n- Netplay peut maintenant rejoindre les lobbies hébergés sur PC (doit être Dolphin version 5.0-19260)\n- Améliorations générales incluant une alerte lorsque les utilisateurs sélectionnent des dossiers avec des permissions incorrectes\n- Corrections générales incluant un correctif pour 'Compiler les Shaders' avant le lancement du frontend et des problèmes liés à 'Wingman'.\n- Mise à jour vers la version 5.0-19260\n- Mise à jour mineure\n- Correction de ELF/DOL ne fonctionnant pas dans Netplay\n- Merci à TRW et GoldenSky pour leur temps de test !\n \nTéléchargement : Dolphin 1.1.5.1 (en UWP)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172700/in-xb-lemulateur-dolphin-en-uwp-v1151-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1172700/in-xb-lemulateur-dolphin-en-uwp-v1151-disponible-1.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1172700/in-xb-lemulateur-dolphin-en-uwp-v1151-disponible-2.jpg"
        }
    },
    "news_17": {
        "title": "[PS4] Saturn2Ps4 v1.0 pour 5.05, 6.72 et 9.00",
        "content": "Depuis un petit moment déjà l' émulation Saturn sur PS4 est disponible mais seulement pour les consoles en 9.00. Depuis peu le grand Cybik qu' on ne présente plus à (enfin) réussit à backporter cet émulateur Saturn en 5.05 ce qui permet donc au consoles 5.05 et 6.72 d'en profiter également.\n \nJ' ai donc décidé d' adapter mon batch Switch permettant de créer nos propres jeux Saturn pour PS4.\n \n\n \nEn effet, grâce à ce nouveau script il vous sera possible de profiter des vos jeux Sega Saturn sur votre PS4 5.05, 6.72 et 9.00. Vous pourrez ainsi jouez à un grand nombre de titre Saturn en plein écran si vous le désirez, garder à l esprit par contre que certains titres ne seront pas compatibles et que d'autres fonctionneront plus ou moins bien...\nA savoir également qu'il vous faudra le goldhen 2.3 minimum pour faire fonctionner cet émulateur Saturn, et que vos jeux devront être au format .bin/cue, le script prenant en compte aussi les jeux possédant plusieurs .bin...\n \n\n \nDe plus j' ai ajouté quelques petites options qui vous permettront par exemple de customiser le boot-logo, d'injecter un fichier .ini custom, mais aussi de lancer les jeux nécessitant 4MB de mémoire...\nVous pourrez également convertir vos .iso en .bin mais cette option a ses limites, les jeux contenant des fichiers .wav ou mp3 ne pourront être convertis en .bin, il vous faudra donc trouver ce même jeu en version .bin complète...\n \nAttention !!! Il se peut que votre jeu ne fonctionne pas, vous aurez alors soit une erreur, soit un black screen à l’exécution de votre jeu, cela signifiera donc que vos iso n' est pas compatible avec l'émulateur.\n \nTélécharger Saturn2Ps4 v1.0\n \nUn petit don pour me soutenir est toujours le bienvenue ^^:https://www.paypal.com/paypalme/markus00095\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172671/in-ps4-saturn2ps4-v10-pour-505-672-et-900-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1172671/in-ps4-saturn2ps4-v10-pour-505-672-et-900-1.jpg"
        }
    },
    "news_18": {
        "title": "[Switch] switch_AIO_LS_pack 4.10.1",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 4.10.1.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.\nLe homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\nLe firmware inclus est le firmware 16.0.2.\nAjout du payload Picofly-toolbox.\nMise à jour d'Atmosphere, de Hekate, de Haku33, de DBI, de Status-Monitor-Overlay, de AtmoXL-Titel-Installer et de Goldleaf vers la dernière version de ceux-ci.\nMise à jour de EdiZon-Overlay, de FastCFWSwitch, de OvlSysmodules et de TeslaMenu pour intégrer les dernières modifications de la Libtesla.\nPetite correction dans le fichier de config d'Atmosphere pour la redirrection des touches, sans importance car non utilisé car toutes les configs sont commentées.\nMise à jour de AIO_LS_pack_Updater qui est compilé avec la dernière version de la Libnx et qui a suivi les évolutions des homebrews Goldleaf et AtmoXL-Titel-Installer.\nMise à jour: Avec la version 4.10.1 Status-Monitor-Overlay a été mis à jour vers sa dernière version.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\nN'hésitez pas à faire vos retours, ils seront les bienvenues. Par contre ne demandez pas une interface graphique pour AIO_LS_pack_Updater, je n'en ferai probablement jamais une.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-4.jpg"
        }
    },
    "news_19": {
        "title": "[switch] switch_AIO_LS_pack 4.10.0",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 4.10.0.\nPour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles. Le homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables.\n \n\n\n\n\nDepuis cette news les évolutions sont les suivantes:\nLe firmware inclus est le firmware 16.0.2.\nAjout du payload Picofly-toolbox.\nMise à jour d'Atmosphere, de Hekate, de Haku33, de DBI, de Status-Monitor-Overlay, de AtmoXL-Titel-Installer et de Goldleaf vers la dernière version de ceux-ci.\nMise à jour de EdiZon-Overlay, de FastCFWSwitch, de OvlSysmodules et de TeslaMenu pour intégrer les dernières modifications de la Libtesla.\nPetite correction dans le fichier de config d'Atmosphere pour la redirrection des touches, sans importance car non utilisé car toutes les configs sont commentées.\nMise à jour de AIO_LS_pack_Updater qui est compilé avec la dernière version de la Libnx et qui a suivi les évolutions des homebrews Goldleaf et AtmoXL-Titel-Installer.\nPour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.\nN'hésitez pas à faire vos retours, ils seront les bienvenues. Par contre ne demandez pas une interface graphique pour AIO_LS_pack_Updater, je n'en ferai probablement jamais une.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1164359/in-switch-switch-aio-ls-pack-401-minus-et-cortex-4.jpg"
        }
    },
    "news_20": {
        "title": "[PS4] Dead Island 2 backporté sur 5.05 / 6.72 / 7.02 / 7.55 / 9.00",
        "content": "Le développeur CyB1K continue de montrer au monde du hack ses talents avec notamment la mise à disposition de la mise à jour backportée de Dead Island 2 avec le backport compatible sur 5.05 / 6.72 / 7.02 / 7.55 / 9.00. \n \nDead Island 2 est un jeu vidéo d'action-aventure de type survival horror, développé par Dambuster Studios et édité par Deep Silver. Il s'inscrit dans le même univers que Dead Island donc il en est la suite, donc âme sensible s'abstenir, le jeu est PEGI 18.\n \n \n\n \n \n \nInitialement prévu pour 2015, il a été reporté à de nombreuses reprises à cause de son développement chaotique, il aura fallu 9 ans pour parvenir à voir le bout du tunnel depuis son annonce de développement. Le jeu est finalement sorti hier le 21 avril 2023 sur Xbox Series, Xbox One, PlayStation 4, PlayStation 5 et Microsoft Windows, et donc a déjà été backporté pour PS4 par CyB1K.\n \nComme vous le save CyB1K n'agit pas réellement seul car il s'appuie sur son ami Arczi et jocover, et pour cette release il tient à remercier plus particulièrement xmrallx qui a probablement acheté le jeu.\n \nIl vous faudra un peu plus de 17 Go pour le jeu principal et moins de 250 Mo pour la mise à jour et les DLC.\n \n \n\n \nOn comprend pourquoi le jeu est PEGI 18\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1172628/in-ps4-dead-island-2-backporte-sur-505-672-702-755-900-1.png"
        }
    }
}