{
    "news_1": {
        "title": "[PS4/PS5/Switch] DS4Windows 3.2.12 disponible",
        "content": "Le développeur Travis Nickles, connu aussi sous le pseudo Ryochan, nous propose de découvrir une nouvelle version de DS4Windows. Cette version apporte quelques corrections notamment sur le support DualShock 3 mais aussi des sticks des JoyCon.\n \n Comme vous le savez probablement DS4Windows est une interface efficace pour paramétrer une manette sur PC, il est basé sur un fork de Jays2Kings. Pour en profiter cela passe par un câble micro-USB, mais il est aussi possible de s'en servir sans fils avec quelques adaptateurs Bluetooth 2.1 (ou supérieur). \n \n\n \n \nVoici le changelog de cette version : \n \n- Correction de l'impossibilité d'activer le support DS3. Contribution de sunnyqeen\n- Mise à jour de la traduction allemande. Contribution de PaulWentzel\n- Ajout de la traduction en finnois. Contribution de eemijun\n- Tentative d'ajustement des plages d'axes des manettes JoyCon en fonction des coordonnées initiales des axes.\n- Diminution de la période d'attente après la reprise. Réduit à 5 secondes. Probablement une erreur\n- Elimination de l'icône de notification avant la fermeture du programme. Au moins les erreurs H.NotifyIcon apparaîtront dans le journal lors de la fermeture du programme.\n- Correction de l'analyse de la calibration du stick RS pour les manettes JoyCon et Switch Pro\n- Modification de la routine de recherche du programme HidHideClient. Utilisation des informations du registre pour tenter de trouver l'emplacement de HidHide.\n- Ajout d'une sauvegarde supplémentaire si la liste des profils est vide. Evite le crash\n \n \n\n \n \n \n \nTéléchargement : DS4Windows 3.2.12\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175487/in-ps4ps5switch-ds4windows-3212-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175487/in-ps4ps5switch-ds4windows-3212-disponible-2.png"
        }
    },
    "news_2": {
        "title": "[PS4] Et Abkarino dévoile un tutoriel pour PS4 Syscon Flasher",
        "content": "Le développeur PS3 Abkarino est de retour sur le devant de la scène PS3 pour notre plus grand plaisir et nos souvenirs, après avoir proposé son outil PS4 Syscon Tool, il offre comme promis un tutoriel vidéo sur le flash du Syscon de la PS4. \n \n \n\n \n \n\n \n \n \nPour parvenir à reproduire son tutoriel vous devez disposer du matériel adéquat, c'est à dire une PS4 et surtout un Teensy++ 2.0, et les bonnes résistances de 100 à 200 ohm.\n \nIl tient à remercier egycnq pour son aide et son travail acharné à préparer ce tutoriel.\n \n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175479/in-ps4-et-abkarino-devoile-un-tutoriel-pour-ps4-syscon-flasher-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175479/in-ps4-et-abkarino-devoile-un-tutoriel-pour-ps4-syscon-flasher-2.png"
        }
    },
    "news_3": {
        "title": "[PS4] Zecoxao dévoile deux payloads et des clés PS4",
        "content": "Le développeur Zecoxao, Jose Coixao, sort du lourd ce matin, il dévoile des clés PS4 qu'il a intégré dans ps4devwiki, qui inclus les clés shellcore metadata et les clés sealed (scellées).\n \nVous me direz c'est très bien mais à quoi cela peut-il servir ? Avec ces clés, les développeurs et autres utilisateurs expérimentés vont pouvoir décrypter fpkg, en utilisant pfs_pkg_tool de flatz cependant, puisque l'outil ne supporte pas (encore) le multithreading, la méthode a privilégier sera toujours l'outil de Maxton.\n \nLes clés sont disponibles ici : clés shellcore metadata et les clés sealed\n \n \n\n \n \nIl a également ajouté quelques notes sur les flags utilisés dans le stockage non volatile sur le ps4devwiki, que vous pouvez trouver ici : psdevwiki\n \n \n\n \n \n \nA cela il ajoute deux nouveaux payloads qui pour l'un permet de sous-cadencé l'APU à 500 MHz, tandis que l'autre overclocke l'APU à 1725 MHz, autant vous le dire tout de suite, c'est extrêmement dangereux pour votre console, et il préconise de ne l'utiliser que si vous avez de quoi flasher, il informe qu'il va étendre le support de l'overclock (ou de l'underclock) à des homebrews mais cela sera pour plus tard. \n \n \nTéléchargement ici : overclock.bin / underclock.bin\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175478/in-ps4-zecoxao-devoile-deux-payloads-et-des-cles-ps4-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175478/in-ps4-zecoxao-devoile-deux-payloads-et-des-cles-ps4-2.png"
        }
    },
    "news_4": {
        "title": "[PS4] Abkarino est de retour sur PS4 avec PS4 Syscon Tool",
        "content": "Le célèbre développeur PS3 Abkarino, très connu car il a été l'un des membres actifs de la Team Rebug, vient d'annoncer sur Twitter la disponibilité prochaine d'un nouvel outil à destination de la PS4 et PS4 Pro, PS4 Syscon Tool. Sous ce nom se cache un utilitaire qui aidera à la \"réparation, modification et au downgrade de PS4\".\n \n \n\n \n \n \nPeu de doute avec un nom pareil, l'outil permettra de bidouiller la puce syscon de la console : \n \nDump du flash syscon :\n- Complet\n- Partiel\n- NVS/SNVS uniquement\nEffacer Syscon :\n- Effacer Flash complet\n- Effacer complètement le bloc Boot 0\n- Effacer partiel\nÉcrire Syscon :\n- Complet\n- Partiel\n- NVS/SNVS uniquement\nActiver le mode de débogage Syscon \n \n \n \n\n \n \n \nLa date de sortie de cet outil proposé par Abkarino et EgyCnq n'a pas encore été annoncée. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175454/in-ps4-abkarino-est-de-retour-sur-ps4-avec-ps4-syscon-tool-1.png"
        }
    },
    "news_5": {
        "title": "[Vita] pkg2zip v2.5 disponible",
        "content": "Le développeur Yoti vient de mettre en ligne la version 2.5 de Pkg2zip, qui comme vous le savez est une alternative intéressante à des solutions comme PkgDecrypt de St4rk ou unpkg_vita de RikuKH3.\n \npkg2zip est un utilitaire qui décrypte les fichiers pkg de la PlayStation Vita et crée un paquet zip. Les types de fichiers pkg pris en charge : application principale, DLC, patch, thème et fichiers PSM. A noter que pkg2zip prend également en charge les fichiers pkg PSX et PSP à utiliser avec Adrenaline.\n \nOptionnellement un fichier de fausse licence NoNpDrm ou NoPsmDrm à partir de la chaîne zRIF peut être utilisé, vous devrez fournir une clé de licence.\n \n \n \n\n \n \nChangelog 2.5 : \n \n- Prise en charge d'un plus grand nombre de régions\n- Ajout d'un support pour décrypter/extraire les PKG de type 1\n- Ajout de la prise en charge de KEYS.BIN pour les PKG de type 1\n- Ajout de la détection de région pour les jeux PS1\n- Correction de quelques messages ici et là\n \n \nTéléchargement : pkg2zip v2.5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175453/in-vita-pkg2zip-v25-disponible-1.jpg"
        }
    },
    "news_6": {
        "title": "[2DS/3DS/DS] TWiLight Menu++ v25.11.0 et nds-bootstrap v0.72.1",
        "content": "Le développeur RocketRobz propose à la scène 3DS de découvrir une nouvelle version de TWiLight Menu++ et de nds-bootstrap qui passent respectivement en v25.11.0 et 0.72.1.\n \nLe rythme d'une version par mois est maintenu, c'est une bonne chose pour TWiLightMenu++ qui pour rappel est un menu alternatif, open source et personnalisable pour lancer des homebrews DS, jeux et roms DS, GBA, BD via la DS, 3DS ou 2DS.\n \n \n\n \n \nChangelog : \n \n- Ajout de correctifs AP pour\nPokémon : Moon Black 2 (Beta v4.2.3)\nPokémon : Version Argent Apaisé (v1.3.2)\n- Les points de départ pour les musiques de skin personnalisées sont maintenant supportés !\n- Le fichier audio doit être nommé bgm.start.wav et doit être placé au même endroit que bgm.wav.\n- Si votre skin personnalisé utilise encore bgm.pcm.raw, il est recommandé de passer à bgm.wav. Voir cette page pour plus d'informations.\n- La musique originale du menu DSi a été rajoutée !\n- La qualité est la même que dans les versions précédentes qui contenaient la musique.\n- Pour célébrer la sortie de Sonic the Hedgehog sur SEGA Genesis/MegaDrive, l'écran d'accueil de TWLMenu++ joue maintenant un jingle du jeu !\n- Pour que cela prenne effet, TWiLight Menu++ doit être démarré à la date de sortie du jeu.\n- Pour contourner un bug, nds-bootstrap est maintenant utilisé pour démarrer Pictochat & DLP, lorsqu'ils sont lancés en dehors du DS Classic Menu.\n \nAmélioration\n \n- TWLMenu++ est revenu aux versions non-ADPCM des fichiers musicaux des thèmes DSi/3DS/HBL, afin d'en améliorer la qualité.\n- Cela améliore également les temps de chargement lors de la première utilisation d'une option musicale spécifique.\n \nCorrection de bugs\n \n- Correction de la visionneuse d'images qui ne lisait pas les images des flashcards.\n- Correction du jingle un peu silencieux lorsqu'il est joué dans la variante Style Savvy de l'écran d'accueil TWLMenu++.\n \nBug connu\n \n- Le point de départ de la musique HBL est légèrement incorrect.\n \nCorrections de bugs pour nds-bootstrap :\n \n- Le bug de verrouillage des sauvegardes dans Pokemon B&W 1&2 et quelques autres jeux a été corrigé une fois de plus.\n- Correction des erreurs de communication lors du démarrage des applications Pictochat ou DLP.\n- My Healthy Cooking Coach a été mis sur liste noire pour ne pas utiliser le DMA de lecture de carte, afin de pouvoir démarrer.\n- Le cache des correctifs devrait maintenant être correctement effacé lorsqu'il est obsolète.\n- Cela devrait résoudre le problème des jeux qui ne démarrent pas et qui ont déjà été démarrés par une version antérieure de nds-bootstrap.\n- Après avoir ouvert le menu du jeu, et en fermant le couvercle de la console 3DS ou 2DS, celle-ci ne se bloquera plus sur des écrans noirs.\n- Tentative de compatibilité avec les cartes SD de marques moins connues, en désactivant l'AMDN avant que le jeu ne démarre.\n- La NDMA est désormais toujours désactivée pour les homebrew.\n \n \nTéléchargement : TWiLight Menu++ v25.11.0 et nds-bootstrap v0.72.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175446/in-2ds3dsds-twilight-menu-v25110-et-nds-bootstrap-v0721-1.jpg"
        }
    },
    "news_7": {
        "title": "[Vita] NoPspEmuDrm 1.00 disponible",
        "content": "Le développeur LiEnby (SilicaAndPina/KuromeSan) vient de mettre en ligne NoPspEmuDrm, il s'agit là d'un nouveau plugin à destination des PlayStation Vita, qui une fois installé permet de se passer des contrôles DRM de l'émulateur PSPEmu. \n \n \n \n\n \n \n \n \nCe plugin magique permet de sauvegarder des jeux PSP et PS1, ainsi que de jouer à des jeux légitimement détenus sur d'autres comptes PSN. Ce n'est pas tout puisque le plug-in permet aussi de lancer en plus des jeux NeoGeo, PC Engine et TurboGrafix16 sans être contraint d'utiliser LiveArea, sans compter la fonctionnalité PocketStation ou encore d'utiliser les DLC PSP. \n \n \n \n\n \n \n \n \nInstallation des jeux PSP :\n \nCopier le dossier digital PSP/GAME dans ux0:/pspemu/PSP/GAME\n \n( si vous utilisez pkgj v0.55 vous devez ajouter install_psp_as_pbp 1 au config.txt ) ( si vous utilisez le navigateur nps avec PKG2ZIP v2.3 ou plus ancien ; vous devez ajouter l'argument -p aux paramètres de pkg2zip )\n \n-- Actuellement, ni VitaShell ni PKGJ ne supportent la \"promotion\" des jeux PSP\n \nCependant, il existe un fork de VitaShell qui ajoute cette fonctionnalité :\n \nhttps://github.com/KuromeSan/VitaShell/releases\n \net sur l'écran principal, cliquez sur le triangle, appuyez sur \"refresh livearea\".\n \n-- Il est possible de faire fonctionner le téléchargement en arrière-plan, en utilisant \n \nhttps://github.com/KuromeSan/bgdl_nopspemudrm_poc\n \nLe support PKGJ devrait donc être bientôt disponible.\n \n \nTéléchargement : NoPspEmuDrm 1.00\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-544080683.png"
        }
    },
    "news_8": {
        "title": "[Wii/WiiU] WiiStation 2.4 disponible",
        "content": "Le développeur xjsxjs197 vient de mettre à jour WiiStation, comme vous le savez l'émulateur WiiSX-RX a changé son nom en WiiStation, pour rappel le programme permet d'émuler les titres de la PlayStation 1 (PS1 / PSX / PSone) sur les consoles Wii et Wii U, basé à son tour sur le port de PCSX-Reloaded et avec beaucoup plus de modifications que PCSX-ReARMed.\n \n \n \n\n \n \n \n \nChangelog version 2.4 :\n \n- Utilisation de devkitPPC r41-2 + libOGC2 pour compiler le code et résoudre le problème de certains jeux ne fonctionnant pas.\n- Utilisation de la dernière version de Lightrec pour résoudre le problème de lenteur de Destruction Derby Raw.\n- Correction de la logique d'échange de disque, et des jeux tels que Metal Gear Solid peuvent être échangés normalement.\n- Réduction du temps de chargement pour les jeux spéciaux.\n- Actuellement limité aux jeux Parasite Eve et LEGO Island 2, il devrait peut-être s'agir d'une option.\n- Correction de la logique de lecture des CDDA, n'utilisant plus le multithreading.\n- Correction du problème du Vib Ribbon jouant le son Reverb, il y a encore des problèmes mineurs.\n \n \nTéléchargement : WiiStation 2.4\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175427/in-wiiwiiu-wiistation-24-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[PS5] Des payloads PS5 comme s'il en pleuvait",
        "content": "Le développeur John Tornblom a compilé il y a quelques jours l'ensemble des payloads disponibles sur PlayStation 5 et qui sont compatibles avec ps5-payload-sdk. \n \nPrenant la forme de fichier ELF ces payloads prennent place dans ce SDK tire une partie de son code du projet PS5SDK. Ce sont pas moins de 13 payloads qui ont été compilés.\n \n \n\n \n \n \nTout est là : ps5-payload-sdk\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175360/in-ps5-des-payloads-ps5-comme-sil-en-pleuvait-1.png"
        }
    },
    "news_10": {
        "title": "[PS5] SiSTR0 travaille sur libhijacker",
        "content": "Suite à la libération du code source de libhijacker par Astrelsky, toute la scène a accès aux codes et aux commentaires du développeur permettant ainsi à d'autres personnes d'y travailler dessus.\n \nC'est le cas de SiSTR0, le développeur qui a su faire évoluer Mira, GoldHen, ou qui apporté de nombreuses contributions à FTS5, jkpatch ou encore ps4-pkg2usb.\n \n \n\n \n \nComme nous pouvons le voir, SiSTR0 propose un fork de libhijacker car il est venu modifier le code pour pouvoir compiler sous linux avec clang 12.\n \nPour ceux qui ne connaitraient pas, et ce serait bien légitime, Clang est un compilateur pour les langages de programmation C, C++ et Objective-C. Son interface de bas niveau utilise les bibliothèques LLVM pour la compilation. C'est un logiciel libre issu d'un projet de recherche universitaire.\n \nTout est là : SiSTR0/libhijacker\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1740874172.png"
        }
    },
    "news_11": {
        "title": "[PS4] GoldHEN 2.4b14 disponible",
        "content": "Le développeur Sistr0 a publié GoldHEN 2.4b14 pour la PS4 et la PS4 Pro. Il s'agit donc de la 14ème Beta de la 2.4 qui débarque avec des améliorations au niveau du chargeur de plugins, avec la prise en charge du format de fichier MC4 Cheat et au FTP, entre autres.\n \n \n\n \n\n \n \n \nLa plupart des hosts ont déjà été mis à jour, ils intègrent déjà cette version.\n \n \n\n \n \n \nChangelog :\n \n- Loader  de plugins amélioré\n- FTP amélioré\n- Amélioration de la prise en charge de MC4\n- Ajout de la prise en charge de la description de la triche\n- Installation des paquets en arrière-plan \n- Ajout d'informations sur les paquets\n- Correction de la prise en charge de la boîte à outils Orbis\n- Support des firmwares 5.05/6.72 et 9.00 \n \n \n \nPour avoir le loisir de profiter de cette nouvelle version il suffit de supporter le développeur ci-dessous.\n \nTout est là : GoldHEN 2.4b14\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175333/in-ps4-goldhen-24b14-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175333/in-ps4-goldhen-24b14-disponible-2.png"
        }
    },
    "news_12": {
        "title": "[XB] Le projet Stellar, une nouvelle puce pour la Xbox Originale",
        "content": "Il y a quelques jours Microsoft annonçait l'abandon total de la Xbox One, en effet, le géant de Redmond a annoncé qu'il ne développerait plus aucun jeu pour la Xbox One. La firme souhaite se concentrer sur la Xbox Series X et la Xbox Series S. \n \nPlus aucun jeu natif ne verra le jour sur Xbox One, cela ne signifie pas pour autant que cette console ne sera plus supportée. Petit reconfort, ce sera grâce au Xbox Cloud Gaming que Microsoft permettra de diffuser les jeux Xbox Series X et Series S sur Xbox One, maigre consolation. \n \nMais là n'est pas le sujet, il y a quelques jours a été dévoilé le projet Stellar, soit ce nom se cache une toute nouvelle solution de type modchip pour la Xbox Originale. \n \n \n\n \n\n \n \nLes développeurs, à qui l'on doit déjà la solution XboxHD+, ont travaillé dur pour proposer cette puce sur un FPGA intégré, s'appuyant sur une mémoire flash intégrée, et bénéficiant d'un port USB-C permettant de la flasher, et pouvoir déboguer le firmware. Cela permet de rendre cette solution évolutive, car bénéficiant en plus du StellarOS, un système d'exploitation spécialement taillé pour la bête. \n \nLe puce permet tout un tas de paramètre de débogage, de rendre la console compatible avec les disques jusqu'à 16 To, la prise en charge de la lecture d'ISO compressées, ou encore la prise en charge de contrôleurs Xbox One. \n \n \n\n \n \nToutes les fonctionnalités : \n \n- Outils intégrés pour le dépannage du système, la configuration, l'installation du disque dur, etc.\n- Mise à jour automatique du système basée sur le réseau.\n- ODE au niveau du noyau. (Chargement ISO)\n- Chargement ISO compressé. (CISO)\n- Prise en charge de contrôleurs supplémentaires. (Xbox One)\n- Chargement en réseau d'ISO et d'images de disques durs virtuels.\n- Prise en charge Titan+. Prise en charge des disques configurés et des disques durs formatés Titan pour un stockage natif allant jusqu'à 16 To.\n- Synchronisation UDMA optimale automatique. Jusqu'à UDMA5 autoconfiguré, vérifié et testé au démarrage.\n- Prise en charge du TRIM ATA natif.\n- Véritable contournement du lecteur de DVD. Aucune modification externe n'est nécessaire.\n- Prise en charge des configurations de RAM de 64, 128 et 256 Mo.\n- Mise à jour automatique de l'heure système via le réseau au démarrage.\n- Améliorations et corrections de la vidéo analogique avec la parité des caractéristiques de la XboxHD+.\n- Animation de démarrage native en 720P.\n- Force native 480P avec corrections HD+.\n- Améliorations Insignia.\n- Contrôle avancé du ventilateur.\n- Débogueur de kernel via USB.\n- Débogueur GDB via USB.\n- Et bien plus encore...\n \n \n \nTéléchargement : project-stellar / makemhz.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175310/in-xb-le-projet-stellar-une-nouvelle-puce-pour-la-xbox-originale-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175310/in-xb-le-projet-stellar-une-nouvelle-puce-pour-la-xbox-originale-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1175310/in-xb-le-projet-stellar-une-nouvelle-puce-pour-la-xbox-originale-3.png"
        }
    },
    "news_13": {
        "title": "[Switch] SwitchIdent v0.5 disponible",
        "content": "Trois semaines après la version 0.4, le développeur Joel16 semble reprendre un rythme intéressant sur son utilitaire SwitchIdent, pour rappel son logiciel d'identification est désormais porté sur la Nintendo Switch.\n \nL'outil comme sur les plates-formes sur lesquelles il est proposé (Vita, 3DS et Vita) permet d'afficher tout un tas d'informations sur le matériel, à savoir la version du système, du firmware, le numéro de série de la console, la région, la fréquence CPU ou GPU, ou encore les adresses IP utilisées.\n \n \n \n\n \n \n \nChangelog :\n \n- Utilisation de la résolution 1080p au lieu de 720p.\n- Correction de l'affichage du symbole de pourcentage de la batterie '%'.\n- Fusionner les informations sur la batterie et le chargeur sur une seule page. (Nous avons plus de place maintenant que nous sommes passés à une résolution 1080p).\n- Affichage correct de la température de la batterie (les températures internes (PCB) et externes (SoC) peuvent être trouvées dans la page System Info).\n- Affichage du statut du port casque dans la page System Info.\n- Afficher du firmware des joy-con de deux joy-cons connectés au P1. (Doit être retiré du rail et utilisé sans fil).\n \nRemerciements :\n \n- masagrator pour avoir indiqué que les températures internes/externes étaient respectivement liées au PCB et au SoC.\n- Le wiki SwitchBrew pour avoir documenté les différentes API de service utilisées dans SwitchIdent.\n- devkitPro pour la chaîne d'outils devkitA64 et le support de libnx.\n \n \nTéléchargement : SwitchIdent v0.5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175304/in-switch-switchident-v05-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[WiiU] Wii U Time Sync, Wup Installer GX2 et re_nfpii mis à jour",
        "content": "Petit méli-mélo de news pour la Wii U, la console reste attirante malgré ses ventes en retrait si l'on a compare aux autres consoles de Nintendo, voilà que certains développeurs ont mis à jour leur homebrews ou carrément proposé de la nouveauté, notamment pour Aroma. \n \nDéveloppé par Noa Mueller, Wii U Time Sync est un tout nouveau plugin qui va vous permettre de synchroniser automatiquement à la date et à l'heure d'internet, permettant ainsi de conserver à jour cet aspect de la console. \n \nWii U Time Sync va automatiser et garantir que la console soit toujours à jour en terme de date et d'heure, la console a tendance à se décaler par rapport à l'heure réelle, Wii U Time Sync corrige ce problème en synchronisant constamment l'horloge avec Internet , un peu comme le fait la Switch.\n \nPour l'installation, copiez le fichier \"WPS\" téléchargeable vers \" SD://wiiu/environments/aroma/plugins\", appelez le menu WUPS avec \"L\" + \"Control pad down\" + \"MOINS\" et réglez ce qui suit :\n \nSynchronisation activée : vrai\nHeure d'été : vrai\nDécalage horaire (heures) : 1 (pour l'Europe centrale)\nDécalage horaire (minutes) : 0 (pour l'Europe centrale)\nL'heure est alors synchronisée immédiatement lorsque le menu du plugin est fermé et à chaque démarrage du plugin. C'est le cas, par exemple, lorsque le menu Wii U est appelé. Cependant, la console devra peut-être être redémarrée pour que les modifications deviennent visibles.\n \nSoit dit en passant, il existe sntp pour la Wii , mais il doit être exécuté manuellement. Sur la 3DS, vous pouvez le faire dans le menu Luma3DS.\n \n \nTéléchargement : Wii U Time Sync (v1.1.0)\n \n\n \n \nWUP Installer GX2 \n \nLe célèbre outil WUP Installer GX2 a lui aussi été mis à jour pour le rendre compatible avec Aroma, cette application développée par GaryOderNichts permet comme vous le savez d'installer des titres, des DLC et des mises à jour dans la mémoire NAND ou sur un périphérique USB formaté pour la Wii U. \n \n \n\n \nTéléchargement : WUP Installer GX2\n \n \n \nre_nfpii\n \nUne réimplémentation plus ou moins précise de la bibliothèque nn_nfp.rpl de la Wii U, dans un but de recherche et d'émulation amiibo vient d'être mis à jour également. \n \n \n \n\n \n \n \n \nTéléchargement :  re_nfpii\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175283/in-wiiu-wii-u-time-sync-wup-installer-gx2-et-re-nfpii-mis-a-jour-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175283/in-wiiu-wii-u-time-sync-wup-installer-gx2-et-re-nfpii-mis-a-jour-2.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] SimpleModDownloader 1.0.0 disponible",
        "content": "Salut à tous, j'ai créé un homebrew pour la switch et ai décidé de le rendre disponible pour tout le monde. Comme vous l'avez deviné celui-ci va servir à télécharger des mods directement depuis gamebanana. Et ensuite avec SimpleModManager vous pourrez les installer. (SimpleModManager peut être téléchargé depuis SimpleModDownloader)Téléchargement : SimpleModDownloaderPost GbaTemp : gbatemp",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175281/in-switch-simplemoddownloade-100-disponible-1.jpg"
        }
    },
    "news_16": {
        "title": "[PS4] BzImages ps4 linux v2.6 saya - aeolia/belize - belize - baikal",
        "content": "BzImages ps4 linux version 2.6 saya\n\nCompilées sur ma ps4 pro\n\nRajout à la source 5.15.15 codedwrench :\n\ndivers patchs d'améliorations pour les jeux (dont fsr)\n\nmore-uarches-for-kernel 5.15-5.16.patch\nprjec_v5.15-r1.patch\n0003-glitched-base.patch\n0003-glitched-base-nonrt.patch\n.patch 0009-glitched-bmq.patch\n.patch 0007-v5.15-futex_waitv.patch\n.patch 0007-v5.15-fsync1_via_futex_waitv.patch\n\nMeilleure stabilité du wifi pour les distributions ps4 linux\n\nPossibilité d'émuler un android (fonctions activées dans le kernel du bzImage)\n\nReconnaissance des périphériques au format fat32/ntfs/exfat/ext4/btrfs\n\nDétection manettes :\nwii/ wiiu\n360 filaire\n360 sans fil + adaptateur Microsoft usb/bluetooth spécifique\nps3/ps4 filaire et wifi\n\nPartage de connexion internet par téléphone android ou iphone , en usb\n\nReconnaissance des périphériques audio sur usb\n(exemple micro usb sous discord)\n\nSnap et flatpak fonctionnels sur toutes distributions linux\n\nVPN (TUN/TAP)\n\nsupport ldt pour le jeu LOL\n\nDétections de périphériques usb wifi et usb bluetooth\n(3 fichiers configurés sont inclus dans le package, à installer sur la distribution linux utilisée)\n\n\nCompatible distributions linux en interne ou en usb\n\n \nbzImage 5.15.15 compatible carte mère aéolia/bélize\nhttps://e.pcloud.link/publink/show?code=XZfYVfZ2rgBevf80YJUYD2o9LLna0fFKrE7\n\n\nbzImage 5.15.15 compatible carte mère bélize (boot plus rapide)\nhttps://e.pcloud.link/publink/show?code=XZBYVfZScHDNtiAyThmgegFekArszLxAgek\n\n5.15.15-aeolia_belize-source_codedwrench-config saya 2.6 fallback\n(afin de détecter des périphériques)\nhttp://sayalinux.free.fr/pour_tuto_belize_2.6/compil_aeolia_belize_fallback.jpg\nhttps://e.pcloud.link/publink/show?code=XZmdVfZoDvH0WVxWqX2B9sdbERA1zTutt0X\n\nA noter que :\npour le bzImage aéolia/bélize,\nla led de la ps4 est différente suivant si l'on a une ps4 aéolia ou bélize (led bleue et led power violette clignotante / leds multi-alternante\npour le bzImage bélize,\nle boot est très rapide, led bleu/blanc + luminosité alternante\n\nRemerciements :\n\ncodedwrench pour ses sources 5.15.15 ps4 de son github\nYoshiLightStar pour les .patchs trouvés pour kernel 5.15.15\ndf_aus pour les tests de fonctionnalitées snap flatpak vpn\nDr4kk3N pour ses 3 fichiers de configuration pour le bluetooth\nfarofr pour les tests finaux pour aeolia/belize + test usb/bluetooth sur ps4 belize (sans bluetooth en natif fonctionnel)\n\n\n\nJ'ai compilé aussi un bzImage baikal 5.4.213 source whitehax0r config 2.6 saya\nhttps://e.pcloud.link/publink/show?code=XZWYVfZ1Yk5sSmauImJovmdu3OLGH8gyr07\n \n\n\n",
        "images": {}
    },
    "news_17": {
        "title": "[PS5] libhijacker de Astrelsky, le code source libéré et déjà un tools",
        "content": "Le développeur Astrelsky vient de publier cette nuit le code source de son PoC PS5 confirmant l'arrivée imminente des homebrews sur PS5. \n \nIl affirme que le github qui a été mis en oeuvre est temporaire, en attendant l'intégration de ce code dans un référentiel comme le SDK PS5. \n \n \n\n \n \nCela nous permet de confirmer que son code s'appuie sur le serveur Redis exécuté sur PS5 pour générer un processus «démon», qui lui même exécutera l'homebrew. Ainsi cela permet de lancer une autre partie exploitable différente de celle utilisée par le hack (Bluray ou Webkit), ce qui s'avère essentiel pour les homebrews. \n \nLe code source a été utilisé pour créer un petit utilitaire permettant de tester le PoC : PS5 Homebrew POC 3.xx 4.xx\n \n \n\n \n \nCode source de libhijacker : libhijacker\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175234/in-ps5-libhijacker-de-astrelsky-le-code-source-libere-et-deja-un-tools-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175234/in-ps5-libhijacker-de-astrelsky-le-code-source-libere-et-deja-un-tools-1.jpg"
        }
    },
    "news_18": {
        "title": "[Switch] Les rapports de Mai 2023 de Yuzu et Ryujinx : Zelda TotK",
        "content": "Les deux émulateurs de Nintendo Switch continuent de se faire de la concurrence, d'une part sur les évolutions apportées, mais en plus sur les rapports qui sont souvent émis à quelques heures d'intervalles, ce qui en fait un combat encore plus beau à voir, chacune des équipes de développement souhaitant apporter à son émulateur le meilleur. \n \n \n\n \n \nDu côté de chez Yuzu : \n \n \nLe rapport de Mai 2023 qui vient de paraitre fait état de plusieurs évolutions notamment pour The Legend of Zelda: Tears of the Kingdom. On l'a bien compris le titre est l'un des jeux les plus exigeants de la console. L'équipe revient sur le jeu en lui même, mais nous en explique un peu plus la technologie derrière, avec la gestion des textures ASTC, la VRAM en feu ce qui a donc imposé le rajout d'une option dans Yuzu, la recompression ASTC. \n \n \n\n \n \nCette nouvelle option vise à réduire la consommation de VRAM en transformant ces textures ASTC non prises en charge maudites par Ganon en quelque chose de plus adapté aux GPU à faible VRAM. Cela se fait actuellement à l'aide du CPU, mais l'accélération GPU est prévue pour l'avenir. Yuzu espère également ajouter une option pour utiliser BC7 à l'avenir afin de fournir une expérience de meilleure qualité.\n \nLe billet est énorme sur Zelda, mais il parle également d'Android, et des modifications graphiques, DMLA ou encore la gestion des Amibo, mais ce billet est tout simplement énorme. \n \nLe rapport est là :  yuzu-emu.org\n \n \n\n \n \n \nDu côté de Ryujinx :\n \nL'équipe de Ryujinx s'est concentré sur Breath of the Wild, oui le Zelda précédent, et sur Demon Slayer. Mais elle parle aussi de Tears of the Kingdom, comment cela pourrait en être autrement...Elle revient elle aussi sur le décodeur ASTC, et cela a amené beaucoup de bugs à l'opposé de Breath of the Wild. \n \nBreath of the Wild bénéficie des emplacements tampons exactement opposés, comme Tears of the Kingdom et la mise en oeuvre a évidemment été réglée pour le premier, pas pour le second. \n \nLe rapport est là : blog.ryujinx.org\n \n \nBref on le voit les développeurs des deux émulateurs se concentrent sur Tears of the Kingdom, un jeu qui restera dans la légende.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175200/in-switch-les-rapports-de-mai-2023-de-yuzu-et-ryujinx-zelda-totk-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175200/in-switch-les-rapports-de-mai-2023-de-yuzu-et-ryujinx-zelda-totk-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1175200/in-switch-les-rapports-de-mai-2023-de-yuzu-et-ryujinx-zelda-totk-3.png"
        }
    },
    "news_19": {
        "title": "[PS4] Iconit 5.12 disponible",
        "content": "Le développeur OfficialAhmed vient de mettre en ligne une nouvelle version d'Iconit, le logiciel qui nous permet de modifier et de remplacer l'icône des jeux sur la console PlayStation 4.\n \nAvec cette nouvelle version, le développeur a intégré de nouvelles fonctionnalités, notamment la possibilité de masquer toutes les icônes ou un ensemble d'icônes à la fois et de les télécharger directement.\n \nUn site est d'ailleurs disponible ici pour obtenir différents maques : https://all-exhost.github.io/Masks.html\n \n\nL'application de masques sur un ensemble d'icônes nécessite justement le téléchargement gratuit d'un masque à partir de ce site. \n \n \n\n \n\n \n \nVoilà le processus : \n \n- Créer un ensemble d'icônes (groupes)\n- Sélectionnez le mode Icônes dans la fenêtre principale\n- Sélectionnez Menu (coin supérieur gauche)\n- Sélectionnez Set Icon Group (Créer un groupe d'icônes)\n- Cliquez sur SET/UPDATE DEFAULT GROUP NOTE : Assurez-vous que toutes les icônes sont normales, sans modifications ni masques.\n- Toutes les icônes de la PS4 seront dans le groupe par défaut.\n \nPour créer un groupe personnalisé :\n \n- Cliquez sur SET CUSTOM GROUP (créer un groupe personnalisé)\n- Choisissez les jeux pour ce groupe, tapez le titre du groupe.\n- Cliquez sur SAUVEGARDER\n- Appliquer le masque\n- Cliquez sur Mask Maker en mode Icônes\n- Cliquez sur Mask... et choisissez le masque .Zip\n- Cliquez sur Group... et choisissez le groupe auquel appliquer le masque\n- Cliquez sur BAKE ICONS pour appliquer le masque à toutes les icônes du groupe sélectionné\n- Cliquez sur UPLOAD BAKED ICONS pour envoyer les icônes à la PS4.\n \nSi quelque chose s'est mal passé pendant le téléchargement, relancez l'application mais cette fois-ci, cliquez sur Continue (Continuer) - le processus de téléchargement sera répété pour les icônes restantes.\n\n \nTéléchargement : Iconit 5.12\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-326923226.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-187247020.jpg"
        }
    },
    "news_20": {
        "title": "[PS5] La preuve de concept de Astrelsky sur les homebrews PS5",
        "content": " \nLe développeur Astrelsky (Andrew Strelsky) vient de publier un PoC permettant de confirmer les propos de Zecoxao sur l'arrivée imminente des homebrews sur PS5.\n \nSa preuve de concept prend la forme d'un pack de fichiers composé d'un script send_elf.py , spawner.elf et test_elf.elf.\n \nCe test Homebrew, lorsqu'il est exécuté, dumpe les données du kernel sur le disque. Ce n'est pas encore un activateur d'homebrews pour PS5 (HEN). A noter qu'il faudra passer par l'exploit BD-JB ce qui en limite d'office l'accès au firmware récent.\n \n \n\n \n \nLa grande différence avec les anciennes solutions est qu'il fonctionne sur son propre processus,  le développeur mentionne que ce système \"utilise tellement de fichiers au lieu de tout extraire de dlsym\" et que \"vous pourrez lire/écrire dans d'autres processus utilisateur avec l'API. Les protections mémoire sont ignorées.\"\n \nAstrelsky a déclaré que son travail devait être nettoyé avant d'être intégré au SDK PS5 Homebrew. Il a volontaire laissé pas mal de commentaires dans ses fichiers pour parvenir à comprendre son fonctionnement, charges à certains de s'en saisir pour que dans quelques semaines ou jours quelque chose de plus concret arrive.\n \nTéléchargement : Poc\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175198/in-ps5-la-preuve-de-concept-de-astrelsky-sur-les-homebrews-ps5-1.jpg"
        }
    }
}