{
    "news_1": {
        "title": "[XB360] Une mise à jour disponible pour la Xbox 360",
        "content": "Les constructeurs nous surprendrons toujours, Microsoft vient de mettre en ligne une mise à jour firmware pour la Xbox 360. Nous la pensions tranquille, mise au repos des mises à jour, mais il n'en est rien, Microsoft a publié une mise à jour pour la Xbox 360 qui a pour ambition d'améliorer l'interface de la console ainsi que l'écran d'accueil.\n \nAprès la fermeture de la boutique officielle il y a un an, en Juillet 2024, le Dashboard a été réduit à l'essentiel, cependant quelques vignettes de jeux ont été déformées ou manquantes. Comme vous pouvez vous en doutez, Microsoft n'a pas changé ou fait évoluer le kernel ou les sécurités de la console, cette mise à jour est purement esthétique. \n \n \n\n \n \nLa firme de Redmond a simplement modifié un fichier XML fourni directement par le serveur Xbox Live, qui gère l'affichage du contenu sur l'écran d'accueil. Grâce à ce changement, les aperçus des titres s'affichent à nouveau correctement. L'écran d'accueil présente également deux grandes bannières publicitaires dédiées aux consoles Xbox Series X|S , qui occupent une part importante de l'espace visuel.\n \nIl s'agit davantage d'un petit restilage dynamique du Dashboard, l'information provient d'un utilisateur de Reddit, il affirme que la page d'accueil affiche désormais quelques publicités pour les consoles Xbox Series X|S et affiche correctement les vignettes des jeux, qui étaient auparavant étranges. De nombreux autres utilisateurs de la Xbox 360 signalent également ce changement.\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208113/in-xb360-une-mise-a-jour-disponible-pour-la-xbox-360-1.jpeg"
        }
    },
    "news_2": {
        "title": "[Switch] Le projet SDEX2M2 porte sur 3 solutions",
        "content": "Le projet SDEX2M2, celui qui a pour ambition d'exploiter le port microSD Express de la Nintendo Swutch 2, a quelque peu évolué. Au départ le projet consistait a proposer les plans pour construire un PCB pour y coupler un NVMe de type SSD ou mémoire flash.\n \n \n \n\n \n \nDésormais ce sont 3 solutions qui sont portées par SDEX2M2, à savoir la création d'une carte de sortie, appelée \"la clé\" (\"The Key\"), il s'agit d'une carte de dérivation du signal microSD Express. \n \n \n\n \n \nLa seconde solution est un PCB qui permet de coupler un NVMe de type SSD de format M2. \n \n \n\n \n \nEnfin la troisième est un PCB permettant de coupler une carte SD Express, ayant pour avantage ses grandes capacités et des lectures rapides selon les classes.\n \n \n\n \n \nIl s'agit donc là d'un adaptateur MicroSD Express vers SD Express pleine taille, extrêmement expérimental. Il permet d'insérer des cartes SD Express de pleine taille dans la Nintendo Switch 2, allant jusqu'à 128 TB de capacité de stockage, reste à savoir si la console acceptera cette capacité. Veuillez noter que ce produit n'a pas été testé, il reste possible que le signal soit probablement un problème dû à un manque de mise à la terre. \n \n \nTout est là : SDEX2M2\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208087/in-switch-le-projet-sdex2m2-porte-sur-3-solutions-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1208087/in-switch-le-projet-sdex2m2-porte-sur-3-solutions-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1208087/in-switch-le-projet-sdex2m2-porte-sur-3-solutions-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1208087/in-switch-le-projet-sdex2m2-porte-sur-3-solutions-4.png"
        }
    },
    "news_3": {
        "title": "[PS4] PlaySon 3.7.27 Beta disponible",
        "content": "Le développeur Sondio propose la version 3.7.27 de PlaySon, une application Android distribuée sous format APK afin de lancer le hack facilement sur PlayStation 4 sous tous les firmwares exploitables de la console. \n \n \n\n \n \nPrise en charge d'Android à partir de l'API 19, avec/sans accès root :\n \n- Serveur local\n- Expéditeur de la charge utile\n- Installer/mettre à jour les Pkg/Cheats/Patches\n- Affichage des paquets\n- Prise en charge du thème/Dlc/App/jeu pour l'installation/désinstallation/vérification\n- Modifier/sauvegarder/restaurer le nom/avatar du profil de l'utilisateur PS4\n- (avec root) Créer/Formater une clé USB avec goldhen.bin ou exfathax_pico.img\n- Activer/désactiver les patchs GoldHEN\n- Visionneuse de klog de GoldHEN\n- Supporte la dernière version de GoldHEN 2.4b18\n- Support de deux types de JB : \navec accès Root et adaptateur OTG-LAN -> exploit PPPwn et bloqueur DNS avec les derniers stage1 et stage2 (1.03 par SISTR0) pour :\nFW 7.00 / 7.01 / 7.02\nFW 7.50 / 7.51 / 7.55\nFW 8.00 / 8.01 / 8.03\nFW 8.50 / 8.52\nFW 9.00\nFW 9.03 / 9.04\nFW 9.50 / 9.51 / 9.60\nFW 10.00 / 10.01\nFW 10.50 / 10.70 / 10.71\nFW 11.00\n \nsans accès Root -> psfree uniquement (pour l'instant) :\nFW 7.00 au 9.60 désormais\n \n \nLe changelog du 25 Juin 2025 fait état de ce changement important. \n \nChangelog : \n \n- Ajout de lapse porté sur PS4 FW 7.00 <> 9.60 par Al Azif (ATTENTION : peut causer des problèmes avec certains jeux/applications comme un écran noir ou des sauvegardes corrompues. Pas 100 % stable.) \n- Ajout du support pour le jailbreak hors ligne \n \n \nTéléchargement : PlaySon 3.7.27 Beta\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208079/in-ps4-playson-3727-beta-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[PS5] Sony dévoile le firmware 5.1.0 pour le PS Portal",
        "content": "Sony vient discrètement ce matin de publier un nouveau firmware pour le PS Portal, le périphérique qui permet de streamer à partir de sa console PS5. Sony surprend laissant quelques joueurs sur leur faim, il faut dire que le PS Portal ne bénéficie pas d'autant de mises à jour que la PS5. \n\n \n \n \nNotes de mise à jour du logiciel système PS Portal 5.1.0 (25 juin 2025)\n \nLes notes de mise à jour de la mise à jour du portail PS d'aujourd'hui sont les suivantes :\n \n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et la convivialité sur certains écrans.\n \nComme Sony n'est pas très loquasse sur les possibilités de ce nouveau firmware, il est impossible en l'état de savoir ce qui est changé réellement dans cette mise à jour, par contre certains joueurs s'agacent de coupure intempestive, attendent des améliorations concernant la furtivité, et se plaigne que la mise à jour est excessivement longue. D'autres joueurs rapportent que certaines saccades se font ressentir, ou encore ils attendent des améliorations sur le streaming cloud. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208062/in-ps5-sony-devoile-le-firmware-510-pour-le-ps-portal-1.png"
        }
    },
    "news_5": {
        "title": "[PS3] CFW 4.92.2 Evilnat Custom Firmware Cobra 8.5 disponible",
        "content": "Le développeur Nathan Martin vient de mettre en ligne la version définitive de son CFW 4.92.2 Evilnat, intégrant les fonctions Cobra 8.5.\n \nAprès une bêta ouverte réussie, le développeur a officiellement mis à jour son firmware personnalisé pour la PS3 vers la version 4.92.2. Cette version inclut de nombreuses modifications et options pour les modèles PS3 FAT et Early Slim compatibles avec les CFW.\n \nPlusieurs correctifs ont été apportés au CFW, ainsi que des ajouts au payload Cobra . Le plugin XAI n'a pas été oublié, avec de nouvelles options, notamment un nouveau menu Overclock. Désormais, il n'est plus nécessaire de disposer d'un PUP dédié pour modifier les paramètres d'overclocking : la modification peut être effectuée directement sur le XMB. Tous les détails et modifications sont disponibles dans le changelog ci-dessous. \n \n \n \n\n \n \n \nChangelog de la version 4.92.2 :\n[CFW] Patché et activé pour mettre à jour CFW via Internet sur CEX/DEX (selon vsh.self)\n[CFW] Mise à jour logicielle du plugin.sprx corrigée depuis OFW 4.84 DEX\n[CFW] Arrière-plan d'image personnalisé en mode mise à jour\n[CFW] Certificats DEX vsh.self corrigés pour autoriser les téléchargements\n[CFW] Patché LV1 pour permettre une vitesse de ventilateur personnalisée sur PS2 EMU (Merci à @kozarovv et @mrjaredbeta )\n[CFW] Suppression des variantes CFW DEX et OC (overclocking)\n[CFW] Patché pour contourner la vérification du micrologiciel lors de la connexion sur PSN (évite le code d'erreur avec la mise à jour CFW via Internet)\n[COBRA] Charge Cobra externe réajoutée\n[COBRA] Ajout de l'overclocking RSX au démarrage avec USB ou disque dur interne\n[COBRA] Suppression de l'OPCODE épilepsie (activé par défaut)\n[COBRA] Suppression de l'OPCODE d'autorisation de restauration des appels système (activé par défaut)\n[COBRA] Suppression de l'OPCODE de saut des fichiers RIF existants\n[COBRA] Suppression du code opération du disque couleur PS2\n[COBRA] Code amélioré pour réduire sa taille\n[XAI] Ajout du menu Overclock\n[XAI] Menu repensé (Par @aldostools )\n[GUIDE] Vitesse du ventilateur PS2\n[GUIDE] Overclocking RSX\n \n \nTéléchargement : CFW 4.92.2 Evilnat Custom Firmware Cobra 8.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1208046/in-ps3-cfw-4922-evilnat-custom-firmware-cobra-85-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[Switch] Switch Theme Injector v4.8.1 et NXThemes Installer v2.8.1",
        "content": "exelix11 vient de proposer une mise à jour de SwitchThemeInjector et de NXThemesInstaller qui passent respectivement en version 4.8.1 et 2.8.1. Switch Theme Injector est chargé d'appliquer des corrections automatiques comme les applications sur les fichiers common.szs et remplace facilement le fichier bntx. NXThemes Installer quand à lui, comme son nom l'indique, permet d'installer les thèmes directement sur votre Nintendo Switch, il est compatible avec les NXThemes et szs.tv. \n \n \n\n \n \nChangelog : \n \n- Cette version ajoute des correctifs de compatibilité supplémentaires pour prendre en charge les anciens thèmes sur les firmwares 20.0 et plus récents.\n \n- En particulier, les thèmes avec d'anciennes animations ne devraient plus faire planter le menu d'accueil lors de l'installation. La section des paramètres dispose de nouvelles options pour forcer le mode de compatibilité lors de l'installation de thèmes, cela devrait aider avec certains thèmes qui n'ont qu'un fond d'écran conçu autour du placement des icônes d'une version spécifique du menu d'accueil.\n \n- De nombreuses bizarreries de compatibilité avec la version 20.0 s'appliquent toujours, vous pouvez en savoir plus dans l' article sur la version précédente. \n \n \n \nTéléchargement : Switch Theme Injector v4.8.1 et NXThemes Installer v2.8.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207987/in-switch-switch-theme-injector-v481-et-nxthemes-installer-v281-1.png"
        }
    },
    "news_7": {
        "title": "[PS5] Backporter vos dumps PS5 vous même",
        "content": "Petite mise a jour de mon outil Auto_Backport qui passe en v1.1, vous permettant de backporter vos dumps PS5 vers plusieurs firmwares.\n \nEn effet, la v1.0 permettait de backporter vers 4.03 seulement, cette nouvelle version 1.1 va vous permettre de choisir le firmware voulu selon celui de votre PS5.\n \n\n \nExemple vous avez une console PS5 en 6.50, vous pourrez maintenant backporter en 6.00 (au lieu de 4.03 dans la v1.0).\nA savoir que vous ne pourrez backporter que de -1 SDK par rapport au SDK d origine du jeu, je m'explique...\n \nDe ce que j' ai compris (je peux me tromper) et d' après mes tests, si le SDK d origine du jeu est 7.xx vous ne pourrez backporter qu' en 6.00... en dessous (5.xx, 4.xx, 3.xx, 2.xx) cela ne fonctionnera pas...\nLe SDK d origine du jeu est 8.xx, backport possible en 7.00 etc...\n \nCela fonctionne par paire en gros (certains jeux peuvent etre descendus plus bas mais ils sont très rares)\n \n8.00 >>> 7.00\n7.00 >>> 6.00\n6.00 >>> 5.00\n5.00 >>> 4.00\n \ntuto d' utilisation:\n \n\n- Créer un dossier Backport\n- Décompresser l' archive auto_backport dedans\n- Récupérer le fichier eboot.bin.esbak, TOUS  les *.prx.esbak présent en général dans (sce_module et parfois prx) et parfois ailleurs de vos dumps PS5 (sans les fichiers .esbak le backport n est pas possible)                                                                                                                                                                              - Copier ces fichiers .esbak dans votre dossier backport (vous pouvez copiez directement les dossiers sce_module et prx comprenant les .prx.esbak)\n- Lancer auto_backport v1.1.bat\n- Séléctionnez le SDK voulu (pour 4.03, tapez 4.00, pour 6.50 tapez 6.00, etc...)\n- Patientez\n- Si tout s est bien passé vous aurez alors un fichier eboot.bin et des .prx en plus des fichiers .esbak\n- Copier/coller ensuite ses nouveaux fichiers dans votre dump PS5 en respectant bien l arborescence de base.\n- Lancer votre jeu...\n \n\n \nSi vous obtenez un écran noir c est que votre jeu ne peut être backporté...  Il leur faut en plus un patch pour le GPU qui n est pas présent dans le script d origine.\n \nMerci à Speed-007 pour les offset 8.xx et 9.xx \n \nTélécharger  Auto_Backport_ v1.1\n \nPour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:\nhttps://www.paypal.com/paypalme/markus00095\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207966/in-ps5-backporter-vos-dumps-ps5-vous-meme-1.png",
            "image_2": "https://www.logic-sunrise.com/forums/public/style_emoticons/default/wink.gif"
        }
    },
    "news_8": {
        "title": "[PS4] PS4-Xplorer 2.05 disponible",
        "content": "Le développeur Lapy vient de mettre en ligne une nouvelle version de PS4-Xplorer qui est maintenant proposé en v2.05.\n \nLe développeur remercie yousef333__ de Discord pour l'avoir testé, dans cette nouvelle version il a ajouté le support jusqu'au firmware 12.02. PS4 Xplorer est une application créée sous Unity et qui permet d'effectuer diverses opérations comme couper, copier, coller, renommer, supprimer des fichiers ou des dossiers, ou encore d'explorer le stockage de la console. \n \n \n\n \n \nChangelog :\n \n- Ajout du support des firmwares jusqu'au 12.02 grâce à yousef333__ de Discord pour l'avoir testé\n \n \n \n\n \n \n \nTéléchargement : PS4-Xplorer 2.05\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207943/in-ps4-ps4-xplorer-205-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207943/in-ps4-ps4-xplorer-205-disponible-1.jpg"
        }
    },
    "news_9": {
        "title": "[PSP] La conférence PSP Homebrew Dev dans 2 jours",
        "content": "Dans 2 jours, à partir de 18h00 se tiendra l'édition 2025 de la conférence PSP Homebrew Dev, elle a fêté ses 20 années, mais elle est toujours là, et elle attire toujours autant la communauté homebrews, ainsi la PSP Homebrew Dev Conférence (PSPHDC), l'événement le plus attendu des développeurs et fans de la scène homebrew PSP, revient avec une édition extraordinaire !\n \nSi vous pensiez que la PSP était juste une chose du passé, préparez-vous car la communauté est plus vivante que jamais, et 2025 sera l'année de la révolution selon eux. \n \n \n \n\n \n \n \nOutils et développement :\n \n« PSPDEV – Qu’est-ce qui a changé ? »  ( @wouter ) – Des nouvelles sur le SDK le plus puissant pour PSP !\n \n« Media Engine Reload : ce qui change en 2025 »  ( @m-cid ) – De nouvelles frontières pour le matériel PSP.\n \n« Leap Engine : amenez vos projets sur PSP ! »  ( @iyenal ) – Un moteur pour simplifier le développement.\n \n« SDL3 »  ( @wouter ) – Mises à jour sur la bibliothèque qui révolutionne les jeux homebrew.\n \nJeux et portages :\n \n« Nazi Zombies: Portable »  ( @Cypress ) – Zombies, armes et survie sur votre PSP !\n \n« Zombie Crisis: Director's Cut »  ( @Andrew « Hudson » Childs ) – Un classique de l'horreur réinventé.\n \n« Neighbours from Hell »  ( @Dantron ) – Le classique culte humoristique enfin sur PSP !\n \n« Minecraft Story Mode pour PSP »  ( @entitybtw ) \n \nModding et firmware :\n \n« ARK-4 Custom Firmware »  ( @acid_snake ) – Le futur du CFW PSP est là !\n \n« Exploration de la sortie vidéo PSP-1000 »  ( @joshjenney ) – Modifications matérielles et logicielles pour la sortie vidéo.\n \nDécompilations et traductions :\n \n« Décompilation correspondante de Castlevania SOTN pour PSP »  ( @xeeynamo ) – La légendaire Symphonie de la Nuit révélée !\n \n\"Puyo Puyo !! Traduction anglaise de l'édition 20e anniversaire\"  ( @Armando ) – Enfin en anglais !\n \n \n \n \n\n \n \n \nRendez-vous le 21 juin 2025 à 18h00 CET !   Discord ici . \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207876/in-psp-la-conference-psp-homebrew-dev-dans-2-jours-1.png"
        }
    },
    "news_10": {
        "title": "[Switch] NxNandManager supporte désormais le firmware 20.1.5",
        "content": "Proposé à l'origine par Eliboa, l'utilisateur JerémKO nous propose de découvrir une nouvelle version de NxNandManager qui supporte le tout dernier firmware 20.1.5. Comme vous le savez NxNandManager  est un utilitaire dont le but principal est de copier le contenu de Nintendo Switch (NAND complet ou une partition spécifique) vers / depuis un fichier ou un lecteur physique, cependant il faut le mettre à jour à chaque arrivée de nouveau firmware. \n \nVous l'aurez compris, il ne s'agit pas d'une version officielle, mais d'un fork de la version 5.2.1 qui supporte la mise à jour 20.1.5.\n \n \n\n \n \nTéléchargement : NxNandManager_v5.2.1_update20.1.5_x64 (112 Mo)\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207855/in-switch-nxnandmanager-supporte-desormais-le-firmware-2015-1.jpg"
        }
    },
    "news_11": {
        "title": "[Switch] Sphaira 0.13.3 disponible",
        "content": " \nLe développeur TotalJustice a proposé plusieurs mises à jour successive de Sphaira, la solution de remplacement du hbmenu proposant des fonctionnalités inédites, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \nLes changements dans ces versions sont nombreux compte tenu qu'il a proposé la v0.13 puis la 0.13.1 et désormais la v0.13.2, cela passe par l'optimisation du téléchargement, du serveur FTP, il est venu corrigé pas mal de crashs, des blocages, et des suppressions intempestives. \n \n \n\n \n\n \n \nv0.13.2 : \n \n- Correction de la détection de carte dans le menu GameCard.\n- Correction de CreateFolderWithPath pour le crash du disque dur en raison d'une déréférencement nullptr.\n \nv0.13.1 :\n \n- Correction d'un blocage potentiel si un jpeg non valide était chargé avec nvjpg (merci à Dark_Iron_Xpour avoir signalé et aidé à corriger le bogue).\n \nv0.13.0 :\n \nCorrections de bugs :\n- Correction d'un crash rare lors de la fermeture de l'App Store.\n- Correction du menu gc ne permettant pas de sélectionner « Retour » lorsqu'une carte de jeu n'est pas insérée.\n- Correction du crash du téléchargement du thème themezer lors du téléchargement de certains thèmes contenant % dans leur nom de fichier.\n- Correction du blocage du disque dur lors de la copie, de la compression ou de la décompression du disque dur vers le disque dur en raison d'un bug de blocage dans usbhsfs (sera bientôt corrigé en amont).\n- Correction de la non-suppression de la sauvegarde avant la restauration, ce qui pouvait entraîner la conservation de fichiers obsolètes.\n- Correction de la structure du ticket es qui n'avait pas la bonne taille, ce qui pouvait entraîner l'échec des installations.\n- Correction du navigateur de fichiers qui n'affichait pas le système de fichiers de montage actuel correct lorsque les traductions étaient activées.\n- Correction du bouton d'écran partagé du navigateur de fichiers qui ne fonctionne pas.\n- Fichiers tik/cert fixes placés au début du nsp lors du vidage, ils sont désormais placés à la fin de la liste des fichiers, conformément au standard NSP.\n \nCe qui a changé : \n- Ajout de la sauvegarde/restauration sur USB.\n- Homebrew s'actualise lorsqu'une application est installée/supprimée de l'Appstore, ainsi que lors du téléchargement via ghdl.\n- Prise en charge ajoutée pour tous les types de sauvegarde (système, bcat, cache, périphérique).\n- Ajout de messages d'erreur plus descriptifs pour les erreurs internes de Sphaira.\n- Activation du mode boost le plus tôt possible lors de l'initialisation.\n- Ajout de la prise en charge du montage personnalisé mtp (carte SD, image SD/NAND, installation, test de vitesse).\n- Utilisation de l'horodatage de sauvegarde réel lors de la création d'une sauvegarde zip de sauvegarde.\n- Ajout d'un correctif de ticket commun si le ticket a été modifié. ceci est appliqué lors de l'installation et du vidage du jeu.\n- Ajout d'une option de conversion de ticket personnalisé -> commun pour l'installation.\n- Mise à jour de nombreuses traductions\n \n \nEdit 17h00 v0.13.3\n \nTéléchargement : Sphaira 0.13.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207852/in-switch-sphaira-0132-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207852/in-switch-sphaira-0132-disponible-2.png"
        }
    },
    "news_12": {
        "title": "[Switch 1 &#38; 2] Nintendo sort le firmware 20.1.5",
        "content": " \nNintendo vient de dégainer un nouveau firmware à destination de la Switch 1 et 2, la firme ne dit pas à quoi sert réellement ce firmware, certains disent qu'il pourrait rectifier les quelques instabilités Wifi relevées sur la Switch 2 par certains utilisateurs. Les deux consoles partagent désormais le même firmware, ce qui va compliqué pour connaitre les nouveautés de l'une et de l'autre si le changelog n'est pas détaillé.\n \n \n\n \n \n \nChangelog :\n \n- Améliorations générales de la stabilité du système pour une expérience utilisateur optimale.\n- SwtichBrew n'a pas encore communiqué sur ce firmware.\n- Comme toujours, veuillez attendre que Homebrew soit à jour si nécessaire pour effectuer la mise à jour.\n \nD'après les premiers retours, ce firmware 20.1.5 ne dispose pas de nouvelles clés, les correctifs Bootloader et PNGShot sont les mêmes que sur le 20.1.1.\n \n \n\n \n \nLa mise à jour concerne : \n \n- Modules système : compte, ns, erpt, pctl, migration.\n- Applets : qlaunch.\n \nTous les changements sont référencés ici : https://switchbrew.org/wiki/20.1.5\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207830/in-switch-1-2-nintendo-sort-le-firmware-2015-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207830/in-switch-1-2-nintendo-sort-le-firmware-2015-2.png"
        }
    },
    "news_13": {
        "title": "[Switch2] David Buchanan continue d'analyser sa Switch 2",
        "content": " \nDavid Buchanan, un spécialiste de rétro-ingénierie, aussi appelée ingénierie inverse ou inversée, a continué d'analyser sa Nintendo Switch 2. Pour rappel, David Buchanan est la personne qui s'est donné comme projet de développer une solution permettant de convertir le port microSD Express en SSD NVMe. \n \nLe développeur précise qu'il est un passionné d'informatique, et d'électronique, mais pas de la Switch 2, sur son profil il est question de la Switch 2, mais aussi de beaucoup d'autres choses intéressantes. \n \nPremière chose intéressante, Nintendo propose un \"jeu\" portant le nom de \"Welcome Tour\", vendu 9.99 euros, ce titre par moment permet de se retrouver dans les entrailles de la console, et bien sachez que Nintendo est allé jusqu'à reproduire exactement le PCB initial de la Switch 2 dans son jeu. \n \n \n\n \n \nDans le jeu c'est la \"Inner Area\" qui montre la console de l'intérieur, on y découvre des détails très précis comme la puissance et la capacité de la batterie, certains se sont empressés de la démonter, mais tout est là, 3.78 volts, 5220 mAh, 19.74 Wh. \n \n \n\n \n\n \n \nMais c'est surtout sur la partie analyse du PCB que les détails sont frappants, les ponts et le circuit imprimé apparait comme en réalité. \n \n \n\n \n \nDavid Buchanan a analysé le signal de la Switch 2, mais cela n'apporte rien et il a republié un Github sur un autre développeur qui propose des plans et templates sur des adaptateurs Micro SD express. Ca s'organise doucement, mais concrètement il faudra passer par l'ajout d'un Raspberry, ce qui complexifie l'approche de David Buchanan, qui elle se base sur les possibilités de gestion du contrôleur PCIe de la Switch 2. \n \n \n \n \n\n \n\n \n \nLa : SD-Express-Template-and-Adapters\n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207810/in-switch2-david-buchanan-continue-danalyser-sa-switch-2-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207810/in-switch2-david-buchanan-continue-danalyser-sa-switch-2-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1207810/in-switch2-david-buchanan-continue-danalyser-sa-switch-2-1.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1207810/in-switch2-david-buchanan-continue-danalyser-sa-switch-2-3.png",
            "image_5": "https://www.logic-sunrise.com/images/news/1207810/in-switch2-david-buchanan-continue-danalyser-sa-switch-2-4.png"
        }
    },
    "news_14": {
        "title": "[PS4] GoldHEN supportera bientôt les firmwares 11.02, 12.00 et 12.02",
        "content": " \nAvec plus de 300 offsets, GoldHEN est comme vous le savez le payload majeur de la PS4, supportant officiellement les firmware 5.05, 6.71, 6.72, 9.00, 9.60, 10.00, 10.01, 10.50, 10.70, 10.71 et 11.00, il n'en demeure pas moins encore sujet à évolution.\n \n \n \n\n \n \n \nRécemment a été découvert la possibilité de lancer les Debugs Settings sur les tous derniers firmwares, notamment en combinant Remote Lua Loader avec Lapse, le dernier exploit découvert pour la PS4, bien entendu pour cela il faut s'appuyer sur la version la plus récente de Remote Lua Loader, et surtout sur les dernières versions des payloads, c'est pourquoi par exemple Al Azif recommande d'injecter les payloads plutôt que d'utiliser des solutions toute-en-une qui parfois ne bénéficient pas des dernières versions. \n \n \n \n\n \n \n \n \nQuoiqu'il en soit avec les possibilités offertes par la mise à jour de Vortex-HEN d'Echo Stretch, et ces nouveaux payloads compatibles avec la version Lua de Lapse, tout devient possible, et le développeur SisTR0 travaille activement à la nouvelle version de GoldHEN, l'exploit a été trouvé, les offsets également, le développeur Zecoxao de son côté demande à tous ceux qui disposent d'une PS4 sous firmware 12.02 avec un compte PSN actif de dumper les jeux via FTP et les lui envoyer, et qu'il s'occupera du reste, rappelant que le chemin d'accès est /mnt/sandbox/pfsmnt.\n \nEn entendant que cette version de GoldHEN se finalise, il est recommandé d'utiliser la version personnalisée de shahrilnet de Remote Lua Loader, qui intègre les toutes dernières évolutions. \n \n \n \n\n \n \n[2025-06-17]\n- Ajout d'un payload pour dumper le kernel via le JB PS4\n- Correction du serveur ftp et de la description de Lapse\n \n[2025-06-16]\n- Ajout de correctifs pour le kernel de la PS4 pour les firmwares compris entre 9.00 et 12.00\n- Ajout de la post-exploitation Lapse PS4 \n- bin_loader.lua \n- Chargement des payloads à partir d'un socket sur le port 9021 ou du système de fichiers.\n- Ajout de FuyuKiss à ftp_server.lua\n \nTéléchargement : remote_lua_loader de shahrilnet\n \n \nL'autre Remote Lua Loader qui évolue rapidement est celui de Master-s qui est régulièrement mis à jour puisqu'il s'agit d'un fork de celui de shahrilnet.\n \n \n\n \n \nTéléchargement : remote_lua_loader 4.3\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207773/in-ps4-goldhen-supportera-bientot-les-firmwares-1102-1200-et-1202-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1207773/in-ps4-goldhen-supportera-bientot-les-firmwares-1102-1200-et-1202-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1207773/in-ps4-goldhen-supportera-bientot-les-firmwares-1102-1200-et-1202-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1207773/in-ps4-goldhen-supportera-bientot-les-firmwares-1102-1200-et-1202-3.png"
        }
    },
    "news_15": {
        "title": "[Xbox] Microsoft annonce une nouvelle génération de console",
        "content": "Microsoft vient d'annoncer le développement de la prochaine génération de consoles Xbox, une bonne nouvelle, sachant que Sony a fait également des allusions à sa PS6 il y a quelques heures. \n \nMicrosoft a confirmé que sa console est actuellement en développement et qu'elle aura pour coeur un APU proposé par AMD, l'annonce a été faite par Sarah Bond, rien de surprenant donc sur ce point, les APU des dernières Xbox étant toujours des dérivés d'APU d'AMD, un kit AMD 4800s pour la Xbox Series X. \n \n \n\n \n \nElle est assez explicite dans sa vidéo, elle annonce que la console sera dans votre salon et entre vos mains, petite information importante, elle annonce que la nouvelle génération maintiendra la compatibilité avec votre bibliothèque actuelle, la fameuse rétrocompatibilité toujours annoncée, et jamais réellement physique puisqu'il faut passer par le cloud ou l'émulation.\n \n \n\n \n \nElle annonce aussi que la limite ne sera plus hardware, mais que la dimension de jeu va se faire au delà, avec notamment du multi-plate forme, on pense tous au Xcloud, et surtout là encore un partenariat étroit avec Windows.\n \n \n\n \n \nBon, il restera à voir ce à quoi nous allons assister, la naissance d'une Xbox portable, ou bien une console hybride à la Switch 2 mais beaucoup plus puissante, l'essentiel étant aussi d'assurer la ludothèque, la disponibilité et la qualité des jeux, ce qui n'a pas toujours été le cas sur la génération actuelle.\n \n \n\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207769/in-xbox-microsoft-annonce-une-nouvelle-generation-de-console-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207769/in-xbox-microsoft-annonce-une-nouvelle-generation-de-console-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1207769/in-xbox-microsoft-annonce-une-nouvelle-generation-de-console-3.png"
        }
    },
    "news_16": {
        "title": "[PS4] EchoStretch dévoile un nouveau HEN compatible avec les firmwares 12.00 et 12.02",
        "content": "Le développeur Echo Stretch dévoile une nouvelle version du HEN, au travers de ps4-hen-vtx, qui dispose du support des firmwares 12.00 et 12.02 de la PS4. \n \n \n\n \n \nAprès avoir proposé quelques correctifs pour le firmware 11.02, le développeur, avec l'aide de egycnq, a mis à jour son HEN afin de rajouter donc le support de ces firmwares. \n \n \n\n \n \nPour rendre cela possible, il faut passer par Remote Lua Loader, puis lancer le payload ps4-hen-1200-vtx, et les debugs settings deviennent alors accessibles. \n \n \nTéléchargement : ps4-hen-vtx\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207671/in-ps4-echostretch-devoile-un-nouveau-hen-compatible-avec-les-firmwares-1200-et-1202-1.jpg"
        }
    },
    "news_17": {
        "title": "[Switch2] Les bans se multiplient suite à l'utilisation du MigFlash sur Switch 2",
        "content": "Il semblerait que le risque de ban de Switch 2, après utilisation du MigFlash, soit très élevé, ou du moins certains utilisateurs commencent à informer que leur console Switch 2 a été bannie après son utilisation. \n \nC'est le cas de SquareSphere et de givemeupvotes qui rapportent en effet sur Reddit que Nintendo a banni leur console, pour le premier il a utilisé en ligne sa console Switch 2 après avoir profité du MigFlash, sa console a été bannie mais son compte lui ne l'a pas été, il n'a utilisé que des sauvegardes personnelles et aucun jeu téléchargé sur internet, il pense qu'il doit y avoir une nouvelle détection de Nintendo. Il rajoute qu'il a voulu jouer en ligne avec son MigFlash, ce qui nous pouvons en convenir n'est pas très malin. \n \n \n \n\n \n\n \n \n \nLe second utilisateur dispose lui de plusieurs consoles, deux Switch (une OLD et une OLED) de première génération et une Switch 2, là aussi un MigFlash avec ses propres sauvegardes, l'utilisant depuis longtemps sur la première génération sans aucun problème.\n \n \n\n \n \nIl raconte lui avoir juste essayer de mettre le MigFlash dans sa Switch 2, et que cela n'a pas fonctionné, il fallait en effet qu'il installe le dernier firmware 1.2.0 pour pouvoir profiter de ces jeux. Il a tenté de télécharger une mise à jour de jeu et d'exécuter ce jeu Switch 1 sur sa Switch 2.\n \nMais il dit que sa console a téléchargé une sorte de mise à jour, probablement il parle là du signalement du bannissement de la console. Clairement si vous utilisez un MigFlash dans une Switch 2, et que vous la connectez à internet (jeu en ligne, nintendo store, eshop...) le risque de ban semble très élevé. \n \n \n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207669/in-switch2-les-bans-se-multiplient-suite-a-lutilisation-du-migflash-sur-switch-2-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1207669/in-switch2-les-bans-se-multiplient-suite-a-lutilisation-du-migflash-sur-switch-2-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1207669/in-switch2-les-bans-se-multiplient-suite-a-lutilisation-du-migflash-sur-switch-2-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1207669/in-switch2-les-bans-se-multiplient-suite-a-lutilisation-du-migflash-sur-switch-2-4.jpg"
        }
    },
    "news_18": {
        "title": "[Switch2] Activer le port MicroSD sans carte MicroSD Extrem",
        "content": "Exactement comme sur la Nintendo Switch de première génération, il est possible sur la Nintendo Switch 2 d'activer la fonction de la carte micro-SD Extrem sans pour autant en disposer, en s'appuyant sur une carte micro-SD classique. La Switch 2 intègre une nouvelle norme microSD, le microSD Express.\n \nL'utilisation de l'emplacement microSD Express de la Switch 2 nécessite au minimum la version 20.1.1 du firmware de la console, mais nécessite également une mise à jour ponctuelle des fonctionnalités, déclenchée par l'insertion d'une carte microSD Express et une connexion à Internet.\n \n \n\n \n\n \n\n \n\n \n \nCette fonctionnalité doit être téléchargée, il pourrait être intéressant de télécharger l'astuce avant qu'une mise à jour vienne corriger le bug, pour réaliser l'astuce, il suffit de mettre une carte SD au format exfat et d'aller sur l'importation de photo et vidéo, une mise à jour se télécharge alors et l'installation du pilote (driver) est donc réalisée via une mise à jour transparente. Cette vidéo explique comment déclencher la mise à jour et l'installer sans utiliser de carte microSD Express, une simple carte microSD standard suffit !\n \n \n\n \n \nTout cela est confirmé par MrMario dans une vidéo, ainsi il n'est pas indispensable de disposer d'une MicroSD Express Cards, une simple SD est bel et bien compatible. \n \n \nMerci à magicden pour l'information en MP\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207581/in-switch2-activer-le-port-microsd-sans-carte-microsd-extrem-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1207581/in-switch2-activer-le-port-microsd-sans-carte-microsd-extrem-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1207581/in-switch2-activer-le-port-microsd-sans-carte-microsd-extrem-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1207581/in-switch2-activer-le-port-microsd-sans-carte-microsd-extrem-4.png"
        }
    },
    "news_19": {
        "title": "[Switch2] De nombreuses vidéos fakes sur Nintendo Switch 2",
        "content": "Des petits malins dévoilent de trop nombreuses vidéos sur le lancement de jeux Switch 2 ou sur la possibilité de dumper des jeux Switch 2 pensant pouvoir en tirer quelques euros. Sachez que tout ce que vous pourriez découvrir au travers des réseaux sociaux ou de certains sites commerciaux sont tout simplement des fakes. \n \n \n \n\n \n \n \nLa dernière en date concerne BlueNX, une vidéo postée par un certain deadkernel, tout cela est fake, on y voit clairement que ce lancement se fait sur une Switch de première génération. \n \nLe HOS utilisé est le firmware 18.1.0, firmware qui n'existe pas sur la Switch 2, on y voit que le numéro de série utilisé ne correspond à celui d'une console de seconde génération, puisqu'ils commencent par HAE1003XXXXXX, on y voit clairement l'utilisation de 4 Go de Ram, alors que la Switch 2 dispose de 12 Go.\n \n \n\n \n \n \n \nCe CFW BlueNX-launcher v0.8.1-alpha n'existe nulle part, et est tout simplement un vaporware, ne vous laissez pas tromper. \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207569/in-switch2-de-nombreuses-videos-fakes-sur-nintendo-switch-2-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch2] MigFlash propose le firmware pour les jeux Switch 1",
        "content": "Comme annoncé, l'équipe en charge du développement du linker MigFlash propose la mise à jour firmware de leur solution permettant de lancer officiellement les jeux Switch 1 sur la Nintendo Switch 2. \n \nLe firmware 1.2.0 vient d'être rajouté à la section téléchargement de leur site institutionnel, permettant à tout détenteur de Switch 2 de lancer les titres Switch 1, l'équipe rajoute que cette mise à jour ne contient rien d'autre. \n \nD'ailleurs, la team informe que \" d'autres nouveautés seront disponibles dans le prochain firmware que nous publierons \" . Les vidéos de lancement de titres Switch 1 sur Nintendo Switch 2 avec MigFlash se multiplient.\n \n \n\n \n \nTout est là : \n \nhttps://migflash.com/\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1207566/in-switch2-migflash-propose-le-firmware-pour-les-jeux-switch-1-1.jpg"
        }
    }
}