{
    "news_1": {
        "title": "[Multi] PS Multi Tools v13.0.2 avec PSMT Library v1.0.2 disponible",
        "content": "Le développeur SvenGDK est déjà de retour avec une nouvelle version de PS Multi Tools, l'outil à tout faire pour utilisateurs PlayStation est donc disponible dans sa version 13.0.1 et débarque avec PSMT Library v1.0.2 qui est intégrée. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \nCette nouvelle version apporte son lot de changements. \n \n \n\n \n \nChangelog dans PS Multi Tools v13.0.1 :\n- L'option Strict est désormais activée\n- La mise à jour de la bibliothèque est désormais totalement optionnelle\n- Un changelog avec les changements de la bibliothèque sera désormais affiché après une mise à jour\n- Ajout des actions manquantes du menu contextuel PKG Info pour PS3/PS4/PS Vita\n\n \nChangelog dans PS Multi Tools v13.0.2 :\n- Correction de PKGInfo (modification de l'utilisation dans psmt-lib)\n- La bibliothèque de jeux PSP affiche désormais clairement la sélection d'un élément\n- La bibliothèque de jeux PS Vita affiche désormais clairement la sélection d'un élément\n- Le titre du jeu ou de l'application devrait maintenant s'afficher correctement sur PSP et Vita.\n- L'option de menu Bibliothèque->\"Ouvrir le dossier Téléchargements\" fonctionne désormais dans tous les menus (si le dossier Téléchargements existe).\n \n\nChangelog dans la bibliothèque PSMT incluse v1.0.2 :\n- L'option Strict est désormais activée\n- Navigateur FTP : Créer un nouveau dossier devrait fonctionner maintenant\n- Mise à jour de MOD WebMAN vers la version 1.47.45\n- Ajout de liens vers les hôtes PS4 (n'affiche que les liens)\n- PackageInfoWindow -> DownloadPackageInfoWindow (Charge les infos depuis le web avec l'ID du contenu)\n- Nouvelle fenêtre PKGInfo pour PS3/PS4/PSV (Charge les infos depuis .pkg)\n- Autres corrections et changements mineurs\n \n \nTéléchargement : PS Multi Tools v13.0.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174102/in-multi-ps-multi-tools-v1301-avec-psmt-library-v102-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PS4] Une nouvelle clé SMU dévoilée sur la PS4",
        "content": "Le développeur Zecoxao, qui s'est de nouveau fait bannir son compte de Twitter, vient d'annoncer qu'une nouvelle clé très intéressante vient de faire son apparition. Certains progrès qui nous viennent du décryptage du SMU (unité de gestion du système AMD) des PS4. \n \nCette clé, utilisée pour décrypter les firmwares de débogage, est également compatible pour les hashs des firmwares des consoles Retail, cela pourrait faire évoluer le hack PS4 vers un décryptage des firmwares, en parvenant à apporter un custom firmware par exemple sur la PS4. Zecoxao précise que vous pouvez probablement dumper vos propres clés/fusibles avec l'exécution du code SMU.\n \n \n\n \n\n \n \nL'AMD System Management Unit (SMU) est une unité de gestion thermique et électrique présente dans les processeurs AMD x86 modernes, ce SMU serait assez similaire sur PS5, mais rien n'est confirmé de ce côté là, il ne faut même rien en attendre, les développeurs se concentrant sur la PS4. Le déblocage du SMU pourrait aussi permettre de profiter de nouveaux espaces pour libérer de la mémoire exploitable, et ainsi permettant l'exécution de codes, bref lancer des outils et des hacks plus facilement sur les derniers firmwares notamment. \n \n \nLa clé quand a elle se trouve dors et déjà sur le wiki.\n \nLe reste est là : twitter.com / fahrplan.events.ccc.de\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174070/in-ps4-une-nouvelle-cle-smu-devoilee-sur-la-ps4-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174070/in-ps4-une-nouvelle-cle-smu-devoilee-sur-la-ps4-2.png"
        }
    },
    "news_3": {
        "title": "[PS3] CCAPI 4.90 CEX disponible",
        "content": "Enstone, qui est pour rappel un développeur français, nous propose une mise à jour de CCAPI, l'API qui vous permet d'exploiter Control Console, une application qui vous permet de connecter votre console PlayStation 3 à votre PC avec l'API TMAPI (Target Manager), comme cela est possible via une console DEX. \n \n \n\n \n \nAttention, CCapi peut provoquer un soft brick sur les slims et super slim en HEN, CCAPI se destine aux consoles disposant d'un CFW. Pour rappel, CCAPI (Control Console API) est une application qui nous permet de connecter un PC à la  PS3 via TMAPI comme il est possible de le faire avec les consoles DEX. Pour rappel, CCAPI établit une interface entre votre PS3 et votre PC, facilitant le lancement de commandes, comme la modification de l'IDPS (ou du PSID) de la console. Il vous permet aussi de connaître les températures en direct, ou encore d'établir des mods RTE, tout cela en wifi ou via le câble réseau. Cette révision 11 apporte le support des firmwares 4.90 CEX. \n \n \n\n \n \nAttention à ne pas utiliser sur HEN ni sur PEX 4.90.\n \n \nTéléchargement : CCapi (Control Console Api) V2.80 Rev11\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174048/in-ps3-ccapi-490-cex-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174048/in-ps3-ccapi-490-cex-disponible-1.jpg"
        }
    },
    "news_4": {
        "title": "[Multi] La Anbernic RG405M voit débarquer un CFW !",
        "content": "Alors là nous vous avouons ne pas connaitre cette \"console\", nous découvrons donc ensemble la RG405M, il s'agit là d'une console proposé par Anbernic qui est une société chinoise spécialisée dans la fabrication de consoles de jeux rétro et de produits électroniques similaires. Ils se sont fait connaître en produisant des consoles de jeux portables qui émulent des systèmes de jeux classiques tels que le Game Boy, le Super Nintendo et la Sega Megadrive.\n \nLes consoles d'Anbernic sont généralement dotées d'un écran couleur, de boutons de contrôle, de haut-parleurs intégrés et d'une batterie rechargeable. Elles prennent en charge une large gamme de jeux rétro, offrant ainsi aux joueurs la possibilité de revivre les expériences de jeux classiques sur des appareils portables. En plus des consoles portables, Anbernic propose également des boîtiers de console de jeux rétro basés sur des cartes Raspberry Pi, ce qui permet aux utilisateurs de construire leur propre système de jeux rétro personnalisé.\n \n \n\n \n\n \n\n \n \nAu delà des spécifications techniques intéressantes, cette Ambernic RG405M que l'on retrouve autour des 180 à 200 euros selon la mémoire que vous prenez avec de 128 Go (eMMC) extensible à 384 Go (MicroSD avec une 256 Go) dispose de nombreux avantages. \n \nCette nouvelle console compacte et élégante est spécialement conçue pour les amateurs de jeux nostalgiques. Avec son écran couleur haute résolution de 4,5 pouces, de 4267 jeux Android, PS2, WII, NGC, 3DS, PSP, DC, SS, PS1, NDS, N64, CPS1, CPS2, CPS3, FBA, NEOGEO, GBA, GBC, GB , SFC, FC, MD, SMS, GG, MSX, PCE, WSC, N-Gage et plus de 20 formats de jeux émulateurs dans un corps en aluminium CNC ultra-compact.\n \nJusque là une console chinoise rétro, ok pas de quoi sauter au plafond non plus compte tenu de sa résolution assez faible de seulement 640*480, mais là où cela commence à devenir intéressant c'est qu'un CFW répondant au nom de GammaOS vient de faire son apparition !\n \n \n\n \n\n \n \nVoilà les caractéristiques de GammaOS :\n \n- Basé sur une version LineageOS 19.1 propre et déverrouillée, Android 12 pour une expérience plus fluide. Applications non essentielles supprimées.\n- Lanceur Daijisho en tant que frontal, préconfiguré avec RetroArch pour certains systèmes. (Paramètres optimisés pour GB, GBC, GBA, NES, SNES, Genesis, PSX).\n- Play Store et magasin Aurora inclus.\n- Bloqueur de publicité Adguard inclus par défaut (peut être désactivé via les paramètres DNS privés).\n- Magisk/root inclus (peut être activé après le redémarrage de l'appareil).\n- Taux de rafraîchissement fixe de 60 Hz pour l'affichage (le stock est de 61,2 Hz et peut causer des problèmes de rythme d'image avec l'émulation).\n- Affichage de partage fixe.\n- Étalonnage du stick analogique pour des contrôles plus stricts.\n- Le CPU et le GPU utilisent désormais des régulateurs de performances pour une amélioration supplémentaire des performances.\n- Nouveaux pilotes GPU tirés de Retroid Pocket 3+ pour une nouvelle amélioration des performances.\n \n \n\n \n \nNous devons ce CFW au développeur TheGammaSqueeze qui nous montre comment flasher la console, qui après proposé la v1.0, propose déjà la v1.1.\n \n \nChangelog 1.1 :\n \n(v1.1) Mise à jour de l'image de base du système vers lineage-19.1-20230508-UNOFFICIAL-arm64_bgN.\n(v1.1) Débloquer la fréquence de la mémoire DDR à 1866mhz pour augmenter les performances.\n(v1.1) Déplacement du pilote graphique Retroid Pocket 3+ vers une version expérimentale séparée. Réintroduction par défaut du pilote graphique Anbernic avec des optimisations supplémentaires.\n(v1.1) Mise à jour des scripts de flashage pour utiliser une méthode de flashage alternative afin d'éviter les problèmes avec les appareils incompatibles. Mise à jour des instructions.\n(v1.1) Mise à jour de RetroArch/Daijisho - pour les nouvelles installations/réinitialisation d'usine uniquement. Changement du noyau SNES RetroArch par défaut en Snes9x Current pour résoudre le bug des contrôles qui ne fonctionnaient pas lors du lancement à partir de Daijisho.\n(v1.1) Mise à jour des paramètres de RetroArch - pour les nouvelles installations/réinitialisations d'usine uniquement. La bascule du menu est déplacée vers la combinaison L3 + R3. L'option Close Content menu permet de fermer RetroArch et de revenir à l'application précédente (généralement Daijisho). Augmentation de la taille de la police du menu.\n(v1.1) Mise à jour des raccourcis clavier de RetroArch - pour les nouvelles installations/réinitialisations uniquement (Home/Back button + L1/Slow Motion | L2/Load State | R2/Save State | R1/Fast Forward | X/Show FPS | Y/Screenshot).\n \n \n\n \n \n \nTéléchargement : Gamma OS v1.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174046/in-multi-la-anbernic-rg405m-voit-debarquer-un-cfw-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174046/in-multi-la-anbernic-rg405m-voit-debarquer-un-cfw-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1174046/in-multi-la-anbernic-rg405m-voit-debarquer-un-cfw-3.png"
        }
    },
    "news_5": {
        "title": "[Switch] Ultimate-Switch-Hack-Script 4.3.294 disponible",
        "content": "Cela faisait un moment que je n'avait pas posté de new sur mon Ultimate-Switch-Hack-Script qui, depuis près d'un an et demi maintenant, est passé en version 4.3.294.\nPour rappel, mon script permet par exemple de préparer une SD avec le contenu nécessaire au lancement d'un CFW, des homebrews, des modules et des overlays; de plus, il est possible de créer des profiles pour chaque élément se qui permet une configuration à la fois assez précise et qui peut être reproduite rapidement. Le script contient aussi de multiples fonctions permettant d'agir sur la nand (infos, dump, restauration, activation/désactivation de l'auto-rcm, montage d'une partie de la nand sur le PC grâce à Memloader...), il contient un lanceur de payload, on y trouve aussi NSC_Builder traduit en français, des outils pour flasher les différentes puces existantes et encore bien d'autres choses, voir cette page pour voir une liste de fonctionnalités plus détaillée qui doit être elle aussi incomplète tant il y a de choses,mais le mieux reste de naviguer dans les menus du script et de voir se qu'il propose.\nDepuis la dernière new les évolutions sont très nombreuses, bien trop pour être notées ici. Cependant comme d'habitude le support des derniers firmwares a été ajouté, le support du Picofly a été implémenté, les mises à jour des différents logiciels utilisés ainsi que des homebrews ont été effectuées et il y a eu des corrections de bugs et probablement d'autres choses que j'ai oublié de noter ici mais voir plus bas pour savoir comment consulter les changelogs complets.\n \n\nJe me permet de rappeler que mon script n'est qu'une aide pour le hack et même si les choses sont généralement expliquées durant l'exécution des fonctionnalités cela ne dispense pas de comprendre se que l'on fait, par exemple il y a la FAQ qui est un bon point de départ et qui contient pas mal d'informations et de liens vers différents tutoriels, ce sujet qui contient des informations sur les manipulations basiques ou encore ce sujet qui contient des infos pour les consoles équipées de puces SX Core/Lite ou Hwfly. Il y a aussi la documentation du script qui pourra parfois vous aiguiller sur les choses à faire ou sur les éléments contenus dans la préparation d'une SD, n'hésitez pas à la consulter et même à regarder les crédits qui peuvent contenir des informations intéressantes.\nPour voir les évolutions de mon script en détail vous pouvez vous rendre sur cette page pour le changelog du script et sur cette page pour le changelogs des packs de CFW/homebrews/modules/overlays/cheats.\nLa version base peut être téléchargée ici; pour la version complète vous pouvez cliquer ici mais je ne recommande pas de faire ainsi mais plutôt de passer par la version base et d'utiliser le gestionnaire de mises à jour intégré au script pour ajouter ou mettre à jour les différentes fonctionnalités car le téléchargement de la version complète ne récupère pas se qui est lié à des projets externes comme les sig_patches par exemple.\nHistoire de clarifier le comportement du gestionnaire de mises à jour du script je vais réexpliquer son fonctionnement, la demande intervenant en premier lieu juste après le premier message du script met seulement à jour les éléments de base du script comme les menus ou les programmes indispensables au bon fonctionnement de l'ensemble, ensuite chaque fonctionnalité est gérée indépendamment et si la mise à jour est acceptée sur une fonctionnalité, les éléments de base seront aussi mis à jour. Bon maintenant pour expliquer en pratique on va imaginer que vous utilisiez le script pour lancer des payloads et préparer une SD se qui représente deux fonctionnalités différentes, pour avoir la dernière mise à jour des deux fonctionnalités il faudra lancer chacune d'entre elle et accepter à chaque fois la mise à jour. Il y a aussi une fonction qui permet via le menu \"A propos\", de mettre à jour l'ensemble des fonctionnalités du script en même temps mais ceci peut prendre pas mal de temps car il y aura beaucoup de choses que le script devra vérifier/télécharger.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.\nEn cas de bugs, de propositions de fonctionnalités ou d’améliorations veuillez s'il vous plaît passer par le Github du projet ou bien par le sujet dédié à mon script sur le forum, de cette façon je peux traiter bien plus rapidement les informations/demandes.\nEnfin, vous avez cette page pour voir les nombreux crédits pour les outils utilisés dans mon script à un moment ou à un autre, comme d'habitude remercions tout ce beau monde pour leurs travaux, leurs participation au projet d'une manière ou d'une autre et également un grand merci aux quelques donateurs.\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1146702/in-switch-ultimate-switch-hack-script-43216-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[XB] Microsoft dévoile l'application Xbox pour Windows en version 2305.1000.48.0",
        "content": "Microsoft a dévoilé une mise à jour majeure de son application Xbox pour Windows, offrant aux joueurs une expérience encore plus immersive et pratique, du moins à ceux qui se sont inscrits au programme Windows Gaming Insiders.\n \nLa nouvelle version de l'application Xbox pour Windows, la quatrième version 2305, introduit la correction de nombreux bugs. En plus du streaming en 4K, l'application Xbox pour Windows propose également une intégration plus étroite avec le Xbox Game Pass. Les abonnés auront la possibilité de parcourir, télécharger et jouer à une vaste bibliothèque de jeux directement depuis l'application, simplifiant ainsi leur expérience de jeu et leur permettant de découvrir de nouveaux titres en quelques clics. La mise à jour de l'application Xbox pour Windows comprend des améliorations de l'interface utilisateur, rendant la navigation plus intuitive et fluide. \n \n \n\n \n \nCette mise à jour de l'application Xbox pour Windows témoigne de l'engagement continu de Microsoft à offrir aux joueurs une expérience de jeu exceptionnelle sur PC. Avec ses fonctionnalités améliorées, ses nombreuses corrections de bugs et son intégration étroite avec le Xbox Game Pass, l'application Xbox pour Windows est un outil essentiel pour les joueurs passionnés qui souhaitent profiter pleinement de leur expérience de jeu sur PC.\n \n \n\n \n \n \nCorrections de bugs :\n \n- Correction de divers problèmes d'interface utilisateur, y compris des problèmes de navigation ou des problèmes d'images coupées\n- Correction d'un problème où la sélection de Tout reprendre pouvait en fait suspendre certains téléchargements\n- Correction d'un problème où Minecraft pouvait ne pas apparaître correctement comme récemment joué\n- Correction d'un problème où certains achats DLC pouvaient afficher une \"Erreur Réessayez\"\n- Correction d'un problème où le narrateur pouvait ne pas fonctionner correctement après la déconnexion de la lecture à distance\n- Correction d'un problème où le filtrage des jeux pouvait ne pas afficher les titres corrects autour du multijoueur en ligne\n- Correction d'un problème où les utilisateurs pouvaient être invités à sélectionner le lecteur d'installation même après avoir sélectionné l'invite de ne pas\n \nProblèmes connus:\n \n- Les éléments du bundle Hearts of Iron IV affichent le message d'erreur \"Impossible d'afficher maintenant\"\n- L'art peut parfois manquer ou montrer un visage triste sur les cartes de jeu\n \nPour télécharger la dernière version de l'application Xbox pour Windows, les utilisateurs peuvent se rendre sur le site officiel de Microsoft ou mettre à jour l'application existante via le Microsoft Store.\n \n \nTéléchargement : Application Xbox publiée : 2305.1000.48.0  (17h00 PT – 16 mai 2023)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2030267232.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173989/in-xb-microsoft-devoile-lapplication-xbox-pour-windows-en-version-23051000480-1.png"
        }
    },
    "news_7": {
        "title": "Un bidouilleur transforme son Steam Deck pour y accueillir des Joy-Cons !",
        "content": "Les merveilles techniques sont toujours un plaisir à découvrir lorsque l'on a l'esprit hacker, et les ingénieurs (professionnels ou du dimanche) ne cessent de surprendre par la quantité de créativité qu'ils peuvent apporter aux appareils déjà existants pour combler des besoins très spécifiques.\n \nL'utilisateur Reddit /u/mrblackm123, propriétaire d'un Steam Deck, a commencé à rencontrer des problèmes du côté de la manette de l'appareil. En raison du manque de pièces de rechange pour réparer complètement le Steam Deck, l'utilisateur a plutôt opté pour quelque chose de plutôt ingénieux... Installer quelques rails de Joycon directement dans le Deck, ou plutôt, dans une tablette comprenant la carte mère démontée sans les éléments de la manette d'origine.\n \nEn d'autres termes, ce passionné de hacking a \"NintendoSwitché\" son Steam Deck... (On adopte ce terme ?) \n \n\n \nLa vidéo présente le Steam Deck \"tablette\" avec les rails latéraux installés, puis l'utilisateur attache rapidement les Joycons sur le côté de la tablette du Deck pour commencer à jouer à une variété de jeux avec eux, allant de l'utilisation des Joycons pour jouer à Cyberpunk 2077, à Breath of the Wild ou encore à Link's Awakening via émulateur sur l'appareil.\n \nLa publication est disponible sur Reddit, sous /r/Steam Deck. Cependant, il semble que les modérateurs du subreddit aient confondu l'appareil avec une sorte de console Switch, car ils ont supprimé la publication de l'utilisateur. Espérons que la publication pourra être rétablie une fois que les modérateurs auront réalisé leur erreur.\n \nQuelle sera la prochaine console à NintendoSwitcher ? Et pourquoi pas la PSP... A bon entendeur !\n \n\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173943/in-un-bidouilleur-transforme-son-steam-deck-pour-y-accueillir-des-joy-cons-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173943/in-un-bidouilleur-transforme-son-steam-deck-pour-y-accueillir-des-joy-cons-2.png"
        }
    },
    "news_8": {
        "title": "[Switch] SaltyNX 0.6.0 disponible",
        "content": "Le développeur Masagrator accentue son travail sur la Nintendo Switch, et propose une nouvelle version de SaltyNX. \n \nLancé il y a un peu plus de 3 ans, le plugin SaltyNX facilite la gestion du processus qui nous permet d'envoyer des commandes en arrière-plan pour éditer des fichiers et du code sous Nintendo Switch. Comme nous pouvons le voir dans les nouveautés listées, il a rajouté une option permettant de protéger la mémoire chargée, Zelda Tears of The Kingdom a laissé des traces tellement il nécessite de la mémoire. \n \nIndirectement, nous commençons à voir les limites techniques de la Switch, et même les développeurs de Nintendo (plutôt du studio Nintendo EPD) commencent à souffrir, le vingtième jeu de la franchise, qui était à l'origine conçu comme une extension de Breath of the Wild met à plat la console. \n \n \n\n \n \n \nChangelog SaltyNX 0.6.0 :\n \n- Réduction de la taille de l'exécutable du sysmodule de 2/3 et de l'empreinte mémoire du sysmodule de ~45%.\n- Ajout d'un nouveau drapeau pour exceptions.txt - R.\n- Le flag R annulera le chargement de SaltyNX dans le jeu si le mod romfs est installé dans le jeu. Cela permet d'éviter les collisions dans le cas où Atmosphere prendrait de la mémoire au jeu lorsque le jeu a un grand nombre de fichiers romfs et pourrait empêcher le jeu avec SaltyNX injecté de démarrer à cause de l'épuisement de la mémoire. Pour l'instant, un tel jeu n'existe pas, mais Zelda Tears of The Kingdom en est assez proche. Il s'agit de se prémunir contre cette éventualité pour l'avenir.\n \nTéléchargement : SaltyNX 0.6.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173904/in-switch-saltynx-060-disponible-1.jpg"
        }
    },
    "news_9": {
        "title": "[WiiU] La fusion entre de_Fuse et iosuhax est là",
        "content": "Le développeur Shinyquagsire23 propose une nouvelle évolution sur sa solution de_Fuse qu'il développe, il vient en effet de rajouter le nécessaire afin que ce dernier puisse acceuillir le code d'isouhax. \n \nConcrètement la combinaison des deux solutions élargie la palette des possibilités, ainsi il fourni un ensemble de correctifs compatible avec ds_Fuse pour IOSU, ainsi est né de_Fuse iosuhax.\n \nIl s'agit là d'une réécriture complète du code de de_Fuse afin qu'il ne soit plus écrit uniquement en C, l'implémentation d'IOSUHAX de smealum ( https://github.com/smealum/iosuhax ) permet en plus de bénéficier de tous les avantages liés aux modules et aux plugins proposés par le système d'exploitation comme la possibilité de s'appuyer sur Aroma. \n \nEn effet, désormais Aroma démarre sans aucune difficulté comme en atteste le développeur dans une vidéo de démonstration. \n \nPour réécrire le code, Shinyquagsire23 s'est appuyé sur celui de SaltyNX, ainsi le kernel permet de charger le firmware décrypté dans IOSU. \n \n \n\n \n \n \nFonctionnalités additionnelles notables (voir aussi : config.s) :\n \n- Support de_Fuse : Redirige toutes les lectures d'OTP vers la RAM. Nécessite minute_minute pour patcher les données.\n- Chargement de fw.img décrypté dans IOSU.\n- IOSU recharge les passes pour faciliter le patching.\n- salt-patch peut générer des patchs qui vont au delà du SLC fw.img\n- Chargement de kernel.img depuis la carte SD\n- Les écritures sur SEEPROM sont désactivées (pour la sécurité)\n- Accélération RedNAND MLC -- déplace le cache MLC (SCFM) vers SLCCMPT\n- Semi-hébergement -- imprime kprintf et syslogs sur les GPIOs DEBUG\n- Désactivation du lecteur de disque (sans écriture dans la SEEPROM)\n- USB_SHRINKSHIFT -- Permet d'avoir à la fois le système de fichiers de la Wii U et un système de fichiers normal sur un disque en déplaçant la partie Wii U après le MBR\n- USB_SEED_SWAP -- Remplace la clé USB SEEPROM pour faciliter la migration du système\n \nWIP :\n \n- Support vWii de_Fuse\n \nAvertissements :\n \n- Le formatage de la redNAND est différent ! utilisez une minute pour formater.\n- Si vous avez des lecteurs USB existants, désactivez USB_SHRINKSHIFT.\n- PRINT_FSAOPEN est utile, mais extrêmement lent\n- Ceci n'est testé que sur 5.5.1 fw.img,  rien n'a été porté sur d'autres firmwares.\n \n \nTéléchargement : de_Fuse iosuhax\n \n",
        "images": {}
    },
    "news_10": {
        "title": "[PS3] webMAN MOD 1.47.45 disponible",
        "content": "Le développeur Aldostools, Aldo Vargas, continue d'alimenter la scène PlayStation 3 de mise à jour de webMAN MOD avec désormais la disponibilité de la version 1.47.45. Régulièrement il propose des mises à jour mais celle là apporte un peu plus que d'habitude puisque cette version vient corriger des bugs importants. \n \n \n \n\n \n \nComme vous le savez, webMAN-MOD est un manager très efficace, pour ceux qui ne connaitraient pas, webMAN est un plugin développé par Deank qui permet de lancer des backups de jeux PS3, PS2, PS1, PSP ainsi que des Blu-ray ou des DVD, stocké sur disque dur (y compris en NTFS) ou sur le réseau local, au format JB ou ISO. M@tsumot0 et Aldostools ont proposé une version MOD de webMan, apportant notamment le support de 21 langages utilisant des fichiers externes, un installer/updater pour CFW Cobra et NonCobra, le spoof IDPS/PSID, la désactivation des syscalls du cfw, et de nombreuses autres évolutions qui se sont succédées.\n \nCette nouvelle version apporte pas moins de 46 corrections depuis la version précédente, vient corriger les mises à jour à la database des configurations PS2, et un bug sur /download.ps3 & /install.ps3 a été corrigé, mais le plus important est que cette version vient corriger un bug sur l'application des patches Lv2 sur 4.90 DEX / PEX. \n \n \nChangelog \n \n- Correction d'un bug critique lors de l'application des patchs lv2 sur 4.90 DEX / PEX\n- /download.ps3 & /install.ps3 ferment désormais le navigateur Internet de la PS3 s'ils sont appelés avec /xmb.ps3 (problème #877)\n- Mise à jour de la base de données de configuration PS2 avec des corrections par @mrjaredbeta, @agrippa, @kozarovv\n- Mise à jour cumulative (inclut plus de 46 modifications apportées à la suite d'outils après la version 1.47.44)\n \n \nTéléchargement : webMAN MOD 1.47.45\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173886/in-ps3-webman-mod-14745-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[Multi] Le AMD Zen 2 Secure Processor Bootrom compromis",
        "content": "Une nouvelle avancée sur la scène PlayStation et Xbox, peut être qu'une nouvelle étape vient d'être franchie en effet les bootroms du processeur sécurisé (SP, alias PSP) d'AMD pour les architectures ZEN et ZEN2 ont été leakés.\n \nIl y a quelques semaines des chercheurs en sécurité ont démontré qu'il était possible de compromettre le Trusted Platform Module (TPM) d'AMD. \n \nAMD l'a même confirmé, des vulnérabilités présentes dans ses APU peuvent compromettre la sécurité de l'architecture ZEN et ZEN2, l'AMD SP étant l'un des niveaux de sécurité le plus haut de ces architectures. \n \n \n\n \n \nLà ce sont les bootroms de Zen2 qui ont été leakés, ces APU présentes dans la PS5 et les Xbox Series. Le bootrom en lui-même n'est pas une vulnérabilité, cependant son accès permet un peu à l'image de ce qui se passe sur la Nintendo Switch, d'accéder à des niveaux de sécurités élevés. \n \n \n\n \n \nSpecterDev a confirmé qu'il s'agit d'une pièce intéressante du puzzle PS5, même si elle sera très probablement \"très difficile à inverser\", elle permettra d'attaquer la sécurité des consoles au travers par exemple de faulTPM. \n \nLe bootroom : https://github.com/anonpsp/bootroms/\n \nTout est là : reversing-the-amd-secure-processor-psp / reversing-the-amd-secure-processor-psp-part-2-cryptographic-co-processor-ccp\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173857/in-multi-le-amd-zen-2-secure-processor-bootrom-compromis-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173857/in-multi-le-amd-zen-2-secure-processor-bootrom-compromis-2.png"
        }
    },
    "news_12": {
        "title": "[XBO/XB Series] XBSX2 v2.0.0 disponible",
        "content": "Le développeur SirMangler vient de mettre en ligne une nouvelle version de son émulateur XBSX2, l'émulateur de PlayStation 2 (le portage de PCSX2) pour les consoles Xbox One et Xbox Series X/S.\n \nIl s'agit là d'une mise à jour majeure, riche en fonctionnalités, et qui va durer dans le temps selon le développeur. Il a ajouté un support intégral de Direct3D de DirectX12, et il est basé sur la dernière version de PCSX2. Pour rappel, l'émulateur XBSX2 vous permet non seulement de jouer à des titres PS2 avec toute la puissance native de l' émulateur PCSX2 , mais vous permet également de profiter des résolutions échelonnées (+4K) jamais vues sur une console Xbox.\n \n \n \n \n\n \n \n \nInclut :\n \n- Support complet de D3D12\n- Standalone de PCSX2 pour Xbox !\n- RetroAchievements\n- Système de triche et de correctifs entièrement fonctionnel\n- Préconfiguré pour le jeu en ligne\n- Basé sur la dernière révision de PCSX2 à ce jour.\n \nProblèmes connus dans cette version :\n \n- La configuration 'Software' en tant que paramètre par jeu provoque un crash du jeu.\n- La boîte de dialogue de l'échelle OSD se ferme parfois de manière aléatoire lors de la saisie manuelle de nombres.\n- Un grand merci à Reverie et TRW pour leurs tests approfondis, ainsi qu'à TRW pour les changements supplémentaires et le nettoyage de l'interface utilisateur.\n \nTéléchargement : XBSX2 v2.0.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173828/in-xboxb-series-xbsx2-v200-disponible-1.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] Atmosphère 1.5.4 pre-release disponible et optimisé pour Zelda ToK",
        "content": "Le développeur SciresM vient de mettre en ligne une nouvelle version d'Atmosphere il y a 2 heures, il s'agit de la version 1.5.4 et il s'agit d'une pre-release c'est à dire qu'il en dévoilera une version définitive plus tard quand elle sera considéré comme stable et exempt de bugs. Cette nouvelle version apporte quelques optimisations pour The Legend of Zelda : Tears of the Kingdom.\n \n \n\n \n \n \nIl s'agit de la 73eme version officielle d'Atmosphère, sachant qu'elle intègre HBL en 2.4.3 et hbmenu 3.5.1.\n \nSi des bugs sont signalés avec la préversion d'Atmosphère, ils seront corrigés et la version sera mise à jour.\n \nLa version 1.5.4 passera en version release après un court laps de temps sans rapport de bug urgent.\nEn particulier, Atmosphère 1.5.4 contient une nouvelle fonctionnalité expérimentale pour supporter les mods layeredfs/romfs pour The Legend of Zelda : Tears of the Kingdom, qui peut avoir des bugs que je n'ai pas découverts lors de mes propres tests.\n \nLes éléments suivants ont été modifiés depuis la dernière version :\n \n- Une nouvelle fonctionnalité expérimentale a été implémentée pour éviter les plantages lors de la construction de romfs pour certains jeux avec des nombres de fichiers obscènes.\n- Cela inclut à la fois Fire Emblem : Engage (~190000 fichiers), et The Legend of Zelda : Tears of the Kingdom (~300000).\n- La solution a consisté à ajouter une fonctionnalité à ams.mitm/pm pour voler dynamiquement la mémoire du pool d'applications (et du système) en fonction des besoins lorsque les jeux ont des mods romfs.\n- Aucune mémoire n'est prélevée, et cette fonctionnalité ne coûte rien lorsque le jeu ne comporte pas de mods (ou que les overrides sont désactivés).\n- The Legend of Zelda : Tears of the Kingdom est actuellement le pire des jeux, nécessitant ~48 Mo de mémoire pour construire une image romfs pour jouer avec des mods.\n- Pour l'instant, la mémoire est répartie comme suit : 32 Mo (base ams.mitm heap), 10 Mo (volés au pool d'applications), 8 Mo (volés dynamiquement au pool système).\n- Cela fait 50 Mo, ce qui permet un peu d'overhead dans le pire des cas (pour éviter un plantage dû à l'épuisement du heap pour d'autres allocations dans ams.mitm).\n- Zelda est remarquablement sensible au vol de mémoire du pool d'application, ne tolérant pas plus de 16 Mo sur 1.0.0 et 12 Mo sur 1.1.0. J'ai choisi de voler 10 Mo, pour être sûr, pour l'instant.\n- Il est possible que cela ne fonctionne plus lors d'une prochaine mise à jour du jeu, mais je le corrigerai si et quand cela se produira. Il n'y a pas de solution parfaite ; le jeu nécessite tout simplement trop de mémoire pour supporter les mods sans problème, et je suis obligé de faire des compromis.\nComme d'habitude, si vous rencontrez un jeu qui épuise la mémoire d'ams.mitm (en le faisant planter) lors du chargement de mods layeredfs, veuillez contacter SciresM#0524.\n\"Je me porte la poisse en disant cela, mais il est vraiment difficile d'imaginer un jeu pire que The Legend of Zelda : Tears of the Kingdom, mais si cela se reproduit, je ferai tout pour le réparer comme d'habitude.\n- Améliorations générales de la stabilité du système afin d'améliorer l'expérience de l'utilisateur.\n \n \nTéléchargement : Atmosphère 1.5.4 pre-release\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1893040938.jpg"
        }
    },
    "news_14": {
        "title": "[Switch] Zelda Tears of the Kingdom en 8 K et 60 FPS sur PC",
        "content": "Les deux géants de l'émulation Switch, que sont les émulateurs Yuzu et Ryujinx font tout pour optimiser le nouveau Zelda Tears of the Kingdom. Il faut dire que le titre, un peu comme une sorte de Pokemon, permet d'avoir une visibilité beaucoup plus large que d'habitude, et ainsi attirer plus d'utilisateurs. \n \nLes deux équipes viennent d'ailleurs de publier leur rapport du mois d'avril, mettant en avant le nouveau jeu de Nintendo. \n \nCes rapports s'ils vous intéressent se trouvent ici : Yuzu /  Ryujinx\n \n \n\n \n \nAinsi Ryujinx revient sur des optimisations apportées à The Legend of Zelda: Breath of the Wild.\n \nLes joueurs se sont littéralement empressés de vouloir tester l'ancien jeu de Zelda afin de mieux découvrir le nouveau, Tears of the Kingdom\nLes besoins en émulation se sont donc ressentis et de nouvelles optimisations ont donc été apportées sur les jeux d'ombres, les textures ou encore sur Vulkan.\n \nMême constat chez Yuzu, les améliorations sur les Zelda sont légions, on peut parle de The Legend of Zelda: Breath of the Wild mais aussi de The Legend of Zelda: Link's Awakening.\n \n \n \n\n \n \n \nMais si vous êtes là c'est aussi pour parler de l'émulation de Zelda Tears of the Kingdom qui est possible en 8 K et 60 FPS. Pour parvenir à cela il faut disposer d'un PC monstrueux.\n \nC'est sur Yuzu que cela a été démontré, un utilisateur de Youtube a dévoilé que le jeu tourne parfaitement dans cette résolution. Pour cela il a utilisé :\n \n- 1 processeur Intel Core i9-13900k 5.8ghz lga1700 qui coûte à lui seul 600 euros\n- 1 carte graphique nVidia GeForce RTX 4080 – Founders Edition à 1500 euros\n- 64 Go de Ram  G.Skill Trident Z RVB DDR4 4000 MHz en 2x32 Go soit 250 euros environ de plus \n \nPlus de 2300 euros juste pour ces 3 composants, autant vous le dire qu'il vous faudra au moins 3000 euros pour faire tourner Zelda dans cette résolution. Un peu cher l'émulation, mais quand on aime... \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173786/in-switch-zelda-tears-of-the-kingdom-en-8-k-et-60-fps-sur-pc-1.png"
        }
    },
    "news_15": {
        "title": "[Multi] PS Multi Tools v13 disponible",
        "content": "Voilà plusieurs semaines que le développeur SwenGDK nous fait saliver avec l'arrivée d'une nouvelle version de PS Multi Tools, et bien voilà que la v13 est proposée au téléchargement depuis quelques heures. \n \nComme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n \n\n \n \nv13 Changelog\n \nChangements généraux\n- PS Multi Tools v13 a été entièrement réécrit en WPF et utilise désormais le .NET Framework 4.8.1 (WinForms & .NET Framework 3.5 auparavant).\n- L'ancienne bibliothèque \"ps-menu\" est maintenant appelée \"psmt-lib\" et est maintenant une bibliothèque partagée qui peut être utilisée dans vos outils également (très limité auparavant).\n- PS Multi Tools fonctionne maintenant sans avoir besoin de vérifier les mises à jour - si aucune mise à jour n'est disponible, il conservera votre \"psmt-lib.dll\" actuel.\n- MyPS et Bug Sender supprimés, veuillez utiliser GitHub pour signaler les bugs.\n \nChangements PS1\n- Amélioration du support de la console PS1\n- Le gestionnaire de sauvegarde supporte maintenant les fichiers \".bin\" et lit le code du jeu à partir de ceux-ci. L'art du jeu peut maintenant être affiché. (.iso [pas encore] & .bin sont maintenant supportés)\n- Outil de fusion des fichiers BIN\n- Mises à jour et nouveaux téléchargements\n \nChangements PS2\n- Amélioration de la prise en charge de la console PS2\n- Inclut maintenant les outils et les téléchargements PSX DVR\n- Le gestionnaire de sauvegarde est maintenant capable d'afficher plus d'informations sur le jeu, y compris l'art du jeu.\n- Conversion de BIN/CUE en ISO\n- PSX DVR XMB Games et Homebrew Installer\n- Mises à jour et nouveaux téléchargements\n \nChangements PS3\n- Amélioration de la prise en charge de la console PS3\n- Le gestionnaire de sauvegarde prend désormais en charge les fichiers \".iso\" et \".pkg\". (Les dossiers de sauvegarde avec PS3_GAME, .iso & .pkg sont maintenant pris en charge)\n- Le gestionnaire de sauvegarde est maintenant capable de jouer la bande sonore du jeu sélectionné.\n- Les outils et opérations ISO sont maintenant disponibles (Créer, Extraire, Diviser & Patch)\n- Supporte maintenant les fichiers \".tsv\" de NPS (Les fichiers doivent être placés dans le dossier \"Database\" mais vous pouvez aussi charger le dernier dans l'application).\n- Ceci débloquera les téléchargements pour : Jeux, Mises à jour, Démos, DLC, Thèmes, Avatars\n- Créer des fichiers \".rap\" (clic droit sur un élément à télécharger)\n- Nouvel éditeur PARAM.SFO\n- Extracteur/déboucheur de PUP\n- Extracteur/déboucheur dev_flash\n- Lecture de soi pour lv0, lv1ldr, lv2ldr, isoldr, appldr, EBOOT.BIN\n- Décryptage, extraction, cryptage et hexadécimation de \"Core_os\".\n- Correction de Tar pour 3.72+\n- RCO Dumper\n- PS2 Classics (pas encore prêt)\n- Mises à jour et nouveaux téléchargements\n \nPS4\n- Prise en charge de la console PS4 ajoutée pour la première fois\n- Le gestionnaire de sauvegarde est capable de charger des fichiers \".pkg\" et d'afficher des informations à leur sujet, y compris l'art du jeu et la bande sonore.\n- USB Writer pour les fichiers \".img\" - utile pour le \"exfathax.img\".\n- Editeur PARAM.SFO pour PS4\n- Payload Sender pour envoyer des payloads \".bin\n- PKG Sender (sera changé en \"PS4 PKG Manager\") pour envoyer et installer des fichiers \".pkg\", il sera également capable de voir et désinstaller les pkgs installés sur la PS4\n- Simple PUP Unpacker pour les PUPS .DEC\n- PS Classics (pas encore prêt)\n- Téléchargement des hôtes d'exploitation pour 4.05 - 9.00\n- Téléchargements d'émulateurs\n- Téléchargements de firmware (System & Recovery)\n- Téléchargements Homebrew\n- Téléchargements d'outils Windows\n \nPS5\n- Prise en charge de la console PS5 ajoutée pour la première fois\n- Le gestionnaire de sauvegarde est indisponible jusqu'à ...\n- Mast1c0re Sender pour envoyer des charges utiles \".elf\" et des jeux PS2 \".iso\" (y compris \".conf\")\n- Informations sur les exploits disponibles\n- Téléchargement d'exploits pour 3.00 - 4.51, y compris le BD-JB ELF Loader v1.6.1\n- Téléchargements homebrew (FTPS5, Mast1c0re Network ELF & Game Loader)\n \nChangements PSP\n- Amélioration de la prise en charge de la console PSP\n- Le gestionnaire de sauvegarde prend désormais en charge le chargement des fichiers \".cso\" (les dossiers de sauvegarde avec PSP_GAME, .iso, .cso sont désormais pris en charge)\n- Compression des fichiers \".iso\" en \".cso\"\n- Conversion des fichiers \".iso\" en \".PBP\" ou \".PBP\" en \".iso\"\n- Extraction de fichiers \".PBP\n- Mises à jour et nouveaux téléchargements\n \nChangements pour la PS Vita\n- Prise en charge améliorée de la console PS Vita\n- Le gestionnaire de sauvegarde prend désormais en charge le chargement des dossiers de jeux et des fichiers \".pkg\" cryptés/décryptés par PSV et affiche des informations à ce sujet, y compris l'art du jeu.\n- Supporte maintenant les fichiers \".tsv\" de NPS (Les fichiers doivent être placés dans le dossier \"Database\" mais vous pouvez aussi charger le dernier dans l'application).\n- Ceci débloquera les téléchargements pour : Jeux, Mises à jour, DLC, Thèmes, Démos\n- Extracteur RCO\n- Décryptage et extraction des fichiers \".pkg\".\n- psvimgtools (pas encore prêt)\n- Générateur de fichiers EML (pas encore prêt)\n- Mises à jour et nouveaux téléchargements\n \n \nTéléchargement : PS Multi Tools v13\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1289622330.png"
        }
    },
    "news_16": {
        "title": "[PS5] PS5 BD-JB ELF Loader v1.6.1 disponible",
        "content": "Le développeur John Tornblom est de retour avec une nouvelle version de PS5 BD-JB ELF Loader, son programme passe en effet en version 1.6.1. \n \n \n\n \n \nAu programme de cette nouvelle version qui débarque mi-mai, il s'agit d'une version stable, qui apporte des exemples de support pour le chargement/déchargement automatique de modules sprx utilisant des tableaux init/fini.\n \nA noter qu'il a mis à jour également le PS5 SDK. \n \n \nTéléchargement : PS5 BD-JB ELF Loader v1.6.1 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173753/in-ps5-ps5-bd-jb-elf-loader-v161-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[3DS/Switch] PKHeX 23.05.11 disponible",
        "content": "Les petits gars en charge du développement de PKHeX viennent de mettre en ligne une nouvelle version de leur outil à destination de la Nintendo 3DS, Switch, et Gamecube. \n \nComme vous le savez avec PKHeX les utilisateurs peuvent manipuler divers fichiers de sauvegarde .sav,.dsv,.dat,.gci,.raw et .bin. PKHeX peut également lire et écrire les fichiers .pk, qui sont des fichiers Pokémon individuels, et les fichiers .pgt,.pcd,.pgf,.wc, qui sont des fichiers Mystery Gift.\n \nCette nouvelle version apporte de nombreux changements !\n \n \n\n \n \n \n11/05/23 - Nouvelle mise à jour :\n \nMise en conformité :\n- Modification : La création d'un nouveau PKM à partir d'un gabarit va définir les mouvements actuels de la même manière que les jeux.\n- Modification : Les souches de Pokérus 0 & 8 sont maintenant autorisées en raison d'erreurs d'implémentation officielles dans les Gen2 & Gen3.\n- Correction : Les rencontres traversant Mesagoza (emplacement 8) ne sont plus autorisées (distance verticale).\n- Correction : Les comptes HOME TSV=0 sont maintenant autorisés à exister, et le XOR antishiny pour les cadeaux PID fixes se comporte maintenant correctement.\n \nCorrections : \n- Ajout : Les commandes de filtrage de l'éditeur par lots peuvent maintenant référencer d'autres valeurs de propriétés (alias \"copie de propriétés\") comme les commandes de modification.\n- Pour copier une propriété, il suffit de la spécifier comme suit .Stat_ATK=*Stat_DEF\n- Pour filtrer sur la base de la valeur d'une autre propriété, procédez de la même manière.\n- Ajout : Les mouvements qui ont changé de type élémentaire au fil des générations indiqueront désormais leur type dans le contexte du fichier de sauvegarde.\n- Ajout : Le visualiseur d'image du joueur Gen9 affiche maintenant les photos de profil dans l'éditeur de l'entraîneur. Merci @pasqualenardiello !\n- Ajout : Le LGPE Gen7 peut maintenant débloquer tous les modes via l'éditeur d'entraineur.\n- Ajout : L'éditeur de blocs de la Gen5 affiche maintenant les deux objets roamer (Thundurus et Tornadus).\n- Correction : Les indicateurs d'échelle de la Gen9 reflètent désormais les seuils d'échelle du patch >=1.1.0. Merci iD3M0N1C !\n- Correction : Gen5 C-Gear Skin ne conserve plus le verrouillage de fichier sur les fichiers d'image de skin importés.\n- Correction : Les cartes mémoires Gen3 peuvent maintenant être détectées comme le dernier fichier de sauvegarde, ainsi que comme source de sauvegarde pour le pkmdb.\n- Correction : Les Pokémon ombre non purifiés Gen3 ne sont plus marqués sans ruban s'ils ont une jauge d'ombre de 0 (prêts à être purifiés).\n- Modification : Le mode de mise à l'échelle de la sous-forme est passé à \"Hériter\" -- ajouté un paramètre d'affichage pour revenir à la mise à l'échelle de la forme (à partir de Dpi).\n \n \n \nTéléchargement : PKHeX 23.05.11\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173721/in-3dsswitch-pkhex-230511-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[Switch] DeepSea 4.6.0 disponible",
        "content": "Le développeur Team-Neptune propose une nouvelle version de DeepSea qui comme les petits copains apportent le support de la dernière version d'Atmosphere. \n \nPour rappel, DeepSea est un Pack AIO regroupant tout en un pack, l'objectif est de facilité l'accessibilité pour les utilisateurs d'Atmosphère.\n \n \n\n \n \nCette version ajoute la prise en charge du dernier firmware Nintendo 16.0.3 : \n \n- Mise à jour d'Atmopshere vers 1.5.3\n- Mise à jour de Hekate vers 6.0.4\n- Mise à jour de AiO Switch Updater vers 2.21.4\n- Mise à jour de emuiibo vers 1.0.0\n- Mise à jour de MissionControl vers 0.9.2\n- Mise à jour de nx-ovlloader vers 1.0.7\n- Mise à jour de Status-Monitor-Overlay vers 0.9.0\n- Mise à jour de sys-clk vers 1.0.3\n \n \nTéléchargement : DeepSea 4.6.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173720/in-switch-deepsea-460-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[Switch] NeXT 3.01 disponible",
        "content": "Le développeur mistervampi vient de mettre en ligne une nouvelle version de NeXT, il faut dire qu'il fallait bien apporter le support du dernier firmware 16.0.3.\n \nPour rappel NeXT est un tout en un qui supporte les CFW que ce soit Atmosphere ou SX OS, de plus sa gestion des applications est largement simplifiée par une interface utilisateur très fonctionnelle. Similaire à DeepSea ou encore RetroReloaded, NeXT intègre de nombreux payloads, et sa plus grande des possibilités est de pouvoir facilement gérer Atmosphere et SX OS au travers d'une interface graphique riche. \n \n \n\n \n \nChangelog : \n \n- Prise en charge de la version 16.0.3 \n- Compatibilité totale avec toutes les consoles Switch moddées Soft / Hard\n \nMises à jour : \n \n- Nouveau Bootmenu basé sur Heakate\n- Atmosphère => 1.5.3\n- Sigpatches => 1.5.3\n- Tesla OVL\n- Emuiibo\n- Lan Play\n- AIO Switch Updater\n- DBI\n- Nombreuses mises à jour majeures \n- Paquet à très haute compression\n \nFYI : Tous les patches/hombrew/sys-modules les plus importants ont été testés avant cette sortie publique afin de vérifier la compatibilité et le bon fonctionnement de cette AIO avec le dernier firmware système disponible. Mais dans certains cas, les modules hombrew/sys ne sont pas mis à jour par leurs développeurs au moment de chaque sortie de NeXT. Il faut donc garder à l'esprit que l'utilisation de certains modules hombrew/sys non mis à jour peut entraîner un blocage ou un plantage du système. \n \n \nTéléchargement : NeXT 3.00\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173710/in-switch-next-300-disponible-1.jpg"
        }
    },
    "news_20": {
        "title": "[PS5] PS5 NOR Modifier 1.0 disponible",
        "content": "Le développeur TheCod3r vient de publier son outil PS5 NOR Modifier, sous ce nom se cache un outil qui vous aide à mettre à jour le  fichier flash NOR de la PS5, vous l'aurez compris cet outil se destine avant tout à des réparateurs.\n \nTheCod3r n'en est pas à son coup d'essai puisqu'il a largement contribué à la scène PS4 et PS5 notamment lors de lecteur blu-ray HS. Dernièrement il a travaillé sur le fait de reclasser une console PS5 disposant d'un lecteur HS en modèle numérique afin d'empêcher les erreurs qui y sont liées. \n \n \n \n\n \n \nPS5 NOR Modifier vous permet de modifier votre fichier PS5 NOR pour le convertir entre les éditions numériques et sur disque pour enregistrer votre PS5 lorsque votre lecteur de disque tombe en panne ou lorsqu'aucun lecteur de disque n'est disponible.\n \nGrâce à ce logiciel gratuit, vous pouvez ramener votre console de la tombe en convertissant une édition disque en édition numérique, ainsi qu'en changeant le numéro de série et la variante signalée afin de remplacer votre rom flash SPI lorsqu'elle meurt ! Ceci est particulièrement utile lorsque vous ne disposez pas non plus d'un lecteur de disque correspondant, en convertissant un disque en une édition numérique afin de permettre de futures mises à jour (restauration de la fonctionnalité en ligne en gardant votre PS5 à jour). Si votre rom flash SPI meurt (très courant), vous pouvez maintenant modifier le vidage à partir d'une autre console et conserver la fonctionnalité du lecteur de disque. Vous n'avez plus besoin de convertir en version numérique lorsque votre rom flash SPI meurt!\n \nCaractéristiques:\n \n- Lisez le numéro de série de vidage du BIOS signalé, la version signalée (disque ou numérique) et la variante de carte (modèle CFI-XXX).\n- Modifiez le numéro de série indiqué dans le vidage du BIOS.\n- Alternez entre les versions disque et numérique.\n- Changer de variante de carte.\n- Traitement en un clic, pas besoin d'expérience en ligne de commande ou de compétences en édition HEX.\n- Rapide, léger et facile à utiliser.\n- Application autonome, aucune installation requise.\n- Entièrement portable. Transportez l'application sur une clé USB et exécutez-la instantanément.\n \nTéléchargement : ps5-nor-modifier-v1-0-0-0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173693/in-ps5-ps5-nor-modifier-10-disponible-1.png"
        }
    }
}