{
    "news_1": {
        "title": "[Vita] PPSSPP 1.16 disponible",
        "content": "L'équipe en charge du développement de PPSSPP est de retour, le développement est plutôt en dents de scie, à savoir que nous avons eu le plaisir de découvrir plusieurs versions durant le mois de Mai 2023, mais depuis c'était le calme plat, et pareil en début d'année jusqu'au mois de Mai.\n \nTant et si bien que cette version 1.16 est la sixième version officielle de l'année 2023, ce qui au final n'est pas énorme mais permet de proposer de nombreuses corrections. \n \n \n \n\n \n \n \n \nChangelog 1.16 :\n \n- Remerciements particuliers à [Unknown] pour les nouveaux compilateurs JIT, et à fp64 pour avoir enfin découvert l'instruction vrnd.\n- Support des RetroAchievements ([#17589], [#17631], et bien d'autres). Voir RetroAchievements sur ppsspp.org.\n \nNouveaux backends JIT :\n- RISC-V, basé sur IR\n- JIT x86 basé sur IR. Souvent plus rapide que l'existant.\n- Corrections sur les entrées\n \n Amélioration du comportement en cas de conflit entre les entrées analogiques et numériques ([#17960])\n- Le mappage des combinaisons est maintenant désactivé par défaut ([#17673])\n- Android : Meilleur suivi des noms de périphériques ([#17562], auto config)\n- Correction de la correspondance entre les boutons tactiles personnalisés et les entrées analogiques ([#17433])\n \nPerformances de rendu et corrections\n- Correction du scintillement dans WWE Smackdown vs Raw 2006 ([#18009]), scintillement vidéo dans Naruto 2 ([#18008])\n- Correction des mauvaises couleurs dans le menu de Syphon Filter : Logan's Shadow ([#17965])\n- Sur les périphériques bas de gamme, éviter les shaders \"uber\" en raison de bugs de performance et de pilotes ([#17449], [#17922])\n- Désactivation de V-sync sur Android avec Vulkan, plus de plateformes SDL ([#17903], [#18087])\n- Sur Vulkan, réduction du décalage d'entrée lorsque \"Buffer graphics commands\" est désactivé ([#17831])\n- Diverses améliorations mineures ([#17810], [#17505], [#17478], [#17471], [#17452], [#17446], [#17442])\n- Correction des ombres dans MotorStorm ([#17602]) (pas vraiment un problème de rendu)\n- Correction d'un problème de rendu dans Lunar Silver Star ([#17451])\n- Ajout d'un cache pour MakePixelsTexture, améliorant les performances dans God of War ([#17534])\n- Beaucoup d'améliorations du moteur de rendu logiciel ([#17571], [#17569], [#17619], [#17621], [#17618], [#17609], ...)\n \nMise en réseau\n- La prise en charge HTTPS est désormais activée dans le magasin et pour RA sur Windows, Android, Mac, iOS ([#17744], ...)\n- Ad-hoc : Correction du problème Metal Gear Acid avec Link Battle ([#17947])\n \nCorrections de remplacement de textures\n- Correction des problèmes de texture de Tactics Ogre ([#18001], [#18011])\n- Correction d'un problème de filtrage anisotropique ([#17930])\n- Correction de problèmes sur D3D11 avec les textures KTX2 ([#17749])\n \nModifications de l'interface utilisateur\n- Support des emoji en couleur sur certaines plateformes ([#17854], [#17856])\n- Utilisation des polices TTF sur SDL lorsqu'elles sont disponibles (macOS, Linux/Steam Deck) ([#17844]), support du HiDPI ([#17651])\n- Permet de régler directement l'adresse MAC de la PSP ([#17755])\n- Amélioration des notifications ([#17606], [#17674], [#17672])\n \nCodes de triches\n- Correction du chargement des bases de données de triche sur les appareils Android avec un espace de stockage limité ([#17834])\n- VR (Quest, autres appareils VR Android)\n \n- Améliorations du mode écran de cinéma ([#17704], [#17752])\n- Mode passthrough pour Quest uniquement ([#17591])\n- Nettoyages, corrections de compatibilité, réglage des paramètres VR par jeu ([#17636], [#17656], [#17598], [#17518])\n \nAutres\n- Correction d'un horrible problème audio dans After Burner ([#18076])\n- Emulation précise de l'instruction vrnd ([#17506], [#17549])\n- Correction d'un problème de timing causant des ralentissements dans les matchs de MLB ([#17676], [#17677])\n- Prise en charge du clavier UWP, nombreuses autres mises à jour ([#17952], [#17974])\n- Possibilité de choisir la résolution de l'écran sur Android ([#17473])\n- Correction d'un problème d'exécution de certains types de fichiers hors du dossier Download sur Android ([#17466])\n \n \n \nTéléchargement : PPSSPP 1.16\n \n \n \n \n \n \n",
        "images": {}
    },
    "news_2": {
        "title": "[XBO] Artifice, un outil personnalisé pour amener des privilèges en mode développeur",
        "content": "Le développeur Kudayasu vient d'ouvrir les portes de son travail connu sous le nom de code Artifice, sous ce nom semble se trouver un travail collossal permettant de proposer un outil personnalisé conçu pour réaliser une escalade des privilèges de manière autonome pour le mode développeur de la Xbox One.\n \n \n\n \n \n \nUn superbe article présente Artifice :\n \nComment fonctionne l'outil par ordre chronologique\nPourquoi certaines méthodes ont été créées d'une manière particulière\nCe que vous pouvez accomplir avec des privilèges élevés\n \n \n\n \n \n \nL'article explique les 10 étapes qui permettent d'arriver en temps qu'utilisateur avec les droits administrateurs actifs, et ainsi vous allez pouvoir : \n \n- Désactivez les nombreux services de télémétrie ( fortement recommandé) \n- Fouillez correctement avec PWSH ( fortement recommandé NtObjectManager ) \n- Exécutez votre propre logiciel\n- Explorez et modifiez le registre à distance \n- Dumpez votre flash\n- Chargez manuellement les pilotes du kernel tels que KsDumper ( Durango ) \n- Créez votre propre \" superposition \" xvd pour SystemOS (avec quelques mises en garde) \n- Déboguer le mode utilisateur avec dbgsrv + windbg (éviter les problèmes de pare-feu avec clicon )\n \n \nTout est là : Artifice v1.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177725/in-xbo-artifice-un-outil-personnalise-pour-amener-des-privileges-en-mode-developpeur-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1177725/in-xbo-artifice-un-outil-personnalise-pour-amener-des-privileges-en-mode-developpeur-2.png"
        }
    },
    "news_3": {
        "title": "[PS5] Specter dévoile un payload pour décrypter les fichiers PS5",
        "content": "Specter vient d'annoncer la disponibilité d'un tout nouveau payload permettant de décrypter les fichiers SPRX et SELF sur tous les firmwares exploitables, l'information a été reprise par Wololo.net ici. \n \nJusqu'à ce jour, le décryptage de fichiers n'était possible que sur le firmware 4.03 grâce à l'utilisation du débogeur Prosper0 de Sleirsgoevy, mais comme quoi cela continue de bouger puisque cette possibilité est désormais possible sur tous les firmwares exploitables. \n \n \n\n \n \n \nLa plupart des fichiers PS5, y compris les binaires système, les bibliothèques des applications, et les jeux sont cryptés, leur décryptage est la première étape pour analyser leur contenu et leur sécurité, et ainsi trouver des vulnérabilités. \n \n \n\n \n \n \nLa sortie de ce payload fait suite à une annonce de Specter sur \" X \" qui a laissé entendre que quelques chose a été opéré sur la PSP ( Platform Secure Processor ). \n \nLe code source doit être compilé et il faudra utiliser une clé USB avec de nombreuses étapes, ce qui n'est pas facile pour des utilisateurs peu expérimentés. \n \nLe code sera amélioré avec notamment une possibilité de sortir plus facilement, pour augmenter la stabilité ou encore améliorer diverses fonctions. \n \nDans sa présentation de hardwear_io, il avait expliqué à quel point les attaques portant uniquement sur les données peuvent être sous-estimées. Il prouve que le décryptage des fichiers système en envoyant des messages à la PSP avec uniquement la lecture arbitrage en lecture/écriture du kernel est possible. \n \n \nTout est là : SpecterDev\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177713/in-ps5-specter-devoile-un-payload-pour-decrypter-les-fichiers-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1177713/in-ps5-specter-devoile-un-payload-pour-decrypter-les-fichiers-ps5-1.jpg"
        }
    },
    "news_4": {
        "title": "[2DS/3DS/DS] TWiLight Menu++ v26.1.0 et nds-bootstrap v1.0.0 disponibles",
        "content": "Le développeur RocketRobz propose à la scène 3DS de découvrir une nouvelle version de TWiLight Menu++ et de nds-bootstrap qui passent respectivement en v26.1.0 et 1.0.0.\n \nLe rythme d'une version par mois est maintenu, c'est une bonne chose pour TWiLightMenu++ qui pour rappel est un menu alternatif, open source et personnalisable pour lancer des homebrews DS, jeux et roms DS, GBA, BD via la DS, 3DS ou 2DS.\n \nCette version de nds-bootstrap prend enfin en charge  Golden Sun : The Dark Twilight . Toute personne intéressée peut trouver une explication complète de ce qui devait être fait sur GitHub. De plus, certains programmes Nintendo tels que NTR EVA/Aging et Wii Sequencer fonctionnent désormais également.\n \n \n\n \n \nLes jeux DSi ne plantent plus après un certain temps sur la 3DS et la compatibilité globale a encore été améliorée.\n \nDans  TWiLight Menu++, le correctif anti-piratage pour le hack ROM \"Pokémon: Refined Gold Overhaul\" a été mis à jour vers la version 2.0 et la prise en charge des couvertures transparentes a été ajoutée. Bref, comme nous pouvons le voir le programme évolue dans le bon sens. \n \n \nTéléchargement : TWiLightMenu / nds-bootstrap\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177705/in-2ds3dsds-twilight-menu-v2610-et-nds-bootstrap-v100-disponibles-1.jpg"
        }
    },
    "news_5": {
        "title": "[Wii] Priiloader 0.10.0 : Version Kappa compatbile vWii",
        "content": "Développé par DacoTaco, PriiLoader est un programme issu d'une version modifiée et améliorée de Preloader 0.30, il a su évoluer notamment l'année dernière en amenant le support de la Wii Mini. Comme vous le savez cet utilitaire permet de réparer des semis-bricks, permet d'activer et de paramétrer le menu système, la Homebrew Channel, BootMii IOS ou encore d'ajouter  des correctifs pour bloquer les mises à jour.\n \nDans cette nouvelle version la grosse nouveauté est qu'il est disponible en version stable, mais c'est surtout l'arrivée du support du mode Wii de la Wii U. \n \n \n \n \n\n \n \n \n \nTechniquement, le priiloader de la vWii fonctionne en  remplaçant l'index de démarrage du menu système de la vWii par celui du  loader BC-NAND NAND , qui est également une  image ancast signée  . BC-NAND démarre ensuite l'index de démarrage 1, qui est remplacé par le priiloader - l'original à l'index 1 est déplacé à la fin du contenu du titre. Le priiloader déchiffre ensuite l'image ancast et la corrige afin que l'index de boot1 soit transmis à la fin et que le menu système déchiffré soit démarré.\n \nSystem Menu 1.0 est également pris en charge et après l'installation et le retour au menu système, Priiloader s'affiche directement, ce qui facilite la configuration sur une Wii Mini car aucun clavier USB n'est requis. Les hacks qui bloquent le démarrage automatique d'un disque, suppriment le scintillement de l'image et marquent toutes les connexions réseau comme « testées » sont également nouveaux. De plus, les disques Wii et, sur les systèmes pris en charge,  GameCube peuvent être lus, en contournant la vérification de la région. En plus de nombreuses corrections de bugs, une option a également été ajoutée pour revenir au fichier installé .\n \n \nTéléchargement : Priiloader 0.10.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177701/in-wii-priiloader-0100-version-kappa-compatbile-vwii-1.jpg"
        }
    },
    "news_6": {
        "title": "[PS4] Psx2Ps4 v1.5.1, nouvel emulateur et ajout du multi-discs",
        "content": "Voici la version 1.5.1 de mon script PSX 2 PS4.bat vous permettant d'injecter vos propre ISO ps1 afin de les exécuter sur vos PS4.  Petite update de mon script en 1.5.1, qui ajoute le nouvel émulateur PS1 officiel de Sony (Syphon Filter v3) apportant une meilleure compatibilité des titres PS1, des corrections de sons, de glitchs et bien d'autres...J' ai également enfin ajouté le multi-discs (sous certaines conditions) permettant de jouer aux titres PS1 contenant plusieurs CD (comme la plus part des Final Fantasy par exemple). Mais attention !!! Seul les jeux permettant la sauvegarde AVANT le swap disc fonctionneront, en effet une fois la save créé (avant le swap disc) il vous suffira de lancer le 2ème CD (dans les options de l'émulateur) et de charger cette même save tout juste créé...  Vidéo tuto:  Changelog: v1.0:- Release de base v1.1:- Ajout du support Multi CD, 4 cds possible (merci @Oxeres pour la manip)- Ajout d' une option Compilation (5 jeux max par PKG)- Ajout du 60hz pour les jeux PAL- Modification du CUSA en SLUS V1.2:- Support des fichiers configs- Support des fichiers .lua- Ajout d' une option Tuto Vidéo V1.3:- Nouveau mode Expert- Création des .TOC- Fusion des .bin- Nouvelle vidéo tuto pour la création du .TOC- Ajout d'un lien vers les config et .lua V1.4:- Création du .toc automatiquement (merci à Goatman13  pour le .exe)- Ajout d'une option pour choisir entre 50 hz ou 60hz pour les jeux PAL V1.5:- Fusion des .bin automatiquement (la partie Merge et Toc totalement automatique)- Ajout d' une option pour skipper les logos Playstation et Sony- Ajout d'une option pour skipper l image d'aide Start-Select (manette ps4)- Ajout d' une option pour ajouter un nouveau Bios- Ajout d' une option pour avoir 60 FPS- Ajout d' une option pour changer le bouton de validation (X > O)- Ajout de l' icône Save-data.png- Correction d' un bug qui affectait les .cue V1.5.1:- Ajout du nouvel émulateur officiel Sony (Syphon Filter v3)- Ajout du Multi-discs (sous certianes conditions) Pour me supporter dans mes travaux, un petit don ne fait pas de mal ^^:https://www.paypal.com/paypalme/markus00095 Télécharger Psx2PS4 v1.5.1 ",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177662/in-ps4-psx2ps4-v151-nouvel-emulateur-et-ajout-du-multi-discs-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1177662/in-ps4-psx2ps4-v151-nouvel-emulateur-et-ajout-du-multi-discs-1.jpg"
        }
    },
    "news_7": {
        "title": "[PS4] PS4 PKG Tool v1.6 et PS4 Syscon Tools v1.6 disponibles",
        "content": " \nA quelques heures d'intervalles viennent de sortir les versions 1.6 de deux logiciels pour la PlayStation 4 et PlayStation 4 Pro, il s'agit de PS4 Syscon Tools et de PS4 PKG Tool.\n \nPS4 Syscon Tools v1.6\n \nProposé par Abkarino, bien connu de la scène PS3, PS4 Syscon Tools est l'alternative gratuite à tous les outils de dumps. Avec son ami EgyCnq, le développeur s'est mis en tête de faire autant voir mieux que les solutions payantes, de là sont nés PS4 Syscon Tools et PS4 Syscon Flasher, le premier est une solution gratuite (software & hardware) qui vous permet de manipuler la puce Syscon originale de la PlayStation 4 (Renesas RL78/G13). \n \n \n \n\n \n \n \nPS4 Syscon Tools v1.6 Changelog :\n \n- Ajout de la prise en charge du nouveau firmware PS4 Syscon Flasher v2.01.\n- Correction d'un problème qui faisait que l'application se bloquait pendant le processus de dumping dans certains cas.\n- Correction d'un problème dans l'obtention d'informations sur le firmware syscon dans certains cas.\n- Ajout d'une fonction de vérification automatique après le processus d'écriture partielle du firmware.\n- Ajout d'une fonction de vérification automatique après le processus d'écriture SNVS/NVS.\n \nPS4 Syscon Flasher v2.01 Changelog :\n \n- Optimisation et amélioration du processus de dumping du firmware.\n- Correction d'un problème sur les firmware Teensy 4.0 & Teensy 4.1 qui empêchait le PS4 Syscon Flasher de faire des glitchs sur les syscons non debug mode.\n- Nettoyage du code.\n \nTéléchargement : PS4 Syscon Tools v1.6\n \n \n \nPS4 PKG Tool v1.6\n \nProposé par Pearlxcore, PS4 PKG Tool est un outil PS4 PKG Tool qui est livré en version 1.6, et cette nouvelle version apporte de nombreuses corrections. Cet outil nous permet d'afficher la bibliothèque PS4 PKG, de gérer et d'effectuer diverses opérations sur vos PKG comme :\n \n- Scannez et visualisez votre collection de la bibliothèque PS4 PKG.\n- Visualisez les informations sur les PKG telles que les paramètres de l'ECG, la liste des trophées de l'ECG et l'entrée de l'ECG.\n- Renommez et exportez les noms des PKG vers un fichier Excel.\n- Vérifier la mise à jour du PKG.\n \n \n\n \n \nChangelog 1.6 :\n \n- Migration de PS4 PKG Tool et des bibliothèques associées vers .NET 7.\n- Ajout d'une option pour extraire complètement les fichiers PKG dans l'onglet View and Extract.\n- Activation de la sélection multiple pour les opérations PKG. (Problème n°46)\n- Correction de l'erreur de lecture du fichier PKG pour Homebrew Store et Remote Package Installer. (Problème n°52)\n- Correction de l'erreur de lecture du fichier PKG dans le lecteur flash. (Problème n°50)\n- Correction de l'erreur de lecture du fichier PKG dans le répertoire racine. (Problème n°40)\n- Ajout des balises \"(Patch)\" au nom de fichier du PKG de patch pendant le renommage du PKG pour éviter les conflits de noms.\n- Activation de la sélection de plusieurs fichiers pour extraire les fichiers PKG.\n- Ajout de caractères génériques de dénomination : {SYSTEM_VERSION}, {VERSION}. (Problème n°41)\n- Ajout d'une couleur personnalisée pour les étiquettes PKG dans la vue grille en fonction de la catégorie PKG (Game, Patch, Addon, App).\n- Ajout d'une option pour déplacer les fichiers PKG dans des dossiers séparés en fonction du titre et de sa catégorie (Game, Patch, Addon, App). Format du nom du dossier : Titre (Titre Id). (Problème n°57)\n- Ajout d'une colonne Backport dans la vue grille, permettant aux utilisateurs d'ajouter des étiquettes/remarques de backport aux fichiers PKG (Expérimental).\n- Ajout d'une option pour vérifier les fichiers PKG dupliqués.\n- Ajout du filtrage des PKG par application.\n- Amélioration de l'affichage et de l'extraction de la liste des fichiers PKG.\n- Amélioration de la journalisation.\n- Déplacement des noms personnalisés de renommage du PKG dans les paramètres du programme.\n- Modification de l'espace réservé à la dénomination.\n- Modification du nom du dossier temporaire de l'outil PS4 PKG en \"PS4PKGToolTemp\", qui sera désormais créé dans le répertoire local du programme.\n- La configuration du programme est maintenant stockée dans \"Settings.conf\" dans le dossier \"PS4PKGToolTemp\".\n- Modification du style de l'interface utilisateur.\n- La vérification de la rétrocompatibilité avec la PS5 est désormais une option. Les utilisateurs doivent télécharger manuellement le PS5 Backward Compatibility Status JSON dans les paramètres du programme pour utiliser le PS5 Backward Compatibility check. Le fichier JSON de rétrocompatibilité PS5 (\"ps5bc.json\") sera téléchargé dans \"PS4PKGToolTemp\".\n- PS4 PKG Tool n'est plus fourni avec l'outil de publication de Sony et \"curl.exe\". Les utilisateurs doivent placer manuellement les fichiers requis dans \"PS4PKGToolTemp\".\n- Suppression de l'icône du menu de la bande d'outils (Le projet a été crashé et a perdu quelques icônes, j'ai décidé d'enlever tout).\n- L'option View PKG Change Info est maintenant activée pour les catégories PKG.\n \n \nTéléchargement : PS4 PKG Tool v1.6\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177633/in-ps4-ps4-pkg-tool-v16-et-ps4-syscon-tools-v16-disponibles-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1177633/in-ps4-ps4-pkg-tool-v16-et-ps4-syscon-tools-v16-disponibles-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] ldn_mitm 1.16.0 disponible",
        "content": "Le développeur Spacemeowx2 a mis en ligne une nouvelle version de son KIP personnalisé, ldn_mitm est désormais proposé en 1.16.0. \n \nLe module ldn_mitm, si votre console est bannie ou que vous souhaitez tout simplement vous protéger d'un éventuel ban, vous permet de prendre en charge presque tous les jeux supportant le réseau sans fil local. Ce fichier KIP, nommé Ldn_mitm, vient en complément de switch-lan-play. Le module n'avait pas été mis à jour depuis Mars 2023.\n \n \n \n \n\n \n \n \n \nEn mettant à jour les bibliothèques Atmosphere sous-jacentes, ldn_mitm prend désormais en charge à la fois le dernier firmware et la dernière version d'Atmosphere.\n \n \nListe de compatibilité : ici\n \nTéléchargement : ldn_mitm 1.16.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177629/in-switch-ldn-mitm-1160-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[Switch] uLaunch 0.3.6 disponible",
        "content": "Le développeur XorTroll vient de sortir une nouvelle version de uLaunch, rappelons que uLaunch, déployé par XorTroll, est la ré-implémentation personnalisée et open source de qlaunch (le menu HOME de la console Switch). Orienté homebrew, ULaunch est simplement une ré-implémentation complète, 100% open-source, qui reprend également l'applet eShop, le contrôle parental et le titre du système de flagellation ( tous sont pratiquement inutiles avec cette ré-implémentation) pour sa fonctionnalité étendue.\n \n \n\n \n \nCette nouvelle version est compatible avec la dernière version d'Atmosphère, la version 1.5.5, mais ce n'est pas tout, cette mise à jour corrige aussi un bug avec uDaemon qui pouvait faire crasher uLaunch lors de son démarrage. \n \nTéléchargement : uLaunch 0.3.6\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177602/in-switch-ulaunch-036-disponible-1.png"
        }
    },
    "news_10": {
        "title": "[XB] La board permettant de dumper la Nand de Torus progresse",
        "content": "Le développeur Torus revient nous informer des quelques évolutions sur son projet, il faut dire qu'ils ne sont pas nombreux les développeurs à se pencher encore sur la partie hardware de la console de Microsoft. \n \nEn ce début du mois de Septembre 2023, Torus annnce en effet voiloir proposer une phase de bêta test, qui s'articulera autant de 4 à 5 testeurs. \n \nL'idée est que chacun puisse participer financièrement et ainsi obtenir une carte de développement permettant de dumper la Nand de leur Xbox One. \n \n \n\n \n \n \n \nAfin de préciser certains éléments, il a rajouté que ce n'est pas un jailbreak, que cette carte a été conçue pour une révision de Xbox One, mais que le concept permet de l'adapter à toutes les consoles, il ne faudra alors que redessiner le design du PCB. Les futurs bêta-testeurs ont dors et déjà reçus une invitation sur un serveur Discord privé aujourd'hui.\n \n \nTout est là : Twitter.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177538/in-xb-la-board-permettant-de-dumper-la-nand-de-torus-progresse-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] L'homebrew Tetris s'améliore sur PS5",
        "content": "Le développeur LightningMods vient tout juste de mettre en ligne une nouvelle vidéo de l'application test qui prend la forme d'un hombrew Tetris, il reste encore pas mal d'évolution à apporter, mais cela commence à prendre du sens. \n \nOn y voit une partie graphique qui s'améliore désormais avec une qualité des carré largement meilleure quand dans la version précédente, on remarque aussi que chacun des blocs disposent de sa propre couleur et que quand ils s'empilent ils changent aussi de couleur, reste encore pas mal de chose à rajouter comme la musique, des sons, un tableau des scores, un ranking, un réel menu utilisateur, on peut réfléchir à de nombreuses choses, mais au moins cela avance sur la partie homebrew. \n \n \n \n\n \n \n \n \nTout est là : twitter.com/LightningMods\n \n",
        "images": {}
    },
    "news_12": {
        "title": "[PS5] Hello World Test Application Tetris sur PS5 et Jailbreak BD-J Tools",
        "content": "Les Hello World PS5 sont plutôt nombreux, nous avons eu droit à des preuves de concepts (Poc), à des mises à jour de Libhijacker, des mises à jour sur PS5 IPV6 Kernel Exploit CEX to DEX, des menus de développement PS5 avec des correctifs de jeux à 60 FPS et ou encore la découverte des clés EMC du CP (processeur de communication), mais là c'est un Hello World un peu particulier qui prend la forme d'une application Tetris. \n \nIl s'agit de la première démonstration homebrew d'une application Hello World de First Bigapp proposé par LightningMods, un premier homebrew qui ne confirme pas encore l'arrivée de l'implémentation des FPKG car cela n'a pas encore été documenté. \n \n \n\n \n\n \n \n \nAutre nouveauté sur la scène PS5, l'arrivée de PS5 Jailbreak BD-J Tools v0.1 Beta, il s'agit là d'une proposition de John Tornblom qui offre la possibilité d'installer des fichers PKG et fPKG via TargetID Dex. \n \nDésormais, que ce soit les exploits webkits ou les exploit BD-J permettent donc d'installer des PKG et des fPKG, à l'exception de Mast1c0re, mais il n'est donc toujours pas possible de les exécuter. \n \n \n \n\n \n \n \n \nPS5 Jailbreak BD-J Tools\n \n- Activer le Dev Mode\n- Installer PS5 PKG & FPKG\n- Jailbreak le lecteur BD-J\n \nTéléchargement : PS5 Jailbreak BD-J Tools v0.1 Beta\n \n \n \n",
        "images": {}
    },
    "news_13": {
        "title": "[Switch] L4T Ubuntu v5.1.2 et L4T Ubuntu 22.04 bêta publique publiées",
        "content": "Le développeur CTCaer a mis en ligne L4T Ubuntu v5.1.2, et le développeur theofficialgman a quand à lui publié une version bêta publique avec Ubuntu 22.04, même si bien entendu toutes les fonctionnalités ne sont pas présentes sur Nintendo Switch. \n \nConcernant la nouvelle version de L4T Ubuntu 5.1.2, elle apporte pas mal de nouveautés, la fréquence RAM des Switch Mariko peut désormais atteindre son maximum via l'overclocking. Il s'agit d'une fréquence de 3 200 MHz, et sur les Switch Erista 2 366 MHz. Cette version vient corriger un bug critique empêchant de nombreux appareils Bluetooth de s'associer, et davantage de Joy-Cons tiers (en particulier ceux non Bluetooth) sont désormais pris en charge.\n \nLes packages multimédia (ffmpeg-l4t, ffplay-l4t, mpv-l4t, ffmpeg) ont été mis à jour et peuvent désormais recourir aux codecs logiciels. Le nouveau script \" gpu-info-l4t\" peut être utilisé pour afficher de nombreuses informations sur le GPU et la configuration joystick-souris/clavier a été mise à jour pour correspondre au mappage de xpadneo pour les contrôleurs Xbox.\n \n \n\n \n \n \nLa liste intégrale des modifications et les liens de téléchargement se trouvent ici : L4T Ubuntu v5.1.2\n \nLa version alternative basée sur  Ubuntu 22.04 se trouve ici : Ubuntu-Jammy-Install-Guide\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177387/in-switch-l4t-ubuntu-v512-et-l4t-ubuntu-2204-beta-publique-publiees-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] L'implémentation de l'exploit PS5 mise à jour",
        "content": "Le développeur EchoStretch a mis à jour l'implémentation de l'exploit PS5 de Specter, cette update a pour ambition d'apporter la prise en charge de l'installation de PKG PS5 et de PKG PS4. \n \nCe n'est bien entendu pas encore le saint graal, mais cela progresse, les PKG peuvent être installés, mais pas  exécutés, cette solution a permis de débloquer un moyen de télécharger et d'installer les updates de jeu sur la PS5, uniquement pour les jeux déjà possédés bien entendu.\n \nIl s'atèle aussi à travailler le firmware 4.00, un firmware qui a été un peu oublié dans les firmwares exploitables, les autres firmwares sont supportés officiellement (3.00, 3.10, 3.20, 3.21, 4.00 (todo), 4.02, 4.03, 4.50 et 4.51).\n \n \n \n\n \n \n \nUpdate cex to dex :\n \n- Ajout OFFSET_KERNEL_DATA_BASE_TARGETID\n \n- Ajoute OFFSET_KERNEL_DATA_BASE_TARGETID  \n \n- Mise à jour de 4.00.js\n \n- Suppression de dup sys__umtx_op\n \n- Offsets mis à jour\n \n- Suppression de dup sys__umtx_op\n \n- Suppression de dup sys__umtx_op\n \n- Suppression de dup sys__umtx_op\n \n- Suppression de dup sys__umtx_op\n \n- Mise à jour du fichier README.md\n \n \n \nTout est là : PS5-IPV6-Kernel-Exploit\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177384/in-ps5-limplementation-de-lexploit-ps5-mis-a-jour-1.png"
        }
    },
    "news_15": {
        "title": "[Switch] Hekate v6.0.6, Nyx v1.5.5 et MissionControl 0.9.3",
        "content": "Avec l'arrivée du nouveau firmware 16.1.0 à destination de la Nintendo Switch, la plupart de nos programmes doivent être adaptés. \n \n \nC'est le cas de nombreuses solutions des développeurs qui ont déjà été mises à jour, mais dans le cas présent nous nous tournerons vers Hekate, NyX et MissionControl.\n \n \n\n \n \nHekate et NyX\n \n \nDans le monde de la personnalisation et du hack de la Nintendo Switch, le nom \"Hekate\" continue à susciter l'intérêt des passionnés. Hekate, un custom bootloader largement utilisé pour la Nintendo Switch, vient d'être mis à jour par CTCaer qui a également mis à jour NyX. Hekate sert de point d'entrée pour de nombreux utilisateurs souhaitant explorer les capacités personnalisées de leur console Nintendo Switch. Depuis sa création, il a été utilisé pour lancer des homebrews, des backups de jeux, et d'autres logiciels personnalisés, offrant ainsi aux joueurs une expérience différente de celle prévue par Nintendo.\n \nL'écosystème qui entoure Hekate comprend une communauté active qui partage des connaissances, des tutoriels et des expériences sur des plateformes en ligne. En résumé, Hekate continue d'évoluer en tant qu'outil majeur pour les passionnés de la Nintendo Switch qui souhaitent personnaliser leur expérience de jeu, cette nouvelle version n'échappe pas à la règle quand on découvre le changelog. \n \n \nChangelog de hekate v6.0.6\n \nEntrées de démarrage :\n- Permettre de surcharger bootwait, le bootwait peut maintenant être utilisé sur les entrées d'amorçage pour remplacer la valeur globale.\n \nChangements L4T/Arachne T210 (Erista) et T210B01 (Mariko) :\n \n- Réglage automatique de la fréquence nominale de la DRAM pour le T210B01 par défaut.\n- Puisque Arachne est maintenant final et stable, utilisez 1866 MHz pour les anciens modèles et 2133 MHz pour les plus récents.\n- T210 utilisera toujours 1600 par défaut, puisque ces puces sont évaluées comme telles.\n- Autoriser la RAM T210B01 OC jusqu'à 3200 MHz (à partir de 3000) et la RAM T210 OC jusqu'à 2366 MHz (à partir de 2133).\n- Certains modèles de RAM et le binning peuvent le supporter. Ceci nécessite la version L4T 5.1.2 et plus pour fonctionner.\n- Amélioration de la création de table 8GB pour T210\n- Autorise le sous-voltage de la ram. VDD2 min : 1050mV, VDDQ min : 550.\n- Certains timings ont été corrigés pour utiliser des valeurs de base basées sur la latence au lieu de la fréquence.\n- Augmente les performances globales de la bande passante et réduit la latence.\n- Ajout d'une prise en charge du retraitement de la mémoire PTSA DDA pour une efficacité accrue.\n- Ceci nécessite la version 5.1.2 de L4T et plus pour que les changements personnalisés fonctionnent.\n- Le wiki doit être relu après la sortie de la version 5.1.2 de L4T avant de les utiliser. Comme toujours, l'OC doit être équilibré, pas seulement poussé au maximum.\n \n \nChangelog de Nyx v1.5.5\n \n- la sauvegarde emuMMC peut maintenant être migrée en tant qu'emuMMC basée sur un fichier directement, sans la déplacer\n- La restauration emuMMC utilise maintenant le dossier /backup/{sn}/restore/emummc\n- Le dossier parent restore est maintenant évité puisqu'il a toujours été utilisé pour la restauration de l'emuMMC.\n- Cela permet d'éviter de copier la sauvegarde emuMMC dans restore/ puis de la restaurer sur eMMC.\n- Correction d'un problème de décalage de l'année par rapport à l'horloge.\n- Correction d'un problème où Nyx ne se lançait pas au premier démarrage sans hekate_ipl.ini.\n- Amélioration de la détection du canal de la mémoire vive dans les informations\n- Ajout d'informations sur cal0\n- Ajout d'informations sur la clé publique dans les fusibles\n \n \nChangelog dans BDK\n \n- FUSES : Toutes les définitions des registres de fusibles ont été ajoutées.\n- Et les T210B01 ont maintenant le suffixe B01\n- FUELG : Le dumping des registres a été déplacé dans le bdk pour être utilisé par d'autres applications.\n- T210 : Ajout de nombreuses adresses mémoires et macros utiles\n- I2C : Correction d'un débordement de tampon de pile\n- MINERVA : OC freq est maintenant géré par Arachne\n \n \nTéléchargement : Hekate v6.0.6 et Nyx v1.5.5\n \n \n \nAutre nouveauté, l'arrivée de la version 0.9.3 de Mission Control, qui comme vous le savez permet de connecter des manettes tierces à votre Nitendo Switch, cette vingtième version officielle de Mission Control ajoute entre autre la prise en charge de la version 16.1.0 du firmware, ainsi que de nouveaux contrôleurs, paramètres et corrections de bugs. \n \n \nChangelog :\n \n- Ajout de la prise en charge du contrôleur Steelseries Stratus XL\n- Ajout de la prise en charge de la manette sans fil 8BitDo Ultimate 2.4G\n- Ajout du support pour le contrôleur Betop 2585N2\n- Ajout d'une option de configuration .ini pour régler le seuil d'activation du trigger analogique\n- Ajout d'un nouveau mode \"hybride\" aux paramètres .ini pour les LED d'indication de joueur de la Dualshock 3 afin d'afficher le modèle de LED de la Switch, mais inversé pour s'aligner sur les chiffres imprimés sur la manette.\n- Modification du comportement du pavé tactile Dualshock 4/Dualsense pour que les bords extérieurs soient affectés à la fonction +/- afin d'éviter que des captures d'écran ne soient prises accidentellement en appuyant sur ces boutons.\n- Le bouton mute de Dualsense est désormais également utilisé comme bouton de capture.\n- Mise à jour de la liste des noms de contrôleurs officiels pour inclure un nouveau nom introduit dans HOS 15.0.0. Ceci corrige un problème où certains contrôleurs Switch récents sous licence PowerA n'enregistrent pas les entrées lorsque - Mission Control est en cours d'exécution.\n- Correction d'un bug qui pouvait entraîner le spam de la console lors de l'activation du clignotement des LEDs de l'indicateur de joueur.\n \n \nTéléchargement : MissionControl 0.9.3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177313/in-switch-hekate-v606-nyx-v155-et-missioncontrol-093-1.png"
        }
    },
    "news_16": {
        "title": "[Switch] Atmosphère 1.5.5 disponible",
        "content": "Le développeur SciresM est de retour en cette quatrième semaine d'Août 2023 avec une nouvelle version d'Atmosphère. \n \nAtmosphère fait référence à une version d'un firmware personnalisé (CFW) open-source pour la console de jeu Nintendo Switch. Atmosphère permet aux utilisateurs de modifier et d'améliorer les fonctionnalités de leurs consoles Nintendo Switch au-delà de ce qui est possible avec le firmware officiel fourni par Nintendo.\n \nLes firmwares personnalisés tels qu'Atmosphère permettent aux utilisateurs d'exécuter des logiciels faits maison (homebrew), des émulateurs et d'autres applications qui ne sont pas disponibles sur le firmware officiel de la Nintendo Switch. Il offre également des fonctionnalités telles que des thèmes personnalisés, des ajustements au niveau du système et une compatibilité améliorée avec divers logiciels.\n \n \n\n \n \n \nCette nouvelle version 1.5.5 proposée depuis quelques heures semble être une mouture de corrections de bugs car aucune grosse nouveauté n'a été apportée, officiellement \"le support du firmware 16.1.0 et une amélioration de l'expérience utilisateur\".\n \nLe développeur reconnait que cette version est allégée en nouveautés, mais il était en vacances durant un mois, des vacances bien méritées comme tout un chacun.\n \n \nTéléchargement : Atmosphère 1.5.5\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177238/in-switch-atmosphere-155-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[Switch] emuiibo v1.1.0, la fin d'emutool et l'arrivée d'emuiigen",
        "content": "Alors que nous venons d'apprendre que Charles Martinet, doubleur de Mario, Luigi, Wario, ou encore Waluigi durant plus de 32 ans dans les jeux Nintendo vient d'annoncer prendre sa retraite, le développeur XorTroll est de retour sur la scène Nintendo Switch et propose une nouvelle version de son outil Emuiibo, cela n'avait pas été le cas depuis début Mai 2023, date à laquelle il avait mis en ligne la version 1.1.0.\n \n \n \n\n \n \n \nComme vous le savez, emuiibo est un module qui permet de profiter de l'émulation d'amiibo au moyen de fichiers \"Bin\" présent sur la carte SD, Emuiibo utilise ce format de stockage de données sur la carte microSD.\n \n \n \n\n \n \n \nDans cette version, les évolutions sont importantes, Emuiibo se souvient maintenant s'il est actif ou non et restaure l'état après un redémarrage. Lorsque la journalisation est active, elle se connecte désormais à un fichier sur la carte SD et les fichiers BIN convertis se voient désormais attribuer un Mii correct. \n \nCertaines traductions, comme l'allemande, ont été améliorées, et certains bugs ont été corrigés notamment celui lors de l'ouverture du menu/album homebrew. \n \nLe plus gros changement est que \"emutool\" a été remplacé par \"emuiigen\" . Comme Emutool, cet outil, écrit en Java, peut également générer directement des amiibo virtuels et a la possibilité d'éditer et de vérifier des amiibo virtuels existants. Plusieurs amiibo peuvent également être générés à la fois. Les noms des amiibo seront également coupés afin qu'à moins de 10 caractères, il soit plus facile de dire de quel amiibo il s'agit en raison de l'espace limité dans la superposition.\n \nPour exécuter emuiigen vous devez disposer de Java 17.\n \nTéléchargement :  emuiibo v1.1.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177229/in-switch-emuiibo-v110-la-fin-demutool-et-larrivee-demuiigen-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] Le développeur Illusion publie un fork de LibHijacker",
        "content": "Le développeur Illusion nous régale depuis quelques semaines en nous mettant l'eau à la bouche avec de nombreuses images de jeux PS5 tournant en 60 FPS grâce à des patchs qu'il applique.\n \nIl a déjà réalisé ceci dans le passé sur la PS4, et il récidive sur PS5, pour y parvenir il faut nécessairement une console hackée, du moins disposant d'un firmware sensible. \n \n \n \n\n \n \n \nAprès une période de bêta-test, il vient d'annoncer sur Twitter (enfin X désormais), qu'il propose un fork de LibHijacker développé par Astrelsky qui permet un fonctionnement autonome de toute forme de hack, en étant indépendant de toute forme de hack (webkit ou BD-JB), il assure un avenir à LibHijacker. \n \nSon ambition est de pouvoir fournir un nombre conséquent de patch pour la PS5 afin que chacun puisse profiter des capacités maximales qu'offrent la console. \n \nBien entendu, il n'est pas possible de se passer du hack même s'il ne sert pas au fonctionnement de LibHijacker, il faudra lancer un script python, et seul le hack permet cela. \n \n \n \n\n \n \n \nInstallation rapide : \n \n- Téléchargez le dernier fichier zip à partir de la page de publication ici : https://github.com/illusion0001/libhijacker/releases . \n- Extrayez le zip avec tous les fichiers dans un dossier sur votre ordinateur.\n- Chargez votre méthode préférée pour lancer l'exploit sur votre PS5 (BDJB ou webkit).\n- Installez python 3 et aiofiles pour les dépendances nécessaires.\n- pip install aiofiles\n- Au niveau du laoder ELF, exécutez send_elf.py avec l'IP de votre PS5 comme premier argument. Exemple : python ./send_elf.py 10.0.6.9\n- Pour tuer le processus du démon afin de faciliter le développement, vous pouvez utiliser kill_daemon.py pour tuer le processus et relancer send_elf.py pour envoyer la nouvelle version de l'exécutable du démon. (ceci peut être fait en dehors du navigateur web ou de la fenêtre de bdj)\n- Vous pouvez également trouver des commandes utiles dans launch.py et ses arguments.\n \n \nLes titres supportés (à l'heure de la publication) : \n \n- Batman: Arkham Knight v1.15: 60 FPS\n- Bloodborne v1.09: 60 FPS de Lance McDonald, avec possibilité de No Motion Blur, No Chromatic Aberration, Debug Camera de Lance McDonald\n- Crash Team Racing v1.21: 60 FPS\n- Demon Souls v1.00: 60 FPS (déblocage dans le mode cinématique)\n- Driveclub v1.28: 60 FPS\n- Gravity Rush 2 v1.11: 60 FPS\n- The Order 1886: v1.02: 60 FPS\n- The Last Guardian v1.03: 4K at 60FPS\n- The Last of Us Remastered 60 FPS + Debug Menu (v1.11)\n- The Last of Us Part 2 60 FPS + Debug Menu (v1.00 + v1.09)\n- Just Cause 4 v1.32: 60 FPS\n- Shadow of the Colossus: 1440p at 60FPS + Debug Menu\n- Silent Hills: P.T at 60FPS\n- Red Dead Redemption 2 v1.29: 60FPS\n \n \nLe programme évolue sans cesse, il faudra bien se référer à la dernière version disponible ici, version 1.53 à l'heure de diffusion :   libhijacker (illusion)\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177213/in-ps5-le-developpeur-illusion-publie-un-fork-de-libhijacker-1.png"
        }
    },
    "news_19": {
        "title": "[PSP] Le hack &#34; Pandora battery &#34; est désormais une réalité sur PSP Go",
        "content": "La \"PSP Go Pandora Battery\" fait référence à une technique de modification qui était à l'origine associée à la console de jeu portable Sony PlayStation Portable (PSP) Go. La batterie Pandora elle-même était initialement utilisée dans le cadre d'un processus appelé \"Pandora Battery and Magic Memory Stick\", qui permettait aux utilisateurs de modifier leurs PSP de différentes manières, telles que l'installation d'un firmware personnalisé (CFW) et l'exécution d'applications homebrew.\n \nLa méthode Pandora Battery et Magic Memory Stick était principalement utilisée pour downgrader ou modifier le firmware de la PSP, permettant aux utilisateurs d'exécuter des logiciels non autorisés, des applications homebrew et des jeux piratés. La technique est devenue populaire parmi les passionnés de la PSP qui souhaitaient avoir plus de contrôle sur leurs appareils et la possibilité d'utiliser une plus grande variété de logiciels.\n \nLe processus impliquait l'utilisation d'une batterie spécialement modifiée (la batterie Pandora) ainsi que d'une carte mémoire personnalisée (Magic Memory Stick) pour déclencher le mode de service de la console, où le firmware pouvait être manipulé. Cette technique était particulièrement pertinente pour les modèles PSP-1000 et les premiers modèles PSP-2000, mais elle n'était pas utilisée avec la PSP Go, faute de hack appropriée, de matériel légèrement différent et de son protocole de communication Syscon.\n \n \n \n\n \n \n \nDepuis des années, les pirates cherchaient à débriquer cette PSP Go, le hacker Leo Oliveira avait partagé de nouveaux détails sur le Syscon de la PSP GO la semaine dernière, et il a confirmé qu'il est désormais en mesure d'entrer en mode service et de débloquer la PSP Go. Il attribue en particulier à Proxima le retro engineering du firmware du Syson.\n \n \n \n \n\n \n \n \n \nEn parallèle, Zecoxao a publié quelques premiers schémas sur la façon dont la \"batterie\" Baryon Sweeper se connectera à la PSP Go. La raison pour laquelle le berceau PSP Go a été utilisé est clairement indiquée ici, mais comme le mentionnent les schémas, \"toute prise contenant toutes les broches peut être utilisée à la place\".\n \n \n \n\n \n \n \n \nTout est là : Psp_Go_Jigkick\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177155/in-psp-le-hack-pandora-battery-est-desormais-une-realite-sur-psp-go-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1177155/in-psp-le-hack-pandora-battery-est-desormais-une-realite-sur-psp-go-2.png"
        }
    },
    "news_20": {
        "title": "[Switch] Goldleaf 1.0 disponible",
        "content": "Goldleaf est un outil homebrew pour la Nintendo Switch, Goldleaf est principalement utilisé pour installer des fichiers au format NSP (Nintendo Submission Package) sur la Nintendo Switch. Les fichiers NSP sont généralement des jeux, des mises à jour ou d'autres contenus téléchargeables. Goldleaf facilite ce processus d'installation en fournissant une interface conviviale et intuitive.\n \nIl est important de noter que l'utilisation d'outils homebrew comme Goldleaf peut comporter des risques, notamment la possibilité de piratage ou de manipulation non autorisée de la console, le développeur XorTroll propose depuis quelques heures la version 1.0 de son programme, il n'avais pas fait de mise à jour depuis Avril.\n \n \n \n\n \n \n \nChangelog :\n \nGénéral\n- Quelques réécritures mineures (de manière probablement imperceptible) ont amélioré les parties internes du projet.\n- Comme toujours, toutes les bibliothèques ont été mises à jour vers leurs versions les plus récentes.\n \nGoldleaf\n- Les installations NSP ont enfin été rendues multitâches - le développeur dit avoir personnellement remarqué des temps d'installation jusqu'à 25 % plus rapides, mais ces améliorations de vitesse pourraient être encore plus importantes \n- Un support approprié pour les titres multiprogrammes a été ajouté (pour l'installation, la navigation et l'exportation correcte de ces titres).\n- Passage à un système de résultats alternatif via arc, de sorte que désormais plus de résultats système possèdent des noms/descriptions appropriés pour une meilleure lisibilité.\n- Amélioration de diverses parties internes via la mise en cache ou des optimisations générales.\n- Ajout de la prise en charge pour vérifier les titres sans données (contenu archivé, titres de cartes de jeu sans la carte de jeu insérée, contenu réellement corrompu, etc.).\n- Extension de la prise en charge du clavier, prenant désormais en charge d'autres types de caractères (prise en charge spécifique pour le renommage de compte).\n- Correction d'un bug gênant d'exportation de tickets/certificats qui causait la génération d'exportations NSP invalides.\n- Désormais, il est possible de monter et d'explorer les RomFs des NRO homebrew.\n- Mise à jour de certaines traductions de langues (un grand merci à toutes les personnes qui contribuent régulièrement à cela <3).\n- Ajout de la prise en charge de l'affichage et de la configuration de l'heure au format 12h/24h.\n- Le support des NXThemes a été supprimé.\n- Ajout d'un paramètre permettant de définir des tailles personnalisées de la mémoire tampon de l'installation NSP.\n- Légère amélioration de la génération aléatoire des couleurs de l'interface utilisateur.\n- Correction des barres de défilement des menus qui se comportaient de manière incorrecte dans les menus avec trop d'éléments.\n- Correction d'un bug où il était possible de quitter Goldleaf en plein milieu de l'installation de NSP, de la copie de fichiers, etc.\n- Amélioration des interfaces des menus de copie de fichiers/répertoires et de l'exportation de contenu.\n- Ajout d'un paramètre pour désactiver l'affichage des fichiers/répertoires masqués (ceux commençant par '.' dans leur nom).\n- Désormais, un dialogue de suppression s'affiche après une installation NSP et il est désactivé par défaut, avec un paramètre permettant de l'activer/désactiver.\n \nQuark\n- Correction d'un bug où, lors d'une reconnexion réussie à Goldleaf après une perte de connexion, Quark se fermait malgré tout.\n \n \nTéléchargement : Goldleaf 1.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1177154/in-switch-goldleaf-10-disponible-1.png"
        }
    }
}