{
    "news_1": {
        "title": "[Wii/NC] Swiss v0.6 r1562 disponible",
        "content": "Le développeur Extrems propose une mise à jour de son outil Swiss afin d'apporter des corrections indispensables. \n \nComme vous le savez probablement Swiss est le digne successeur de SD-boot, il permet de lancer les homebrews GameCube mais aussi les backups stockés sur carte SD ou un disque dur, SDGecko, WODE, Wiikey Fusion et bien d'autres solutions. \n \nCette nouvelle version v0.6 r1562 apporte pas mal de nouveautés ! \n \n \n\n \n \nChangements apportés par emukidid :\n \n- Correction de la navigation vers le haut d'un répertoire avec X sur les disques ISO9660\n \nChangements apportés par Extrems :\n \n- Optimisation supplémentaire de l'écriture à travers le cache FAT.\n- Invalider la page de cache en cas d'erreur de lecture.\n- Mise à jour de la base de données Redump.\n- Correction d'un bug IDCT dans la première bibliothèque THP.\n- Rendre GC Loader HW2 1.0.0 inéligible en tant que dispositif de correction.\n- Signaler CUBEODE comme \"compatible avec GC Loader\".\n- Utiliser les commandes de lecture de disque après l'installation du fragment pour tester les eaux.\n- Mieux initialiser les structures de gestion des périphériques.\n- Garder une trace de certaines bizarreries de GC Loader.\n- Ajustement pour les changements de libogc2.\n- Corriger le problème pour de vrai, en quelque sorte.\n- N'afficher l'entrée du jeu DVD que dans le répertoire racine.\n- Améliorer quelque peu la détection de la Wii.\n- Mise à jour de la base de données No-Intro.\n \nTéléchargement : Swiss v0.6 r1562\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184077/in-wiinc-swiss-v06-r1562-disponible-1.jpg"
        }
    },
    "news_2": {
        "title": "[Switch] NS-USBloader v7.1 disponible",
        "content": "Le développeur developersu propose la version 7.1 de NS-USBloader, pour rappel NS-USBloader se charge de se substituer au script de python de Tinfoil, et qui est proposé en java pour être lancé sous Windows, Linux et MacOS.\n \nUn programme qui continue de convaincre, malgré que quelques alternatives existent comme DBI, NS-Usbloader reste un programme d'installation NSP Adubbz / TinFoil et GoldLeaf (USB) du côté du PC, avec une interface graphique et les cookies.\n \n \n\n \n \nChangelog : \n \n- Pilotes ajoutés au programme d'installation de Windows. L'application vérifie s'il y a des pilotes dans le dossier de l'application et essaie de les télécharger uniquement s'ils sont absents. Important pour certaines personnes. #156\n- Prise en charge HiDPI ! Eh bien, en quelque sorte vous pouvez modifier la police et la taille de l'application dans les paramètres. Cela a du sens pour les utilisateurs de Rectify11. #153\n- Correction du traitement des paramètres régionaux. Important pour certains utilisateurs Linux. #139\n- Traduction chinoise simplifiée mise à jour par @exiori. Merci!\n- Traduction française mise à jour par @requinDr. Merci!\n- Traduction coréenne mise à jour par @DDinghoya. Merci!\n- justindhillon a corrigé les liens brisés dans 'readme' et 'pom'. Merci!\n \n \n \nTéléchargement : ns-usbloader 7.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184076/in-switch-ns-usbloader-v71-disponible-1.png"
        }
    },
    "news_3": {
        "title": "[Multi] Le code source de GTA V leakée mais pas que...",
        "content": "Rockstar a une nouvelle fois été la cible d'un vol de données, décidemment le studio n'est pas épargné, après le hack qui a permis de dévoiler environ une centaine de vidéos de GTA VI, la bande annonce dévoilée plus tôt, voilà que c'est le code source de GTA V qui a été rendu public contre 2000 $. \n \n \n\n \n \nLe code source a été fourni par un groupe de personnes dans un contexte privé puis le code a été vendu pour une bouchée de pain, avec des modèles et des ressources internes de Rockstar. \n \n\n \n\n \n \nCe serait environ 200 Go de données qui ont été divulguées, en plus du code source il y aurait même quelques allusions à Bully 2, Midnight Club 5 ou encore GTA VI avec des listes de diffusions, des noms complets de 1158 employés de Rockstar Games ou encore certains fichiers sensibles des prochains jeux. \n \n \n\n \nBien entendu Rockstar a supprimé depuis les liens et l'accès aux fichiers mais c'est déjà trop tard, environ 117 nouveaux éléments ont été divulgués lors de la fuite du code source de GTA 5, notamment des vidéos de développement, des captures d'écran et des documents.\n \n \n\n \n \n \nLa source ici : twitter.com/GTAFocal/\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-607508196.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1753973593.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1711829397.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-1439781616.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-483826025.png"
        }
    },
    "news_4": {
        "title": "[NDS/2DS/3DS] TWiLight Menu++ v26.4.0 et Bootstrap v1.1.0 disponibles",
        "content": "Le développeur RocketRobz propose les versions Christmas de TWiLight Menu++ et Bootstrap, l'occasion de mettre à jour ses logiciels. \n \n \n\n \n \nQuoi de neuf dans TWiLight Menu++ :\n \n- DeadSkullzJr : Mise à jour du correctif AP pour Pokémon : Refined Gold Overhaul (v3.1).\n- Ajout d'un message de limitation de RAM (pas de musique) pour Glory Days : Tactical Defense sur DS.\n- DieGo367 : Thèmes basés sur la DSi : Ajustement des conditions du jingle / de la musique de démarrage (#2336).\n- Divers : Mise à jour des traductions.\n \nCorrections de bugs :\n- Correction du fait que le son DSi ne soit pas automatiquement défini comme ROM donneuse afin que les jeux DSi-Enhanced fonctionnent en mode DSi dans les exploits DSiWare (tels que Memory Pit, Flipnote Lenny, stylehax, etc.).\nO- btenir la région SysNAND et les paramètres de l'application launcher fonctionne à nouveau.\n- DieGo367 : Correction du Slot-1 qui ne se chargeait pas dans le menu DS Classic (#2335).\n- DieGo367 : Thèmes basés sur la DSi : Correction de l'effacement de la boîte et des boîtes manquantes (#2338).\n- NightScript370 : Le thème est maintenant l'option musicale par défaut.\n- Correction du jingle de démarrage ne jouant pas dans le thème 3DS avec la musique du menu 3DS réglée.\n \n \nNouveautés de Bootstrap :\n \n- Mode B4DS : La musique est désormais jouée dans Pop Island : Paperfield & Glory Days : Tactical Defense lorsqu'ils sont joués sur des consoles DS debug/dev.\n \nCorrections de bugs :\n- Correction du dysfonctionnement du cloneboot dans certains titres DSiWare.\n- Correction de la lecture du drapeau cloneboot à une adresse de fin de ROM invalide, ce qui empêchait certains ROM hacks de démarrer.\n- Une partie de la RAM utilisée pour les captures d'écran est désormais sauvegardée avant de prendre une capture d'écran. Ceci corrige le cas où un jeu se plantait après avoir pris une capture d'écran.\n- L'accès au Slot-1 est désormais activé pour le DS Download Play.\n \n \nTéléchargement : \n \n \nhttps://github.com/DS-Homebrew/TWiLightMenu/releases\n \n \nhttps://github.com/DS-Homebrew/nds-bootstrap/releases\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1184014/in-nds2ds3ds-twilight-menu-v2640-et-bootstrap-v110-disponibles-1.png"
        }
    },
    "news_5": {
        "title": "[PS5] Itemzflow disponible en v1.0.3 avec support des backups PS5",
        "content": "A l'occasion de Noël 2023, le développeur LighninsMods dévoile la version 1.0.3 de son manager Itemzflow, et cette version c'est clairement du lourd. \n \n \n\n \n \nPrincipales fonctionnalités incluses dans cette version :\n \n- Applications PS5\n- Game Dumper\n- Installateur PKG interne\n- Lecture MP3\n- Plus d'informations\n \n \nPour l'heure, cela est limité au firmware 4.03, 4.50 et 4.51, ce qui est déjà pas mal. \n \n\n \n \nTout une liste de jeux sont donc désormais jouables sur PS5 : \n \nGhost of Tsushima (63.47 GB)\nBack 4 Blood (31.84 GB)\nLittleBigPlanet Sackboy: A Big Adventure (26.15 GB)\nMarvel's Guardians of the Galaxy (38.10 GB)\nSTAR WARS Jedi: Fallen Order (49.47 GB)\nWWE 2K22 (47.45 GB)\nSTRANGER OF PARADISE FINAL FANTASY ORIGIN (59.63 GB)\nSifu (6.15 GB)\nAlan Wake Remastered (27.34 GB)\nGhostwire: Tokyo (17.48 GB)\nThe Pathless (6.62 GB)\nGuilty Gear -Strive- (13.86 GB)\nTales of Arise (31.22 GB)\nLife is Strange: True Colors (11.32 GB)\nThe Persistence Enhanced Edition (1.89 GB)\nKena: Bridge of Spirits (16.63 GB)\nGrand Theft Auto III: The Definitive Edition (4.55 GB)\nGrand Theft Auto: San Andreas: The Definitive Edition (20.71 GB)\nGrand Theft Auto: Vice City: The Definitive Edition (10.01 GB)\n \n \nTéléchargement : \n \nhttps://twitter.com/LightningMods_/status/1739509549537665215\n \n \nhttps://pkg-zone.com/details/ITEM00001\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-922050178.jpg"
        }
    },
    "news_6": {
        "title": "[PS5] Une nouvelle version d'etaHEN avec itemzflow disponible",
        "content": "Clairement c'est du côté de Lightning Mods que cela se passe actuellement, tous nos espoirs de voir débarquer un véritable hack exploitable sur PS5 viennent d'etaHEN couplé avec itemzflow, et l'arrivée d'une nouvelle version est toujours appréciable. \n \nIl teste actuellement une nouvelle version de etaHEN intégrant une nouvelle version d'itemzflow, de quoi nous faire patienter encore un peu en attendant un véritable hack permettant d'exécuter les dumps PS5. \n \nLightning Mods informe le monde qu'il prépare la version 1.2B d'etaHEN qui va permettre de nouvelles fonctionnalités : \n \n \n\n\n \n\n \n\n \n \nNouvelles fonctionnalités clés :\n \n- Version personnalisée du système\n- Un fichier de configuration\n- Ajout IF à la base de données si sur m.2\n- Corrections de bogues\n- Réécriture du payload du serveur \n- Les cheats ne sont plus un payload indépendant\n\n \nA noter que le Store PKG a été mis à jour pour fonctionner avec etaHEN 1. 2B l'ancien PKG ne fonctionnera PAS avec cette version d'etaHEN, assurez-vous de retélécharger le PKG.\n \nTéléchargement : etaHEN 1.2B\n \nUne liste de compatibilité est disponible ici : Liste\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183964/in-ps5-une-nouvelle-version-detahen-avec-itemzflow-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1183964/in-ps5-une-nouvelle-version-detahen-avec-itemzflow-disponible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1183964/in-ps5-une-nouvelle-version-detahen-avec-itemzflow-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[DSi] Un hack de la Nintendo DSi à la 37C3 dans 3 jours",
        "content": "Noël est passé et comme un premier cadeau voilà qu'arrive la conférence 37C3, l'un des rassemblements des meilleurs développeurs et hackers. \n \nLes nouveautés lors de la \"Chaos Communication Congress\" sont toujours intéressantes, comme vous le savez il s'agit d'un salon qui se tiendra cette année encore à Hambourg.\n \nUne des présentations attire notre regard, il s'agit de celle de PoroCYon qui s'est intéressé à la Nintendo DSi.\n \nSelon la description, la présentation expliquera comment la ROM de démarrage de la Nintendo DSi a été extraite et comment de nouveaux exploits peuvent être utilisés pour obtenir un accès plus approfondi au système, ainsi il aussi possible de réparer une console dont la puce eMMC NAND a été corrompue.\n \n \n\n \n \n \nL'évènement commence le  28 décembre 2023 à 14h45 ; la conférence durera environ une heure.\n \n \nTout est là : https://events.ccc.de/congress/2023/infos/startpage.html\n \net le programme est là : \n \nhttps://fahrplan.events.ccc.de/congress/2023/fahrplan/events/11736.html\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1428018082.png"
        }
    },
    "news_8": {
        "title": "[PS4] Textures Converter UE4 v1.0: PC vers PS4",
        "content": "Je commence les hostilités, voici un premier outil que je vous partage pour Noël, à la base je ne devais pas le partager (c'était un outil personnel)  mais après plusieurs demandes, voici une version exploitable pour tous... Il y a quelques temps je publiais un créateur de MODs pour les jeux Unreal Engine 4, mais comme précisé dans la news correspondante, vous deviez avant convertir vos textures PC au format PS4, c'est ici qu'intervient ce nouveau script.  En effet, grâce à ce petit outil, vous pourrez maintenant convertir les textures des jeux Unreal Engine 4 PC vers PS4 et ainsi les utiliser dans UE4 mod builder v1.0. Cet outil n 'est pas compatible pour TOUS les jeux Unreal Engine 4 mais fonctionne pour une grande partie, comme Dragon ball Fighter Z, Sifu ou encore Stray.  Le fonctionnement n' est pas compliqué mais il vous faudra cependant d' autres outils pour son bon fonctionnement, Umodel.exe, Uviewer.exe et upak-master.De plus il vous faudra posséder certains fichiers du SDK PS4 à placer dans le dossier tools/convert/... que je ne peux malheureusement pas vous partager qui sont: - libSceGnm.dll- libSceGpuAddress.dll- libSceTextureTool.dll- orbis-image2gnf.exe Vous devrez donc déchiffrer le mod PC avec Umodel.exe, extraire les textures au format .png ou .dds, puis utiliser mon script pour les convertir au format PS4, puis repacker le tous en .pak avec upak-master. Je ferais un tuto vidéo prochainement expliquant toute la manipulation du Mod pc vers PS4.  Tuto: - Déchiffrer votre mod PC avec Umodel.exe- Extraire les textures PC avec Umodel.exe (Export folder content)- Sauvegarder les textures PC avec Umodel.exe (Save folder packages)- Copier mon outil (dossier tools/ et .bat) dans UmodelExport- Lancer le .bat et patienter- Copier/coller les textures tous juste convertis dans le dossier Save folder packages- Reconstruire le .pak avec upak-master- Votre mod PS4 est prêt. Télécharger Textures Converter v1.0",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183911/in-ps4-textures-converter-ue4-v10-pc-vers-ps4-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1183911/in-ps4-textures-converter-ue4-v10-pc-vers-ps4-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1183911/in-ps4-textures-converter-ue4-v10-pc-vers-ps4-1.png"
        }
    },
    "news_9": {
        "title": "[Multi] Joyeux Noël à toutes et tous !",
        "content": "Les ami(e)s sunriseurs et sunriseuses il est venu le temps pour nous de vous souhaiter un excellent Noël, que ces quelques heures vous apporte tout ce que vous désirez, mais surtout que vous puissiez profiter de vos proches ou des personnes que vous aimez. \n \nAlors que les rues s'illuminent de l'éclat des décorations festives et que l'air est imprégné de l'esprit joyeux de Noël, l'industrie du jeu vidéo célèbre également la saison des fêtes avec une panoplie de surprises pour les joueurs du monde entier, l'occasion pour nous de faire un peu la fête qu'elle soit physique ou vidéoludique, virtuelle ou avec vos proches. \n \nEn ce 24 décembre 2023, nous sommes désormais à quelques heures de la plus grande fête de l'année, et cette année encore gageons qu'elle fera des heureux et des heureuses, que ce soit au travers des cadeaux, ou bien car vous profiterez de vos proches. \n \n \n\n \n \n \nAu nom de toute l'équipe, Logic-Sunrise.com vous souhaite un Joyeux Noël !\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183874/in-multi-joyeux-noel-a-toutes-et-tous-1.png"
        }
    },
    "news_10": {
        "title": "[Multi] DS4Windows 3.3.2 disponible",
        "content": "Le développeur Ryochan7 dévoile ce qui sera certainement l'une des dernières versions de DS4Windows, nous avons de la chance de pouvoir profiter de dernières versions de dernières minutes, rappelons que le développement s'arrêtera après la fin du mois. \n \nComme vous le savez probablement DS4Windows est une interface efficace pour paramétrer une manette sur PC, il est basé sur un fork de Jays2Kings. Pour en profiter cela passe par un câble micro-USB, mais il est aussi possible de s'en servir sans fils avec quelques adaptateurs Bluetooth 2.1 (ou supérieur). \n \n \n\n \n \nChangelog : \n \n- Diverses corrections pour la classe ProfileDTO afin de corriger la lecture des profils rétro\n- Correction de la zone maximale par défaut pour TouchMouseStick\n- Ajout d'un test pour vérifier la chaîne XML de sortie après la migration du profil\n- Correction des paramètres du profil hip fire time\n- Correction de certaines clés de traduction dans l'éditeur de profil\n \nTéléchargement : DS4Windows 3.3.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183872/in-multi-ds4windows-332-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[PS4/PS5] PS Multi Tools v13.4 disponible",
        "content": "SvenGDK vient de mettre à jour PS Multi Tools, notamment pour ajouter un menu contextuel à la bibliothèque de jeux PS5. \n \nAprès avoir travaillé une version Mac, il fait une nouvelle fois évoluer son outil qui comme vous le savez est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n\n \n \nChangelog PS Multi Tools :\n \n- Ajout d'un menu contextuel à la bibliothèque de jeux PS5 avec les options suivantes :\n- Copy To -> Copie le jeu sélectionné vers un lecteur ou un dossier de destination\n- Play Soundtrack -> Joue la bande son at9 incluse du jeu (si disponible)\n- Check for updates -> Vérifie la disponibilité des correctifs de jeu.\n- Le téléchargement de correctifs de jeux est désormais possible dans PS Multi Tools.\n- Les PKG peuvent être téléchargés directement ou ajoutés à une file d'attente.\n- Il est possible de télécharger plusieurs fichiers .pkg\n- Corrections de bugs mineurs\n \n \nTéléchargement : PS Multi Tools v13.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183865/in-ps4ps5-ps-multi-tools-v133-disponible-1.png"
        }
    },
    "news_12": {
        "title": "[Switch] Un linker en phase de test sur Switch ?",
        "content": "Les pincettes pour cette news sont de sorties, sous entendu prenez cette news avec du recul, seul le temps nous dira ce qu'il en est, cependant il semblerait qu'une sorte de linker soit en train d'être développé et testé sur Nintendo Switch. \n \nOn en a vu d'autres comme cela avec récemment les RP2040, au début personne n'y croyait, et pourtant c'est arrivé, bon là c'est un peu différent dans le sens où c'est un utilisateur de Twitter qui aurait entre ses mains une sorte de linker ou de Sky3DS pour la Nintendo Switch. \n \nIl serait bêta-testeur de la solution, il s'agirait d'un linker qui prendrait en charge tous les firmwares et tous les types de consoles, ainsi que toutes les régions. Pour le moment il est difficile de se faire une opinion mais il a diffusé une vidéo. \n \n\n \n \nSi le produit venait à être finalisé, il pourrait être lancé dès le mois prochain, en Janvier 2024, bref nous serons vite fixé sur la légitimité de cette proposition. \n \n \n\n \n \n \nSi on rentre un peu dans le détail nous voyons que le linker dispose d'une micro-sd qui doit contenir les jeux, et qu'il suffit d'insérer et d'éjecter le linker pour changer de jeu. \n \nLa news et la vidéo sont en provenance de AfterTimeX.\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183805/in-switch-un-linker-en-phase-de-test-sur-switch-1.png"
        }
    },
    "news_13": {
        "title": "[PS4/PS5] PS4 et PS5 Wee Tools se mettent à jour",
        "content": "Les logiciels PS4 et PS5 Wee Tools ont été mis à jour par le dévelopeur Andy_maN, le premier pour la PS4 est proposée en v0.9.9 alors que le second pour la PS5 débarque en v0.1.7.\n \n \n\n \n \nPS5 Wee Tool v0.1.7 :\n- EMC errlog reader (lecture et nettoyage des codes actuels)\n- Visualisation du journal EMC\n- Description de 614 codes\n- Correction de bugs\n \n\n \n \nPS4 Wee Tool v0.9.9 : \n- Support du firmware 11.02\n- Récupération des zones NVS\n- Informations complémentaires pour validation\n- Optimisation du langage\n- Indicateurs de résolution\n- Correction de bugs liés au récepteur-émetteur asynchrone universel (UART)\n- Mise à jour des ressources\n- Correction de bugs liés au chemin racine\n \n \nTéléchargement : \n \nhttps://ko-fi.com/s/269af2412b\n \nhttps://ko-fi.com/s/4a865eaf62\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183802/in-ps4ps5-ps4-et-ps5-wee-tools-se-mettent-a-jour-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1183802/in-ps4ps5-ps4-et-ps5-wee-tools-se-mettent-a-jour-2.png"
        }
    },
    "news_14": {
        "title": "[PS5] Un PKG pour installer un navigateur web sur PS5",
        "content": "Le développeur Mouuu vient de mettre en ligne un fichier PKG sur PlayStation 5 qui permet d'installer un navigateur web sur la dernière console de salon de Sony. \n \nComme vous le savez, Sony a fait le choix, probablement pour limiter le piratage, de n'intégrer aucun navigateur web sur sa console, mais il existe cependant des moyens d'accéder à une sorte de navigateur en détournant des pages d'aide avec des faux DNS.\n \nLe fichier PKG proposé par le développeur Mouuu permet donc d'intégrer un accès direct à ce navigateur web depuis le dashboard d'accueil, il permet ainsi d'accéder également à des raccourcis et des historiques d'URL avec barre d'adresse et tout ce qui va bien pour profiter pleinement des capacités de sa console. \n \n \n \n\n \n \n \nAttention, la procédure implique probablement de restaurer la sauvegarde, toutes les données stockées sur la console, les jeux, les applications et les sauvegardes seront donc perdues. \n \nLe développeur Master a pu tester et nous informe que cela fonctionne jusqu'au / ou sur le firmware 8.40, il faut bien entendu disposer d'une PS5 jailbreakée au niveau de son webkit. \n \n \nTéléchargement : Internet Browser PS5 PKG (35.89 MB)\n \n \n",
        "images": {}
    },
    "news_15": {
        "title": "[PS5] Une vidéo en montre plus sur le lancement de jeu sur PS5",
        "content": "L'utilisateur averti de Twitter/X Echo Stretch dévoile une vidéo montrant le lancement de sauvegardes sur PlayStation 5. Comme toujours depuis le début cela passe par Itemzflow de LightningMods. \n \nIl semble que les jeux s'appuient sur une application qui utilise un espace réservé, un peu comme cela se faisait sur PlayStation 3 avec les ISO PSP. \n \n \n\n\n \n \nCette fameuse app s'apparente comme un loader, mais tous les jeux sauvegardés ne sont pas compatibles et ils doivent être manuellement adaptés, cela ne se fait pas à la volée. \n \nIl faut passer par un dump via le script python PS5 Game File Dumper développé par Nomadic, et bien entendu il faudra adapter le dump au loader, ce qui n'est pas facile selon les titres en question. \n \n \n\n \n \n \nTout est là : \n \nhttps://twitter.com/StretchEcho/status/1736950491073192239",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183747/in-ps5-une-video-en-montre-plus-sur-le-lancement-de-jeu-sur-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1183747/in-ps5-une-video-en-montre-plus-sur-le-lancement-de-jeu-sur-ps5-2.png"
        }
    },
    "news_16": {
        "title": "[Switch] Yuzu sort son rapport de Novembre 2023",
        "content": "La Team Yuzu vient de dévoiler son rapport de novembre 2023, et elle nous informe qu'elle a proposée de nombreuses évolutions et de corrections essentiellement au niveau de la gestion GPU. \n \nCe sont des corrections au niveau du GPU mais aussi de nouveaux pilotes, des changements importants sur Android/ARM, encore plus de travail sur les applets, et bien entendu des projets encore top secret. \n \nComme nous l'explique la Team Yuzu elle a travaillé sur la musique de Super Mario Bros mais aussi amélioré les graphismes, notamment les utilisateurs nVidia qui faisaient face à un rendu défectueux. \n \nLe projet NiCE est le passage d'un émulateur PC compatible Android à un émulateur Android totalement \"natif\". \n \nLa prise en charge de NCE (Native Code Execution) implique un travail important dans le code GPU, et il convient de recompiler certaines choses pour les rendre compatible nativement avec les appareils ARM. Un travail important là encore à été effectué par GPUCode et byte[]. \n \n \n\n \n \nDes modifications graphiques importantes ont également été opérées avec notamment un paramètre nommé Force maximum clocks qui semble causer beaucoup de confusion pour les utilisateurs. Un paramètre à l'origine intégré pour résoudre des problèmes AMD, certaines cartes AMD souffrant de downclocking sévère. Force maximum clocks, qui sur le bureau Yuzu génère simplement une charge de calcul factice à exécuter sur le GPU, déclenchant l'horloge forcée de la carte. Bien que cela corrige le problème et place les performances des cartes AMD à égalité avec celles de NVIDIA (et aide même les cartes NVIDIA dans certains scénarios), exécuter une charge de calcul comme celle-ci n'est pas une option viable pour les GPU intégrés. Il a fallu corriger certaines choses afin d'être prudent avec son utilisation. \n \n \n\n \n \nLa Team explique ensuite les divers changements qu'elle a pu faire notamment suite à la sortie du firmware 17.0.0, puis sur le pilote Vulkan des pilotes Vega et Polaris qui est plus ancien que celui du pilote matériel basé sur RDNA, et tous les GPU AMD exécutant cette configuration mixte exécuteront un seul pilote Vulkan. Cela entraîne un recul des fonctionnalités et des correctifs pour le GPU basé sur RDNA juste pour maintenir la compatibilité.\n \n \n\n \n \nBref, encore un billet très complet, qu'il reste intéressant de découvrir ici : https://yuzu-emu.org/entry/yuzu-progress-report-nov-2023/\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-650931029.png",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-690845378.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1527683436.png"
        }
    },
    "news_17": {
        "title": "[PS4/PS5] PS4 Reaper Studio intègre le support de la PS5",
        "content": "Le développeur ShininGami propose une nouvelle version de PS4 Reaper Studio, qui passe en version v01.0.4.1. Ce logiciel est un studio de développement destiné aux utilisateurs PC sous Windows, et il permet de les aider à créer et partager des cheats pour les jeux PS4, il succède à MultiTrainer. \n \nPS4 Reaper Studio intègre un débogueur, un convertisseur, un code training pour tester les codes et les cheats, avec des calculateurs et un éditeur hexadécimal. \n \nLa grosse nouveauté de cette version est l'arrivée du support de la console PS5, car ce logiciel se sert de PS4Debug sur PS4 et donc désormais de PS5Debug sur PS5. \n \nCette mise à jour intègre de nombreux correctifs pour la PS5, des crashs, des optimisations le changelog intégral se trouve sur le Ko-fi.com du développeur. \n \n \n\n \n \nChangeLog 1.0.2.128745 public beta 3.2 (mis à jour par CTN) :\n-Correction des offsets pour PS5.\n-Correction d'un espace à la fin d'un nouveau nom de projet qui fait que le projet n'est pas trouvé.\n-Correction d'un crash lors de l'ajout de commentaires (//) asm avec des caractères [,].\n-Correction d'un blocage lors de l'ajout de nouvelles lignes au milieu du code asm.\n-Correction d'un blocage lors de l'utilisation de GetStack avec une valeur dépassant la profondeur de la pile.\n-Correction d'un crash lorsque le titre du projet ne correspond pas au jeu en cours.\n-Correction de l'importation de shn avec une section non-0.\n-Activation de la fonctionnalité Analyse de l'exécutable, de l'organigramme et de la fonction de recherche. (Expérimental)\n--->Désactivée par défaut, peut être activée via le menu Options.\n-Mise à jour de la présentation de l'organigramme.\n-Correction d'un problème avec les fonctions vides dans l'organigramme.\n-Ajout d'une option pour activer/désactiver l'organigramme, la fonction de recherche et l'analyse exe.\n-Correction d'un crash du jeu lors de l'activation d'une triche avec un élément de la liste déroulante non sélectionné.\n-Ne se déconnecte pas si l'identifiant du titre est incorrect.\n-Correction de la fusion du code des grottes où les grottes sont fusionnées incorrectement.\n-Correction des breakpoints < 0x400000.\n-Correction du problème du convertisseur \"ToASM\" avec les sauts en double.\n \nTout est là : PS4 Reaper Studio v1.0.4.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183711/in-ps4ps5-ps4-reaper-studio-integre-le-support-de-la-ps5-1.jpg"
        }
    },
    "news_18": {
        "title": "[3DS/Switch/GC] PKHeX du 18.12.2023 disponible",
        "content": "Il y a quelques heures a été publiée la toute dernière version de PKHeX, comme vous le savez avec PKHeX les utilisateurs peuvent manipuler divers fichiers de sauvegarde .sav,.dsv,.dat,.gci,.raw et .bin. PKHeX peut également lire et écrire les fichiers .pk, qui sont des fichiers Pokémon individuels, et les fichiers .pgt,.pcd,.pgf,.wc, qui sont des fichiers Mystery Gift.\n \nCette nouvelle version de leur outil Nintendo 3DS, Switch, et de la Gamecube apporte le support de .NET 8 proposé par Microsoft, mais aussi le support de la version 3.0.0 de Scarlet et Violet, mais aussi tout un tas de corrections X et Y, entres autres. \n \n \n \n\n \n \n \nChangelog : \nModifié : PKHeX utilise désormais .NET 8 pour son runtime (mis à jour à partir de .NET 7) !\nNécessite un système d'exploitation Windows 64bit, avec le .NET Desktop Runtime 8.0.x\nhttps://dotnet.microsoft.com/en-us/download/dotnet/8.0\nAjout du support pour Scarlet & Violet 3.0.0 (Indigo Disk)\nLégalité : Ajout de rencontres / changements selon les ajustements du DLC Indigo Disk.\nIl y aura toujours des problèmes avec les croisements, Minior, et les emplacements des rencontres. Ces problèmes seront résolus lors de la prochaine version.\nCorrigé : Le comportement du rerolling du PID de Manaphy Gen4 a été mis à jour. Merci @Lincoln-LM !\nAjouté : L'aperçu au survol affiche maintenant une info-bulle personnalisée. L'ancien comportement peut être rétabli via les paramètres.\nAjouté : Edition de la position/rotation de la carte Gen6-9. Merci @abcboy101 !\nAjouté : Gen6 XY Roamer editor. Merci @foohyfooh !\nAjouté : Editeur d'accessoires musicaux pour la Gen5. Merci @foohyfooh !\nAjouté : Gen4/5 Chatter editor. Merci @abcboy101 !\nAjouté : Convertisseur Gen4 KOR<->INT/JPN pour les fichiers de sauvegarde. Merci @abcboy101 !\nAjouté : Gen2 Mystery Gift item / unlock flag editing. Merci @RainingChain !\nCorrection : String conversion has been rewritten for easier maintenance. Les prochaines mises à jour géreront mieux les cas de Farfetch'd et autres.\nCorrigé : Les noms de pays/régions de la Gen6/7 pour le dernier manifeste régional de la 3DS. Merci @abcboy101 !\nCorrigé : Le cheat Pokétch Unlock Gen4 met à jour le nombre total d'applications maintenant. Merci @foohyfooh !\nCorrigé : Le cheat Gen4 Complete Dex met à jour correctement les bitflags féminins. Merci @DeadSkullzJr !\nCorrigé : Les flags de Gen3 Colosseum Fateful Encounter lisent/écrivent maintenant correctement en fonction du contexte du fichier de sauvegarde japonais/international.\nCorrigé : Les sauvegardes Gen3 Mainline mettent à jour les index de courrier de la partie lorsqu'il n'y a pas d'objet détenu par courrier (empêche l'icône de courrier invalide).\nCorrigé : Les sauvegardes Gen1 RBY qui n'ont pas encore reçu de starter se différencient maintenant correctement. Merci @fattard !\n \n \nTéléchargement : PKHeX du 18.12.2023\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183691/in-3dsswitchgc-pkhex-du-18122023-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[Switch] NSZ 4.6.1 disponible",
        "content": "Le développeur Nicoboss (Nico Bosshard) dévoile ce qui sera probablement la dernière version de NSZ de 2023. \n \nComme vous le savez il s'agit d'un script python qui permet de proposer le format de compression spécifique à la scène Switch, qui vous permet de compresser et décompresser les fichiers .nsz.\n \nLes fichiers NSZ sont très proches des NSP, ils sont compressés, ce n'est pas tout à fait un nouveau format, le script est assez simple à utiliser, et sachez que NSC_Builder prend en charge la compression de fichier NSP dans NSZ et la décompression de fichier NSZ dans NSP.\n \nCette version 4.6.0 succède à la 4.5.0 proposée le 01 Octobre 2023, les changements sont pour certains des évolutions majeures pour le script alors que d'autres sont des corrections de bugs.\n \n \n\n \n \nA noter qu'un problème pourrait subvenir : \nProblème avec NSZ 4.6.0 : MPLUS1p-Medium.ttf introuvable\nLes utilisateurs concernés par le problème #154 peuvent rencontrer ce problème tel que rapporté dans le #164. Une nouvelle version de NSZ qui corrige ce problème sera déployée plus tard dans la journée. Supprimez le fichier suivant pour faire fonctionner l'interface graphique de NSZ 4.6 :\nWindows : C:\\NUsers\\N<Nom de l'utilisateur>\\NConfig.ini\nLinus : /home/<Nomd'utilisateur>/.kivy/config.ini\nmacOS : /Users/<UserName>/.kivy/config.ini\n \n \nPrincipales nouveautés\n--verify utilise désormais la validation du hachage sha256 NSP au niveau du fichier. --verify garantit maintenant que le hachage sha256 du fichier original et du fichier décompressé correspondra et donc que le fichier est recréé à l'identique.\n- Réécriture majeure de XCI/XCZ pour supporter les partitions XCI multiples : Spécifiez --keep pour conserver toutes les partitions, y compris leur contenu. Par défaut, le contenu de toutes les partitions sauf la partition sécurisée est supprimé mais la partition vide elle-même est conservée pour la compatibilité avec l'émulateur Yuzu.\n \nCorrections de bugs\n- Ajout d'un terminateur nul manquant à la fin de la table des chaînes. Ceci corrige le problème #151\n- Correction d'un problème avec l'en-tête PFS0 chevauchant le premier fichier lorsque l'option --remove-padding est utilisée.\n- Correction de la logique responsable de la gestion des tailles d'en-tête PFS0 trop courtes\n- Correction du remplissage de l'en-tête PFS0 afin qu'il soit conforme à la spécification PFS0. Ceci corrige le problème #150\n- Nous ne voulons pas toucher à la police Kivy par défaut mais plutôt utiliser LabelBase pour définir DEFAULT_FONT pour cette application spécifique. Ceci corrige #154\n- Ajout de la possibilité de lire les dumps xci complets grâce à @alucryd\n- Ajout du hachage de la clé master_key_10 grâce à @seiya-git\n- Meilleur support de la suppression des fichiers sources. Ceci corrige #141\n \nModification des arguments de la ligne de commande\n- L'option --remove-padding a été renommée --fix-padding. Ceci a été fait car cette option fait maintenant correspondre le padding de NSP au standard No-Intro.\n- Renommé --keep-delta en --keep car il n'est plus seulement utilisé pour conserver les fichiers NDV0 mais aussi pour conserver toutes les partitions XCI.\n--verify et --remove-padding sont incompatibles entre eux. Pour des raisons de compatibilité, --quick-verify sera automatiquement utilisé si cette situation se produit pour correspondre au comportement des arguments de la ligne de commande avant NSZ v4.6.0.\n \n \nTéléchargement : NSZ 4.6.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183690/in-switch-nsz-460-disponible-1.jpg"
        }
    },
    "news_20": {
        "title": "[PS5] PS Mac Tools v1.5 disponible",
        "content": "Le développeur SvenGDK pensent aux détenteurs d'ordinateurs Apple, il vient de mettre en ligne une première version de son outil PS Multi Tools pour les Mac. \n \nSon outil porte fort logiquement le nom de PS Mac Tools, et ambitionne d'offrir les mêmes services que la version PC Windows. \n \nCette version 1.5 de PS Mac Tools intègre les librairies de sauvegardes PS5 game/app, et les outils PS5 pour MacOS.\n \n\n \n \nOutils PS5 : \n- Bibliothèques de Jeux/Applications\n- Paylaod sender (ELF, BIN & JAR)\n- Navigateur FTP\n- Dumper Grabber FTP (Game Dumper)\n- Fusion de PKG\n- Edtiteur Param & Manifest JSON \n- Graveur de disques Blu Ray\n- Téléchargements et liens\n \nS'agissant d'une nouvelle app, vous allez devoir ouvrir une exception lors du premier lancement de l'utilitaire : https://support.apple.com/en-gb/guide/mac-help/mh40616/mac \n \n \n \nTéléchargement : PS Mac Tools 1.5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1183688/in-ps5-ps-mac-tools-v15-disponible-1.png"
        }
    }
}