{
    "news_1": {
        "title": "[PS4 PRO linux] Registres AMDGPU gladius",
        "content": " \n \nVoici les registres de la carte graphique des PS4 PRO\nJe fourni les registres + des bzImages ayant ces options, sur ps4 pro belize et baikal\nLes ps4 fat/slim aeolia, belize et baikal peuvent les utiliser, mais ils ne pointent pas ces registres + fix gflops ( AMD Liverpool = PS4 fat/slim     AMD Gladius = PS4 pro )\nCependant ces derniers bzImages ont aussi la possibilité de filmer un autre périphérique hdmi avec une ps4 fat/slim/pro aeolia/belize/baikal , et j'inclue des patchs gamer.\nJ'ai d'ailleurs filmé la video de la release , sur une ps4 pro belize linux + bzImages de la news + carte d'acquisition usb/hdmi branchée sur une deuxieme ps4 pro linux\n(la partie baikal a été testé par Lestat)\nDepuis la release en octobre 2022 des payloads linux ps4 pro (travail de rancido/mircoho + ma ps4 pro)https://www.youtube.com/watch?v=U_bMh4wf7sw\nun dump de la carte graphique a été effectué sur la ps4 pro de mircoho\nrancido (team psxita) a ajouté une fonction au chargeur Linux qui permet de vider la mémoire du GPU juste avant de redémarrer la PS4 et de lancer Linux.\nMircoho l'a ensuite utilisé sur sa Ps4 Pro et a généré un fichier cik, puis des tests ont été effectués.    Je n'ai récupéré que les valeurs que j'inclue dans cette release.\nCes bzImages ont les memes options kernel que mes releases de février 2024https://www.logic-sunrise.com/news-1187117-ps4-bzimages-aeoliabelize-51515-compiles-en-fulllto-et-thinlto.html\n( patchs gamer + options du kernel ps4 linux)https://ps4linux.com/ps4-aeolia-belize-full-thin-lto-kernel-saya/\nPassons maintenant à la release de mai 2025 :\n https://www.youtube.com/watch?v=9Q1WwvZUEQc&t=0s\nRegistres AMDGPU GLADIUS PS4PRO\nhttp://e.pc.cd/MVey6alK\n5.15.15.src-codedwrench-KHEOPS-FullLTO-v2_aeolia-belizehttp://e.pc.cd/37ey6alK\n5.15.25-rc1.src-codedwrench-KHEOPS-FullLTO-v2_belizehttp://e.pc.cd/NXey6alK\n5.4.213.src.whitehax0r.KHEOPS_baikalhttp://e.pc.cd/J7ey6alK\nEt un petit bonus, en béta :\n6.8.12.src-crashniels-saya_v0_aeolia-belizehttp://e.pc.cd/WVey6alK\n6.8.12.src-crashniels-saya-FullLTO_v0_aeolia-belizehttp://e.pc.cd/QyUotalK\nPour le bzImage 5.4.213 baikal et les bzImages  6.8.12-aeolia-belize, je n'ai pas rajouté de fix blackscreen\nvous pouvez rajouter ce bootargs.txt (rajouté à coté du bzImage) pour fixer l'écran noirhttp://e.pc.cd/NVey6alK\nJe tiens à remercier rancido (team psxita) , mircoho, codedwrench whitehax0r et crashniels pour leur source kernel de base, lestat triki1 VvSx87 Qba pasmatic LUFFY_YTB95 Arksama001 pour les differents tests, Kilyan.G pour le test de la capture video sous Obs-studio avec sa ps4 slim baikal\nTeam KHEOPS\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206440/in-ps4-pro-linux-registres-amdgpu-gladius-1.jpg"
        }
    },
    "news_2": {
        "title": "[Switch2] La carte mère et le die nvidia T239 analysés",
        "content": "De manière exceptionnelle Geekerwan a obtenu une carte mère Switch 2 et a fait une analyse complète des die shots du T239 avec l'aide de Kurnal. Ils ont obtenu la carte mère sur l'équivalent chinois d'eBay (Xianyu) pour environ 150 $.\n \nNous avons enfin la confirmation de certains éléments, le processus de gravure utilisé est le Samsung 8N, le die dispose de 8 coeurs A78C, partage 4 Mo L2, la partie GPU s'appuie sur 1536 Cuda cores et 6TPC au travers de l'architecture Ampère.\n \n \n\n \n \nLe die a été fabriqué à Taiwain par Samsung la semaine 21 de 2024, soit il y a un an, et on peut donc voir que ce T239 est très proche d'un die d'une carte graphique de la génération RTX série 3050, mais aussi avec certaines optimisations de la RTX 2050.\n \n \n\n \n\n \n \n\n \n \nLa vidéo de Geekerwan est tout simplement remplie de détails techniques, il analyse comment Nvidia a adapté le T239 entre les différentes architecture, décryptant la partie GPU, CPU et des Cuda Cores qui sont présents. \n \n \n \n\n \n \n\n \n \n \n \nQuelques détails techniques : \n \n- 207 mm² (Switch 2) contre 118 mm² (Switch)\n- Il est également plus grand que le GPU RTX 3050 Ti (mobile), le M2 d'Apple, le Ryzen 7840H (Z1 extreme) et le X elite de Qualcomm.\n- L'année de sortie du SoC est 2021, comme indiqué sur la matrice.\n- Ils ont également examiné la matrice du GPU RTX 3050, dont l'année de sortie était 2020.\n \nLe T239 en résumé :\n-  8 coeurs A78C, avec 4 Mo de cache L3 et 256 Ko de cache L2 sur chaque puce.\n- La surface de la puce A78C est la même que celle de la puce T234 de 8 nm, ce qui indique qu'il s'agit du même nœud de traitement.\n- Le suffixe C et AE n'a pas beaucoup de signification sur la conception du cœur lui-même, mais plutôt sur la classification ARM indiquant Compute et Automotive et comment les cœurs fonctionnent.\n- 6 TPC, 2SM/TPC, 1536 coeurs CUDA\n- La conception de l'Ampère, bien que sa disposition semble étrange car les TPC sont séparés.\n- La conception du GPU semble plus proche de celle d'Ada Lovelace.\n- En termes de surface du TPC, le T239 est 22% plus petit que le T234 d'orin.\n-  Il y a quelques différences dans la conception de la puce elle-même, elle n'est pas exactement 8nm et certains aspects sont plus proches de la fabrication du nœud de processus 10nm de Samsung.\n-  Ils soulignent les vitesses d'horloge précédemment « fuitées » et, comme DF, mentionnent que son équivalent le plus proche est la RTX 2050, bien qu'elle soit fortement downclockée.\n-  Comme DF, ils effectuent également une simulation des performances de la Switch 2 avec la RTX 2050 downclockée comme proxy.\n- Les performances de la Switch 2 sont alignées sur celles de la GTX 1050 Ti en mode docked et de la GTX 750 Ti en mode handheld dans les tests synthétiques de Steel Nomad Light.\n- Il est loin de la Xbox Series S et l'équivalent mobile le plus proche est l'A18 Pro d'Apple, M1 en mode docké, et la Steam Deck est un peu meilleure en mode portable.\n- Ils ont testé Cyberpunk 2077, Black Myth Wukong, Monster hunter Wild, KCD2...\n- Ils ont également pris une carte T234 (Orin) et ont testé les performances du CPU à travers des synthèses (geekbench 6)\n- En le downclockant à 1,1 GHz et 1 GHz, ses performances à cœur unique sont deux fois supérieures à celles de la PS4 et trois fois supérieures à celles de la Switch, l'équivalent portable le plus proche étant le i7-4700HQ.\n- L'équivalent mobile le plus proche en termes de performances multithread est l'A12 de l'iPhone, dont les performances single thread sont plus de deux fois supérieures à celles de la « Switch 2 »\n- Ils ont également utilisé un i7-10700KF downclocké pour approcher les performances du CPU de la Switch 2.\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206419/in-switch2-la-carte-mere-et-le-die-t239-analyse-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206419/in-switch2-la-carte-mere-et-le-die-t239-analyse-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1206419/in-switch2-la-carte-mere-et-le-die-t239-analyse-3.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1206419/in-switch2-la-carte-mere-et-le-die-t239-analyse-4.png"
        }
    },
    "news_3": {
        "title": "[XBO] Les projets Skeleton Key et Skeleton Key Mu sortent des cartons",
        "content": "Les payloads Skeleton Key et Skeleton Key Mu sortent des cartons, il s'agit de projets qui se destinent à la Xbox originale, il s'agit d'une collaboration communautaire de grande envergure. Ces payloads devraient faciliter l'accès aux améliorations Xbox et constituer une précieuse boîte à outils pour les fans expérimentés de la Xbox originale.\n \nDeux projets, Skeleton Key pour les clés USB, et Skeleton Key Mu pour les consoles modifiées, Skeleton Key fonctionnera sur de nombreuses clés USB. Vous pouvez également acheter une clé USB préchargée et un adaptateur USB auprès de nombreux revendeurs. Consultez plusieurs vitrines pour trouver un prix raisonnable. Les payloads seront toujours gratuits. Veuillez ne pas payer pour un logiciel gratuit !\n \n \n\n \n\n \n \n \nCe loader est basé sur les outils PrometheOS et peut lancer les applications suivantes :\n \n- Xbox Content Archive Tool (XCAT) Loader\n- Insignia Setup Assistant\n- Gamepad Tester\n- MemCheck\n- Rocky5's Softmod v1.2.2\n- Xbox Disk Over Network\n \nPour utiliser le payload Xbox Skeleton Key :\n \n1) Écrivez le contenu du dossier Skeleton Key sur une clé USB compatible. Ou copiez le contenu de Skeleton Key MU sur une carte mémoire Xbox avec une Xbox modifiée.\n2) Connectez la clé USB ou la carte mémoire à votre Xbox.\n3) Dans le tableau de bord Xbox; Accédez à l'option Mémoire, sélectionnez la Skeleton Key ou la Skeleton Key MU et appuyez sur A.\n \nUne image disque complète de cette boîte à outils est incluse dans la version. Elle peut être utilisée avec HDD Raw Copy ou d'autres outils pour écrire l'image sur votre clé USB compatible sans FatXplorer.\n \nLe lancement de Rocky5's Softmod v1.2.2 définira votre DNS sur automatique. Si votre console est configurée pour utiliser Insignia, vous devrez le remettre en manuel.\n \nTéléchargement : Projets Skeleton Key et Skeleton Key Mu\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206415/in-xbo-les-projets-skeleton-key-et-skeleton-key-mu-sortent-des-cartons-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206415/in-xbo-les-projets-skeleton-key-et-skeleton-key-mu-sortent-des-cartons-2.png"
        }
    },
    "news_4": {
        "title": "[PS4/PS5] Lapse Exploit d'abc disponible, nouvel exploit kernel sur PS4 et PS5",
        "content": "Le développeur abc est fier de nous présenter Lapse Exploit, un exploit kernel pour les firmwares 5.00 à avant le 12.50 pour la PS4 et du 1.00 avant le 10.20 pour la PS5, il faudra des correctifs pour la lecture / écriture sur le kernel PS4 8.0x. \n \n \n\n \n\n \n \n \nVous l'aurez compris il s'agit ni plus ni moins d'une bombe qui vient d'être lâchée par abc, un kernel exploit qui va rester dans l'histoire vu les firmwares qui sont supportés.\n \n \n \n\n \n \nCet exploit est corrigé sur le firmware 12.50 sur PS4 et sur 10.20 sur PS5, mais cela signifie qu'il est possible d'en profiter juste avant ces firmwares. \n \n \nTéléchargement : psfree-1.5rc1.7\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206406/in-ps4ps5-lapse-exploit-dabc-disponible-nouvel-exploit-kernel-sur-ps4-et-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206406/in-ps4ps5-lapse-exploit-dabc-disponible-nouvel-exploit-kernel-sur-ps4-et-ps5-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1206406/in-ps4ps5-lapse-exploit-dabc-disponible-nouvel-exploit-kernel-sur-ps4-et-ps5-3.png"
        }
    },
    "news_5": {
        "title": "[PS5] L'hyperviseur bientôt accessible sur les firmwares 3.xx et 4.xx",
        "content": "Petite bombe lâchée par Zecoxao il y a quelques heures, il vient de mettre un Tweet sur X informant que l'hyperviseur sera probablement bientôt une réalité sur les firmwares 3.xx et 4.xx de la PS5, de là à ce que les firmwares 4.xx deviennent des GoldHEN Firmware il n'y a qu'un pas. \n \nEn Septembre 2024, le développeur Flat_z nous confirmait que la structure sécuritaire des firmwares 3.21 avait bien trop évoluée pour permettre l'accès à l'hyperviseur au dessus de ce firmware, mais il semble que la donne à changer. \n \n \n\n \n \nReste à voir si la problématique du processeur principal a53io qui gère séparément les packages PS5 (PKG) sur PS5 sera toujours présente, et il faut là aussi casser ses protections ou trouver un moyen de le contourner pour lancer les fPKG.\n \n \n\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206367/in-ps5-lhyperviseur-bientot-accessible-sur-les-firmwares-3xx-et-4xx-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1206367/in-ps5-lhyperviseur-bientot-accessible-sur-les-firmwares-3xx-et-4xx-2.jpg"
        }
    },
    "news_6": {
        "title": "[PS5/PS4] FPKGi pour PS4/PS5 v1.00.0 disponible",
        "content": "Le développeur ItsJokerZz vient de dévoiler la version 1.00.0 de FPKGi pour PS4 et PS5. FPKGi, une alternative à PKGi, projet open-source permet de télécharger et d'installer des fichiers .pkg modifiés, notamment pour les jeux backportés sur des firmwares compatibles. FPKGi est conçu pour être utilisé avec des serveurs personnalisés, permettant aux utilisateurs de peupler l'application avec leur propre contenu via des fichiers .json locaux ou en ligne. \n \n \n\n \n \n \nLes grandes nouveautés de cette version 1.00.0 : \n \n- Supprimer après l'installation \n- Le téléchargement ZIP PS5 Prise en charge + Ordre d'installation\n- Extraction du dump PS5\n- Compatibilité jailbreak améliorée\n- Fermer avec double pression sur le bouton cercle\n- Augmentation des éléments par page\n- Correctifs PS5\n \n \nChangelog 1.00.0 : \n \nAjouts : \n- « Supprimer après l'installation » pour PS5 : activation de la fonctionnalité « Supprimer après l'installation » pour les téléchargements PS5.\n- Prise en charge du téléchargement ZIP : ajout de la prise en charge du téléchargement, de l'extraction et de l'installation de fichiers ZIP.\n- Extraction de vidage PS5 : extraction de vidage PS5 introduite pour l'intégration d'itemzflow.\n- Ordre d'installation ZIP : les packages ZIP s'installent désormais par ordre alphabétique, en donnant la priorité aux numéros et aux symboles.\n- Compatibilité Jailbreak : Compatibilité améliorée en utilisant un jailbreak sur liste blanche sur PS5.\n- Double pression circulaire : Fermeture par deux pressions sur le bouton circulaire.\n \nAméliorations et optimisations : \n- Augmentation du nombre d'éléments par page : le nombre d'éléments par page est désormais passé de 25 à 30, avec une mise à jour de l'interface utilisateur et un nouveau logo.\n- Télécharger les informations Précision : Basculé vers ulongpour des données de téléchargement plus précises.\n- Restriction de contenu PS5 : le contenu PS5 ne peut plus être visualisé sur PS4.\n \nCorrections, résolutions et plus :\n- Correction des plantages de téléchargement direct sur PS5 : plantages résolus lors des téléchargements directs sur PS5.\n- Correction de langue : problèmes d’affichage résolus pour différentes langues.\n- Correction de l'installation de titres non UTF8 : correction de l'impossibilité d'installer des fichiers de titres de caractères non UTF8 (non anglais).\n- Prise en charge linguistique ajoutée : prend désormais en charge les langues asiatiques et l'arabe pour les titres de contenu, conformément à la vidéo YouTube de Miichael Crump\n \n \n\n \n \n \nTéléchargement : FPKGi v1.00.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206365/in-ps5ps4-fpkgi-pour-ps4ps5-v1000-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[3DS] L'émulateur 3DS Azahar est disponible en version finale 2121",
        "content": " \nLe développement de l'émulateur 3DS Azahar continue son chemin et ce chemin est truffé de nouveautés, issu d'un fork de Citra développé par PabloMK7 et Lime3DS, Azahar représente une évolution prometteuse dans le monde de l'émulation, surtout après l'arrêt du développement de Citra en mars 2024. Cet arrêt faisait suite à un accord juridique entre les développeurs de Citra (également responsables de l'émulateur Switch Yuzu) et Nintendo. Contrairement à Yuzu, qui a été frappé d'une injonction, Citra n'a pas été directement affecté par des restrictions légales, permettant ainsi à des projets comme Azahar de voir le jour.\n \n \n \n\n \n \n\n \n \n \nLes changements de cette version 2121 (qui n'est donc plus en release candidate depuis quelques heures) sont très nombreux, en résumé :\n \nNouvelles Fonctionnalités :\n- Téléchargement des DLC déjà possédés désormais pris en charge. (@PabloMK7)\n- Mode Turbo : Permet d'augmenter la vitesse d’émulation via un raccourci clavier (PC) ou un bouton à l’écran (Android).\n- Espace entre les écrans : Possibilité de configurer l’écart entre les écrans supérieur et inférieur. (@DavidRGriswold)\n- Augmentation du slider 3D : La valeur maximale passe de 100% à 255% (peut causer des anomalies graphiques).\n- Sauvegardes rapides (quicksave/quickload) : Ajout sur PC, comme sur Android.\n \nCorrections de Bugs :\n- Streetpass Mii Plaza : Correction d’un problème de détection des mises à jour.\n- Installation des DLC : Problème résolu pour certains DLC décryptés mal détectés.\n- Cache des shaders : Maintenant correctement associé à l’application en cours (évite les conflits).\n \nAudio : Correction d’un bug affectant certains jeux comme Brain Age: Concentration Training.\n \nHotkeys : Problèmes de sauvegarde et de fonctionnalité résolus.\n \nAméliorations Spécifiques aux Plateformes :\nPC (Desktop) :\n- Fusion de azahar-room dans l’exécutable principal (option --room).\n- Correction des captures d’écran en mode Hybrid Screen.\n \nLinux :\n- AppImage désormais en un seul fichier (non compressé).\n- Meilleure compatibilité Wayland.\n \nmacOS :\n- Désactivation temporaire de la barre de menus native (problèmes d’affichage).\n- Version minimale requise : macOS 13.4.\n \nAndroid :\n- Nouveau bouton pour accéder aux dossiers du jeu (sauvegardes, DLC, etc.).\n- Option pour étendre l’affichage vers la notch de l’écran.\n- Correction d’un bug d’affichage sous Android 9.\n \nAméliorations Techniques :\n- Optimisation des scripts de compilation et corrections mineures pour les développeurs.\n \n \nTéléchargement : Azahar 2121\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206326/in-3ds-lemulateur-3ds-azahar-est-disponible-en-version-finale-2121-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1206326/in-3ds-lemulateur-3ds-azahar-est-disponible-en-version-finale-2121-2.jpg"
        }
    },
    "news_8": {
        "title": "[PS3] Un mod Pico avec BadHTAB d'esc0rtd3w disponible",
        "content": "Le développeur esc0rtd3w a décidé d'optimiser l'exploit BadHTAB comme vous le savez se destine à la PlayStation 3 et qui fait suite à la découverte de XORLOSER. \n \nL'exploit utilise une technique hardware et software pour modifier le signal de la RAM vers la terre, alors qu'un payload lui se charge afin d'aller pointer les données HTAB tout en forçant leur entrée via un glitch. \n \nUn exploit très technique, mais qui fonctionne, malgré son taux de réussite assez faible de l'ordre de 30 %. L'idée d'esc0rtd3w a été de modifier le code original afin d'apporter des modifications au code Pico pour faciliter les tests, pour l'heure aucune modification n'a été apporté pour la partie PS3. \n \n \n\n \n \n\n \n \nLes modifications incluent :\n \n- Redémarrage automatique si un problème fait planter la PS3\n- UART0 activé pour pico\n- UART1 activé pour l'entrée sb_uart de la PS3\n- Surveillance du mode veille du bloc d'alimentation\n- Connecteur d'alimentation de surveillance\n- Surveillance d'état sur 4 LED\n \nJusqu'à présent en cas de bug de lancement, il fallait souvent débrancher la prise, ou faire un hard reset, avec cette version vous n'aurez plus à  débrancher le cordon d'alimentation ni à actionner l'interrupteur de la multiprise. Le redémarrage automatique est pris en charge lorsqu'une erreur est détectée. Cela nécessite sb_tx de la PS3 et la soudure du bloc d'alimentation 5 V « always on » au Vsys du Pico. Ainsi, le Pico reste allumé lorsque la PS3 s'éteint. Le sb_uart de la PS3 surveille les messages permettant de contrôler le comportement du Pico.\n \n \n\n \n \n\n \n \nIl reste quelques bugs à corriger, notamment des plantages de la PS3 empêchant le Pico de se rétablir automatiquement, nécessitant un redémarrage manuel. Les fils devront être soudés aux emplacements appropriés sur la PS3 et le Pico.\n \nIl a proposé plusieurs versions qu'il fait rapidement évoluer, les dernières modifications ont été réalisées pour : \n \n- Ajout d' une variable pour suivre les tentatives de mise sous tension\n- Réinitialiser les séquences si le nombre maximal de boucles est de 12 et que l'alimentation est allumée \n- Réinitialiser en mode veille pour vérifier si les tentatives de mise sous tension sont de 6 ou plus\n- Augmentater du temps de glitch de la LED en cas de problème réussi\n \nTout est là : Psx-place.com\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206325/in-ps3-un-mod-pico-avec-badhtab-desc0rtd3w-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1206325/in-ps3-un-mod-pico-avec-badhtab-desc0rtd3w-disponible-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1206325/in-ps3-un-mod-pico-avec-badhtab-desc0rtd3w-disponible-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1206325/in-ps3-un-mod-pico-avec-badhtab-desc0rtd3w-disponible-4.jpg"
        }
    },
    "news_9": {
        "title": "[PS5] Mise à jour kstuff pour le VR2 et la désactivation ASLR",
        "content": "Le développeur Echo Strech a dévoilé une nouvelle version du payload kstuff qui intègre quelques évolutions intéressantes, cela passe par la désactivation de l'ASLR, mais aussi des progrès sont réalisés pour le support du PlayStation VR2.\n \nAu sujet de la désactivation de l'ASLR, ASLR est la randomisation de la disposition de l'espace d'adressage (ASLR), il s'agit d'une technique utilisée pour augmenter la difficulté de réaliser une attaque par débordement de mémoire tampon qui nécessite que l'attaquant connaisse l'emplacement d'un exécutable dans la mémoire. Il s'agit donc dans kstuff de proposer son contournement, en désactivant cette protection, les adresses deviennent prévisibles. Ainsi cela permet de charger des payloads de manière plus stable, cela ouvrirait la possibilité à d'autres exploits de bas niveau. Il restera à voir si cela sera utile. \n \n \n\n \n \n \nLe support du PlayStation VR2 a été également intégré par Al-Azif, il s'agit encore d'une version expérimentale, en version bêta, cela montre la volonté d'améliorer les fonctionnalités du payload, et ainsi de proposer l'arrivée du VR2 au travers du payload. Lancé en 2023 à 599 euros, il a largement baissé, proposé parfois autour des 370 euros, il n'a pas réellement connu le succès escompté par Sony, mais il reste un accessoire permettant une expérience intéressante.\n \nEt Al-Azif a également apporté le support du firmware 3.10 en apportant les offsets nécessaires, et un nettoyage du code a été opéré afin de supprimer des opérations inutiles et accroitre la stabilité de l'exécution. \n \n \nTéléchargement : kstuff v1.5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206313/in-ps5-mise-a-jour-kstuff-pour-le-vr2-et-la-desactivation-aslr-1.png"
        }
    },
    "news_10": {
        "title": "[Switch] Une première version d'Hekate pour le firmware 20.0.0 est là",
        "content": "Le développeur CTCaer vient de proposer, sur son Github, une première version d'Hekate pour le firmware 20.0.0.\n \nRappelons que le firmware 20.0.0 contient un bug qui pourrait être gênant et qu'il est probablement préférable d'attendre pour savoir si cette version est compatible avec le firmware 20.0.1.\n \n \n\n \n \n \nHekate, un custom bootloader largement utilisé pour la Nintendo Switch, vient d'être mis à jour par CTCaer. Hekate sert de point d'entrée pour de nombreux utilisateurs souhaitant explorer les capacités personnalisées de leur console Nintendo Switch. Depuis sa création, il a été utilisé pour lancer des homebrews, des backups de jeux, et d'autres logiciels personnalisés, offrant ainsi aux joueurs une expérience différente de celle prévue par Nintendo.\n \nCette version préliminaire, qui n'est pas accompagné de la mise à jour de Nyx, est compatible avec le firmware 20.0.0 mais également avec Atmosphère 1.9.0, il s'agit d'une version de test qui n'est pas à considérer comme une version stable et finale, pour l'utilisateur lambda il est préférable d'attendre la version officielle. \n \n \nTéléchargement : Hekate compatible firmware 20.0.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206292/in-switch-une-premiere-version-dhekate-pour-le-firmware-2000-est-la-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] PS5 BDJB Modified ISO v1.12 plus besoin de connexion internet",
        "content": " \nPlus besoin d'avoir une connexion internet, avec PS5 BDJB Modified ISO il est désormais possible de jailbreaker une PS5 sans avoir besoin d'une connexion internet ! Cette version modifiée proposée par Viktorious-x, basée sur le travail original de driverick, a été optimisée pour fonctionner en mode complètement hors ligne sur les firmwares  4.xx jusqu'à 7.xx. \n \nLe développeur utilise la version 7.61 du firmware, pour lui cette solution est une alternative à celles et ceux qui souhaitent débloquer leur console sans avoir besoin de la connecter à internet. \n \n \n\n \n \nProcédure gravure : \n \n- Téléchargez la dernière version ISO à partir du lien GitHub\n- Ouvrez  ImgBurn  (ou un autre logiciel)\n- Sélectionnez « Écrire le fichier image sur le disque »\n- Charger le fichier ISO modifié\n- Insérez le BD-R vierge et démarrez la gravure\n \nFonctionnement sur PS5 :\n- Insérez le disque gravé dans la PS5\n- Démarrer le lecteur Blu-ray\n- Sélectionnez un pipeline  (1er recommandé)\n- Veuillez patienter jusqu'à ce que le processus soit terminé\n- Lorsque vous y êtes invité,  fermez le lecteur de disque.\n- etaHEN se chargera automatiquement sur la page d'accueil (Si etaHEN n'apparaît pas , réinjectez-le via ItemzFlow)\n \n \n \n\n \n \n \nCette version modifiée de l' ISO PS5 BD-JB représente une avancée pour le jailbreaking hors ligne. Avec la prise en charge de plusieurs firmwares (du 4.xx au 7.xx et sa facilité d'utilisation, il permet d'accéder aux UMTX, loader ELF, serveur Web et autre etaHEN (avec kstuff) très facilement, la dernière version v1.11 apportant la prise en charge des fichiers .jar  dans le loader USB bin/elf.\n \n \nTéléchargement : PS5 BDJB Modified ISO v1.11\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206204/in-ps5-ps5-bdjb-modified-iso-v111-plus-besoin-de-connexion-internet-1.png"
        }
    },
    "news_12": {
        "title": "[XB/XB360] XCAT v1.07 disponible (maj 08.05.2025)",
        "content": "Les passionnés de préservation pour la Xbox et la Xbox 360 ont consacré d’importants efforts au développement de XCAT, un outil gratuit et automatisé permettant aux possesseurs de Xbox d’explorer leur console à la recherche de contenus disparus (DLC, mises à jour de jeux, applications homebrew, skins, etc.) et de les téléverser dans le cadre d’un projet collaboratif d’archivage. Grâce à XCAT, la communauté peut mutualiser ses ressources pour sauvegarder des fichiers rares encore présents sur certaines consoles, assurant ainsi leur conservation pour les générations futures.\n \nCompatible avec les Xbox modifiées (softmod ou hardmod), ce logiciel extrêmement léger (moins de 4 Mo) tient facilement sur une carte mémoire, et l'outil vient d'être mis à jour en v1.06. \n \nLe fonctionnement est simple : XCAT génère une empreinte unique (checksum) pour chaque fichier détecté. Ces identifiants sont ensuite comparés avec ceux des serveurs XCAT. Si un fichier est inédit, il est ajouté à une liste de téléchargement et récupéré directement depuis la console du contributeur. En revanche, si le fichier est déjà archivé, il n’est pas dupliqué. Ce système évite aussi les doublons causés par des différences de nom ou dénomination, puisque chaque fichier est identifié par son hash.\n \nLa préservation ne s’arrête pas à la récupération : une fois collectés, les contenus pertinents sont partagés avec la communauté. Par exemple, les éléments utiles pour jouer en ligne via Insignia (le successeur moderne du Xbox Live) sont transmis à son équipe et intégrés aux mises à jour des jeux concernés. Les autres fichiers (homebrew, skins, etc.) sont diffusés via les canaux dédiés.\n \n \nAvec cette version 1.06, l'équipe a mis l'accent sur la réinitialisation réseau en cas de perte de connexion.\n \n \n\n \n \nChangelog v1.06\n \nAjout : Réinitialisation automatique des paramètres réseau en cas d'échec de connexion. Les configurations existantes du dashboard ne seront ni perdues ni écrasées !\n \n \nTéléchargement : XCAT v1.06\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206200/in-xbxb360-xcat-v106-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[PS5] Kstuff Toggle v0.1 Beta de Echo Stretch disponible",
        "content": "Le développeur Echo Stretch, avec la contribution de John Tornblom dont il tient à remercier, vient de mettre en ligne une première version d'un nouvel payload qu'il propose, il s'agit de Kstuff Toggle 0.1 Beta qu'il vient proposer au téléchargement. \n \n \n\n \n \n \nCet outil sous la forme d'un payload prend la forme d'un fichier ELF : \n \n- Ajout de homebrew.js – Grâce à cette nouveauté, le payload peut désormais être lancée via websrv.\n- Quelques améliorations cosmétiques \n– Des ajustements visuels ont été apportés pour une meilleure expérience utilisateur.\n \n \nTéléchargement : Kstuff Toggle v0.1 Beta\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206182/in-ps5-kstuff-toggle-v01-beta-de-echo-stretch-disponible-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] Un bug dans le firmware 20.0.0 !",
        "content": "Cela peut paraitre inconcevable, surtout quand on connait les process de validation des firmwares et leur importance, mais il semblerait qu'un bug est présent dans le firmware 20.0.0 publié il y a 2 jours, imposant Nintendo à sortir en catastrophe le nouveau firmware 20.0.1. \n \nUn bug s'est glissé dans la mise à jour firmware 20.0.0 de mercredi, certains utilisateurs se retrouvent face à un code erreur 2206-1015 lors du redémarrage de leur console.\n \nLe firmware 20.0.1 qui est déployé dès maintenant vient corriger ce bug ! Bref, ne mettez pas à jour en firmware 20.0.0 ou bien passez au 20.0.1 si vous l'avez déjà fait ! \n \nToute personne recevant le code d'erreur doit mettre à jour le Switch via le mode maintenance . Pour ce faire, allumez la Switch et maintenez les deux boutons de volume enfoncés jusqu'à ce que le mode maintenance s'affiche.\n \n \n\n \nLe rapport Yellow's8 est disponible ici. \n \nPour le hack, il ne doit pas y avoir de changements au niveau de la sécurité du firmware, nous verrons bien comment vont réagir les acteurs, notamment SciresM . \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206150/in-switch-un-bug-dans-le-firmware-2000-1.png"
        }
    },
    "news_15": {
        "title": "[PS3] PS3 4K Pro Lite 5.6.2 mis à jour par LuanTeles",
        "content": "Le développeur Luan Teles a mis à jour il y a 4 heures sa solution toute en un PS3 4K Pro Lite en version 5.6.2, comme vous le savez il s'agit là d'une interface utilisateur permettant d'amener de nouvelles fonctionnalités à la PS3, en plus de toutes celles déjà présentes dans un CFW par exemple.\n \n \n\n \n \nDe nouveaux sons, de nouvelles animations, de nouvelles options, une navigation plus intuitive font de PS3 4K Pro une solution fluide et qui permet de transformer radicalement votre UI.\n \n \n\n \n \n \n \n[2025-05-01]\n \n- Overclocking automatique à 650/750 Mhz (CFW uniquement)\n- Contrôle des performances (OC et Underclock)\n- Contrôle du ventilateur dans ps2net_emu\n- Prise en charge de plus de stores non officiels\n- Corrigé : Activer les syscalls sur 4.92 (HEN)\n \n \n \nTéléchargement : PS3 4K Pro Lite 5.6.2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206146/in-ps3-ps3-4k-pro-lite-562-mis-a-jour-par-luanteles-1.png"
        }
    },
    "news_16": {
        "title": "[XB/Series] Une nouvelle version de XBS2 a été proposée",
        "content": "Le développeur SternXD a repris le travail de SirMangler car il a publié il y a quelques jours une nouvelle version de l'émulateur XBSX2, l'émulateur de PlayStation 2 (le portage de PCSX2) pour les consoles Xbox One et Xbox Series X/S.\n \nIl s'agit là d'une mise à jour maj, il faut avouer que les mises à jour ne se font que tous les 4 à 5 mois, en conséquence, les nouveautés sont nombreuses. \n \nPour rappel, l'émulateur XBSX2 vous permet non seulement de jouer à des titres PS2 avec toute la puissance native de l' émulateur PCSX2 , mais vous permet également de profiter des résolutions échelonnées (+4K) jamais vues sur une console Xbox.\n \n \n \n\n \n \n \n \nPossibilités de XBS2 : \n \n- Support complet de D3D12\n- Standalone de PCSX2 pour Xbox !\n- RetroAchievements\n- Système de triche et de correctifs entièrement fonctionnel\n- Préconfiguré pour le jeu en ligne\n- Basé sur la dernière révision de PCSX2 à ce jour.\n \n \nAttention, l’installation de cette mise à jour rendra vos sauvegardes incompatibles. Assurez-vous d’avoir sauvegardé vos parties sur une carte mémoire avant d’installer cette mise à jour, sinon vous perdrez votre progression. \n \nXBS2 a désormais le support officiel de l'équipe RetroAchievement pour la version 2.0.8.3 et les versions plus récentes, conformément à leur récent article de blog\nhttps://retroachievements.org/viewtopic.php?t=29231 , il ne dira plus lorsque vous ouvrez un jeu \n \n \nChangelog de la version 2.0.8.3 :\n \n- Synchronisé avec les dernières optimisations en amont au 07/03/2024 .\n- Grâce aux nouvelles corrections de l'équipe PCSX2, nous avons maintenant des thèmes !\n- Mise à jour vers SDL3 3.3.0 (Merci à@3URpour avoir travaillé rapidement sur ce sujet pour moi).\n- L'Enable CDVD Precachingoption a été supprimée des paramètres en raison de problèmes excessifs avec la limite de RAM.\n- Ressources mises à jour pour supprimer le .0de XBSX2.\n- Mise à jour de l'agent utilisateur pour inclure le modèle de console de l'utilisateur.\n- N'oubliez pas que les packs de textures fonctionnent, mais ils doivent être au format .dds. .png ne fonctionne plus.\n \n \nTéléchargement : XBS2\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206133/in-xbseries-une-nouvelle-version-de-xbs2-a-ete-proposee-1.jpg"
        }
    },
    "news_17": {
        "title": "[Switch] Sys-tune v3.0.0 disponible",
        "content": "Le développeur TheReconJacob, qui dispose d'une formation de développeur professionnel, propose une nouvelle version de Sys-tune, à l'origine créé par HookedBehemoth. Cet outil vous permet sur la Nintendo Switch de lire les fichiers audio directement en arrière plan, tout en les gérant via le menu Tesla. \n \nCette nouvelle version 3.0.0 apporte toutes les fonctions des versions précédentes, mais elle intègre aussi des optimisations importantes comme les listes de lecture qui sont automatiquement enregistrées au redémarrage de la console. Une autre option dans le menu permet de démarrer la lecture de piste dès que la Switch est allumée. \n \nD'autres options ont été intégrées, comme la liste blanche qui a été ajoutée, une option qui n'existait pas jusqu'à là, une chanson ne peut être jouée que lorsqu'un certain ID de titre est actif.\n \n \n\n \n\n \n\n \n \n \nAjoute les fonctionnalités suivantes :\n \n- Les listes de lecture sont désormais enregistrées lors du redémarrage de la Switch\n- Une nouvelle option apparaît dans le menu, permettant à votre playlist de démarrer automatiquement lorsque vous allumez votre Switch\n- Ajoute un mode liste blanche, qui fait l'inverse de la liste noire, où une chanson est jouée UNIQUEMENT lorsqu'elle a un identifiant de titre spécifique\n \nInstallation :\n \n- Téléchargez Sys-tune\n- Extrayez le zip à la racine de votre carte SD.\n- Mettez des fichiers mp3, flac, wav ou wave sur votre carte SD.\n- Vous pouvez gérer la lecture via la superposition Tesla dans la version.\n \n \nTéléchargement : sys-tune 3.0.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206128/in-switch-sys-tune-v300-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206128/in-switch-sys-tune-v300-disponible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1206128/in-switch-sys-tune-v300-disponible-3.png"
        }
    },
    "news_18": {
        "title": "[XBO] Une version de Far Cry découverte sur un kit de développement XBO",
        "content": "Une découverte intéressante a été faite pour l'histoire du jeu vidéo, une version expérimentale de Far Cry a été découverte sur un kit de développement \n \nUn membre de Reddit, connu sous le nom de « New_Strategy5261 », a découvert une version préliminaire du premier opus de Far Cry sur un kit de développement Xbox Original. \n \nAprès avoir acheté ce kit de développement à un allemand, il a appris que ce kit appartenait au développeur allemand \"Crytek\", qui a notamment proposé Far Cry et Crysis. \n \n \n\n \n \nEn cherchant un peu il a trouvé une version expérimentale de Far Cry, il s'agit d'une version datée du 27 octobre 2005, soit un mois seulement après la sortie de « Far Cry Instincts », ce qui en constitue un portage du premier Far Cry sur la Xbox Originale, mais il avait été abandonné à la dernière minute pour se concentrer sur la version Xbox 360. \n \n \n \n",
        "images": {}
    },
    "news_19": {
        "title": "[PS4] Apollo Save Tool PS4 v2.2.0 disponible",
        "content": " \nLe développeur Damian Parrino, alias Bucanero, vient de mettre en ligne une nouvelle version d'Apollo Save Tool pour la PS4 et PS4 Pro qui est maintenant proposé en v2.2.0.\n \nComme vous le savez Apollo Save Tool est un superbe gestionnaire de sauvegardes qui devrait être livré par défaut avec toutes les consoles Sony tellement il est efficace et simple d'utilisation. Ce serait vraiment dommage de se priver de son utilisation si vous disposez d'une console récente Sony. \n \nChangelog PS4 release - Apollo Save Tool v2.2.0 :\n- Si vous disposez d'un serveur FTP (NAS, PC, VPS, Android, etc.), vous pouvez créer un compte et gérer la sauvegarde/restauration des sauvegardes dans le cloud avec votre compte FTP. (Sauvegardes PS4/PS2/PS1 supportées).\n \n \n\n \nChangelog 2.2.0 :\n \nAjout :\n- Prise en charge du serveur FTP (sauvegarde des sauvegardes dans le cloud)\n- Zipper, télécharger et sauvegarder des sauvegardes sur un serveur FTP défini par l'utilisateur\n- Lister, télécharger et restaurer des sauvegardes à partir d'un serveur FTP défini par l'utilisateur\n- Sauvegarder des sauvegardes PS1, PS2 et PS4\n- Prise en charge de la gestion en masse des sauvegardes cryptées (USB)\n- Option améliorée de copie des sauvegardes sur le disque dur\n \nMenu Paramètres :\n- Ajout de l'option URL du serveur FTP\n- Ajout d'une option de sélection (FTP/BD en ligne) pour les téléchargements de sauvegardes\n- Amélioration de la génération de noms de fichiers .zip pour l'exportation de sauvegardes\n \nNouveaux codes de triche :\n- Lunar 1 Remastered\n- Lunar 2 Remastered\n- Metaphor : ReFantazio\n- Resident Evil 7 : Biohazard\n \nPrise en charge de la somme de contrôle personnalisée :\n- Lunar 1 Remastered\n- Lunar 2 Remastered\n- Resident Evil 7 : Biohazard\n \nCorrections :\n- Correction du processus de reconstruction de l'app.db sur 11.00+ FW\n \nMisc : \n- Mise à jour de la bibliothèque SSL vers mbedTLS v2.16.12\n- Mise à jour d'Apollo Patch Engine vers v1.3.0\n- Ajout de la fonction de hachage djb2\n- Ajout de la prise en charge des balises pour les options sélectionnées par l'utilisateur sur les fichiers .savepatch\n- E.g., {ZZ}val=nom;03E7=999 or ;...;270F=9999 or{/ZZ}\n- Prise en charge des codes SaveWizard et BSD avec plusieurs options\n- Mise à jour du processus de montage des données de sauvegarde\n \nTéléchargement : Apollo Save Tool PS4 v2.2.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206103/in-ps4-apollo-save-tool-ps4-v220-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] Mise à jour de PSX2PS5 support 5.xx 6.xx et 7.xx",
        "content": "Depuis peu le hack PS5 s 'est étendu aux firmwares 5.xx, 6.xx et 7.xx, voici donc une mise à jour de PSX 2 PS5 apportant le support de ces nouveaux firmwares.   En effet, la première version ne fonctionnait qu' avec les firmwares 2.xx à 4.xx et donnait une erreur lors de l installation sur 5.xx ou plus.Avec cette version 1.1 vous aurez maintenant la posibilité de choisir quel émulateur utiliser en conséquence de votre firmware. Vous aurez le choix entre 2 émulateurs: - 2.xx-3.xx-4.xx.pkg pour les firmwares 2.xx à 4.xx- 5.xx-6.xx-7.xx.pkg pour les firmwares 5.xx à 7.xx  Mais ce n 'est pas tout, j' ai aussi ajouté le multi-disque, ce qui vous permettra de convertir vos jeux contenu sur plusieurs CD, mais attention seul les jeux demandant de sauvegarder a la fin d' un CD seront compatibles (comme final fantasy 7 par exemple)... Il comprend toujours les liens vers mon tweeter (icon Kaneda), mon Paypal (icon paramètre), ma vidéo tuto (logo youtube) et pour finir le plus important, les codes LibCrypt (La loupe). Ce dernier lien (la loupe) pointe donc vers les codes LibCrypt qui vont vous permettre de débloquer certains jeux comme Dino Crisis ou Resident Evil 3 Nemesis (explications dans ma vidéo tuto ci dessous).  Vous trouverez également dans le .rar de cette new. Un petit batch qui vous servira à fusionner vos .bins en un seul .bin afin d'utiliser ensuite PSX 2 PS5 v1.1  mais également de créer le .toc. Ce dernier fichier (.toc)  est important pour certains jeux comme Tekken, sans ce fichier votre jeu fonctionnera mais sans musique, d' où son utilité. J'ai également rajouté un dossier \"dependance\" comprenant Python v3 et install_pillow.bat qui sont obligatoires pour lancer mon outil, il vous faudra donc bien installer les 2 avant de lancer l' outil la 1ère fois. Mais aussi et très important bien COcHER LA CASE PATH dans python avant l' installation de ce dernier, sans ça vous aurez des erreurs lors de la compilation de vos FPKG.  Télécharger PS2PS5_v1.1 ",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1206029/in-ps5-mise-a-jour-de-psx2ps5-support-5xx-6xx-et-7xx-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1206029/in-ps5-mise-a-jour-de-psx2ps5-support-5xx-6xx-et-7xx-2.png"
        }
    }
}