{
    "news_1": {
        "title": "[PS4] shadps4 v0.1.0 nom de code &#34;Tortue folle&#34; montre des progrès significatifs",
        "content": " \nUne grosse mise à jour du code de ShadPS4 vient d'être dévoilée, il s'agit de la version 0.1.0 portant le nom de code de madturtle que l'on peut traduire par \"Tortue folle\". L'émulation PS4 sur PC Windows et Linux bondit une nouvelle fois avec l'arrivée d'une telle version, qui montre une avancée significative dans la restitution graphique de la PS4.\n \n \n\n \n \nDéveloppé par Georgemoralis, connu sous le pseudonyme de shadow, fondateur et programmeur sur ce projet et beaucoup d'autres, ShadPS4 a connu la modification de plus de 445 fichiers depuis la version précédente 0.0.3 publiée en Mars 2024, les principales évolutions portent sur un recompilateur de shaders qui a été ajouté . Cet ajout permet de faire tourner plusieurs jeux 3D comme Persona 5 ou One Piece Odyssey, de plus une grande partie du core a été réécrite. La restitution sonore elle aussi est excellente, il reste encore quelques artefacts graphiques qui peuvent présenter encore certains risques, mais les progrès sont là. \n \n \n\n \n \n \nTéléchargement : shadps4 v0.1.0 madturtle\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192849/in-ps4-shadps4-v010-nom-de-code-tortue-folle-montre-des-progres-significatifs-1.jpg"
        }
    },
    "news_2": {
        "title": "[Switch] Le nouveau site internet de Mig Switch est là",
        "content": "\n \nL'équipe en charge du Mig Switch ne compte pas se laisser faire et dévoile, malgré la décision de justice, un nouveau site internet qui prend le relai de http://www.migswitch.com/. \n \nIl s'agit d'une copie de l'ancien site, ou d'une sauvegarde, qui est donc désormais hébergé ici : https://www.migswitchru.com/\n \nMalgré cette situation, l'équipe a annoncé avoir l'intention d'assurer les livraisons et de continuer à servir ses clients, en rajoutant qu'elle s'est dite choquée et que cette réaction de Nintendo était une menace pour l'entreprise mais aussi pour la liberté sur internet en général.\n \n \n\n \n \n \nDésormais l'équipe va communiquer via TOR, elle conclue en disant que ce site est temporaire, qu'il sert surtout à rendre les fichiers accessibles aux utilisateurs, et qu'elle va mettre en place un lien davantage sécurisé dans l'avenir. \n \nPour information, la page Reddit en lien avec Mig Switch a elle aussi été rendue privée, preuve que les changements impactent tous les liens. \n \n \n\n\n \n01/07/2024: Temporary new site for MigSwitch to access firmwares and more: www.migswitchru.com\nAlthough the situation is still not clear, it seems our company has lost the ownership of our domain name www.migswitch.com\n \nFirst and most important: We are operating as usual. We are shipping our products. All orders are being fulfilled and nothing has changed beside the domain name.\n \nWe are shocked by what happened for several reasons, and we feel this is not only shocking for us but for the freedom of Internet in general.\n \nFirst, we were not warned or had a chance to answer and defend our products or at least the simple fact that whatever the complaint is, it applies only to a few countries and in no way allows to take down a domain for all users in the world. Can Afghanistan request to take down a .com website that goes again its interests? We don't think so.\nBut more than that, this is a .com domain, meaning a universal domain applying to many countries.\n\".com\" domains sell products like drug/medications which are only legal in certain countries, or gambling. US sites selling or promoting weapons which are illegal in just about every country on the planet are registered in .com. We never heard any of them being seized as they are operating legally in their markets.\nWe clearly indicate on our site that our product is for legal use only in countries/jurisdictions where backing up your legally owned games is authorized. And there are many.\nWe do not even sell our products directly from our website. And there is no copyrighted material to be found anywhere.\nIf what we suspect is true, this is another proof of the abuse and bullying from some governments and companies which think they are above the laws of the world and do not respect anyone who think different.\n \nWe will not tolerate that attitude and bow down to those bullies.\n \nOf course, IP blocking our site in countries where our products are considered illegal is totally acceptable. And we would never challenge it. In fact, it is the case for many companies. Some of our distributors even enforce that on their own.\nBut trying to tell the world what is right or wrong based on your country point of view is really unacceptable and add to the hate of certain countries for their bullies' attitude.\n \nPlease note this site is likely only temporary as we know our many users need access to files and support and is a quick fix. We will likely move again to a more secure domain in the weeks to come.\n \nThank you for your understanding and for your support against the bullies of the world. As soon as we find out more about what happened, we will post about it so all of us can report to pro-freedom NGO and hopefully contribute to making Internet a better place.\n \nP.S.: If you are not able to access this website, we will post news and update on our .onion website accessible by TOR:4gnoefk5zilujdkixixlsiagd3al5cejg3ooiwq2uuxgizgpnpwq7cqd.onion\n \n\n \n\n \n \n \n\n \n",
        "images": {
            "image_1": "https://nintendo-wii.logic-sunrise.com/images/validation/in-1224670235.png"
        }
    },
    "news_3": {
        "title": "[Switch] Hekate 6.2.1 et Nyx 1.6.3 disponibles",
        "content": " \nLe développeur CTCaer vient de déployer une nouvelle version de son programme Hekate et de Nyx. Le bootloader personnalisé arrive et c'est plutôt rare sans l'arrivée d'une nouvelle version d'Atmosphère, l'objectif étant de corriger surtout des bugs.\n \n \n\n \n \nChangelog de Hekate v6.2.1 :\n \n- L4T : Mise à jour d'ARC en version 6\n- Améliorations considérables de la qualité du signal\n- Augmentation des performances et de la bande passante\n- Certains timings ont été légèrement ajustés, ram_opt peut donc avoir besoin d'être ajusté en conséquence.\n- Correction des problèmes de démarrage dans HOS et L4T\n- Réintégration de l'activation forcée du chargeur au cas où hekate démarre dans un état où il est désactivé\n \nChangelog de Nyx v1.6.3 :\n \n- L'easter egg a été mis à jour vers la version 2.5.2\n- Amélioration de la précision dans certains cas\n- Amélioration de la gestion du montage de la carte SD (peut réduire encore plus la consommation d'énergie)\n- HW info a été mis à jour pour donner des informations complètes sur les noms de code SKU et l'identifiant de la puce dans un format plus organisé.\n- Amélioration d'un message d'erreur dans le gestionnaire de partition lorsque l'utilisateur a un dossier bootloader corrompu ou > 1GB.\n \n \nTéléchargement : Hekate 6.2.1 et Nyx 1.6.3\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192802/in-switch-hekate-621-et-nyx-163-disponibles-1.png"
        }
    },
    "news_4": {
        "title": "[Multi] Dolphin 5.0 fête ses 5 ans et propose un nouveau cycle de vie",
        "content": " \nFruit d'une longue et difficile période de transition, les imprécisions fondamentales qui ont affecté Dolphin pendant plus d'une décennie ont été corrigées avec succès et Dolphin était désormais libéré de ses fardeaux pour nager vers une nouvelle ère de précision et de performance.\n \nHuit années se sont écoulées depuis cette formidable sortie de cette version 5.0, et il faut avouer que Dolphin a marqué l'histoire de l'émulation, il y a tout juste 8 ans sortait cette version mythique.\n \nDolphin a connu des mises à jour constantes, avec de nouvelles fonctionnalités et améliorations, ainsi que des corrections de bugs et des améliorations de la stabilité. Les utilisateurs peuvent désormais effectuer une mise à niveau sans crainte, sachant que même dans le cas improbable d'un bug, il sera corrigé en quelques heures . Et parmi les milliers de titres que Dolphin peut exécuter, le nombre de ceux qui ne fonctionnent pas se compte désormais sur les doigts d'une main !\n \n \n\n \n \nL'annonce du jour est simple, l'équipe annonce qu'elle vient d'adopter un cycle de publication continu, en s'appuyant sur les versions bêta, les nouvelles versions peuvent recevoir des correctifs, donc si des problèmes surviennent, l'équipe publiera de petites mises à jour au lieu d'une nouvelle version complète. Et, bien sûr, chaque version fera progresser le numéro de version de Dolphin qui ne sera plus en x.0, la première version continu est disponible dès maintenant : Dolphin 2407. \n \n \n \n \n\n \n \nVoici les détails du nouveau système de diffusion continue :\n \n- Les deux premiers chiffres représentent l'année et les deux suivants le mois. 2407 codifie une sortie à partir de juillet 2024.\n- Toutes les versions de développement ultérieures après une version seront des numéros ajoutés à celle-ci. Par exemple, 144 commits après 2409 donneraient lieu à la version de développement 2409-144.\n- La prochaine version sera la 240X. Oui, elle sortira dans quelques mois seulement !\n- Les versions de correctifs comporteront l'ajout d'un suffixe. Par exemple, un correctif unique pour Dolphin 2409 serait « Dolphin 2409a ».\n- Les versions bêta sont remplacées par des versions publiées. Tous les utilisateurs de la version bêta seront déplacés vers la nouvelle version publiée.\n \nAu programme, un nouveau logo, MayImilae, la créatrice du précédent logo et rédactrice et collaboratrice de longue date du blog Dolphin, a rafraîchi le logo et a commenté cette évolution :\n \n \nLe logo de Dolphin de 2013 a été conçu au début d'une transition. Dolphin laissait derrière lui son passé bugué et s'engageait à faire les choses correctement, même si cela signifiait supprimer des tonnes de code fonctionnel. Le stupide signe de paix mario a donc disparu et à sa place, j'ai créé un logo net, audacieux, sérieux et tendance pour symboliser le nouvel avenir de Dolphin en tant qu'émulateur sérieux . Et oui, c'est ce qui nous a porté jusqu'ici ! Cependant, Dolphin est plus mature maintenant. Il est stable, confiant et à l'aise dans son environnement. Donc, pour le rafraîchissement, je voulais revenir au design original et le rendre intemporel, mais aussi plus amusant, plus coloré et un peu plus doux et plus épais. Et enfin, aborder toutes les choses qui m’ont dérangé pendant dix ans.\n \n \nL'équipe ensuite explique pourquoi ne pas avoir réalisé une version 6.0, un billet touchant qu'il est possible de retrouver ici en intégralité : fr.dolphin-emu.org\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192785/in-multi-dolphin-50-fete-ses-5-ans-et-propose-un-nouveau-cycle-de-vie-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1192785/in-multi-dolphin-50-fete-ses-5-ans-et-propose-un-nouveau-cycle-de-vie-2.png"
        }
    },
    "news_5": {
        "title": "[XBO/XBS/X] De l'espoir pour ceux qui disposent d'une Xbox One, Series X ou S à jour ?",
        "content": "Il semblerait que Microsoft n'a pas totalement corrigé les failles impliquées dans l'exploit kernel récemment découvert pour les Xbox One, Series X et Series S. Microsoft en fait ce serait contenté de supprimer le script de jeux du store, et la mise à jour a pu corriger une autre vulnérabilité du Game OS (AREA) qui permet de monter temporairement des XVD sans restrictions de contenus. \n \nLors de la sortie de l'exploit, son principal développeur carrot_c4k3 a répondu qu'il ne savait pas si l'exploit fonctionnerait sur 10.0.25398.4909. Il avait alors répondu qu'il se savait pas car il ne disposait pas de console avec cette mise à jour, mais si vous avez une 4909 il propose de tester cette preuve de concept, en attendant la disponibilité de l'exploit complet. \n \n \n\n \n \n \nPour parler de façon un peu plus transparente, Microsoft s'en contenter de couper les ponts dans les failles, mais n'a pas réellement corrigé la faille de l'exploit, pas encore, l'exploit sera rendu public dans quelques jours, dans les 15 premiers jours de Juillet 2024 selon le développeur. \n \n \nTout est là : carrot-c4k3\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192754/in-xboxbsx-de-lespoir-pour-ceux-qui-disposent-dune-xbox-one-series-x-ou-s-a-jour-1.png"
        }
    },
    "news_6": {
        "title": "[Switch] Nintendo s'attaque aux revendeurs et ferme le site officiel Mig Switch",
        "content": " \nCa y est c'est désormais officiel, Nintendo s'attaque aux revendeurs de Mig Switch, il aura fallu un bon moment avant que le géant japonais ne s'en prenne à ce type de transactions, cela se caractérise par le fait que Nintendo of America engage également des poursuites contre Ryan Michael Daly, aussi connu sous le pseudo de Modded Hardware, via le tribunal de Washington à Seattle. \n \nLa plainte déposée le 28 Juin 2024 fait référence à du contournement de sécurité, des violations de brevets, de diverses sections numériques, des droits d'auteurs, autant pour lui même mais aussi et circonstances aggravantes, Nintendo considère qu'il a encouragé d'autres à le faire. \n \n \n \n\n \n \nBien entendu, la violation du CLUF de Nintendo est aussi mise en avant, une violation des droits et d'ingérence délictuelle du contrat, nuisant à l'entreprise.\n \n \n \n\n \n \nCette procédure se fait en parallèle de celle de la mise hors ligne hier du site migswitch․com et yuzu-emu․org qui partagent désormais le même enregistrement DNS.\n \n \nNintendo on le voit s'attaque aux revendeurs, à ceux qui mettent en avant le MigSwitch, après avoir fait fermer le site officiel. \n \n \nTout est là : reddit.com et twitter.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192709/in-switch-nintendo-sattaque-aux-revendeurs-et-ferme-le-site-officiel-mig-switch-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1192709/in-switch-nintendo-sattaque-aux-revendeurs-et-ferme-le-site-officiel-mig-switch-1.png"
        }
    },
    "news_7": {
        "title": "Ouverture de la boutique en ligne LS",
        "content": "Ls et moi même sommes heureux de vous annoncer l'ouverture de notre boutique en ligne. A cette occasion nous avons prévu 1 code de réduction à utiliser à la validation de votre panier.Effectif du 1er au 14 Juillet inclus.les frais de port sont offert à partir de 39€vous trouverez sur notre boutique: - Des consoles (modifiées ou non)- Des pièces détachées neuves et garanties- Nos prestations de réparations et modifications- Des jeux (en cours d'ajouts) - Certaines pièces de collections comme des Neo-Geo entre autresles articles sont encore en cours d'ajouts dans certaines catégories. Un code de 10% de réduction launchls10Le paiement en 4 fois est possible grâce à stripeEn cas de demande particulière n'hésitez pas à nous contacter par le biais du formulaire de contact de la boutiqueA très vite.",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192674/in-ouverture-de-la-boutique-en-ligne-ls-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] Tous les détails sur l'UnlockSwitch cette semaine",
        "content": "C'est cette semaine que la team UnlockSwitch va dévoilé la plupart des détails qui concerne leur linker.\n \n \n\n \n \nElle va s'exprimer dans quelques heures ou jours sur : \n \n- Envoi d'échantillons aux bêta-testeurs.\n \n- Informations sur le début de la production en série du UnlockSwitch et sa date de sortie officielle.\n \n- Quantité maximale disponible par client.\n \n- Détails sur les fonctionnalités du UnlockSwitch et de son programmateur\n \n- Informations sur notre plateforme d'expédition logistique en Chine pour le B2C et le B2B.\n \n- Date de lancement et prix du Xtractor, à la fois individuellement et groupés avec UnlockSwitch.\n \n- Sélection de partenaires de distribution externes potentiels par pays dans des conditions spécifiques (à confirmer).\n \nBref vous l'aurez compris les prochaines heures vont permettre d'en savoir davantage sur le linker.\n \n \n\n \n\n \n\n \n \nLes prototypes des deux boîtiers pour UnlockSwitch PBS et son programmeur sont terminés et approuvés, la production en série commençant ce lundi. Encore une fois, ce ne sont que des prototypes, la version finale sera de meilleure qualité et transparente.\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192662/in-switch-tous-les-details-sur-lunlockswitch-cette-semaine-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1192662/in-switch-tous-les-details-sur-lunlockswitch-cette-semaine-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1192662/in-switch-tous-les-details-sur-lunlockswitch-cette-semaine-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1192662/in-switch-tous-les-details-sur-lunlockswitch-cette-semaine-4.jpg"
        }
    },
    "news_9": {
        "title": "[PS4] Apollo Save Tool PS4 v1.4.5 disponible",
        "content": " \nLe développeur Damian Parrino vient de proposer une nouvelle version PS4 de son célèbre Apollo Save Tool, son outil permettant de gérer aux mieux les sauvegardes de votre console. Apollo Save Tool est un utilitaire qui permet de gérer les fichiers de sauvegarde de jeux sur PlayStation 4. \n \n \n\n \n \nChangelog v1.4.5 :\n \n- Prise en charge des firmwares 9.60 / 10.00 / 10.01 (merci à @BestPig).\n- Nouveaux codes de triche pour Shin Megami Tensei V.\n- Prise en charge du décryptage personnalisé des sauvegardes pour Shin Megami Tensei V (AES-ECB).\n- Prise en charge du contrôle de somme personnalisé pour Shin Megami Tensei V (SHA1).\n \n \nTéléchargement : Apollo Save Tool PS4 v1.4.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192649/in-ps4-apollo-save-tool-ps4-v145-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[Multi] Citra Enhanced 1.3.0 disponible",
        "content": "Les développeurs de Citra Enhanced sont de retour, Citra Enhanced est un fork du célèbre émulateur Nintendo 3DS, Citra. Développé par Gamer64ytb, il apporte des améliorations et des ajustements pour une meilleure performance par rapport à l’original. Vous pouvez télécharger cette version et la tester. Si vous rencontrez des bugs, n’hésitez pas à ouvrir un ticket sur GitHub, Discord ou Telegram. \n \n \n\n \n \nPour l’installation, vous bénéficiez de plusieurs plates-formes \n \nWindows : Utilisez le projet Troppical Installer qui prend en charge Citra Enhanced. Vous pouvez le trouver ici.\nAndroid : Pour les mises à jour automatiques, utilisez Obtainium. Téléchargez et installez l’application app-release.apk depuis ce lien, puis ajoutez l’URL de la source ici dans Obtainium.\nLinux : La version FLATHUB arrive bientôt.\nMac OS : Téléchargez la dernière version stable pour Mac ici.\n \n \nChangelog 1.3.0 : \n \n- Android et PC : Correction d'une erreur de syntaxe qui pouvait provoquer des plantages sur OpenGL\n- Android : Mise à jour des liens \"A propos\" vers les liens \"Citra Enhanced\n- PC : Ajout d'une barre de défilement à l'onglet Système (rtiangha)\n- Exécuter la fonction de capture d'écran en pause en capturant l'image suivante (RocketRobz)\n- réseau : Changement du résultat de verify_backend si null, corrige des problèmes mineurs de réseau\n- glsl_fs_shader_gen : Utilisation d'une meilleure façon d'écarter le mode gaz, peut aider un peu pour les appareils bas de gamme\n- OpenGL : Réimplémentation du hack weihuoya stream buffer et retour en arrière sur certains trucs de stream buffer\n- Android : Implémenter Adreno GPU Boost (Expérimental)\n- Android : corriger correctement les paramètres non exécutables (Ishan09811)\n- Android : Supprimer la destruction inutile de la surface lors de la pause de l'émulation (Ishan09811), peut résoudre des problèmes.\n- Android : Retravailler l'interface utilisateur des paramètres (Ishan09811)\n- PC : Implémentation d'un support avancé pour la mise en page personnalisée (blakbin) (OpenSauce04) (rtiangha)\n- Android : Ajouter des bindings pour les boutons du dpad (OpenSauce04)\n- Android : Les manettes de jeu peuvent maintenant contrôler le menu du jeu (OpenSauce04)\n- Android & PC : Remplacer la fonction frameskip de l'ancienne citra (rtiangha et moi). ATTENTION : - Cette fonctionnalité est buggée pour l'instant, moins de jeux fonctionnent bien avec.\n- GameSettings : Amélioration de la détection du backend\n- Android & PC : Changer l'option Raise CPU Ticks dans la section General\n- Android & PC : Ajouter un desc pour le mode New 3DS\n- Android & PC : Mise à jour de la base de code vers la dernière version, incluant les corrections pretendo et plus encore !\n- Améliorations mineures du code et nettoyages\n \n \nTéléchargement : Citra Enhanced 1.3.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1474517776.png"
        }
    },
    "news_11": {
        "title": "[PS4] Itemzflow v1.06 disponible",
        "content": " \nLe développeur LightningMods dévoile une nouvelle version d'Itemzflow, il présente en effet la version 1.06 de son manager avec un support appuyé pour la PS4. Il y a quelques jours il sortait la v1.06 pour la PS5, là il s'agit de la version spécialement taillée pour la PS4.\n \n \n\n \n\n \n \nVoici quelques changements clés auxquels vous pouvez vous attendre :\n \n- Ajout de la prise en charge (expérimentale) des jeux \"fake\" (chargement de dumps à partir d'une clé USB ou d'un stockage local, prise en charge de NFS, nécessité d'une signature externe des faux jeux).\n- Ajout d'informations sur le firmware et les détails de compatibilité dans la fonction de mise à jour officielles des jeux.\n- Ajout de l'option d'installation des PKGs en arrière-plan via l'installateur PKG d'Itemzflow (Option du navigateur de fichiers)\n- Itemzflow conserve désormais les 3 derniers logs (3 derniers lancements d'itemzflow)\n- Ajout de plus d'informations pour certains codes d'erreur (i.e. l'installateur de patch vous dira si vous bloquez Sonys CDN etc)\n- Amélioration des performances d'itemzflow\n- Correction d'une fuite (leak) de mémoire qui causait des problèmes si la console contenait beaucoup de jeux.\n- Ajout d'une barre de progression pour le téléchargement des pochettes\n- Correction d'un problème provoquant le plantage d'Itemzflow si vous essayez de télécharger des jaquettes de jeux avec l'API bloquée (c'est-à-dire le DNS).\n- Amélioration du démarrage du Fuse itemz-daemon (ne se bloque pas en essayant de se connecter automatiquement au dernier partage NFS s'il n'est pas disponible).\n \n \nTéléchargement : Itemzflow v1.06\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192590/in-ps4-itemzflow-v106-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1192590/in-ps4-itemzflow-v106-disponible-2.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] La Team UnlockSwitch annonce sa roadmap et explique son avenir",
        "content": "L'équipe UnlockSwitch continue de communiquer, et elle le fait plutôt bien, après avoir publié des photos de son linker, tout d'abord dans sa version PCB noir, puis avec un PCB violet, elle dévoile désormais un peu plus d'informations sur son avenir via un post assez long sur le réseau Twitter, récemment renommé X. \n \nDans ce post nous apprenons pas mal de chose, comme le volume qui sera produit, au moins 10 à 20 000 pièces réservées justement à la communauté Twitter.  \n \n \n\n \n \n \nComme annoncé hier, nous avons présenté la version finale du UnlockSwitch PBS (V5R1) - UnlockSwitch PBS ( Black Edition ) - UnlockSwitch PBS ( Purple Edition ).\n \nAu départ, nous avons choisi un PCB noir, mais la communauté a demandé une version violette, nous l'avons donc produite ! Nous maintenons le prix de lancement à 29,90 $. \n \n \nNous avons déjà produit des échantillons pour nos bêta-testeurs, qui seront expédiés à partir de lundi. Nous attendons avec impatience leurs retours ! Nous sommes particulièrement intéressés par leurs avis positifs ou négatifs sur notre solution, et surtout, par les vidéos de démonstration de l'UnlockSwitch en action ! On compte sur vous les gars !!! \n \nEn attendant, nous lancerons une production de masse de 10 000 à 20 000 unités exclusivement pour notre communauté Twitter, la quantité exacte restant à déterminer. Nous procéderons prochainement à un vote pour estimer les commandes et la quantité souhaitée. Il n'y aura pas de précommandes, UnlockSwitch ne sera disponible à la vente que lorsque le stock sera prêt, jusqu'à épuisement. \n \nAprès cette production, le UnlockSwitch ne sera plus vendu seul mais en kit avec le Xtractor. Nous souhaitons vendre UnlockSwitch comme une solution de sauvegarde personnelle complète. Bien entendu, le Xtractor sera également vendu séparément par la suite. La semaine prochaine, nous publierons le nombre d'unités à produire. Nous partagerons également avec vous des vidéos de fabrication. Nous savons que vous aimez ça, et nous aussi ! Avez-vous des questions ?\n \n \n\n \n \nLa team a l'intention de commercialiser ce premier lot à 29.90 $, sans l'extracteur de jeu (appelé Xtractor), cela permettra d'écouler cette première production, ensuite seule une version UnlockSwitch + Xtractor sera commercialisée, mais nous n'en connaissons pas encore le tarif. La semaine prochaine, la team dévoilera le prix de l'extracteur qui sera vendu seul, d'ailleurs au niveau de la vente, elle aura lieu via le site internet via UnlockSwitch.com et uniquement via le site internet directement, pas de revendeur ou d'Aliexpress. Quand à la date de commercialisation, la team UnlockSwitch annonce Juillet 2024, voir Mi Juillet 2024.\n \nAu niveau du flash et de l'extracteur, la team explique qu'elle va publier des informations sur le software, ainsi que le code source, la solution se revendiquant open-source. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192568/in-switch-la-team-unlockswitch-annonce-sa-roadmap-et-explique-son-avenir-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1192568/in-switch-la-team-unlockswitch-annonce-sa-roadmap-et-explique-son-avenir-2.jpg"
        }
    },
    "news_13": {
        "title": "[Switch] La version finale du UnlockSwitch PBS et de son programmateur",
        "content": " \nVoilà la team UnlockSwitch annonce avoir produit les premiers volumes de la version finale du UnlockSwitch PBS (V5R1) disposant d'un PCB violet tout comme son programmeur. Il aura fallu un peu de temps, mais voilà la version finale de ce qui sera la première version du linker. La présentation officielle se fera demain, il se pourrait qu'une roadmap soit dévoilée également, une réunion interne aura lieu demain matin.\n \n \n\n \n \nL'autre élément important est le programmateur du UnlockSwitch, avec lui vous pouvez flasher sans effort et profiter d'un contrôle total sur votre UnlockSwitch pendant des mois, voire des années. Il constitue la principale différence qui autre solution qui sont pour le coup un peu plus fermée. \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192535/in-switch-la-version-finale-du-unlockswitch-pbs-et-de-son-programmateur-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1192535/in-switch-la-version-finale-du-unlockswitch-pbs-et-de-son-programmateur-2.jpg"
        }
    },
    "news_14": {
        "title": "[Switch] Ldn_mitm, FPSLocker, SaltyNX et Status Monitor Overlay à jour",
        "content": " \nDe nombreux logiciels à destination de la Nintendo Switch ont été mis à jour. Faisons le tour.\n \n \n\n \nSaltyNX : Le plugin permettant d'exécuter des processus en arrière plan est de retour dans une version 0.8.0, une mise à jour assez riche.\n \nChangelog : \n- Changement de gnu++20 à gnu++23\n \nSysmodule :\n- Ajout d'un IPC permettant de changer le taux de rafraîchissement de l'écran\n- Ajout du support de l'option Display Sync dans les paramètres d'affichage disponibles dans FPSLocker 2.0.0\n \nCore / NX-FPS :\n- Ajout du support pour la nouvelle génération de patchs FPSLocker qui ont ajouté des entrées supplémentaires pour 40, 45, 50 + 55 Hz et qui permettent de forcer le verrouillage du FPS.\n- Maintenant, si une cible FPSLocker correspond au taux de rafraîchissement de l'écran, le verrouillage FPS de NX-FPS est automatiquement désactivé pour éviter les ralentissement (sauf si le patch FPSLocker impose le verrouillage FPS).\n- Depuis cette version, SaltyNX ne supporte plus les FW antérieurs à 10.0.0\n \nTéléchargement : SaltyNX\n \n \n \nComme nous venons de le voir dans SaltyNX, FPSLocker est disponible en v2.0.0. Comme déjà annoncé avec SaltyNX, le taux de rafraîchissement de l'écran LCD peut désormais être ajusté et synchronisé avec la fréquence d'images, mais cela est encore expérimental. De plus, de nouvelles configurations sont prises en charge dans lesquelles la plupart des calculs ont été déplacés vers la superposition, ce qui rend les correctifs globalement plus petits.\n \nChangelog : \n \n- Ajout du menu Display settings pour changer la fréquence de rafraîchissement du LCD (ne pas mettre la Switch sur le dock avec une fréquence de rafraîchissement modifiée lorsque le jeu est en cours, sinon il y a un risque de plantage du jeu), non disponible pour le modèle OLED. SaltyNX 0.8.0+ est nécessaire pour que ce menu s'affiche. Plus d'informations dans le readme.\n- Ajout du support pour la prochaine révision des configurations du jeu qui les rendent plus petites et déplacent la plupart des calculs dans la couche FPSLocker elle-même.\n- Passage de c++20 à c++23\n \nTéléchargement : FPSLocker 2.0.0\n \n \n \nLdn_mitm quand à lui passe en v1.17.0, comme vous savez il s'agit du plugin qui permet de jouer en ligne aux jeux qui disposent d'un mode LAN.\n \nQuelques corrections, et surtout le support du tout dernier Atmosphère 1.7.1.\n \nTéléchargement : ldn_mitm 1.17.0\n \n \nEnfin Status Monitor Overlay a vu lui aussi débarquer une update il y a quelques heures. \n \nLà aussi il s'agit de passer de c++20 to c++23 et avec SaltyNX 0.8.0+, le mode FPS Graph ajustera la hauteur en fonction du taux de rafraîchissement de l'écran arrière reçu.\n \nTéléchargement : Status Monitor Overlay 1.0.4\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192509/in-switch-ldn-mitm-fpslocker-saltynx-et-status-monitor-overlay-a-jour-1.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] UnlockSwitch fait le plein de photos de production",
        "content": "La Team UnlockSwitch dévoile de nombreuses photos de la production de la première version du UnlockSwitch au PCB de couleur violette. \n \nCette révision violette intègre la correction du port du programmateur, il s'agit de la version finale du PCB (V5R1) pour le UnlockSwitch PBS (PURPLE EDITION).\n \n \n \n\n \n\n \n\n\n \n \nCe n'est pas tout, la team dévoile aussi des images de la production, des photos des machine qui réalisent les PCB. \n \n \n\n \n\n \n\n \nElle rajoute à la publication de ces nouvelles photos : Nous avons connu des retards dus à la fragilité du câble entre le UnlockSwitch et son programmateur, mais nous sommes satisfaits du résultat. Il est désormais plus robuste et nous commencerons les tests de programmation cette semaine.\"\n \n\n \n\n \n \nL'équipe UnlockSwitch vient de mettre en ligne une vidéo de la production. \n \n \n \n\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-3.jpg",
            "image_4": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-4.jpg",
            "image_5": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-5.jpg",
            "image_6": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-6.jpg",
            "image_7": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-7.jpg",
            "image_8": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-8.jpg",
            "image_9": "https://www.logic-sunrise.com/images/news/1192506/in-switch-unlockswitch-fait-le-plein-de-photos-de-production-9.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] MigSwitch précise pourquoi avoir intégré un bouton très fin",
        "content": "La Team Mig Switch a posté un nouveau message sur son site internet, elle a souhaité apporter une clarification sur l'utilisation des boutons de la v2 de son linker, celle qui dispose d'un bouton permettant de changer les jeux sans devoir retirer et réinsérer le linker du slot de jeux. \n \nAvec les retours que l'équipe a reçu des premiers utilisateurs de la Mig Card V2, l'équipe a voulu clarifier quelque chose concernant le bouton de changement de jeu. Lors de la conception de la V2, l'équipe a volontairement intégré un bouton fin car, comme vous pouvez le voir dans la vidéo ci-dessous, il est destiné à être également utilisé avec le couvercle de la fente du slot de carte de jeu fermé.\n \nLa Team Mig Switch a pensé plus pratique de pouvoir fermé le slot jeux, et ne plus avoir besoin de l'ouvrir une fois vos jeux installé dans la microSD, selon la team c'est tout simplement plus propre et plus beau. Bien entendu, elle précise que vous pouvez également l'utiliser l'emplacement pour carte de jeu ouvert, mais cela n'est plus nécessaire avec cette V2 contrairement à la V1 qui nécessite la fameuse manipulation pour changer de titre. \n \n \n \n\n \n \n",
        "images": {}
    },
    "news_17": {
        "title": "[Multi] PS Multi Tools v14.3 disponible",
        "content": " \nLe développeur SvenGDK a retravaillé PS Multi Tools et propose désormais la v14.3. Comme vous le savez probablement cet utilitaire s'adresse à tout ceux qui dispose d'une console Sony, de la PSP à la PS5 en passant par toutes les générations. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n\n \n \nChangelog 14.3 : \n \nGénéral :\n- Changement de la couleur d'arrière-plan du thème sombre de #FF252525 à #2D2D30 pour toutes les fenêtres\n- Suppression des paquets NuGet inutilisés\n- Mise à jour de FluentFTP 50.0 -> 50.1\n- Mise à jour de WinSCPNet 1.15.0.14890 -> 1.15.0.14955\n- Mise à jour Microsoft.Web.WebView2 1.0.2535.41 -> 1.0.2592.51\n- Utilisation des listes principales PS1IDs & PS2IDs intégrées pour obtenir le titre du jeu si aucune information ne peut être trouvée sur PSXDatacenter.\n \nPS1 :\n- Les jeux au format VCD peuvent désormais être chargés dans la bibliothèque de jeux PS1.\n- Nouvelle option de menu contextuel dans la bibliothèque de jeux PS1 pour créer un projet de jeu PS1 pour la PSX\n \nPS2 :\n- Nouvelle interface graphique CUE2POPS\n- Convertit les jeux PS1 au format VCD pour les utiliser avec POPStarter\n- Nouveau GUI ELF2KELF\n- Convertit les fichiers ELF homebrew au format KELF (HDDOSD, PSBBN, PSX XMB)\n- Nouvelle option de menu contextuel dans la bibliothèque de jeux PS2 pour créer un projet de jeu PS2 pour la PSX\n \nPSX Tools Integration :\n- Ajout de PSX Tools à partir de PSX XMB Manager avec des changements mineurs\n- L'utilisation de PSX Tools nécessite un accès administrateur pour connecter les disques durs via NBD.\n- Vous serez invité à redémarrer PS Multi Tools en tant qu'administrateur.\n \n \n\n \n \nCaractéristiques de PSX Tools :\n- Installer des homebrew et des jeux PS2 sur le disque dur interne de la PSX\n- Installer des jeux PS1 sur le disque dur interne du PSX\n- Gestionnaire de partitions du disque dur (créer une partition, supprimer une partition (destructive), modifier la visibilité d'une partition)\n- Explorateur de fichiers XMB (Outils XMB)\n- Ouvrir un dossier _system ou xosd pour charger, visualiser et modifier son contenu\n- Éditeur de texte pour les fichiers .xml et .dic avec mise en évidence de la syntaxe\n- Traduire automatiquement les fichiers .dic et .xml dans la plupart des langues\n- L'aide et plus d'informations sont disponibles ici https://github.com/SvenGDK/PSX-XMB-Manager\n \nPS4 :\n- Mise à jour de PPPwn C++ avec les derniers changements (16/06/2024)\n- Ajout des fichiers SiSTRo/GoldHEN stage1 & stage2 pour FW 9.50 / 9.51 / 9.60\n- Mise à jour de GoldHEN inclus à v2.4b17.3\n- Vous pouvez toujours obtenir la dernière version en cliquant sur \"Télécharger la dernière version de GoldHEN sur une clé USB\" si celle qui se trouve dans PS Multi Tools est obsolète.\n \n \nTéléchargement : PS Multi Tools v14.3\n \n \n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192451/in-multi-ps-multi-tools-v143-disponible-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1192451/in-multi-ps-multi-tools-v143-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[PS4/PS5] Un nouvel exploit webkit qui pourrait impacter le 11.02 (PS4) et 8.60 (PS5)",
        "content": "Le développeur Zecoxao a publié un fichier PoC (preuve de de concept) pour une toute nouvelle vulnérabilité qui affecterait les firmwares du 10.00 au 11.02 sur la PS4, et du firmware 6.00 au 8.60 sur la PS5, on serait donc sur un exploit webkit plutôt intéressant, reste à voir ce qu'il va être possible de faire avec. \n \nInitialement, cette vulnérabilité du webkit a été signalée par Kameleon pour la scène PlayStation, mais nous apprenons que cette faille a été corrigée sur Safari.\n \n \n\n \n \n \nPour tester la faille : \n \nhttps://zecoxao.github.io/cve/index.html\n \nLa faille est expliquée ici : \n \nhttps://medium.com/@enki-techblog/ios-16-5-1-safari-rce-analysis-cve-2023-37450-89bb8583bebc\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192448/in-ps4ps5-un-nouvel-exploit-webkit-qui-pourrait-impacter-le-1102-ps4-et-860-ps5-1.jpg"
        }
    },
    "news_19": {
        "title": "[2DS/3DS] Luma3DS v13.1.2 disponible",
        "content": " \nLe développeur TuxSH a déployé une nouvelle version de Luma3DS, il a mis en ligne la version 13.1.2 du moyen CFW pour la Nintendo 3DS. Comme vous le savez Luma3DS est le CFW indispensable pour les 3DS et 2DS et l'arrivée d'une nouvelle version est toujours intéressante à suivre. \n \nLuma3DS apporte des améliorations dans les paramètres des langues de jeux, le débogage amélioré pour les développeurs, ou encore le déverrouillage de région, cette nouvelle version 13.1.2 apporte de nouvelles fonctionnalités, et vient corriger le problème de démarrage automatique après avoir laissé enfoncé le bouton power trop longtemps. \n \n \n\n \n \nAvec cette nouvelle version, les captures en mode 800 pixels sont désormais restitués en 800 x 480, ce qui rend une image plus fidèle avec une mise à l'échelle entière sur l'axe Y.\n \nDes petites améliorations sur la stabilité système ou l'expérience utilisateur ont été apportées également à cette version, même si clairement nous ne savons pas dans le changelog de quoi il s'agit. \n \nChangelog v13.1.2 :\n \n- Correction de l'autoboot homebrew bloqué dans une exception au démarrage après que le bouton POWER ait été maintenu trop longtemps.\n- Captures d'écran : en mode 800px, produire des images 800x480 avec le bon rapport hauteur/largeur au lieu de 800x240 pour une sortie plus fidèle (en utilisant l'échelle entière sur l'axe Y).\n- D'autres améliorations de la stabilité générale du système et d'autres ajustements mineurs ont été apportés pour améliorer l'expérience de l'utilisateur.\n \nTéléchargement : Luma3DS v13.1.2\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192445/in-2ds3ds-luma3ds-v1312-disponible-1.jpg"
        }
    },
    "news_20": {
        "title": "[PS4] PPPwnUI 3.20 moddé par aldostools",
        "content": " \nLe développeur Aldo Vargas, alias Aldostools, semble s'intéresser à la scène PlayStation 4, il nous a davantage habitué à travailler sur PS3, mais depuis quelques semaines il livre un fork de PPPwnUI à l'origine proposé par Memz qu'il est venu modder avec ses propres intégrations ou bien il compile une version avec les dernières nouveautés disponibles dans ce domaine. \n \nPPPwnUI est un programme réalisé en Python qui ajoute une interface utilisateur à l'exploit PPPwn créé par TheFlow, la version moddée par Aldostools ajoute de nombreux éléments, cette version 3.20 apporte encore plus d'options. \n \n \n \n\n \n \nIl a ainsi rajouté les derniers payloads disponibles, les dernières versions de PPPwn compatible IPv6, comme le USB BinLoader / NOBD stage2 8.00 & 8.01 de StretchEcho & LightningMods, ou encore les dernières mises à jour des payloads PS4-HEN-VTX-PPPwn de StretchEcho & BestPig.\n \nDans la version 3.20 qu'il vient tout juste de mettre en ligne, il présente une nouvelle interface graphique, les derniers payloads Linux pour le firmware 11.00 de EinTim23.\n \n \nChangelog PPPwnUI 3.20 moddé par aldostools :\n \n- Nouvelle présentation de l'interface graphique\n- Suppression de l'étape 1 dupliquée\n- Inclut les dernières charges utiles PS4-HEN-PPPwn-VTX par EchoStretch & BestPig\n- Inclut la dernière version de l'étape 2 avec USB Loader (normal & NOBD) par LightningMods\n- Inclut les dernières versions de GoldHEN 2.4b17.3 & GoldHEN Lite 1.0 pour 9.00 par SiSTR0\n- Inclut les dernièrs payloads Linux pour le firmware 11.00 par EinTim23\n- Inclut le dernier payload PPPwn par TheFlow0 compatible avec une adresse IPv6 qui fonctionne sur toutes les PS4\n- Comprend un pack de payloads supplémentaires par LightningMods\n \nCaractéristiques :\n \n- Se souvient des dernières options sélectionnées\n- Option de démarrage automatique de PPPwn lorsque l'interface graphique est lancée\n- Option d'auto-rétention en cas d'échec\n- Script python multiplateforme\n- Possibilité d'utiliser des étapes 1 et 2 personnalisées\n- Logo personnalisable 580x50\n \n \nTéléchargement : PPPwnUI 3.20 moddée par aldostools\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1192395/in-ps4-pppwnui-320-modde-par-aldostools-1.png"
        }
    }
}