{
    "news_1": {
        "title": "[WiiU] ISFShax v5.0, minute v1.0 et stroopwafel v1.0",
        "content": " \nLes nouveautés sur la Nintendo Wii U sont nombreuses, l'exploit Coldboot boot1 pour la Wii U, ISFShax, a connu une mise à jour importante qui apporte une protection avancée contre les bricks et des correctifs système supplémentaires.\n \nIl s'agit de la v5.0 qui apporte des correctifs dans le code et un changelog intéressant. \n \n \n\n \n \nChangelog v5.0 : \n \n- Modification de la priorité de démarrage.\n- Maintenant, il essaie de charger d'abord la minute à partir de la carte SD, puis essaie SLC.\n- Maintenant, il recherche d'abord un minute.img avant d'essayer fw.img\n- Modifications mineures au code SD\n- Si vous avez déjà installé ISFShax, il n'est pas nécessaire de le mettre à jour \n \nTéléchargement : ISFShax v5.0\n \n \nLe développeur Jan Hofmeier propose la mise à jour de minute minute en v1.0 avec notamment des optimisations sur les vérifications sur la mémoire MLC et une correction sur le chargement à partir de PRSHhax. \n \nTéléchargement : minute_minute 1.0\n \n \nEnfin sachez que le développeur a déplacé Stroopwafel dans un nouvel espace Github et il en a profité pour le mettre à jour en renommer 00core.ipx et 5debug.ipx.\n \n \nTéléchargement : Stroopwafel v1.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202935/in-wiiu-isfshax-v50-minute-v10-et-stroopwafel-v10-1.jpg"
        }
    },
    "news_2": {
        "title": "[Switch] Citron continue de mettre la pression à Nintendo",
        "content": "Développé par Zephyron, Citron reprend les bases de Yuzu, et continue de presser Nintendo en tirant le meilleur de l'émulation sous Windows, Android ou Linux. \n \nBien entendu, ce projet est une alternative à usage éducatif, le développeur tente de se prémunir de l'avenir en mettant en garde dès le téléchargement et l'installation du logiciel qu'il ne cautionne pas le piratage. \n \n \n\n \n \nIl y a quelques jours il publiait la version Canary 0.3 de l'émulateur, cette version se concentre sur l'amélioration de la stabilité et la compatibilité entre les plateformes. De nombreuses modifications apportées à la compilation des shaders, au système de build et notamment pour la plateforme Android. \n \nLe changelog intégral se trouve ici et il vaut le détour :  v0.3-canary-refresh\n \nTéléchargement : Citron 0.3 Canary\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202927/in-switch-citron-continue-de-mettre-la-pression-a-nintendo-1.png"
        }
    },
    "news_3": {
        "title": "[Switch] NxFileViewer v3.0.2 disponible",
        "content": "Le développeur Myster-Tee revient pour une proposer une mise à jour de NxFileViewer, comme vous le savez\n \nLa mise à jour vient corriger le numéro de version affiché dans la barre de titre, et vient apporter la prise en charge du latino-américain. Pour rappel, NxFileViewer est un logiciel PC qui vous permet de parcourir les fichiers NSP, NSZ, XCI et XCZ et ainsi afficher tout un tas d'informations et de vérifier s'ils disposent de signatures, et d'afficher les hashs.\n \n \n\n \n \n \nCaractéristiques : \n \n- Basé sur LibHac\n- Fichiers pris en charge : NSP, NSZ, XCI, XCZ\n- Prend en charge Super NSP/XCI\n- Parcourir la structure du contenu des fichiers\n- Exporter des fichiers\n- Enregistrer ou copier les images de titre\n- Spécifiez l'emplacement de vos propres clés\n- Recherche des clés dans les emplacements fréquemment utilisés\n- Télécharger automatiquement les clés à partir d'une URL définie dans les paramètres\n- Prend en charge le glisser-déposer\n- Vérifie le type de fichiers réels (XCI ou NSP)\n- Journal détaillé\n- Interface conviviale et réactive\n- Fichier exécutable unique\n- N'écrivez rien en dehors du répertoire du programme\n- Vérifier le hachage et la signature\n- Affiche les clés manquantes\n- Ouvre l'URL du titre\n- Plusieurs langues \n- Renommage avancé des fichiers\n \n \nChangelog 3.0.2 :\n \n- Version corrigée affichée dans la barre de titre\n- Ajout de la langue espagnole latam (merci à Impeeza)\n \n \nTéléchargement : NxFileViewer v3.0.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202925/in-switch-nxfileviewer-v302-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[Switch] Sudachi mis à jour en 1.0.13",
        "content": "Le développeur Jarrod Norwell propose une mise à jour de Sudachi en version 1.0.13. On vous a déjà parlé, et c'est une première malgré les injonctions de Nintendo, le développeur continue le développement de l'émulateur. \n \nSudachi est un émulateur Nintendo Switch pour Android, Linux, macOS et Windows écrit en C++ et basé sur Yuzu, Sudachi est proposé pour Windows, MacOS et Android.\n \n \n\n \n \n \nLes modifications portent sur la version Android et la version Windows, sur lesquelles les modifications de formulaire sont plus précises par rapport à la documentation. \n \nDans cette version, le développeur semble tout de même se conforter davantage avec le droit puisqu'il a supprimé la possibilité d'installer des jeux sur Nand. \n \nLe projet désormais se présente désormais comme un modèle de développement appelé \"Modèle d'extrait de Mantine + Vite + Vanille\", son objectif est de limité les capacités des moteurs en publiant le changelog sur un site externe. \n \n \nAndroid :\n- Modification de mm:u pour être plus précis par rapport à la documentation\n- Suppression de la possibilité d'installer des jeux sur la NAND\n \nWindows\n- Ajout de la prise en charge du démarrage sur QLaunch via -qlaunch\n- Modification de mm:u pour être plus précis par rapport à la documentation\n- Suppression de la possibilité d'installer des jeux sur la NAND\n \nTéléchargement : Sudachi 1.0.13\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202907/in-switch-sudachi-mis-a-jour-en-1013-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] Un homme de 58 ans arrêté au Japon, il vendait des Switch modifiées",
        "content": "Au Japon, on ne rigole pas avec le hack et la revente de consoles moddées, un homme de 58 ans vient d'être arrêtés car il revendait des consoles modifiées en ligne, mais il ne faut pas résumer cette arrestation en quelques mots. \n \nFumihiro Otobe a été accusé d'avoir volé des unités Switch, d'y avoir soudé des puces modifiées et de les avoir revendues pour environ 28 000 ¥ (180 USD). Le prix proposée à lui seul permet d'identifier qu'il s'agissait de recel. En plus déjà de revendre du matériel volé, il y installé des copies pirates de jeux (jusqu'à 27 jeux), en option, qu'il faisait payer en plus. \n \n \n\n \n \nVu les injonctions contre lui, Fumihiro Otobe a plaidé coupable, il a même ironisé lors de son audition \" J'étais curieux de savoir si les gens penseraient que j'étais incroyable si je vendais des consoles modifiées \" . \n \nIl est clair que la justice, au travers de la police japonaise, est probablement plus sévère que dans le reste du monde, car par nature elle est plus sensibilisée, il faut dire qu'au Japon les vols et les recels sont très mal perçus. \n \nSur le même exemple, un homme l'année dernière avait été arrêté pour avoir juste modifié des fichiers de sauvegarde de Pokemon Violet, il avait lui aussi commercialisé cette prestation en ligne. \n \nSource : News.ntv.co.jp\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202875/in-switch-un-homme-de-58-ans-arrete-au-japon-il-vendait-des-switch-modifiees-1.jpg"
        }
    },
    "news_6": {
        "title": "[PS5] FetchPKG v0.3.1 disponible",
        "content": "Le développeur John Tornblom continue de proposer de la nouveauté en ce début d'année avec non seulement des nouveaux payloads pour l'exploit BD-J, mais aussi au niveau des logiciels avec la mise à jour de FetchPKG, un outil qui permet de manipuler les PKG à destination de la PS5 mais aussi de la PS4. \n \nAvec cette nouvelle version 0.3.1, les mises à jour de jeu qui sont divisées seront automatiquement fusionnées lors du téléchargement, il est possible de les télécharger derrière un proxy, utile pour une PS4 qui dispose d'un firmware inférieur au dernier original en date. \n \n \n \n\n \n \nPour exploiter au mieux le logiciel, il est utile de le paramétrer derrière un proxy pour protéger votre console de toute mise à jour. Cette correction vise aussi à corriger un problème avec les fichiers de plus de 2 Go.\n \nPour exécuter Fetchpkg sur PS5, vous devez le charger avec un loader ELF qui fournit une interface de ligne de commande, par exemple, shsrv, et les moyens de transférer l'ELF vers la ps5, par exemple, ftpsrv. Il vous faudra lancer les commandes qui téléchargeront le fichier ELF dans /data, qui se connecteront à shsrv et qui téléchargeront un fichier pkg dans /mnt/usb0 via un serveur proxy.\n \n \nTéléchargement : FetchPKG v0.3.1\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202874/in-ps5-fetchpkg-v031-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[PS5] PS5 Homebrew Apps 1.3 disponible",
        "content": "Le développeur Master-s propose de découvrir une nouvelle version de son outils PS5 Homebrew Apps qui est maintenant estampillé 1.3.\n \nDans cette nouvelle version le développeur a ajouté etaHEN 2.0, comme vous le savez, PS5 Homebrew Apps est un ensemble d'homebrews qui fonctionne avec websrv. websrv est un serveur Web simple qui peut être exécuté sur une Playstation 5 jailbreakée via les points d'entrée BD-J ou Webkit . Il peut être utilisé pour lancer des homebrews via le navigateur Webkit intégré à la PS5, ou à distance depuis votre PC, téléphone, etc.\n \n \n\n \n \nAvec cette modernisation avec etaHEN 2.0, l'outil intègre les toutes dernières avancées sur PS5.\n \n \n\n \n \nTéléchargement : PS5 Homebrew Apps 1.3\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202868/in-ps5-ps5-homebrew-apps-13-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202868/in-ps5-ps5-homebrew-apps-13-disponible-2.png"
        }
    },
    "news_8": {
        "title": "[PS3] Nathan Martin propose la deuxième Bêta de son CFW Evilnat 4.91.3",
        "content": "Le développeur Nathan Martin offre sur PS3 une nouvelle version de son custom firmware CFW Evilnat 4.91.3, il s'agit de la deuxième Bêta de cette série.\n \nLa disponibilité se limite pour l'heure à la version PEX, incluant les modules et kernel DEX à partir du DEX 4.84, bien qu'il utilise le CEX par défaut bien entendu.\n \n \n \n\n \n \nL'update permet notamment l'introduction de nouvelles fonctionnalités comme la prise en charge du CFW 4.84 DECR. Certaines options ont été reclassées afin de les rendre plus faciles à utliser, et les fonctionnalités liées au licences ont été améliorées.\n \nCela passe par exemple par l'ajout des mises à jour des options d'importations, et d'exportation de licence au format rap.bin, qui est plus simple à exploiter. \n \n \n\n \n \nPour ceux qui ont une ancienne version du CFW, installez le CFW complet 4.91.3 [BETA 2], pour les autres qui ont une version plus récente vous pouvez simplement mettre à jour xai_plugin mais uniquement pour PEX. \n \nTéléchargement : CFW 4.91.3 Evilnat Cobra 8.5 [PEX] [BETA 2].rar (202.4 Mo)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202859/in-ps3-nathan-martin-propose-la-deuxieme-beta-de-son-cfw-evilnat-4913-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202859/in-ps3-nathan-martin-propose-la-deuxieme-beta-de-son-cfw-evilnat-4913-1.png"
        }
    },
    "news_9": {
        "title": "[PS4/SP5] LightningMods commence les tests d'etaHEN 2.0 Bêta",
        "content": "Le développeur LightningMods fait savoir qu'il teste actuellement le prochain etaHEN 2.0B, et bonne nouvelle il lance un test public de cette nouvelle version. Ainsi si vous souhaitez y participer il faut accéder au serveur discord PKG-Zone.\n \nDans cette nouvelle version d'etaHEN 2.0B (pour Bêta) il a introduit des nouvelles fonctionnalités liés aux code des triches, un nouveau système est en effet pris en charge, avec notamment la gestion des formats MC4, JSON et SHN. Il en a profité aussi pour mettre à jour la toolbox, l'objectif étant de limiter les problèmes de freezes. \n \n \n\n \n \nSi cela vous intéresse c'est par ici : Discord.com\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202849/in-ps4sp5-lightningmods-commence-les-tests-detahen-20-beta-1.png"
        }
    },
    "news_10": {
        "title": "[PS4/PS5] theflow0 récompensé une nouvelle fois avec 10 000 $",
        "content": "Nous venons d'apprendre que theflow0 a une nouvelle fois signalé un bug sur hackerone. L'information jusqu'alors l'information était restée secrète, ce qui nous met la puce à l'oreille, car le dépôt de cette faille remonte à environ 5 mois, et n'avait pas été divulguée. \n \nPlus besoin de rappeler qui est theflow0, mais si cette remontée de faille remonte à 5 mois, il se pourrait qu'il s'agisse du firmware 12.00 de la PS4 ou bien du firmware 24.06-10.00.00 de la PS5, les firmwares récents.\n \n \n\n \n \nCe bug a permis à theflow0 d'obtenir une récompense de 10 000 $, probablement un exploit kernel. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202793/in-ps4ps5-theflow0-recompense-une-nouvelle-fois-avec-10-000-1.png"
        }
    },
    "news_11": {
        "title": "[Switch] MigFlash et UnlockSwitch vous souhaitent une bonne année",
        "content": "Depuis quelques mois nous n'avons que très peu de nouvelles des teams MigFlash (ex Mig Switch) et UnlockSwitch, cependant les équipes sont toujours là et vous souhaitent une agréable année 2025. \n \nLa team MigFlash vient de proposer un nouveau post sur son site, tout d'abord elle souhaite une bonne année à toutes et tous, même si elle ne parle pas beaucoup elle travaille et elle annonce déjà des mises à jour pour 2025.\n \nElle annonce par ailleurs recevoir des centaines de demandes par e-mail pour convertir la MigCard v1 (le modèle sans commutateur) pour la passer en MigCard v2, celle qui dipose de l'interrupteur qui permet de passer d'un jeu à un autre. \n \nBien qu'elle dit ne pas recommander la modification, elle donne tout de même le lien vers le guide qui permet de le faire, et ainsi modifier la MigCard. Malheureusement ce lien ne semble pas accessible, ou bloquer derrière un proxy russe. \n \n \n\n \n \nDe son côté la team UnlockSwitch elle aussi vous souhaite une excellente année 2025, elle informe qu'elle n'a rien publié, ce qui est il faut le reconnaitre assez étrange, mais elle a dévoilé une vidéo de packaging. \n \n \n\n \n \nMaintenant que la Switch 2 est annoncée avec la rétrocompatibilité avec la Switch première version, il est possible que ce genre de solution soit fonctionnelle sur la Switch 2, reste à voir si les jeux Switch 2 auront le même format que ceux de la Switch 1, il y a fort à parier que Nintendo ait revu sa copie niveau sécurité de la console. \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202787/in-switch-migflash-et-unlockswitch-vous-souhaitent-une-bonne-annee-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202787/in-switch-migflash-et-unlockswitch-vous-souhaitent-une-bonne-annee-2.png"
        }
    },
    "news_12": {
        "title": "[Switch] Sphaira v0.6.1 disponible",
        "content": "Le développeur TotalJustice propose déjà sa seconde mise à jour de 2025 de Sphaira, la solution de remplacement du hbmenu proposant des fonctionnalités inédites, avec notamment un explorateur de fichiers facilement accessible, une gestion des nxthèmes poussée, ou encore un mode \"appareil photo\" utilisant la caméra infrarouge du joy-con droit.\n \nLes changements dans cette version sont là encore assez nombreux, cela passe par l'optimisation du mode dock suite au correctif apporté par deko3d, par des correctifs sur des crashs et des leaks de mémoire, sur des bugs et autres petites mises à jour. \n \n \n\n \n \nChangelog : \n \n- Correction d'un leak de mémoire deko3d lors de l'utilisation du mode ancré.\n- Correction du crash du mode applet s'il est lancé avec un jeu qui utilise plusieurs services Audren. L'audio est actuellement désactivé en mode applet jusqu'à ce que j'écrive un pilote audio pour libpulsar.\n- Correction d'un crash dans l'option « restaurer hbmenu » où l'option ne se déclenchait pas si /hbmenu.nroelle n'existait pas.\n- ftpsrv mis à jour de 1.2.1 à 1.2.2\n- Correction d'un bug avec l'Appstore où si un champ n'était pas trouvé dans le repo.json, il était défini sur une valeur indésirable. Cela n'affectait que le tri via les téléchargements.\n- Ajout de nouvelles chaînes et mettre à jour ko.json, ja.json \n- Mise à jour es.json \n- Mise à jour pt.json \n- Mise à jour de la langue française\n- Correction de la faute de frappe \"descendant\"\n- Mise à jour du « de.json » avec les traductions manquantes\n \n \nTéléchargement : Sphaira v0.6.1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202754/in-switch-sphaira-v061-disponible-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS4/PS5] PS Remote Lua Loader v3.3 disponible",
        "content": "Le développeur Master-S propose une nouvelle version de PS Remote Lua Loader, qui désormais est estampillé 3.3. Comme vous le savez Remote Lua Loader est un script python déployé pour la PS4 et PS5 (et leur versions pro), permettant de charger des fichiers via l'utilisation de Lua dans les jeux construits autour du moteur Artemis. \n \nLe point d'entrée étant un jeu, ce loader ne dépend pas de la version du firmware installée, et fonctionne donc sur tous les firmwares, il a ainsi été testé avec succès sur le dernier firmware de la PS5 et de la PS5 Pro, pareil pour la PS4 et PS4 Pro. \n \n \n\n \n \nDans cette version 3.3, le développeur a apporté une correction et a permet de dump la libkernel de base. \n \n \nTéléchargement : PS Remote Lua Loader v3.3\n \n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202735/in-ps4ps5-ps-remote-lua-loader-v33-disponible-1.jpg"
        }
    },
    "news_14": {
        "title": "[PS5] BD-J UMTX HEN de John Tornblom disponible",
        "content": "Le développeur John Tornblom continue de marquer l'histoire BD-J de la PS5, il propose BD-J UMTX HEN, il s'agit ni plus ni moins d'un Xlet BD-J qui permet l'exécution des payloads ELF sur les consoles PS5 exécutant les firmwares 3.00 à 4.51.\n \nLe Xlet utilise une vulnérabilité d'escalade de privilèges découverte par theflow , qui a ensuite été reproduite pour la PS4 par sleirsgoevy . Pour échapper au sandbox Java, le Xlet utilise cette vulnérabilité pour désactiver le gestionnaire de sécurité à l'aide d'une technique découverte par sleirsgoevy.\n \n \n\n \n \nLe Xlet doit être gravé sur un disque Blu-ray et comprend un certain nombre de payloads, par exemple un serveur FTP et un serveur Telnet. Si votre PS5 est connectée à Internet, ces payloads peuvent être téléchargées directement depuis le Web, ce qui vous évite d'avoir à graver un nouveau disque lorsque les payloads sont mis à jour.\n \n \nTéléchargement : bdj-umtx-hen.iso\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202732/in-ps5-bd-j-umtx-hen-de-john-tornblom-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[Switch 2] Nintendo annonce enfin la Switch 2 !",
        "content": "Ah la voilà enfin officiellement, Nintendo vient d'annoncer officiellement la Nintendo Switch 2. \n \nLa console est donc plus grande, elle permet de jouer aux jeux physiques et numériques de la première Switch, Nintendo précisant que certains titres ne pourraient pas être compatibles. Tous les leaks qui ont eu lieu récemment se révèlent être exact, il est fort à parier que les spécifications récentes découvertes soient également justes. \n \n \n\n \n \nL'écran qui passe donc d'un 7 pouces à un 8 pouces, un nouveau port USB-C, un port arrière en forme de U, les nouveaux joy-con magnétiques qui auront des fonctions souris avec l'infrarouge, le nouveau bouton sur le joy-con droit.  \n \n \n\n \n\n \n \n\n \n \n \nNintendo annonce un Nintendo Direct pour le 02 Avril 2025, la date, les spécifications et le prix pourraient alors être annoncés à ce moment là, et du 04 au 06 avril 2025, au grand palais à Paris, il y a des possibilités d'essayer la console. \n \n \n \n\n \n \n \nOn découvre sur les images, un teaser du prochain Mario Kart, probablement Mario Kart 9,  et des images de Mario Wonder, même s'il s'agit de la version Switch première du nom. \n \nTout est là : nintendo.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202691/in-switch-2-nintendo-annonce-enfin-la-switch-2-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202691/in-switch-2-nintendo-annonce-enfin-la-switch-2-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1202691/in-switch-2-nintendo-annonce-enfin-la-switch-2-2.png",
            "image_4": "https://www.logic-sunrise.com/images/news/1202691/in-switch-2-nintendo-annonce-enfin-la-switch-2-3.png"
        }
    },
    "news_16": {
        "title": "[Multi] Un avocat de Nintendo explique qu'un émulateur n'est pas illégal mais...",
        "content": " \nLors d'une conférence organisée par l'association japonaise du droit d'auteur pour les logiciels informatiques, certains avocats se sont réunis pour discuter des fondements de certains brevets et autorisations. L'événement « Tokyo eSports Festa » s'est tenu pendant trois jours du 10 au 12 janvier dans les halls 1 et 2 du Tokyo Big Sight South . Le premier jour, la table ronde organisée sur la scène principale était « Table ronde de l'ACCS sur l'importance des droits de propriété intellectuelle dans l'industrie du jeu » .\n \n \n\n \n \nBien que réunissant notamment les dirigeants de propriété intellectuelle d'entreprise telle que Sega, Capcom, ou encore Konami, une autre personne, répondant au nom de Koji Nishiura, directeur général du département de propriété intellectuelle de Nintendo, a répondu a quelques questions intéressantes. \n \nKoji Nishiura a expliqué que même si les émulateurs eux-mêmes ne sont pas illégaux par définition, ils peuvent le devenir s'ils fonctionnent d'une manière qui porte atteinte aux droits d'une entreprise.\n \n \n \n\n \n \n \n \nPour commencer, les émulateurs sont-ils illégaux ou non ?\n \n\" Koji Nishiura a répondu : C'est un point souvent débattu. Bien qu'on ne puisse pas immédiatement affirmer qu'un émulateur est illégal en soi, il peut le devenir en fonction de la manière dont il est utilisé.\" \n \nSelon lui \" si un émulateur qui imite un appareil de jeu peut être légal sur papier, si l'émulateur copie également un programme appartenant à cet appareil, cela peut constituer une violation du droit d'auteur. Si l'émulateur désactive également les mesures de sécurité comme le cryptage, cela pourrait également être considéré comme illégal. \"\n \nCela vaut pour d'autres méthodes telles que les linkers, citant l'utilisation des linkers Nintendo DS (comme la R4) qui contournent la sécurité en imitant un jeu DS légitime. \n \nIl a souligné que Nintendo et plus de 50 autres fabricants de logiciels ont intenté une action en justice conjointe contre les vendeurs de linkers et ont obtenu un jugement selon lequel ils violaient la loi japonaise sur la prévention de la concurrence déloyale. \n \nA juste titre, selon Nishiura, si un émulateur relie les utilisateurs à des ressources où des jeux piratés peuvent être téléchargés, cela est également considéré comme une violation du droit d'auteur. On se souvient tous de la lutte de Nintendo pour stoper la propagation des émulateurs Yuzu et Ryujinx à grands coups de DMCA. \n \nLa suppression de l'émulateur Yuzu, suite à un retrait DMCA sur Github, a entraîné la suppression de plus de 8 500 référentiels contenant un ou des versions de l'émulateur. \n \n \n\n \n \nNintendo a pris pour exemple également la propriété intellectuelle sur la manette de la Switch, le Joy-Con, de nombreuses imitations sont apparues avec des formes et des boutons différents. Concernant le design du Joy-Con, Nintendo a déposé le design original ainsi que quelques variantes.\n \nLes droits de conception peuvent être utilisés pour des produits contrefaits de forme similaire , mais il est difficile de les appliquer pour des produits contrefaits dont la forme est très différente. Les droits de brevet, qui protègent les conceptions techniques, éliminent toutes ces variations de conception comme rappelle Nintendo. \n \n \nSi l'article vous intéresse c'est par ici et c'est très instructif : news.denfaminicogamer.jp\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202690/in-multi-un-avocat-de-nintendo-explique-quun-emulateur-nest-pas-illegal-mais-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1202690/in-multi-un-avocat-de-nintendo-explique-quun-emulateur-nest-pas-illegal-mais-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1202690/in-multi-un-avocat-de-nintendo-explique-quun-emulateur-nest-pas-illegal-mais-3.png"
        }
    },
    "news_17": {
        "title": "[WiiU] Cemu Graphics Packs v930 disponible",
        "content": "Pour ceux qui profitent de l'émulateur Wii U Cemu, il est possible de profiter de packs graphiques qui améliorent, selon la configuration de votre Pc, la restitution et l'affichage de la console de Nintendo. \n \nCe pack graphique communautaire permet la mise à l'échelle, de modifier et d'améliorer la plupart des jeux Wii U et leur fonctionnement sous Cemu. \n \n \n\n \n \nChangelog v930 :\n \n- Améliorations des pièges de Skylanders\n- Correction d'un crash dans le mod Arts\n- Pack de résolution pour Transformers Prime\n \n \n \nTéléchargement : Cemu Graphics Packs v930\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202647/in-wiiu-cemu-graphics-packs-v930-disponible-1.png"
        }
    },
    "news_18": {
        "title": "[2DS/3DS/WiiU] Nintendo recommande de ne pas utiliser Pretendo sur Wii U",
        "content": "Nintendo vient de laisser un message sur X en demandant aux utilisateurs de Wii U de ne pas utiliser les services de Pretendo, le service de substitution pour le jeu en ligne pour la Nintendo Wii U et pour la Nintendo 3DS. \n \nLe géant japonais explique que sur le réseau social X ce service Pretendo non officiel peut présenter \"des risques de sécurité inattendus\", le revers de la médaille est que Nintendo a arrêté les services en ligne pour la 3DS et la Wii U le 09 Avril 2024, cette solution alternative ne concurrence en rien la proposition de Nintendo qui n'existe plus du tout. \n \n \n\n \n \nBien entendu, il reste possible que Nintendo puisse bannir les consoles utilisant ce type de service, un peu comme Wimmmfi pour la Wii, mais cela reste dommage que Nintendo commence à s'attaquer à ces services qui ne viennent que proposer une alternative à ce qui n'est plus dans l'offre. \n \nIl n'empêche que ce type de services s'appuient nécessairement sur des failles de la console ou du navigateur, mais c'est surtout face à des problématiques comme ENLBufferPwn que Nintendo tente de justifier la non utilisation d'homebrews, rappelons simplement que maintenir les serveurs et les services en ligne engendrent des coûts importants que Nintendo ne souhaite plus assumer. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202644/in-2ds3dswiiu-nintendo-recommande-de-ne-pas-utiliser-pretendo-sur-wii-u-1.jpg"
        }
    },
    "news_19": {
        "title": "[PS5] PS5 Edit Profile v1.5 disponible",
        "content": "Le développeur Master-s propose un nouvel outil pour la PS5, il s'agit de PS5 Edit Profile qui après avoir été proposé en v1.0 il y a quelques jours a rapidement évolué vers la version 1.4.\n \nComme son nom l'indique il s'agit d'un programme qui permet d'éditer le profil de votre PS5 afin d'y ajouter de la personnalisation, comme changer l'icône, des profils par défaut, des avatars.\n \n \n\n \n \nLa version 1.4 introduit des avatars, le profil hors-ligne, et vous pouvez changer le nom. De nombreux profils et avatars sont intégrés comme ceux de DragonBallZKakarot, TheWitcher3WildHunt, Assassin's Creed, Read Dead Redemption 2, CrashBandicoot 4, ForHonor\n \nedit 17.01.2025\n \nTéléchargement : PS5 Edit Profile v1.5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202636/in-ps5-ps5-edit-profile-v14-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[Switch] Sudachi 1.0.12 disponible",
        "content": "Sudachi est un émulateur Nintendo Switch pour Android, Linux, macOS et Windows écrit en C++ et basé sur Yuzu. Bien qu'il soit sous le retrait DMCA, le développement de Sudachi continue, le développeur Jarrod Norwell ne semble pas se soucier des injonctions de Nintendo et propose une mise à jour de son émulateur qui a la spécificité d'être proposé sur Windows, MacOS et Android, même si toutes les versions ne se suivent pas au même moment. \n \nLes versions Linux dt Windows ont été revues et corrigé notamment en ajoutant le support de Donkey Kong Country Returns HD, mais cette version ajoute aussi un correctif audio du firmware 19.0.0.\n \n \n\n \n \n \n \nChangelog : \n \n \nLinux\n \n- Ajout de la prise en charge de Donkey Kong Country™ Returns HD\n \n- Suppression des changements audio cassés de la version 19.0.0+.\n \nWindows\n \n- Ajout de la prise en charge de Donkey Kong Country™ Returns HD\n \n- Suppression des modifications audio de la version 19.0.0 et suivantes.\n \n \nTéléchargement : https://sudachi.emuplace.app/\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202635/in-switch-sudachi-1012-disponible-1.png"
        }
    }
}