{
    "news_1": {
        "title": "[PS4] PS4-Xplorer et PS4 Temperature teasés pour le firmware 11.00",
        "content": " \nLe développeur Lapy est de retour, il dévoile en effet que le firmware 11.00 va pouvoir bientôt bénéficier de PS4-Xplorer 2.0, il s'agirait de la version 2.03 même si cela reste encore à confirmer. \n \n \n\n \n \nCe sont une vidéo mais aussi quelques images qui prouvent la chose, pour y parvenir il faut bien entendu ouvrir les accès root sur le firmware 11.00 et ainsi pouvoir lancer le programme.\n \n \n\n \n\n \n\n \n \nBien entendu, nombreux sont ceux qui demandent le lien, mais pour l'heure rien n'est disponible car Lapy n'a pas encore lâché les programmes, que ce soit PS4-Xplorer ou PS4 Temperature, seuls quelques testeurs y ont eu droit. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190776/in-ps4-ps4-xplorer-et-ps4-temperature-teases-pour-le-firmware-1100-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1190776/in-ps4-ps4-xplorer-et-ps4-temperature-teases-pour-le-firmware-1100-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1190776/in-ps4-ps4-xplorer-et-ps4-temperature-teases-pour-le-firmware-1100-3.jpg"
        }
    },
    "news_2": {
        "title": "[PS4] PPPwnUI version 2.0 disponible et s'améliore encore",
        "content": " \nPPPwnUI est un programme qui ajoute une interface utilisateur (UI) à l’exploit PPPwn créé par TheFlow. Cette interface graphique proposée par Memz a largement été améliorée ces derniers jours, notamment avec les ajouts récents qui ont été effectués. De plus l'outil a été mis à jour aussi pour intégrer le support de goldHEN 2.4b17 de SiSTR0.\n \n \n \n\n \n \nChangelog :\n \n- Modification de la disposition de l'interface graphique, des étiquettes et du style des boutons\n- Correction du script py pour le firmware 9.60\n- Ajout de scripts manquants pour les firmwares 10.50, 10.70, et 10.71\n- Vérifie l'interface réseau avant de démarrer\n \n \nTéléchargement : PPPwnUI version 2.0\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190756/in-ps4-pppwnui-version-20-disponible-et-sameliore-encore-1.png"
        }
    },
    "news_3": {
        "title": "[PS4] PS4 Wee Tools PRO disponible en v1.0.1 pour PS4 et bientôt pour PS5",
        "content": " \nPS4 Wee Tools PRO 1.0.1 est une version améliorée de l’application PS4 Wee Tools, développée par Andy Man, et proposée contre un café. \n \nComme vous le savez PS4 Wee Tools dans sa version standard est une application open source gratuite qui facilite le travail avec les dumps NOR (sflash) et syscon de la PS4. Écrit en Python pour rester simple, il a été développé en s'appuyant sur Python 3.8.\n \n \n\n \n \nFonctionnalités :\n \n- Comparaison de fichiers multiples.\n- Outil NOR pour afficher des informations sur les dumps NOR de la PS41.\n- Dépendances: Aucune dépendance particulière.\n \nPS4 Wee Tools PRO (version améliorée, réservée aux donateurs/contributeurs):\n \nFonctions supplémentaires : \n \n- Patcher NOR pour la Southbridge.\n- Patcher NOR pour le module Torus (WiFi+BT).\n- Analyse et récupération des partitions NOR.\n- Modes Quick/Expert pour la récupération des partitions NOR.\n- Activation/désactivation du slot flag\n- Patcher SCFlasher pour une suppression sûre du syscon.\n- Nettoyage complet du syscon.\n- Correction de bugs pour la méthode B du syscon.\n- Patch manuel du syscon avec flatdata.\n- Affichage du compteur de lignes.\n- Optimisation du code et corrections de bugs\n \nEn résumé, PS4 Wee Tools PRO offre des fonctionnalités supplémentaires par rapport à la version standard, mais elle est réservée aux donateurs et contributeurs. Si vous avez besoin d’outils pour travailler avec les dumps NOR et syscon de votre PS4, il est donc conseillé d'utiliser cette version plus complète. \n \nA noter qu'une version PS5 est aussi en cours de développement, elle permettra d'en savoir plus sur les erreurs EMC, de connaitre à quoi correspondent justement ces erreurs, et aussi de patcher des nouvelles NOR. \n \n \n\n \n\nChangelog\nv1.0.1\n* Syscon Rebuilder modes\n* Spanish Language\n* Russian Language\n \nv1.0.0b\n* [new] Syscon auto-patch E\n* [new] Syscon FW recovery\n* [new] Stock syscon flasher (rl78flash)\n* [new] Syscon NVS viewer\n* [new] Decrypted PUP unpacker\n* [new] 11.50 support\n* [new] Rename to canonical name\n* [new] Syscon boot/mode select\n* [upd] Syscon flasher 2.02\n* [upd] Syscon flat data viewer\n* [upd] Code optimization\n* [fix] Syscon boot modes select\n* [fix] Syscon rebuilder (factory reset)\n \n \n\n \n\n \nTéléchargement : PS4 Wee Tools PRO 1.0.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190755/in-ps4-ps4-wee-tools-pro-disponible-en-v101-pour-ps4-et-bientot-pour-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1190755/in-ps4-ps4-wee-tools-pro-disponible-en-v101-pour-ps4-et-bientot-pour-ps5-2.png"
        }
    },
    "news_4": {
        "title": "[PS4] PS Multi Tools 14.1.1 disponible",
        "content": " \nPS Multi Tools, développé par SvenGDK, est maintenant disponible en version v14.1.1 et il intègre un nouveau “updater” complet ainsi que la nouvelle interface graphique PPPwn pour la PS4. Comme vous le savez, PS Multi Tools est un gestionnaire de sauvegardes pour PS1, PS2, PSX, PS3, PS4, PS5 (versions ultérieures), PSP et PS Vita, mais cette nouvelle version vient modifier uniquement des éléments pour la PS4 compte tenu des dernières évolutions liés à PPPwn. \n \n \n\n \n \nVoici les nouveautés de cette version:\n \n- Nouvel “updater” complet: Cet outil met à jour PS Multi Tools entièrement et peut également ajouter de nouveaux fichiers manquants au besoin pour les nouveaux outils dans la PSMT-Library.\nPPPwn GUI pour PS4: Cette nouvelle interface graphique facilite l’utilisation des outils sur la PS4.\nAméliorations générales: La mise à jour v14.1 apporte également des ajustements.\nPS4:\n- Mise à jour de l'interface graphique de PPPwn pour PS4\n- Mise à jour de pppwn.exe avec les derniers changements\n- Ajout des nouveaux fichiers 9.00 + 11.00 stage1 & stage2 de SiSTR0\n- Ajout des fichiers les plus récents et mis à jour 9.00 + 11.00 GoldHEN 2.4b17 de SiSTR0\n- Ajout d'un nouveau bouton pour copier goldhen.bin à la racine de l'USB\n \n \n \nTéléchargement : PS Multi Tools 14.1.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190701/in-ps4-ps-multi-tools-1411-disponible-1.png"
        }
    },
    "news_5": {
        "title": "[PS4] Stooged dévoile PI-Pwn pour les Raspberry Pi",
        "content": "Stooged a publié un projet intéressant pour les utilisateurs de Raspberry Pi : PI-Pwn. Ce script permet de configurer un environnement pour exécuter l’exploit GoldHen sur une PlayStation 4 (PS4) sous le firmware 11.0. \n \nVoici comment l’utiliser :\n \nPréparation du Raspberry Pi :\n \n- Installez Raspberry Pi OS Lite sur une carte SD.\n- Copiez le dossier PPPwn sur la carte SD.\n- Insérez la carte SD dans le Raspberry Pi.\n- Exécutez les commandes suivantes :\n \nsudo chmod 777 /boot/firmware/PPPwn/install.sh\nsudo bash /boot/firmware/PPPwn/install.sh\n \n- Une fois le Raspberry Pi redémarré, PPPwn s’exécutera automatiquement.\n \n \nConfiguration de la PS4 :\n \n- Allez dans les paramètres de la PS4, puis dans la section Réseau.\n- Sélectionnez Configurer la connexion Internet et choisissez Utiliser un câble LAN.\n- Optez pour la configuration Personnalisée et sélectionnez PPPoE pour les paramètres d’adresse IP.\n- Entrez n’importe quoi pour l’identifiant PPPoE et le mot de passe PPPoE.\n- Choisissez Automatique pour les paramètres DNS et MTU.\n- Sélectionnez Ne pas utiliser pour le serveur proxy.\n- Pour GoldHen, placez le fichier goldhen.bin à la racine d’une clé USB et branchez-la à la console.\n \n \n \n\n \n \n \nPwn automatique :\n \n- Connectez le Raspberry Pi à la PS4 via un câble Ethernet.\n- Le Raspberry Pi tentera automatiquement d’exploiter la console.\n- L’exploit peut échouer plusieurs fois, mais le Raspberry Pi continuera à purger la console jusqu’à réussir.\n- Une fois l’exploit réussi, le Raspberry Pi s’éteindra.\n \nL’idée est de démarrer la console et le Raspberry Pi ensemble, et le Raspberry Pi continuera à essayer de lancer l'exploit sur la console sans intervention de votre part. Attendez simplement sur l’écran d’accueil jusqu’à ce que PPPwn réussisse. Vous pouvez également personnaliser les scripts en modifiant le contenu de la carte SD sur votre ordinateur.\n \n \nTéléchargement : stooged/PI-Pwn\n \n \n",
        "images": {}
    },
    "news_6": {
        "title": "[PS4] TheFlow a modifié le code de l'exploit pour augmenter son taux de réussite",
        "content": " \nLe développeur TheFlow tente toujours d'améliorer l'exploit PPPwn, il dévoile en effet une nouvelle version du code, l'idée est permet à l'exploit d'ignorer le premier PADI lors du jailbreak afin d'augmenter le taux de réussite. \n \nLe code implémenté dans le script Python a été modifié avec notamment des optimisations sur ppp_negotation, lié à la gestion des négociations PPPoE, afin d'ignorer volontairement certaines demandes PPPoE. \n \n \n\n \n \nL'objectif de cette modification permet d'augmenter le nomre de paramètres, en rajoutant ignore_initial_req et une nouvelle logique pour ignorer les demandes initiales afin d'optimiser le processus PPP. \n \nCe sont des tests plus poussés sur le firmware 10.50 qui ont permis d'établir que les 6 premières requêtes PPPoE peuvent poser problème, il suffit donc d'ignorer ces 6 premières requêtes pour augmenter le taux de réussite sur ce firmware. \n \nTout est là : Ignore first PADI\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190638/in-ps4-theflow-a-modifie-le-code-de-lexploit-pour-augmenter-son-taux-de-reussite-1.png"
        }
    },
    "news_7": {
        "title": "[PS4] Le payload GoldHEN v2.4b17 est disponible (9.00 et 11.00)",
        "content": " \nGoldHEN est un Homebrew ENabler pour la PS4 sous forme de payload, qui permet aux utilisateurs de débloquer certaines fonctionnalités et d’exécuter des homebrews sur leur console. \n\n \nCe chargeur ne prend en charge que les payloads ayant un point d'entrée dans le kernel.\nLa version personnalisée de stage recherche d'abord le payload dans le répertoire racine de la clé USB, et si il est trouvée, il est copié sur le disque dur interne à ce chemin : /data/GoldHEN/payloads/goldhen.bin. Le payload interne est alors chargé et n'est plus nécessaire sur le lecteur USB externe.\n \nPour l'instant, seules les versions 9.00 et 11.00 du firmware sont prises en charge. Bientôt, les versions 10.00/10.01 seront également prises en charge.\n \n \n\n \n \nVoici les détails de la dernière version Version 2.4b17 :\n \n- Ajout de la prise en charge des payloads ayant un point d'entrée\n- Prise en charge du firmware 11.00 et 9.00\n- Ajout du syscal 11.\n- Problème connu : après l’utilisation de pppwn, le serveur klog n’est pas immédiatement accessible. Une reprise en mode repos est nécessaire pour le faire fonctionner. \n \nComme toujours, il est important de noter que ceci est une version bêta, et malgré les vérifications minutieuses effectuées par le développeur et les testeurs, il est possible que des bugs apparaissent. Si vous en trouvez, n’hésitez pas à les signaler sur le serveur Discord dédié.\n \nComme il est important de soutenir le développeur, il est possible de lui offrir un café ici : https://ko-fi.com/sistro\n \n \nTéléchargement : GoldHEN v2.4b17 v1.00\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190614/in-ps4-le-payload-goldhen-v24b17-est-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1190614/in-ps4-le-payload-goldhen-v24b17-est-disponible-1.jpg"
        }
    },
    "news_8": {
        "title": "[Switch] UnlockSwitch annonce vouloir publier 2 versions d'UnlockSwitch",
        "content": "Cela fait quelques jours que nous n'avions plus de nouvelles de la Team UnlockSwitch, dans un premier temps l'équipe a communiqué sur le fait qu'elle souhaitait laisser tout le monde profiter des mouvements sur la PlayStation 4 avec PPPwn, mais dans une seconde communication elle informe qu'elle a pris la décision de rendre disponible deux versions de l'UnlockSwitch.\n \nLa première sera notre version finale open source avec nos deux nouveaux chipsets. Toute notre énergie sera concentrée sur cette version, les mises à jour, etc.\n \n \n\n \n \nLa deuxième version sera basée sur les chipsets ice40/esp32s avec son programmateur également. Au moment où les fichiers seront divulgués en ligne, le matériel sera déjà disponible. \n \nElle tient à rappeler que le seul et unique compte est celui du Télégram officiel et que les informations seront publiées en même temps sur Twitter (X) :  https://t.me/unlockswitch\n \n \nQuoi penser de cette information de la commercialisation de deux versions ? \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190592/in-switch-unlockswitch-annonce-vouloir-publier-2-versions-dunlockswitch-1.jpg"
        }
    },
    "news_9": {
        "title": "[PS4] Sistr0 tease GoldHEN sur le firmware 11.00",
        "content": " \nGoldHEN, développé par Sistr0, est un Homebrew ENabler pour la PS4. Il permet aux utilisateurs de débloquer certaines fonctionnalités et d’exécuter des homebrews sur leur console. Récemment, SistrO a annoncé que GoldHEN serait bientôt disponible pour le firmware 11.00. Cela marque une étape importante vers la création d’une solution de jailbreak complète pour cette version spécifique du firmware, et bien entendu pour tous les autres firmwares inférieurs. \n \n \n\n \n \nVoici quelques détails sur GoldHEN et son évolution :\n \nComme vous le savez PPPwn est une chaîne de jailbreak pour la PS4, publiée par TheFloW. Elle repose sur une vulnérabilité publique étonnamment ancienne dans l’un des pilotes réseau FreeBSD (sppp). Cette vulnérabilité n’a apparemment jamais été corrigée pour la PS4, ou a été incorrectement réintroduite à un moment donné.\n \nPPPwn est confirmé pour fonctionner jusqu’au firmware 11.00, avec des implémentations existantes disponibles pour les firmwares de 7.50 à 11.00 inclus.  Le firmware PS4 11.00 sera le premier à recevoir GoldHEN, après cela ce sera 10.x mais pas de date de disponibilité d'annoncée. (source SiStro).\n \nCertaines personnes sont bloquées sur un firmware donné et ne peuvent pas mettre à jour leur console en raison du problème “NoBD” : leur PS4 est considérée comme “NoBD” si le lecteur BluRay est manquant ou endommagé.\nGoldHEN est en train de progresser et est testé par quelques personnes de confiance. Michael Crump a partagé une vidéo montrant GoldHEN en cours d’exécution sur le firmware 11.00. \n \n \n\n \n \n \nIl est probable que cette nouvelle version soit proposée contre un café dans quelques jours. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190587/in-ps4-sistro-tease-goldhen-sur-le-firmware-1100-1.jpg"
        }
    },
    "news_10": {
        "title": "[WiiU] Aroma 19 disponible",
        "content": " \nAroma, développé par Maschell, est un environnement de hack pour la Wii U. Récemment, Maschell a mis à jour Aroma avec les versions 17 et 18, apportant des améliorations significatives pour les utilisateurs de Nintendo Wii U. \n \nAroma qui est l'environnement homebrew pour la Wii U, évolue une nouvelle fois avec de nouvelles options et corrections dans ses deux versions successives. \n \n \n\n \n \n \nVoici les détails sur ces mises à jour :\n \nAroma Beta 17 (6 mai 2024) :\n \n- Recompilation de presque tout avec les dernières versions de wut, devkitppc, wums/wups.\n- Refonte de l’EnvironmentLoader et du CustomRPXLoader pour initialiser le module WUMS plus tôt, permettant ainsi l’accès à tous les modules/plugins dans d’autres modules de configuration.\n- Ajout d’une option pour bloquer/débloquer les mises à jour depuis le sélecteur de démarrage ou l’écran d’avertissement de blocage de mise à jour.\n- Regroupement de l’installateur de chargeur de payload avec Aroma.\n- Possibilité d’utiliser l’application Health & Safety.\n- Amélioration des performances du pilote Cafe OS FAT32 pour les commandes readdir et stat.\n- Réécriture de l’API de configuration et de stockage (les plugins existants sont toujours compatibles).\n- Nouveau menu de configuration pour les plugins avec prise en charge des catégories imbriquées.\n- Notifications d’erreur lors de l’échec du chargement des plugins.\n- Détection automatique des configurations corrompues et suppression.\n- Amélioration de la détection des combinaisons de boutons dans le PayloadLoaderPayload.\n- Correction du lancement des paramètres de démarrage rapide depuis le menu de démarrage rapide.\n- Support initial pour le chargement d’applications homebrew depuis le menu de démarrage rapide1.\n \nAroma Beta 18 (07 mai 2024) :\n \n- Correction de chargement de Nanddumper via le PayloadLoaderPayload. \n- Les plugins dans le menu de configuration seront désormais triés par nom.\n \n \nTéléchargement : Aroma 18 Bêta\n \nEdit 09.05.2024 : version 19 disponible. \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190585/in-wiiu-aroma-18-disponible-1.jpg"
        }
    },
    "news_11": {
        "title": "[PS4/PS5] PPPwn c++ en développement",
        "content": " \n \nPPPwn_cpp est un nouveau projet, il s’agit d’un réécriture en C++ de PPPwn. Malheureusement, il n’y a pas encore de versions publiées, mais vous pouvez suivre le développement sur GitHub. PPPwn est un exploit d’exécution de code à distance du noyau pour la PlayStation 4 jusqu’à la version 11.00 du firmware. Cependant, cette version C++ ne semble pas encore avoir de versions officielles publiées, uniquement des nightly.\n \n \n\n \n \n \n \nS'agissant de versions de développement pour le moment il n'est pas recommandé de l'utiliser au quotidien, il fait face à un taux d'échec bien trop important notamment sur les deux premières étapes du lancement de l'exploit, mais aussi à des problèmes liés à des vitesses d'exécution du C++ et du Python. Les utilisateurs Windows devront installer npcap. \n \nL'idée de ce projet est de pouvoir porté PPPwn sur de petits appareils comme des routeurs par exemple. \n \n \nTout est là : PPPwn_cpp\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190581/in-ps4ps5-pppwn-c-en-developpement-1.png"
        }
    },
    "news_12": {
        "title": "[PS4] L'outil PS4 Wee Tools prend en charge le dernier firmware de la PS4",
        "content": " \nLe développeur Andy_Man vient de dévoiler une nouvelle version de son outil PS4 Wee Tools qui est maintenant proposé en v0.9.9. L'outil prenant forme de script Python permet de manipuler la mémoire NOR et le Syscon d'une PS4 avec les bons outils hardware, il est assez proche de ce que permettent PS4-NOR-Validator et Syscon-Patcher de BwE, mais en étant une alternative gratuite et open-source. \n \nCette nouvelle version permet le support de la toute dernière mise à jour système officielle disponible à savoir le firmware 11.50 pour la PS4, mais aussi des correctifs Visual Studio, et entre autre de contrôle MBR. \n \n \n\n \n \nVoici les nouveautés de cette version 0.9.9 :\n \n- Support du firmware 11.02 et 11.50 : Cette mise à jour prend en charge le dernier firmware de la PS4.\n- Récupération des zones NVS : Vous pouvez désormais récupérer des informations à partir des zones NVS.\n- Informations supplémentaires pour la validation : La version 0.9.9 fournit plus d’informations pour la validation.\n- Optimisation du langage : Le développeur a amélioré l’optimisation du langage dans cette version.\n- Corrections de bugs et mises à jour des ressources : Comme toujours, des corrections de bugs ont été apportées et les ressources ont été mises à jour.\n \nCette version est disponible uniquement via un café sur Ko-fi, le github lui n'intègre que la version précédente à savoir la mouture 0.9.5.\n \nTéléchargement : PS4 Wee Tools 0.9.9\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190526/in-ps4-loutil-ps4-wee-tools-prend-en-charge-le-dernier-firmware-de-la-ps4-1.png"
        }
    },
    "news_13": {
        "title": "[Multi] PS Multi Tools s'adapte à PPPwn avec la disponibilité de la v14.1",
        "content": " \nPS Multi Tools v14.1 est maintenant disponible et intègre un nouveau “updater” complet ainsi que la nouvelle interface graphique PPPwn pour la PS4. Comme vous le savez  PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \n \n\n \n \nVoici les nouveautés de cette version :\n \n- Nouvel “updater” complet : Cet outil met à jour PS Multi Tools entièrement et peut également ajouter de nouveaux fichiers manquants au besoin pour les nouveaux outils dans la PSMT-Library.\n- PPPwn GUI pour PS4 : Cette nouvelle interface graphique facilite l’utilisation des outils sur la PS4.\n- Améliorations générales : La mise à jour v14.1 apporte également des ajustement\n \nPS4 :\n- Ajout des fichiers PPPwn\n- Ajout d'une nouvelle interface graphique PPPwn pour PS4 (Tools -> PPPwner)\n- Ajout de nouveaux téléchargements PS4 : Firmware système et de récupération pour 11.00\n- Ajout d'un téléchargement PS4 manquant : GoldHEN v2.3\n \nPS5 :\n- Correction d'une faute de frappe dans les téléchargements PS5 : etaHEN v1.6B -> v1.7B\n \n \nTéléchargement : PS Multi Tools v14.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190525/in-multi-ps-multi-tools-sadapte-a-pppwn-avec-la-disponibilite-de-la-v141-1.png"
        }
    },
    "news_14": {
        "title": "[Switch] SysDVR 6.1 disponible avec les traductions",
        "content": " \nLa mise à jour SysDVR 6.1 est une refonte majeure du client, et bien que j’aie testé toutes les nouvelles fonctionnalités, il est possible que des bugs apparaissent, surtout sur les plateformes que le développeur n'a pas pu tester, mais cette nouvelle version apporte de nombreuses nouveautés. \n \nSysDVR 6.1 apporte les traductions de l'application et des paramètres, mais aussi de nombreuses optimisations liés à Android, sachant que désormais il faudra désormais disposer au minimum d'Android 8.\n \n \n\n \n\n \n \n \nRappel, les appareils ARM 64 bits ne sont pas supportés, et de nombreux crash ont été corrigés, tout cela se trouve dans le changelog. Pour rappel, SysDVR permet de streamer l'écran directement sur son PC via le wifi ou via un câble. A noter qu'il est possible d'utiliser SysDVR sur windows, Linux, Mac OS, et désormais Android. \n \n \nChangelog : \n \n- Prise en charge de la localisation. L'application client et paramètres peut maintenant être traduite.\n-- Cette version est livrée avec la prise en charge des langues suivantes : anglais, allemand, polonais, italien et chinois (simplifié)\n-- Si vous souhaitez contribuer à une traduction dans votre propre langue, contactez-nous dans le numéro concerné ou sur Discord\n- Ajout d'un contrôle du volume dans l'application pour les systèmes d'exploitation qui n'ont pas de mixeur de volume \n- Prise en charge de la désactivation de l'écran de la console pendant le streaming\n- Prend en charge davantage d'appareils Android, la version Android minimale requise est désormais Android 8. Nous ne prenons toujours en charge que les appareils Arm 64 bits.\n- Prise en charge de la navigation dans l'interface utilisateur du client avec une manette de jeu sur toutes les plateformes (sous réserve des limitations SDL)\n- Correction des paramètres de rotation ignorés sur Android \n- Correction du streaming réseau qui ne fonctionnait parfois pas lors de la sortie de la console du mode veille\n- Correction d'un crash rare qui se produisait après plusieurs heures de flux continu\n- Correction de la saisie du pavé tactile lors de l'utilisation de Samsung Dex\n- Autres corrections et ajustements mineurs\n \nTéléchargement : SysDVR 6.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190507/in-switch-sysdvr-61-disponible-avec-les-traductions-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1190507/in-switch-sysdvr-61-disponible-avec-les-traductions-2.png"
        }
    },
    "news_15": {
        "title": "[2DS/3DS] Homebrew Menu v2.4.3 disponible",
        "content": "La dernière version du 3DS Homebrew Menu, la v2.4.3, a été proposée par le développeur fincs. \n \nIl s'agit comme vous le savez de l'Homebrew Launcher (hbmenu), le gestionnaire développé à l'origine il y a quelques années par Smealum. Nous parlons ici du Homebrew Launcher qui permet de lancer les homebrews au format 3DSX. Là encore pour le lancer il faut soit un point d'entrée désormais d'un autre âge comme Ninjhax, hax 2.x ou soit Rosalina via Luma3DS. \n \nCette version inclut généralement des améliorations de performance et des corrections de bugs pour améliorer l’expérience utilisateur sur Nintendo 3DS. \n \n \n\n \n \n \nLa version précédente avait été proposée début Novembre 2023, soit il y a plus de 6 mois, cette nouvelle version 2.4.3 apporte des améliorations de stabilité et quelques changements, mais sans détail supplémentaire dans le changelog difficile d'être plus précis, peut être que cette sortie est indirectement liée à celle de Luma3D 13.1.\n \n \nTéléchargement : Homebrew Menu v2.4.3 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190488/in-2ds3ds-homebrew-menu-v243-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[PS4] PPPwn supporte le firmware 8.50 avec PPPwn GUI 1.3",
        "content": "Cela continue d'évoluer sur PPPwn avec désormais l'intégration du support du firmware 8.50. \n \nClairement, en dessous du firmware 9.00, il est recommandé d'utiliser les exploits existants, et de préférence pOOBs4, mais il reste intéressant de développer l'exploit pour améliorer la stabilité de certains firmwares peu utilisés comme l'a été le 8.50. \n \nD'une manière générale les firmwares 8.xx n'auront que peu été utilisés sur PS4, peu de titres intéressants, et le firmware 9.00 est venu canibalisé toute l'attention, donc les firmwares 8.00, 8.01, 8.03, 8.50 et 8.52 sont passés vite sur l'histoire de la console, contrairement aux 6.xx et 7.xx qui ont eu été plus exploités. \n \nDe fait, amener une stabilité accrue avec PPPwn a du sens, encore plus si vous ne pouvez mettre à jour votre console à cause d'un NoBD par exemple. \n \nL'utilisateur averti Modded Warfare a aussi développé PPPwn GUI, une interface graphique qui dispose de quelques outils pour exécuter l'exploit à partir de Windows.\n \n \n\n \n \nIl a rajouté des possibilités intéressantes dans sa version 1.3 : \n \n- Ajout de la prise en charge du firmware 8.50\n- Prend désormais en charge les machines 32 bits\n- Si aucun payload n'est sélectionné, le loader de Lightning Mods sera utilisé par défaut pour les firmwares 11.00 et 9.00.\n- Devrait vous inviter à installer npcap s'il n'est pas détecté\n- Quelques autres petites améliorations\n \n \nTéléchargement : pppwn_GUI_1.3\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190487/in-ps4-pppwn-supporte-le-firmware-850-avec-pppwn-gui-13-1.png"
        }
    },
    "news_17": {
        "title": "[3DS] Luma3DS v13.1 disponible",
        "content": "[3DS] Luma3DS v13.1 disponible\n \nLuma3DS vient d'être mis à jour, une bonne nouvelle pour ceux qui profitent encore de leur Nintendo 3DS. \n \nLe volume peut désormais être remplacé dans le menu Rosalina sous « Configuration du système » , bien que cela puisse entraîner un temps d'arrêt plus long de la 3DS; De plus, cette option n'est prise en charge que dans le logiciel 3DS. Le SSID est désormais également affiché dans le menu « Forcer la connexion wifi ».\n \nDans le menu de configuration (lorsque SELECT est maintenu enfoncé) le chainloader peut être appelé manuellement, l'option \"Autoriser les combos Gauche+Droite / Haut+Bas pour DSi\" a été supprimée car elle n'était pas utilisée et \"Activer les filtres d'upscaling personnalisés pour DSi\" a été ajouté dans le menu caché.\n \nDe plus, une erreur lors du démarrage des charges utiles Arm9 a été corrigée.\n \nLe lanceur 3DS Hombrew a également reçu une « mise à jour » ; Mais ici, seul le numéro de version a été augmenté.\n \n \n\n\n \n\n \n\n \nChangelog : \n \n- Add volume slider override\nCurrently, this option is located under \"System configuration\" in the Rosalina menu and autosaves, while being under [misc] in config.ini. This is because this option is only supported for NATIVE_FIRM. This may change in the future\nWhen using the option, the console might sometimes take longer to shutdown\n- Add explicit \"Boot chainloader\" entry, above \"Save and exit\" in the boot configuration menu\n- Remove unused and useless \"Allow Left+Right / Up+Down combos for DSi\" option\n- Hide \"Enable custom upscaling filters for DSi\" option\n- Fix an issue where baremetal screeninit would result in two white screens or wrong colors, usually when launching Arm9 payloads\n- Rosalina: display SSID in \"Force wifi connection\" menu\n- LayeredFS: improve game update RomFS mountpoint detection\n- Further improvements to overall system stability and other minor adjustments have been made to enhance the user experience\n- In addition, with thanks to @devkitPro, this release of Luma3DS comes bundled with version 2.4.3 of the Homebrew Menu, itself bundled with config/ssl/cacert.pem for use with libcurl.\n \n \n\n \n\n \nTéléchargement : Luma3DS v13.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190425/in-3ds-luma3ds-v131-disponible-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS4] UniversalMediaServer améliore la restitution H.264 sur la PS4",
        "content": "La dernière mise à jour de Universal Media Server, la version 13.10.1, a apporté plusieurs corrections importantes, comme toutes les versions proposées depuis des années, mais sans jamais apporter de modification pour nos consoles, jusqu'à aujourd'hui puisque Subjunk a mis à jour son programme pour la PS4.\n \n\nUniversal Media Server, connu aussi sous son nom court UMS, est un serveur multimédia DLNA qui permet de profiter de vos fichiers sur n'importe quel appareil de la maison, câblé en réseau. L'application est compatible avec la FreeBox HD, la PS3, Google Android, XBMC Media Server, les télévisions connectées Samsung, et la XboX 360 mais aussi avec les appareils DNLA comme la PS4 ou la Xbox One.\n \n\n \n\n \n \n Voici quelques points clés de cette version :\n \n- Correction de la transcodage pour les fichiers MP4 et WMV.\n- Amélioration de la détection des fichiers MKV sur certains appareils.\n- Correction de la détection de la variante Dolby Vision hvc1.\n- Correction d’un problème où FFmpeg ne remuxait pas correctement l’E-AC3 lorsqu’il était pris en charge.\n- Correction d’un bug où les vidéos étaient marquées à tort comme entièrement visionnées.\n- Cette version semble particulièrement axée sur l’amélioration de l’expérience utilisateur sur divers appareils, y compris les téléviseurs Samsung QLED et LG OLED, ainsi que la PlayStation 4. Cette version corrige la lecture de vidéos H.264 au-dessus du niveau 4.2 sur PS4. \n \nPour plus d’informations et pour télécharger la dernière version, vous pouvez visiter le site officiel de Universal Media Server, à noter que la fin des bugs connus de la v14, il est donc très probable que ce soit la dernière version de la v13. \n \nTéléchargement : UniveralMediaServer v13.10.1\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190424/in-ps4-universalmediaserver-ameliore-la-restitution-h264-sur-la-ps4-1.png"
        }
    },
    "news_19": {
        "title": "[PS3] La 8ème Bêta du CFW Evilnat 4.91.2 est là en PEX/D-PEX/CEX et DEX",
        "content": "Le développeur Nathan Martin a récemment dévoilé une nouvelle version bêta de son CFW Evilnat pour la PS3, la version 4.91.2 Beta 7, intègre toujours les fonctionnalités de Cobra 8.5.\n \nVoici quelques points clés de cette mise à jour :\n \n- Cobra mis à jour vers 8.5 : Cette mise à jour apporte des améliorations significatives aux fonctionnalités existantes.\n- Corrections de bugs : Des problèmes tels que des écrans noirs et des gels lors du lancement des ISO PS3/PSP/PSX ou encore lors de l’installation de PKG à partir de périphériques exFAT/NTFS externes ont été résolus.\n- Trophy Unlocker mis à jour : La version 1.1 du Trophy Unlocker est incluse, offrant plus de flexibilité aux utilisateurs.\n- Variantes [noBD] pour PEX et D-PEX : Des variantes spécifiques ont été créées pour ceux qui utilisent des configurations sans lecteur Blu-ray.\n \n \n \n\n \n \nCette mise à jour semble être bien accueillie par la communauté, avec des retours positifs sur les améliorations et la stabilité apportées par cette nouvelle version bêta. Il faut dire que le développeur a intégré une recompilation du kernel LV2 et du stage2 du Cobra. Ce n'est pas tout il a introduit aussi le support des casques Bluetooth tiers. \n \nLes versions PEX/D-PEX/CEX et DEX sont proposées, donc profitez en, attention ceci ne concerne que les PS3 qui sont compatibles avec les CFW. \n \n \nTéléchargement : CFW Evilnat 4.91.2 PEX/D-PEX/CEX et DEX\n \nEdit 05.05.24 : 8eme disponible  . \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190418/in-ps3-la-7eme-beta-du-cfw-evilnat-4912-est-la-en-pexd-pexcex-et-dex-1.jpg"
        }
    },
    "news_20": {
        "title": "[PS4] PPPwn porté sur les firmwares 9.03 à 11.00",
        "content": "Cela progresse rapidement, bien plus que si TheFlow n'avait rien publié en amont de la conférence TyPhoonCon et pour cause de nombreux développeurs se sont raccrochés et ont adopté PPPwn.\n \nTous les firmwares récents, qui ne disposaient jusqu'alors d'aucun exploit kernel sont désormais officiellement supportés par PPPwn. Ainsi les firmwares 9.00, 9.03, 9.04, 9.50, 9.60, 10.00, 10.01, 10.50, 10.70, 10.71, et 11.00  disposent tous de ce support.\n \n \n\n \n \nEncore plus fort, LightningMods a confirmé que le Payload Loader est compatible mais que pour le moment seul le offset du 9.00 ont été trouvé, comme ce firmware 9.00 est déjà hacké, il est facile de les identifier. GoldHEN lui aussi est compatible, et idem il faut le temps de trouver les offsets, et rendre parfaitement compatible l'outil.\n \nLa PS4 n'a pas encore dit son dernier mot, même s'il faut avouer que les titres se font de plus en plus rares malgré son énorme parc de 120 millions d'unités vendues. \n \nTout est là : \n \nhttps://github.com/TheOfficialFloW/PPPwn\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1190355/in-ps4-pppwn-porte-sur-les-firmwares-903-a-1100-1.png"
        }
    }
}