{
    "news_1": {
        "title": "[PS5] PS5 Jar Loader 3.1.0 disponible",
        "content": "Le projet PS5 Jar Loader, développé par hammer-83, vient de dévoiler sa toute nouvelle version 3.1.0, cette mise à jour apporte son lot d'améliorations, de nouvelles fonctionnalités et de corrections de bugs, consolidant sa position comme un outil essentiel pour les développeurs et les passionnés de la PlayStation 5. \n \nLes Nouveautés de la Version 3.1.0 :\n \nAmélioration de la Stabilité : La version 3.1.0 corrige plusieurs bugs critiques signalés par la communauté, offrant une expérience plus fiable et fluide.\n \nSupport Étendu pour les Fichiers JAR : Les fonctionnalités de chargement et d'exécution des fichiers JAR ont été optimisées, permettant une compatibilité accrue avec des applications Java variées.\n \nInterface Utilisateur Améliorée : Des ajustements ont été apportés à l'interface pour la rendre plus intuitive et accessible, même pour les utilisateurs moins expérimentés.\n \nPerformances Boostées : Le temps de chargement des fichiers a été réduit, et l'exécution des applications est désormais plus rapide.\n \n \n\n \n \nNouvelles Fonctionnalités :\n \n- Un nouveau payload pour le jailbreak du processus BD-J : Ce fichier JAR définit l'utilisateur du processus comme \"root\" et redéfinit la racine du système de fichiers sur \"/\", permettant ainsi de s'échapper de la prison \"/app0\". Après l'exécution de ce payload, le serveur FTP pourra accéder à l'intégralité du système de fichiers.\n \n- Un autre payload pour récupérer le contenu de Klog via le réseau : Ce payload utilise des outils comme netcat pour récupérer les logs Klog à distance.\n \n- Exécution des payloads en arrière-plan : Le JAR loader peut maintenant exécuter des payloads en arrière-plan tout en acceptant d'autres fichiers JAR. Deux payloads ont été adaptés pour fonctionner en tâche de fond : le serveur FTP et le serveur Klog.\n \nCorrectifs :\n \n- Amélioration de la stabilité d'UMTX2 : Des problèmes de blocage (deadlocks) systématiques dans la dernière mise à jour ont été résolus, avec une stabilité espérée améliorée.\n \n- Revert des optimisations d'appels natifs : Des problèmes de stabilité liés aux optimisations des appels natifs dans la dernière version sont toujours en cours d'investigation. Pour l'instant, le code est revenu à un état proche de la version précédente.\n \nNotes :\n \nCompatibilité ascendante non garantie : Comme d'habitude, la compatibilité avec les versions précédentes du JAR loader n'est pas assurée.\n \nProblèmes persistants sur les firmwares 6.00 et ultérieurs : Tenter d'écrire dans certaines régions des données du kernel entraîne toujours un panic (crash) sur les firmwares 6.00 et supérieurs.\n \n \n \nTéléchargement : PS5 Jar Loader 3.1.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203195/in-ps5-ps5-jar-loader-310-disponible-1.jpeg"
        }
    },
    "news_2": {
        "title": "[Multi] Super Mario gagne contre Nintendo",
        "content": "Dans une décision surprenante, la National Register du Costa Rica a récemment tranché en faveur du supermarché \"Super Mario\" de San Ramón, après que Nintendo ait contesté l'utilisation de ce nom. La célèbre entreprise japonaise, connue pour ses jeux vidéo et ses personnages emblématiques, avait intenté une action en justice pour empêcher le supermarché de renouveler son enregistrement de nom (marque).\n \nLe supermarché \"Super Mario\", dirigé par Don José Mario Alfaro González, utilise ce nom depuis des décennies. Le magasin ne se sert d'aucun personnage ou logo de Nintendo dans ses promotions ou publicités, mais l'usage du nom a suffi à attirer l'attention de l'entreprise japonaise, dont la vigilance en matière de protection des marques est bien connue.\n \n \n \n\n \n \nLors de l'audience, les représentants de Nintendo ont soutenu que le nom \"Super Mario\" pourrait induire une confusion parmi les consommateurs, bien que le supermarché se limite à la vente de produits alimentaires et domestiques et n'ait aucun lien avec l'industrie du jeu vidéo. De leur côté, les avocats de Don José Mario ont souligné que le nom du magasin n'avait jamais été source de litige avant la tentative de renouvellement d'enregistrement, et que la marque \"Super Mario\" de Nintendo n'était pas enregistrée pour les supermarchés.\n \nFinalement, la National Register a conclu que Nintendo n'avait pas de droits exclusifs sur le nom \"Super Mario\" dans le contexte des supermarchés, permettant ainsi à Don José Mario de conserver le nom de son établissement. Ce verdict a été accueilli avec soulagement et joie par le propriétaire, qui a remercié la communauté locale pour son soutien tout au long de cette affaire.\n \n \n\n \n \nL'affaire a suscité un débat sur l'étendue de la protection des marques et la capacité des grandes entreprises à influencer les petites entreprises locales. Tandis que Nintendo est régulièrement impliquée dans des litiges concernant ses marques, cette décision montre que les tribunaux peuvent également statuer en faveur des plus petits opérateurs face aux géants industriels.\n \nAvec cette victoire, le supermarché \"Super Mario\" continue d'opérer sous son nom historique, apportant un service essentiel à sa communauté tout en affirmant sa propre identité face à l'industrie du jeu vidéo.\n \n \nTout est là : facebook.com\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203191/in-multi-super-mario-gagne-contre-nintendo-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203191/in-multi-super-mario-gagne-contre-nintendo-2.png"
        }
    },
    "news_3": {
        "title": "[DS/2DS/3DS] TWiLight Menu++ v27.12.4 et nds-bootstrap v2.4.0 disponibles",
        "content": " \nLe développeur RocketRobz dévoile de nouvelles versions de TWiLight Menu++ et de nds-bootstrap qui respectivement sont désormais proposées en v27.12.4 et v2.4.0.\n \nDe nouveaux paramètres de préchargement intégrés ont été ajoutés à nds-bootstrap pour les jeux suivants afin d'améliorer la vitesse de chargement ! (Cela ne s'applique pas aux ROMs piratées ou traduites, sauf indication contraire.)\n \n\n \nJeux :\n \n- Animal Crossing: Wild World (versions USA, Japon et Corée seulement) (3DS)\n- Castlevania: Dawn of Sorrow (3DS)\n- Castlevania: Portrait of Ruin (3DS)\n- Castlevania: Order of Ecclesia (3DS)\n- Classic Word Games (3DS, mode DSi)\n- Diddy Kong Racing DS (DSi)\n- English Training: Have Fun Improving Your Skills (DSi/3DS)\n- FabStyle (3DS)\n- Geometry Wars: Galaxies (DSi/3DS)\n- Juiced 2: Hot Import Nights (DSi)\n- Kirby Super Star Ultra (3DS)\n- The Legend of Zelda: Phantom Hourglass (3DS)\n- Mario Hoops 3 on 3 (versions USA et Japon seulement) (3DS)\n- Mario Kart DS (DSi)\n- MegaMan Zero Collection (3DS)\n- MegaMan ZX (3DS)\n- MegaMan ZX Advent (3DS)\n- Metal Slug 7 (DSi/3DS)\n- Metroid Prime Hunters (3DS)\n- New Super Mario Bros. (DSi)\n- Plants vs. Zombies (DSi/3DS)\n- Power Rangers: Samurai (3DS)\n- Professor Layton and the Curious Village (versions USA, Japon et Corée seulement) (3DS)\n- Sonic Colors (3DS)\n- Sonic Rush (3DS)\n- Sonic Rush Adventure (3DS)\n- Tomodachi Collection (versions originale et traduite en anglais) (DSi/3DS)\n- Yoshi Touch & Go (DSi)\n \nCorrectifs de Protection Antipiratage (AP) :\n \n- Ajout de correctifs AP pour les traductions anglaises de MapleStory DS.\n- Ajout d'un correctif AP pour la traduction italienne (Première Bêta !) de Tomodachi Collection (par @Peppe30brick).\n \nAméliorations Techniques :\n \n- DSi/3DS : Lors du préchargement d'une ROM contenant des overlays, le binaire ARM7 n'est plus préchargé (car déjà chargé à la destination RAM). Cela permet de précharger certaines ROMs autour de 12MB/28MB.\n- DSi/3DS : La WRAM partagée est désormais activée pour le préchargement des ROMs avec la WRAM DSi désactivée.\n- DSi/3DS : Utile pour le débogage, toute la RAM disponible est désormais explorable, que ce soit en mode DS ou DSi.\n- B4DS : Les correctifs de sauvegarde pour les titres DSiWare de 0/A à C ont été déplacés dans un nouveau fichier pack dans NitroFS. Cela réduit la taille du fichier nds-bootstrap d'environ 288KB.\n- DSi/3DS : En cas de crash dans Mario & Luigi: Bowser's Inside Story, le jeu redémarre au lieu d'afficher une erreur d'abandon des données.\n \nCorrections de Bugs :\n \n- DSi/3DS : La méthode de hooking pour lire les ROMs depuis la carte SD est revenue à la boucle principale/SWI Halt pour résoudre des problèmes de communication sans fil.\n- Pokémon Noir & Blanc 1 & 2 continueront d'utiliser la méthode de hooking IPC Sync qui a corrigé les crashs occasionnels.\n- Correction d'un bug ancien où Luminous Arc 2 se bloquait sur des écrans noirs au démarrage avec une nouvelle sauvegarde.\n- Mise à jour du correctif AP pour GoldenEye 007 pour éviter les crashs au démarrage.\n- DSi/3DS : Correction d'un bug où les fichiers ROM fragmentés dans le système de fichiers FAT ne se chargeaient pas.\n- B4DS : Correction de certains jeux SDK 5 qui ne chargeaient pas les données de sauvegarde avant les données de la ROM.\n \n \nChangelog TWiLightMenu++ : \n \n- Ajout du support pour les dossiers de skins imbriqués (ex. ../themes/Dark/Dark/ au lieu de ../themes/Dark/). Bien que non recommandé, cette fonctionnalité a été ajoutée principalement comme mesure à l’épreuve des débutants pour l'installation des skins.\n- Divers : Traductions mises à jour.\n \nCorrections de bugs :\n \n- Correction des paramètres non sauvegardés par jeu qui se rechargeaient à l'ouverture du menu des triches.\n- Thèmes basés sur DSi : Correction de la longueur de la barre de progression dépassant parfois l'icône de progression.\n \n \nTéléchargement : TWiLightMenu ++ / nds-bootstrap\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203181/in-ds2ds3ds-twilight-menu-v27124-et-nds-bootstrap-v240-disponibles-1.png"
        }
    },
    "news_4": {
        "title": "[PS4] Sony sort le firmware 12.02 pour la PS4",
        "content": "La mise à jour du firmware 12.02 pour la PS4 est maintenant disponible, cette mise à jour apporte principalement des correctifs de sécurité et quelques modifications mineures à l'interface et aux fonctionnalités. \n \nCependant, il semble que Sony se concentre davantage sur la PS5 ces derniers temps, délaissant la PS4 dans ses fonctionnalités, estimant en avoir fait le tour peut être pour que tout le monde bascule sur la nouvelle génération, qui a déjà 50 mois, soit plus de 4 ans déjà.\n \n \n \n\n \n \n \nIl faut compter environ 503 Mo pour la télécharger, ce qui va relativement vite, cependant si vous pouvez l'éviter, le temps que certains puissent vérifier si les dernières avancées en matière de hack fonctionnent. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203178/in-ps4-sony-sort-le-firmware-1202-pour-la-ps4-1.png"
        }
    },
    "news_5": {
        "title": "[PS5] Fla_z détaille la gestion de la mémoire GPU, DMA, Bypass sur PS5",
        "content": "Le développeur Flat_z a récemment partagé de nouvelles informations sur la gestion de la mémoire GPU et l'Accès Direct à la Mémoire (DMA) sur les consoles PlayStation 5. Dans ses explications qu'il donne sur Discord, Flat_z a mis en avant l'importance de blocage et de déblocage de la mémoire pour éviter les bugs inattendus. En utilisant des techniques spécifiques pour obtenir les adresses physiques et modifier la table des pages, il a réussi à maintenir ses méthodes de gestion des opérations de mémoire avancées même sur les firmwares les plus récents.\n \nFlat_z a également souligné que cette technique pourrait être utilisée pour contourner les protections de sécurité et écrire directement dans des régions spécifiques de la mémoire, ce qui la rend particulièrement intéressante pour des scénarios liés aux systèmes AGX. En plus de tout cela, il a mentionné que les clés de sécurité de la PlayStation 5 sont générées de manière hiérarchique, rendant certains exploits plus difficiles à mettre en oeuvre.\n \n \n \n\n \n \n \n \nPour les débogages avancés, il utilise notamment UART et certaines fonctions personnalisées afin d'obtenir des résultats détaillés, y compris des backtraces.\n \nSon analyse se porte sur le code présent dans GpuMemoryUtil.java, le développeur continue de progresser ou donner des pistes, cela demandera une analyse plus approfondie pour pouvoir être exploitée. \n \nIl se permet de dévoiler cela ici sur Github : GpuMemoryUtil.java\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203162/in-ps5-fla-z-detaille-la-gestion-de-la-memoire-gpu-dma-bypass-sur-ps5-1.png"
        }
    },
    "news_6": {
        "title": "[PS4/PS5] GoldHEN Stage2 v1.04 disponible",
        "content": "Le développeur SiStr0 dévoile une nouvelle version de son plugin GolHEN stage 2 qui est désormais proposé en v1.04. \n \nCe loader ne prend en charge que les payloads avec un point d'entrée au kernel. La version personnalisée de stage2 recherche d'abord le payload dans le répertoire racine de la clé USB et, si elle est trouvée, elle est copiée sur le disque dur interne à ce chemin : /data/GoldHEN/payloads/goldhen.bin. Le payloads interne est alors chargé et n'est plus nécessaire sur la clé USB externe.\n\n \n \n \nLes versions prises en charge sont des firmwares :\n \nFW 9.00\nFW 9.03\nFW 9.60\nFW 10.00 / 10.01\nFW 10.50 / 10.70 / 10.71\nFW 11.00\n \nLes prochaines versions sont :\n \n- Version 7.XX du firmware\n- À déterminer\n \n \n \n \nTéléchargement : GoldHEN Stage2 1.04 \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203125/in-ps4ps5-goldhen-stage2-v104-disponible-1.png"
        }
    },
    "news_7": {
        "title": "[PS5] PS5 Jar Loader 3.0.1 disponible",
        "content": "Le développeur Hammer-83 dévoile une nouvelle version de PS5 Jar Loader qui est désormais proposé en v3.0.1. \n \n \n\n \n \nChangelog : \n \n- Déplacement de la désactivation de l'avertissement d'accès illégal vers le module xlet\n- Correction sur le serveur ftp n'utilisant pas les calls natifs.\n- Suppression de l'assertion sur le test unitaire qui mesure la vitesse des pointeurs de vue de données.\n- Désactivation de l'avertissement intellij\n \n \nTéléchargement : PS5 Jar Loader 3.0.1\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203123/in-ps5-ps5-jar-loader-301-disponible-1.png"
        }
    },
    "news_8": {
        "title": "[3DS] Mandarine v1.2 disponible",
        "content": "Mandarine, le fork de l'émulateur Citra, capable de lancer les rom 3DS sur Windows PC, MacOS, Linux et Android.\n \nLe fork de Citra, Mandarine, est une version retravaillée qui offre en théorie des performances supérieures, des mises à jour récentes, et des optimisations supplémentaires par rapport à Citra Enhanced. L'interface utilisateur a été revue, de nouvelles options audio ont été introduites, et ainsi que le contrôle sur Android. \n \n \n \n\n \nLes nouveautés sont nombreuses, le support d'Android 15, la résolution d'erreurs liés à cette intégration, l'optimisation de la gestion des buffers OpenGL, ou encore la mise en oeuvre de l'optimisation Vulkan SPIR-V sont autant de nouveautés qui ont été intégrées.\n \nLe multitâche Android a été implémenté, la prise en charge de plusieurs dossiers de jeu et du mode multijoueur sont autant d'améliorations. \n \nChangelog :\n \n- core : Suppression du Frontend SDL @OpenSauce04\n- Ajout du support Android 15, correction des erreurs Android 15, mise à jour de libadrenotools @jarrodnorwell\n- gl_stream_buffer : optimisation de la gestion des tampons OpenGL @weihuoya\n- Mise à jour de la page de manuel mandarine.6 @rtiangha\n- key : correction de la division des clés aes qui ne fonctionne pas correctement @jarrodnorwell\n- Mise à jour vers QT 6.8.1 @rtiangha / @kleidis\n- Android : Ajout d'une description pour les axes du d-pad @DavidRGriswold\n- Android : Ajout de raccourcis de jeu dans le dialogue about game @kleidis / @OpenSauce04 / @Ishan09811\n- video_core : implémentation de l'optimisation Vulkan SPIR-V sur les OS de bureau @litucks\n- Externals : tracy v0.11.1 custom ver. @rtiangha\n- Android : implémentation de la prise en charge de plusieurs dossiers de jeux @Ishan09811 / @kleidis\n- Android : Ajout du support multijoueur @kleidis / @Gamer64ytb\n- Ajout de la traduction suédoise aux versions PC @yeager\n \nTéléchargement : Mandarine v1.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203118/in-3ds-mandarine-v12-disponible-1.png"
        }
    },
    "news_9": {
        "title": "[XB] Xemu mis à jour en v0.8.15",
        "content": "L'équipe en charge du développement de Xemu, l'émulateur de la console Xbox originale, dévoile une nouvelle version de Xemu pour PC Windows, MacOS et Linux.\n \nXemu est avant tout un fork de XQEMU, le projet d'émulation système complet QEMU, toujours axé sur les fonctionnalités, les performances, et la stabilité et surtout l'expérience utilisateur.\n \n \n\n \n \nNiveau compatibilité, 80% des jeux sont \"jouables\", tandis que les jeux qui \"fonctionnent\" parfaitement le sont à 5%.\n \n \n\n \n \n \nChangelog 0.8.15 : \n \n- nv2a : Ajout d'un test de swizzle et un benchmark\n- nv2a : Accélération du swizzle des logiciels\n- ci : Amélioration du conteneur de build Windows\n- scripts/gen-license.py : Obtention de la version du sous-projet glslang\n- xid : Ajout de la manette Xbox S\n- vl : Activation du backend audio\n- build : Autorise le passage des CFLAGS sur macos.\n- Corrections diverses\n \n \nTéléchargement : Xemu 0.8.15\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203102/in-xb-xemu-mis-a-jour-en-v0815-1.png"
        }
    },
    "news_10": {
        "title": "[Vita] eCFW 6.61 Adrenaline 7.1.7 disponible",
        "content": "Une nouvelle version de l'eCFW 6.61 Adrenaline vient d'être mise en ligne, il s'agit de la v7.1.7 ! Comme vous le savez, le plugin permet de modifier l'émulateur interne PSP dans la PS Vita en utilisant taiHEN afin d'exécuter le custom firmware 6.61. Adrenaline injecte le code personnalisé dans l'IPL - Inital Program Loader - et permet de lancer du code non signé dans la console lorsqu'elle s'allume.\n \n \n \n\n \n \nLe développeur isage propose depuis quelques heures cette nouvelle version qui corrige l'option de l'autoboot, et qui corrige le support Vita des firwmares 3.71 à 3.74.\n \n \nTéléchargement : eCFW 6.61 Adrenaline 7.1.7\n \n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203098/in-vita-ecfw-661-adrenaline-717-disponible-1.png"
        }
    },
    "news_11": {
        "title": "[PS5] Flat_z redonne de l'espoir pour bypasser les protections kernel",
        "content": "Récemment, le développeur russe connu sous le pseudonyme de Flat_z a ravivé l'enthousiasme dans la communauté des gamers en redonnant de l'espoir quant à l'arrivée d'un hack pour la PlayStation 5. En effet, Flat_z a confirmé avoir réussi à faire fonctionner un exploit via le BD-J (Blu-ray Disc Java) sur le firmware 7.61. Cet exploit, nommé UMTX, est une étape significative dans la quête du hack PS5.\n \nCependant, il reste des défis à relever pour atteindre une version pleinement opérationnelle de cet exploit. Flat_z travaille actuellement sur l'amélioration de la vitesse et de la stabilité. \n \nIl vient d'également évoqué que certaines protections du kernel peuvent être bypasser en utilisant les capacités d'écritures du GPU, notamment en s'appuyant sur l'écriture du DMA dans l'AGX. \n \n \n\n \n \nIl donne d'ailleurs des pistes en affirmant que dans le BD-J il existe une fonction pour faire cela en copiant DMA, et que dans Lua cela a été implémenté par lui (en s'appuyant sur le buffer et des soumissions au GPU). \n \nIl donne aussi les primitives et les fonctions Java nécessaires à cela en rajoutant que cela peut être utilisé pour attaquer certaines parties de l'hyperviseur. \n \n \n\n \n \n \nCela redonne surtout de l'espoir à un support plus larges du hack sur les firmwares 6.xx et 7.xx, la seule chose à obtenir serait alors un ou des exploits webkit fonctionnels avec ces primitives. Plus qu'à attendre pour voir si ces pistes peuvent être mises en oeuvre. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203083/in-ps5-flat-z-redonne-de-lespoir-pour-bypasser-les-protections-kernel-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203083/in-ps5-flat-z-redonne-de-lespoir-pour-bypasser-les-protections-kernel-2.png"
        }
    },
    "news_12": {
        "title": "[PS5] PS5 Edit Profile 1.7 disponible",
        "content": "Le logiciel prend un bon chemin car il est régulièrement mis à jour par son développeur, Master-s vient en effet de mettre à jour PS5 Edit Profile en v1.6. \n \nComme son nom l'indique il s'agit d'un programme qui permet d'éditer le profil de votre PS5 afin d'y ajouter de la personnalisation, comme changer l'icône, des profils par défaut, des avatars.\n \n \n \n\n \n \nLa nouvelle version améliore encore une fois la proposition faite par Master-s, il a ajouté un nouveau thème et un profil par défaut. Le programme est censé fonctionner du firmware 2.00 au 5.50, en tout cas il a bien été testé du 5.00 au 5.50 par Master-s. \n \n \n \n\n \n \n \nTéléchargement : PS5 Edit Profile 1.7\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203078/in-ps5-ps5-edit-profile-16-disponible-1.png"
        }
    },
    "news_13": {
        "title": "[Oldies] Des outils de Bucanero pour convertir des saves Saturn",
        "content": "Le développeur Bucanero, Damian Parrino pour les intimes, a travaillé sur quelques outils à destination de ceux qui disposent d'une Sega Saturn. \n \nSes outils \" Saturn Save Tools \", à l'image de ces autres outils que nous connaissons bien, sont des outils de ligne de commandes simples qui permettent de convertir les sauvegardes Saturn vers quelques formats de fichiers, notamment BUP et SAROO. \n \n \n\n \n \nIl a également intégré une version personnalisée de l'outil de sauvegarde de Saroo qui prend en charge les sauvegardes BUP.\n \nCes outils supportent MacOS, Ubuntu et Windows 32 et 64 bits.\n \n \nTéléchargement : Saturn Save Tools\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203075/in-oldies-des-outils-de-bucanero-pour-convertir-des-saves-saturn-1.png"
        }
    },
    "news_14": {
        "title": "[3DS] Borked3DS voit débarquer une mise à jour importante (SDL2 à SDL3)",
        "content": "La dernière version de Borked3DS a été annoncée il y a tout juste quelques heures. Cette mise à jour passionnante passe de SDL2 à SDL3 via la couche de compatibilité SDL2. L'objectif est de finalement porter le projet sur SDL3 pur, mais en attendant, les utilisateurs pourront tester le nouveau backend.\n \nBorked3DS est un émulateur expérimental de Nintendo 3DS basé sur Citra. Ce projet vise à continuer le développement de l'émulation 3DS après l'arrêt de Citra et d'autres forks similaires. Borked3DS intègre des fonctionnalités et des améliorations issues de ces projets antérieurs tout en ajoutant des éléments uniques, c'est un projet d'émulateur 3DS expérimental et n'est PAS le projet officiel qui vise à unifier et à poursuivre le développement de Lime3DS et PabloMK7. Bien que des éléments de ce projet puissent être intégrés à ce nouveau projet lorsqu'il sera en ligne, pour le moment, le développement de ce projet a suffisamment divergé de ce que PabloMK7 et Lime3DS faisaient pour qu'il soit considéré comme une œuvre à part entière\n \nIl y a quelques jours, des améliorations importantes à la version Android ont été apportées, mais aussi pour Vulkan, et de nombreuses dépendances ont été mis à jour. \n \n \n\n \n\n \n\n \n \nChangelog : \n \n- glslang 15.1.0\n- aqtinstall 3.1.21\n- Vulkan v1.4.305\n- oboe 1.9.3\n- Android Gradle 8.12\n- fmt 11.1.2\n- vma 3.2.0\n- SDL 2.30.11\n- Catch2 v3.8.0\n- openal-soft 1.24.2\n- Autres mises à jour mineures des dépendances Android et Desktop\n \nTéléchargement : Borked3DS\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203073/in-3ds-borked3ds-voit-debarquer-une-mise-a-jour-importante-sdl2-a-sdl3-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203073/in-3ds-borked3ds-voit-debarquer-une-mise-a-jour-importante-sdl2-a-sdl3-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1203073/in-3ds-borked3ds-voit-debarquer-une-mise-a-jour-importante-sdl2-a-sdl3-1.jpg"
        }
    },
    "news_15": {
        "title": "[Switch] Citron 0.4 disponible",
        "content": " \nLe développeur Zephyron continue de faire progresser au calme le développement de Citron, l'émulateur Switch fonctionnant sous Windows, Android ou Linux. \n \nLa mise à jour 0.4 qu'il vient de dévoiler se concentre sur l'amélioration de la stabilité, des performances et de la compatibilité de l'émulateur sur différentes plateformes.\n \n \nPoints clés :\n \n- Améliorations des performances : Cette version intègre des optimisations avancées pour augmenter la vitesse globale et réduire la latence pendant les jeux.\n \n- Corrections de bugs : Plusieurs bugs critiques ont été corrigés, en particulier ceux affectant le rendu graphique et la synchronisation audio.\n \n- Nouvelles fonctionnalités : Introduction d'options supplémentaires de compilation de shaders et meilleure compatibilité avec les derniers titres de jeux.\n \n- Améliorations de l'interface utilisateur : Navigation plus facile et contrôles plus intuitifs, rendant la configuration des paramètres plus simple pour les utilisateurs.\n \n \n\n \n \nAméliorations techniques principales de cette version 0.4 :\n \nCompilations de shaders optimisées : Des améliorations significatives ont été apportées à la compilation de shaders, ce qui améliore la stabilité et la performance globale.\n \nGestion améliorée des erreurs : Des messages d'avertissement ont été ajoutés pour suivre les fonctionnalités non implémentées, ce qui facilite le débogage.\n \nSimplification du système de build : Le système de build a été simplifié notamment en supprimant les options de compatibilité x86-64ISA et en améliorant la maintenabilité .\n \nCompatibilité Android : Support amélioré pour les derniers outils de développement Android, ce qui assure une meilleure intégration et compatibilité .\n \nRecompiler de shaders : Implémentation de six conditions de test de flux, comme FCSM_TR et CSM_TA, améliorant la stabilité et réduisant les chances de plantage\n \n \nTéléchargement : Citron 0.4\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203071/in-switch-citron-04-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[PS5] PS5 Jar Loader 3.0.0 de hammer-83 disponible",
        "content": " \nLe développeur hammer-83 vient de mettre à jour PS5 Jar Loader en version 3.0.0, pour rappel, PS5 Jar Loader est un outil de lancement de payloads s'appuyant sur un exploit au niveau du lecteur BD-J et qui est compatible jusqu'au firmware 7.61 de la console. Il permet d'exécuter des fichiers JAR qui seront préalablement gravés sur un BD-R.\n \n \n\n \n \n \nNouvelles fonctionnalités :\n \n- Deux versions de l'ISO : l'une avec tous les payloads (mises à jour au moment de la publication) et le menu qui peut les charger directement à partir du disque, l'autre, comme auparavant, avec seulement le chargeur JAR à distance. - Les deux versions peuvent charger à distance les payloads les plus récents attachés progressivement à cette version, l'ISO complète n'a que le menu qui charge également les payloads gravés sur le disque. Merci à iakdev.\n- Intégration dans le SDK des idées récentes d'Andy Nguyen sur l'optimisation des appels natifs. Le payload UMTX se lance maintenant beaucoup plus rapidement.\n- UMTX2 est désactivée avec cette version. Il est plus enclin aux blocages et le maintien de deux implémentations ajoute une surcharge inutile. Il sera probablement supprimé dans les prochaines versions.\n- Corrections diverses du SDK.\n- Les payloads compilés avec la version précédente du SDK ont peu de chance de fonctionner avec ce loader et probablement vice versa (le loader précédent a peu de chance de charger correctement les JARs compilés avec cette version du SDK).\nNote : sur le firmware 6.00+, tenter d'écrire dans les données du kernel provoque un kernel panic. Le texte du kernel ne peut être lu/écrit que sur les firmwares inférieurs à 3.00.\n \n \nMarche à suivre :\n \n- Compilez le projet et gravez le contenu de assembly/target/assembly-3.0.0 sur un disque BD-RE. L'ISO précompilé est également fourni. Compilez éventuellement avec -Dloader.logger.host=[IP du serveur d'enregistrement] pour envoyer la sortie à l'écran à un hôte distant.\n- Insérez le disque dans PS5 et exécutez le chargeur JAR.\n- Envoyez un payload : java -jar <payload.jar> <PS5 IP>\n \n \nPayloads inclus :\n \n- Serveur FTP (en sandbox).\n- Exemple de mini jeu de tennis.\n- Impression des propriétés du système.\n- Dump du chemin d'accès actuel de la JVM, y compris le module java.base (peut ne pas fonctionner sur tous les firmwares).\n- Les implémentations des bugs UMTX de flat_z, Cryptogenic et cheburek3000 adaptées à ce SDK. Chacune d'entre elles peut être utilisée pour obtenir la lecture/écriture du noyau. Note : UMTX1 est la charge utile recommandée. Au fur et à mesure que la stabilité s'améliore, les autres implémentations seront désactivées et finalement supprimées.\n- Implémentation de Byepervisor de Cryptogenic\n- Dumpers de kernel. Une fois que le r/w du kernel est obtenu, envoyez ce payload pour dumper le kernel. Si byepervisor a été lancé en premier, il enverra du texte et des données. Sinon, seules les données seront envoyées. Utilisez netcat sur un ordinateur pour recevoir le binaire du kernel en vous connectant à la PS5 sur le port 5656.\n \n \nTéléchargement : ps5-jar-loader 3.0.0\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203065/in-ps5-ps5-jar-loader-300-de-hammer-83-disponible-1.png"
        }
    },
    "news_17": {
        "title": "[PS5] bd-j pv6 Hen, PS5kstuff et etaHEN mis à jour",
        "content": "John Tornblom continue de mettre à jour ses outils, il vient de proposer une update de BDJ-IPv6-HEN, avec notamment des modifications apportées au payload elfldr.elf et aussi à kstuff.\n \nPour rappel, ce payload charge les fPKG sans avoir besoin de modifier l'hyperviseur, il fonctionne sur les firmwares 3.00 à 4.51, et ne permet de lancer que les jeux PS4 et quelques vieux jeux PS5, mais c'est déjà bien pour ceux qui disposent de tels firmwares. \n \n \n\n \n \nAu passage, etaHEN 2.0 a été mis à jour  par LightningMods. \n \n \nTéléchargement : bdj-ipv6-hen v0.3 / kstuff / etaHEN\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203057/in-ps5-bd-j-pv6-hen-ps5kstuff-et-etahen-mis-a-jour-1.png"
        }
    },
    "news_18": {
        "title": "[Xbox] Phil Spencer partage les ambitions de Xbox sur l'avenir",
        "content": "Répondant à des questions de deux spécialistes du jeu vidéo, dont le célèbre podcaster Danny Peña, Phil Spencer, PDG de Microsoft Gaming, discute de son héritage, de l'importance de l'engagement communautaire et de l'avenir des jeux multiplateformes tout en mettant l'accent sur l'innovation matérielle et logicielle.\n \nPhil exprime sa gratitude pour la communauté et l'importance des voix équilibrées dans l'industrie du jeu vidéo, il a aussi conscience que la Xbox 360 va fêter ses 20 ans, et rajoute qu'il faut savoir tirer les leçons apprises du passé et leur impact sur les consoles actuelles.\n \n \n\n \n \n \nIl ne s'en cache plus, l'avenir de Xbox se passera ailleurs que sur Xbox, il parle d'importance de déployer l'avenir de l'expérience utilisateur sur plusieurs appareils, et de souligner l'importance de reproduire l'expérience Xbox sur divers dispositifs pour garantir une expérience utilisateur cohérente.\n \nNe plus faire du hardware et faire du software, un peu à la Sega ? \n \nPhil exprime son enthousiasme pour les présentations récentes des développeurs, soulignant l'attrait des nouveaux jeux à venir, mais il réfléchit aussi à l'évolution de l'entreprise. \n \nIl insiste sur la nécessité de rendre les jeux accessibles sur plusieurs plateformes, permettant aux joueurs de choisir où ils souhaitent jouer. Spencer exprime sa conviction que les jeux vidéo sont une forme de divertissement supérieure, favorisant la communauté et la créativité, mais cette plateforme physique pour lui est désormais moins importante que d'avoir la console la plus puissante du monde. \n \nD'ailleurs nous sommes en droit de nous questionner sur l'étagère d'en haut, on y retrouve deux consoles qui sont inconnues, probablement des projets abandonnés, comme la Xbox Cloud Gaming de 2022, ou encore une Switch 2 ou une Xbox portable, ce n'est pas une Steamdeck.\n \n \n \n\n \n \n \nIl confirme aussi \" Cela signifie que davantage de nos jeux seront commercialisés sur davantage de plateformes, pas seulement sur PlayStation. Nous aimons le travail que nous faisons avec Nintendo, nous aimons ce que nous faisons avec Valve sur Steam. Nos jeux apparaîtront dans de plus en plus d'endroits \". \n \nAu delà du micro-partenariat avec Sony, il semblerait que Microsoft se tourne désormais vers Nintendo et Valve, reste à voir si cela servira le géant américain. \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203026/in-xbox-phil-spencer-partage-les-ambitions-de-xbox-sur-lavenir-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] Le firmware 25.01-10.60.00 déployé par Sony sur PS5",
        "content": "La firme japonaise vient de diffuser un nouveau firmware à destination de la PlayStation. \n \nDécouvrez la toute nouvelle mise à jour 25.01-10.60.00 pour votre PlayStation 5 ! Sony continue d'améliorer l'expérience utilisateur avec des optimisations de performance et de stabilité. \n \n \n\n \n \nChangelog 25.01-10.60.00 :\n \n- Nous avons amélioré les performances et la stabilité du logiciel système.\n- Nous avons amélioré les messages et l'ergonomie de certains écrans.\n \n \nCe firmware 10.60 ajoute probablement des corrections sur des failles sécuritaires, Sony précisant qu'il améliore la stabilité du logiciel système, cela semble signifier que Sony a corrigé une faille exploitable.\n \n \n\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203014/in-ps5-le-firmware-2501-106000-deploye-par-sony-sur-ps5-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] PS5 Offline PS5 Code Parser 1.0.0 et  PS4 NOR Validator 1.0.9",
        "content": "La société Better Way Electronics a mis à jour en ce début d'année 2025 quelqu'un de ces logiciels afin de proposer les dernières innovations en la matière. \n \n \n\n \n \n \nAinsi BwE PS4 NOR Validator a été mis à jour en v1.0.9 (v2.6.4), qui comme le savez probablement est un logiciel d'analyse de NOR. Si, pour une raison quelconque, la console PS4 est allumée, le 'BLOD' (lumière bleue de la mort) et un écran noir apparaissent, la console n'est pas morte mais peut être \"réparée\". Pour rappel, ce programme vous permettra de valider littéralement chaque octet du NOR (plus de 2100 zones spécifiques), vous permettant ainsi de voir où il a été corrompu. Les zones faciles à réparer sont étiquetées comme identiques sur toutes les consoles. Les zones dynamiques sont interchangeables avec chaque révision de microprogramme, la console elle-même ou le modèle de console. Les zones pour console (comme la plupart des CID) ne peuvent pas être modifiées donc, fondamentalement, ce programme est destiné aux réparateurs de consoles.\n \n \n\n \n \nChangelog \n \n- Correction de bugs dans le menu\n- Mise à jour de la gestion des fichiers (pour la version ci-dessous)\n- Possibilité d'uploader deux NOR (prochaine version)\n \n \nTéléchargement : BwE_PS4_NOR_Validator\n \n \nLe développeur propose aussi un nouveau logiciel nommé BwE Offline PS5 Code Parser en v1.0.0. \n \n \n\n \nChangelog\n \n- Lit l'intégralité des codes d'erreur PS5\n- Entièrement hors ligne (adapté aux environnements d'entreprise)\n- Licence DRM uniquement\n- Base de données hors ligne limitée mais éprouvée\n- Axé sur les entreprises (des licences de volume sont proposées)\n \n \nTout est là : ps5parser\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1202983/in-ps5-ps5-offline-ps5-code-parser-100-et-ps4-nor-validator-109-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1202983/in-ps5-ps5-offline-ps5-code-parser-100-et-ps4-nor-validator-109-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1202983/in-ps5-ps5-offline-ps5-code-parser-100-et-ps4-nor-validator-109-2.png"
        }
    }
}