{
    "news_1": {
        "title": "[PS5] Le payload ps5-self-dumper compatible avec les .prx",
        "content": "Le développeur sleirsgoevy vient de mettre à jour il y a quelques heurs son payload ps5-self-dumper afin qu'il supporte désormais le dump des fichiers avec l'extension .prx. \n \nAinsi cela permet de supporter sur PlayStation 5 le dump de fichier .prx, cela signifie que les utilisateurs pourront désormais capturer et enregistrer des fichiers .prx à partir de la PS5, leur permettant de les consulter ou de les utiliser à des fins de modification et de personnalisation.\n \nCette mise à jour étend les fonctionnalités du payload qui permettaient auparavant de télécharger des fichiers eboot.bin et différents modules, encore une fois, cela ne permet pas d'exécuter les fpkgs, mais désormais les jeux sont dumpés en leur totalité. \n \n \n \n \n\n \n \nA noter que sleirsgoevy vient également de mettre à jour ps5-kstuff en ajoutant les macros pour lire les registres de débogage. Bref sleirsgoevy est très en forme et fait évoluer les choses, espérons le dans le bon sens.\n \n \nTout est là : ps5-self-dumper\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174438/in-ps5-le-payload-ps5-self-dumper-compatible-avec-les-prx-1.jpg"
        }
    },
    "news_2": {
        "title": "[PS5] Une présentation de Specter dans quelques jours sur la PS5",
        "content": "Dans quelques jours, le 02 Juin 2023 pour être précis, le développeur Specter (ou SpecterDev) fera une présentation d'environ 45 minutes lors de la prochaine conférence Hardwear.io. Nous ne présentons plus hardwear.io, il s'agit d'une site spécialisé sur la sécurité informatique, durant laquelle un certain TheFlow avait présenté son exploit Bluray il y a tout juste un an. \n \n \n \n\n \nTheFlow en Juin 2022 \n \n \n \nDans cette présentation, Specter parlera de la sécurité de la PS5, d'ailleurs nous connaissons déjà le titre de la conférence \"Next-Gen Exploitation: Exploring the PS5 Security Landscape\" que l'on pourrait traduire par \"Exploit sur console Next-Gen : Explorez le paysage de la sécurité de la PS5\".\n \n \n\n \n \n\n \n \n \nRésumé :\n \nLa PlayStation 5 (PS5) représente une avancée technologique significative, en particulier en termes de mesures de sécurité, qui ont subi des améliorations substantielles par rapport à son prédécesseur, la PS4. En raison du manque de documentation publique sur les techniques de renforcement de la sécurité, il existe une certaine incompréhension de l'infrastructure de sécurité du système. Cette conférence vise à faire la lumière sur l'architecture du système de la PS5, en se concentrant sur les efforts de Sony pour empêcher l'ingénierie inverse et atténuer l'impact de la corruption de la mémoire du noyau.\n \nCette présentation se penchera sur les subtilités des mécanismes de sécurité de la PS5, en analysant l'évolution de la surface d'attaque et l'introduction de mesures d'atténuation modernes telles que la prévention de l'accès au mode superviseur (SMAP), la protection de l'exécution en mode superviseur (SMEP), l'intégrité du flux de contrôle du noyau (kCFI) et la mémoire eXecute Only Memory (XOM). En outre, nous étudierons le fonctionnement interne de l'hyperviseur du PS5 et analyserons son rôle dans la protection du système contre les attaquants disposant de privilèges élevés. Nous parlerons également de la manière dont ces mesures d'atténuation peuvent être contournées et nous mettrons en évidence quelques pistes et idées pour la recherche future.\n \n \nBiographie de l'orateur :\n \nSpecterDev est un chercheur en sécurité spécialisé dans l'exploitation du kernel sous linux, mobile et console. Il a commencé à faire de la recherche sur les consoles il y a cinq ans sur la PlayStation 4, et s'est récemment concentré sur la PlayStation 5 et l'AMD Secure Processor. Il coanime également un podcast hebdomadaire et un canal média appelé dayzerosec, qui suit et discute de diverses vulnérabilités récentes, d'exploits et de recherches.\n \n \nTout est là : specter.php  /  schedule.php\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174383/in-ps5-une-presentation-de-specter-dans-quelques-jours-sur-la-ps5-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174383/in-ps5-une-presentation-de-specter-dans-quelques-jours-sur-la-ps5-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1174383/in-ps5-une-presentation-de-specter-dans-quelques-jours-sur-la-ps5-3.png"
        }
    },
    "news_3": {
        "title": "[PS4] Illusion dévoile un plugin pour forcer le 30 FPS dans tous les jeux",
        "content": "Le développeur Illusion vient de mettre en ligne un nouveau plugin nommé force_30_fps.prx qui a pour mission de forcer l'affichage de n'importe quel jeu en 30 FPS. C'est la mise à jour 1.185 du GoldHEN_Plugins_Repository qui amène cette nouvelle possibilité. \n \nDit comme ça ça n'a l'air de rien, mais cela permet par exemple dans Résident Evil 4 Remake de passer de 25 FPS à 30 FPS en mode résolution sur PS4 Pro, et ainsi profiter de 20 % de performance en plus. Revers de la médaille quand la console peut donner davantage de FPS, le plugin limite aussi à 30 FPS. \n \n \n\n \n \nCela est possible grâce à une option proposée dans le plugin GoldHEN, depuis la version 2.3, il permet en effet de se soustraire à la limite d'affichage, pour être très honnête cela ne sera pas non plus flagrant à ce niveau, ce n'est pas comme si vous activiez un patch 60 FPS. \n \n \n \n\n \n \n \nPour l'installation c'est assez simple, il vous faudra une PS4 jailbreakée bénéficiant de GoldHEN 2.3 (ou supérieur). \nEnsuite aller activer l'option de chargement dans le menu plugins (Enable Plugins Loader).\nDe charger dans /data/GoldHEN/plugins/ le fichier force_30_fps.prx\nDe le lancer.\n \nA noter qu'illusion propose pas mal de plugins permettant de rajouter d'autres options au lancement du jeu, comme AFR (la redirection de fichier d'application), Échange de bouton X et O, forcer l'affichage 1080p, la suppression de taux de rotation, des correctifs de jeux, ou encore la configuration du mappage des boutons L1, L2, R1 et R2.\n \n \n \nTéléchargement : force_30_fps.prx\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174341/in-ps4-illusion-devoile-un-plugin-pour-forcer-le-30-fps-dans-tous-les-jeux-1.png"
        }
    },
    "news_4": {
        "title": "[3DS/2DS] Nintendo sort le firmware 3DS 11.17.0-50 pour patcher bannerbomb3",
        "content": "Décidemment Nintendo ne lâchera jamais rien, la firme japonaise vient de publier un nouveau firmware pour la 3DS et 2DS qui a pour objectif de corrigé le hack bannerbomb3. Cette mise à jour vient appliquer un patch qui corrige  le hack. \n \nOfficiellement il s'agit d'apporter \"D'autres améliorations de la stabilité globale du système et d'autres ajustements mineurs ont été apportés pour améliorer l'expérience utilisateur.\"\n \n \n \n\n \n \n \nIl s'agit là de la toute première mise à jour firmware pour la 3DS de l'année, ce firmware 11.17.0-50 vient donc corriger bannerbomb3, l'exploit s'appuyant sur les paramètres système de la 3DS. Étant donné que les nouveaux logiciels ne peuvent plus être achetés dans l'eShop , d'autres jeux sont également exclus pour ceux qui n'en ont pas encore acheté. \n \nNTRboot lui est toujours fonctionnel via les linkers, et il est encore trop tôt pour dire si super-skaterhax a été patché. S'agissant de boot9strap et Luma3DS, s'ils sont déjà installé sur votre console vous pouvez mettre à jour en toute sécurité et NTR CFW continuera lui aussi à fonctionner, sachant que cette mise à jour vient modifier CVer / NVer , Paramètres système , eShop , Menu d'accueil , 0004001B00018002 (Données du navigateur Web).\n \n \nLes rapports : \n \nhttps://yls8.mtheall.com/ninupdates/reports.php?date=2023-05-23_00-00-33&sys=ctr\n \nhttps://yls8.mtheall.com/ninupdates/reports.php?date=2023-05-23_00-00-41&sys=ktr\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174339/in-3ds2ds-nintendo-sort-le-firmware-3ds-11170-50-pour-patcher-bannerbomb3-1.jpg"
        }
    },
    "news_5": {
        "title": "[Switch] SwitchLayoutEditor 15 disponible",
        "content": "Le développeur exelix11, à l'origine en charge de l'éditeur, vient une nouvelle fois de mettre en ligne une nouvelle mouture de SwitchLayoutEditor. A l'origine proposé par FuryBaguette (qui est à l'origine de son développement), cet outil a pour but de simplifier et de rendre plus accessible la création de thèmes (et de layouts) pour la Nintendo Switch ! Pour rappel, l’application nous permet de modifier et de prévisualiser les fichiers .bflyt et les .bflan utilisés dans l’interface et dans les jeux du Switch.\n \nA noter que SwitchLayoutEditor n'avait pas été mis à jour depuis presque deux ans, déjà par exelix11.\n \n \n\n \n \nChangelog : \n \n- Support expérimental des templates bflan, cela permet d'écrire des templates json qui peuvent être utilisés pour automatiser la création d'éléments dans les fichiers d'animation (bflan).\n- Chaque modèle a un \"manifeste\" json qui définit les propriétés et le nom et un fichier d'implémentation réel, le fichier d'implémentation est défini dans le champ \"FileName\" de ce manifeste, l'implémentation est un json mais les valeurs sont remplacées à l'exécution par les \"macros\" définies dans Parameters dans le manifeste, les valeurs réelles sont sélectionnées à partir d'une interface graphique à l'exécution.\n- Les différentes options ne sont actuellement documentées nulle part, il faut se référer au fichier BflanTemplates.cs dans le code source.\n- Un modèle simple \"Animate color\" est fourni, il est composé d'un fichier .template et d'un descripteur .json\n- Les builds sont maintenant générés avec les actions Github\n \nTéléchargement : SwitchLayoutEditor 15\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174322/in-switch-switchlayouteditor-15-disponible-1.png"
        }
    },
    "news_6": {
        "title": "[Wii/GC] Swiss v0.6r1476 disponible",
        "content": "Le développeur Extrems vient de mettre en ligne il y a quelques heures une nouvelle mouture de son outil Swiss qui est proposé en version v0.6r1476.\n \nComme vous le savez probablement Swiss est le digne successeur de SD-boot, il permet de lancer les homebrews GameCube mais aussi les backups stockés sur carte SD ou un disque dur, SDGecko, WODE, Wiikey Fusion et bien d'autres solutions. \n \n \n\n \n \nChangelog :\n \n- Désactivation de la mise en mémoire tampon pour FTP/SMB.\n- Ajout de quelques fermetures de fichiers manquantes.\n- Accélérer la recherche du deuxième disque lors du défilement en arrière.\n- Ajout d'une option pour aplatir la structure d'un répertoire.\n- Aplatir le répertoire des jeux Nintendont par défaut.\n- Affichage du chemin relatif lors de l'aplatissement.\n- Correction d'une erreur d'alignement de section dans le Wind Waker Randomizer.\n- Prise en compte d'un en-tête de disque malformé dans Bikmin 269.\n- Navigue vers l'entrée la plus récente lorsque la liste récente est entièrement activée.\n- Correction d'une barre oblique manquante.\n- Correction de la navigation vers un répertoire aplati.\n- Rafraîchir le navigateur de fichiers après avoir sauvegardé les paramètres.\n- Amélioration légère de la gestion des fichiers/répertoires courants.\n- Amélioration des performances.\n- Désactivation du débogueur WiiRD lorsque l'USB Gecko n'est pas présent.\n- Faire la même chose pour l'USB Gecko.\n- Lire directement dans le tampon avec FSP.\n- Transmettre de manière asynchrone lorsque c'est possible.\n- Permettre à nouveau un MTU de 2030 octets.\n- Installer l'ISR si nécessaire.\n \n \nTéléchargement : Swiss v0.6r1476\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174321/in-wiigc-swiss-v06r1476-disponible-1.jpg"
        }
    },
    "news_7": {
        "title": "[PS5] Sleirsgoevy dévoile un payload permettant de dumper les jeux PS5 décryptés",
        "content": "Le développeur Sleirsgoevy vient de mettre en ligne \"PS5 4.03 Kernel Exploit Payload.bin Loader Host\", il s'agit là d'un tout nouveau payload qui permet de dumper les jeux PS5 décryptés. \n \nIl existe depuis un bon moment des moyens de dumper les versions cryptées des jeux PS5 notamment via FTP, mais les fichiers binaires sont restent cryptés. Avec ce nouveau payload, il est possible de décrypter les binaires d'un jeu en cours d'exécution et d'en faire ainsi une sauvegarde.\n \nLes personnes souhaitant dumper leurs jeux PS5 utiliseront ce payload pour dumper les fichiers binaires, et le FTP pour dumper les fichiers non chiffrés, comme par exemple les ressources, les images, les musiques, car le FTP est plus rapide. \n \n \n\n \n \nL'utilisation est toujours la même comme nous le rappelle Zecoxao : Démarrez le jeu, minimisez le jeu, accédez au navigateur, lancez l'exploit, puis chargez payload.bin. devrait dumper sur usb iirc.\n \nPour le moment il y aussi quelques restrictions, ainsi le payload n'est compatible qu'au format PLD (.bin) et uniquement sur le firmware 4.03, et surtout cela ne libère pas la possibilité de lire les fpkg. Vous l'aurez donc noté les payloads ELF ne sont pas supportés, et il est possible qu'il soit rapidement adapté aux autres firmwares. \n \nL'implémentation se trouve ici : https://sleirsgoevy.github.io/ps4jb2/ps5-403/index.html\n \nTéléchargement : code source   / dumper (à lancer netcat sur le port 9019)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174262/in-ps5-sleirsgoevy-devoile-un-payload-permettant-de-dumper-les-jeux-ps5-decryptes-1.png"
        }
    },
    "news_8": {
        "title": "[Switch] AIO-switch-updater v2.22.0 disponible",
        "content": "HamletDuFromage propose une nouvelle version d'AIO-switch-updater qui débarque en v2.22.0. Pour rappel, cet outil permet de profiter d'options très utiles comme mettre des DNS Lan Play, de mettre à jour Atmosphere ou les sigpatches, ou encore de gérer des cheats codes (via CheatSlips.com).\n \nLe petit homebrew proposé par le français a été mis à jour afin d'améliorer le support des packs personnalisés. \n \n \n\n \n \n \nAmélioration des packs personnalisés :\n \n- Augmentation de la longueur maximale des chaînes de caractères pour le clavier à l'écran\n- Utilisation de la vue web pour afficher le journal des modifications\n- Désactivation de l'invite de téléchargement hekate pour les téléchargements de packs personnalisés dont le nom commence par [PACK]\n- Mise à jour de la traduction chinoise (github.com/qazrfv1234)\n \n \nTéléchargement : AIO-switch-updater v2.22.0\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174256/in-switch-aio-switch-updater-v2220-disponible-1.jpg"
        }
    },
    "news_9": {
        "title": "[Switch] AtmoPackUpdater v1.9.0 est disponible",
        "content": "Bonjour à tous, une mis à jour AtmoPackUpdater en version 1.9.0 est disponible suite à différents bugs signalés par la communauté. Pour rappel, cet homebrew a pour but de mettre à jour votre CFW (notamment grâce au pack ici), les sigpatches, le firmware et certains homebrews/sysmodules.\n-Il y avait un bug concernant le téléchargement du firmware et des sigpatches.\n-Un autre bug touchait les consoles Mariko\n-Un dernier bug concernait une duplication de l'homebrew.\n-Ajout de deux nouveautés qui devraient vous plaire.\n \n\n \n \nChangelog : \n-Fix de #12\n-Fix de #13\n-Normalement #15 est aussi fixée\n-Ajout d'un message d'avertissement si vous lancez l'homebrew en mode applet\n-Ajout d'un système de mise à jour automatique de l'app. Il faut choisir \"Oui\" dans les paramètres pour l'activer\n \nTéléchargement : AtmoPackUpdater v1.9.0\n \n \nPour rappel, si vous avez des idées d'améliorations ou si vous avez détecté des bugs, n'hésitez pas à ouvrir une issue ici\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174252/in-switch-atmopackupdater-v190-est-disponible-1.jpg"
        }
    },
    "news_10": {
        "title": "[Switch] FPSLocker v1.2.2 disponible",
        "content": "Le développeur Masagrator propose une nouvelle version de FPSLocker, qui pour rappel fonctionne comme une superposition pour la Nintendo Switch permet aux utilisateurs de définir des FPS personnalisés pour les jeux Switch. Pour fonctionner, cette application nécessite NX-FPS et SaltyNX, à noter que certains fichiers YAML utilisés par FPSLocker, et des correctifs spécifiques sont aussi disponibles dans un entrepôt de données.\n \n \n\n \n \n \n \nChangelog FPSLocker 1.2.1 :\n \n- Ajout d'une option \"Semi-activée\" pour Window Sync qui ne temporise pas nvnSyncWait si au moins la deuxième image consécutive a été rendue en moins de 8,3 ms.\n- Au prix d'une légère baisse des performances, cela a permis de résoudre les problèmes dans Tears of the Kingdom avec des temps de chargement plus longs et des déchirures d'écran dans les menus à 60 FPS.\n- Il est nécessaire de mettre à jour NX-FPS à la version 1.5.1+ pour que cela fonctionne.\n \n \nEdit 23.05.23 \n \nTéléchargement : FPSLocker v1.2.2\n \n \n",
        "images": {}
    },
    "news_11": {
        "title": "[PS4] PS4 Store PKG v2.5 disponible",
        "content": "Le développeur LightningMods nous informe de la disponibilité d'une nouvelle version de PS4 Store PKG qui est maintenant proposée en v2.5. Pour ceux qui ne connaitraient pas cet outil permet d'effectuer diverses opérations sur les sauvegardes de jeux et les homebrews installés sur une console PlayStation 4.\n \nAu programme, une nouvelle section \"mise à jour\" qui est proposée en Bêta, et quelques optimisations intéressantes comme la possibilité de bénéficier de rapports de crashs via des logs. \n \n \n\n \n\n \nChangelog 2.5 : \n \n- Ajout de la section Mises à jour (BETA)\n- la fonction de recherche n'est plus sensible à la casse\n- Ajout du préchargement des icônes au démarrage (paramètre)\n- Ajout de la possibilité de télécharger les logs de crash après un crash\n- Plus d'informations\n \n \nA noter que l'Online Store Installer a été également mis à jour, il s'agissait là de corriger un bug sur le firmware 9.00.\n \nChangelog : \n \n- Correction d'un problème avec le message OOM qui apparaissait tout le temps (seule la version firmware 9.00 avait ce problème).\n \n \nTéléchargement : PS4 Store PKG v2.5\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1823312265.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-1598524563.jpg"
        }
    },
    "news_12": {
        "title": "[Switch] DBI 569 disponible",
        "content": "Rashevskyv, le développeur de DBI propose une nouvelle version de son logiciel, la version 569. DBI, pour DB Installer, est un gestionnaire et installateur de fichiers NSP/NSZ/XCI et XCZ via SD, USB. Il fonctionne tout aussi bien en standalone ou bien en créant son propre serveur http local. Il permet aussi de gérer et supprimer les fichiers orphelins les tickets (mise à jours par exemple). Hormis une tendance très minimaliste exacerbée, DBI est apprécié pour ses fonctionnalités et une partie backend de Windows qui permet de faciliter les transferts.-Grâce au multi-threading, l'installation du NSP a été accélérée d'environ 40%. -Désormais plus d'informations sont affichées pendant le processus d'installation et certaines erreurs de sortie ont été corrigées lorsque la console est en mode dock. -Les dumps de plus de 4Go peuvent également être dumpés sur des périphériques FAT32 grâce au fractionnement. -Le menu de sauvegarde des données a été repensé et un code QR s'affiche au démarrage du serveur FTP.\n \n Changelog 569 :\n- Fixed #223\n- Added text editor (hotkey is L3 in opened text file). More info\n \nTéléchargement: DBI 569\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174212/in-switch-dbi-569-disponible-1.jpg"
        }
    },
    "news_13": {
        "title": "[2DS/3DS/DS] TWiLight Menu++ v25.9.6 et nds-bootstrap v0.71.2",
        "content": "Le développeur RocketRobz propose à la scène 3DS de découvrir une nouvelle version de TWiLight Menu++ et de nds-bootstrap qui passent respectivement en v25.9.6 et 0.71.2. TWiLightMenu++ pour rappel est un menu alternatif, open source et personnalisable pour lancer des homebrews DS, jeux et roms DS, GBA, BD via la DS, 3DS ou 2DS.\n \nLes versions 25.9.5 et 25.9.6 se sont rapidement succédées, et nds-bootstrap est désormais lui proposé en version v0.71.2.\n \nAu programme, un peu comme d'habitude, des améliorations du code, des corrections de bugs, et des corrections sur les AP-fix.\n \n \n\n \n \nLes nouveautés 25.9.5 : \n \n- Ajout d'un AP-fix fonctionnel pour The Legend of Zelda : Spirit Tracks (Europe, Rev 1) !\n- Le correctif provient de la base de données de triche de DeadSkullzJr.\n \nAméliorations :\n \n- lifehackerhansol : Mise à jour de certains pilotes DLDI.\n- Correction d'un bug possible où un jeu ne démarrait pas s'il était placé sur la racine du SD.\n \nLes nouveautés 25.9.6 :\n \n- Pour restaurer complètement l'aspect du menu DSi, le skin de repli par défaut pour le thème DSi est maintenant le skin clair au lieu du skin foncé. Ceci a été fait parce que certains utilisateurs ont apparemment eu de mauvaises premières impressions avec TWLMenu++ sur DSi, et en plus, auraient fini par faire des forwarders pour le Menu DSi original (avec l'installation optionnelle de hiyaCFW, un CFW DSi qui n'est plus nécessaire de nos jours).\n- Vous pouvez toujours télécharger le dark skin ici : https://skins.ds-homebrew.com/nintendo-dsi/default-dark Dans le fichier dark.7z, mettez le dossier dark dans sd:/_nds/TWiLightMenu/dsimenu/themes/, puis ouvrez TWLMenu++ Settings, sélectionnez Theme (réglé sur Nintendo DSi), appuyez sur A, puis sélectionnez dark.\n \nAméliorations :\n \n- lifehackerhansol : Mise à jour de l'auto-démarrage du GMP-Z003 vers flashcard-bootstrap v1.2.3, avec un DLDI open-source.\n- Correction du jingle de démarrage de la DS/DSi qui ne jouait pas et dont le son ne jouait pas ou jouait mal à la place.\n \n \nTéléchargement : TWiLight Menu++ v25.9.6 et nds-bootstrap v0.71.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174112/in-2ds3dsds-twilight-menu-v2596-et-nds-bootstrap-v0712-1.jpg"
        }
    },
    "news_14": {
        "title": "[Multi] PS Multi Tools v13.0.2 avec PSMT Library v1.0.2 disponible",
        "content": "Le développeur SvenGDK est déjà de retour avec une nouvelle version de PS Multi Tools, l'outil à tout faire pour utilisateurs PlayStation est donc disponible dans sa version 13.0.1 et débarque avec PSMT Library v1.0.2 qui est intégrée. Comme vous le savez, PS Multi Tools est un gestionnaire de backups pour PS1, PS2, PSX, PS3, PS4 et PS5 (ultérieures), PSP et PS Vita. Inclut des homebrew, des firmwares, des téléchargements d'outils Windows et des outils intégrés pour toutes les consoles et tous les PC référencés. Cet outil vous permettra, entre autres, de télécharger des homebrews ainsi que des Firmwares officiels ou Custom Firmwares, le tout depuis votre ordinateur, accompagné d'une interface conviviale.\n \nCette nouvelle version apporte son lot de changements. \n \n \n\n \n \nChangelog dans PS Multi Tools v13.0.1 :\n- L'option Strict est désormais activée\n- La mise à jour de la bibliothèque est désormais totalement optionnelle\n- Un changelog avec les changements de la bibliothèque sera désormais affiché après une mise à jour\n- Ajout des actions manquantes du menu contextuel PKG Info pour PS3/PS4/PS Vita\n\n \nChangelog dans PS Multi Tools v13.0.2 :\n- Correction de PKGInfo (modification de l'utilisation dans psmt-lib)\n- La bibliothèque de jeux PSP affiche désormais clairement la sélection d'un élément\n- La bibliothèque de jeux PS Vita affiche désormais clairement la sélection d'un élément\n- Le titre du jeu ou de l'application devrait maintenant s'afficher correctement sur PSP et Vita.\n- L'option de menu Bibliothèque->\"Ouvrir le dossier Téléchargements\" fonctionne désormais dans tous les menus (si le dossier Téléchargements existe).\n \n\nChangelog dans la bibliothèque PSMT incluse v1.0.2 :\n- L'option Strict est désormais activée\n- Navigateur FTP : Créer un nouveau dossier devrait fonctionner maintenant\n- Mise à jour de MOD WebMAN vers la version 1.47.45\n- Ajout de liens vers les hôtes PS4 (n'affiche que les liens)\n- PackageInfoWindow -> DownloadPackageInfoWindow (Charge les infos depuis le web avec l'ID du contenu)\n- Nouvelle fenêtre PKGInfo pour PS3/PS4/PSV (Charge les infos depuis .pkg)\n- Autres corrections et changements mineurs\n \n \nTéléchargement : PS Multi Tools v13.0.2\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174102/in-multi-ps-multi-tools-v1301-avec-psmt-library-v102-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[PS4] Une nouvelle clé SMU dévoilée sur la PS4",
        "content": "Le développeur Zecoxao, qui s'est de nouveau fait bannir son compte de Twitter, vient d'annoncer qu'une nouvelle clé très intéressante vient de faire son apparition. Certains progrès qui nous viennent du décryptage du SMU (unité de gestion du système AMD) des PS4. \n \nCette clé, utilisée pour décrypter les firmwares de débogage, est également compatible pour les hashs des firmwares des consoles Retail, cela pourrait faire évoluer le hack PS4 vers un décryptage des firmwares, en parvenant à apporter un custom firmware par exemple sur la PS4. Zecoxao précise que vous pouvez probablement dumper vos propres clés/fusibles avec l'exécution du code SMU.\n \n \n\n \n\n \n \nL'AMD System Management Unit (SMU) est une unité de gestion thermique et électrique présente dans les processeurs AMD x86 modernes, ce SMU serait assez similaire sur PS5, mais rien n'est confirmé de ce côté là, il ne faut même rien en attendre, les développeurs se concentrant sur la PS4. Le déblocage du SMU pourrait aussi permettre de profiter de nouveaux espaces pour libérer de la mémoire exploitable, et ainsi permettant l'exécution de codes, bref lancer des outils et des hacks plus facilement sur les derniers firmwares notamment. \n \n \nLa clé quand a elle se trouve dors et déjà sur le wiki.\n \nLe reste est là : twitter.com / fahrplan.events.ccc.de\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174070/in-ps4-une-nouvelle-cle-smu-devoilee-sur-la-ps4-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174070/in-ps4-une-nouvelle-cle-smu-devoilee-sur-la-ps4-2.png"
        }
    },
    "news_16": {
        "title": "[PS3] CCAPI 4.90 CEX disponible",
        "content": "Enstone, qui est pour rappel un développeur français, nous propose une mise à jour de CCAPI, l'API qui vous permet d'exploiter Control Console, une application qui vous permet de connecter votre console PlayStation 3 à votre PC avec l'API TMAPI (Target Manager), comme cela est possible via une console DEX. \n \n \n\n \n \nAttention, CCapi peut provoquer un soft brick sur les slims et super slim en HEN, CCAPI se destine aux consoles disposant d'un CFW. Pour rappel, CCAPI (Control Console API) est une application qui nous permet de connecter un PC à la  PS3 via TMAPI comme il est possible de le faire avec les consoles DEX. Pour rappel, CCAPI établit une interface entre votre PS3 et votre PC, facilitant le lancement de commandes, comme la modification de l'IDPS (ou du PSID) de la console. Il vous permet aussi de connaître les températures en direct, ou encore d'établir des mods RTE, tout cela en wifi ou via le câble réseau. Cette révision 11 apporte le support des firmwares 4.90 CEX. \n \n \n\n \n \nAttention à ne pas utiliser sur HEN ni sur PEX 4.90.\n \n \nTéléchargement : CCapi (Control Console Api) V2.80 Rev11\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174048/in-ps3-ccapi-490-cex-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174048/in-ps3-ccapi-490-cex-disponible-1.jpg"
        }
    },
    "news_17": {
        "title": "[Multi] La Anbernic RG405M voit débarquer un CFW !",
        "content": "Alors là nous vous avouons ne pas connaitre cette \"console\", nous découvrons donc ensemble la RG405M, il s'agit là d'une console proposé par Anbernic qui est une société chinoise spécialisée dans la fabrication de consoles de jeux rétro et de produits électroniques similaires. Ils se sont fait connaître en produisant des consoles de jeux portables qui émulent des systèmes de jeux classiques tels que le Game Boy, le Super Nintendo et la Sega Megadrive.\n \nLes consoles d'Anbernic sont généralement dotées d'un écran couleur, de boutons de contrôle, de haut-parleurs intégrés et d'une batterie rechargeable. Elles prennent en charge une large gamme de jeux rétro, offrant ainsi aux joueurs la possibilité de revivre les expériences de jeux classiques sur des appareils portables. En plus des consoles portables, Anbernic propose également des boîtiers de console de jeux rétro basés sur des cartes Raspberry Pi, ce qui permet aux utilisateurs de construire leur propre système de jeux rétro personnalisé.\n \n \n\n \n\n \n\n \n \nAu delà des spécifications techniques intéressantes, cette Ambernic RG405M que l'on retrouve autour des 180 à 200 euros selon la mémoire que vous prenez avec de 128 Go (eMMC) extensible à 384 Go (MicroSD avec une 256 Go) dispose de nombreux avantages. \n \nCette nouvelle console compacte et élégante est spécialement conçue pour les amateurs de jeux nostalgiques. Avec son écran couleur haute résolution de 4,5 pouces, de 4267 jeux Android, PS2, WII, NGC, 3DS, PSP, DC, SS, PS1, NDS, N64, CPS1, CPS2, CPS3, FBA, NEOGEO, GBA, GBC, GB , SFC, FC, MD, SMS, GG, MSX, PCE, WSC, N-Gage et plus de 20 formats de jeux émulateurs dans un corps en aluminium CNC ultra-compact.\n \nJusque là une console chinoise rétro, ok pas de quoi sauter au plafond non plus compte tenu de sa résolution assez faible de seulement 640*480, mais là où cela commence à devenir intéressant c'est qu'un CFW répondant au nom de GammaOS vient de faire son apparition !\n \n \n\n \n\n \n \nVoilà les caractéristiques de GammaOS :\n \n- Basé sur une version LineageOS 19.1 propre et déverrouillée, Android 12 pour une expérience plus fluide. Applications non essentielles supprimées.\n- Lanceur Daijisho en tant que frontal, préconfiguré avec RetroArch pour certains systèmes. (Paramètres optimisés pour GB, GBC, GBA, NES, SNES, Genesis, PSX).\n- Play Store et magasin Aurora inclus.\n- Bloqueur de publicité Adguard inclus par défaut (peut être désactivé via les paramètres DNS privés).\n- Magisk/root inclus (peut être activé après le redémarrage de l'appareil).\n- Taux de rafraîchissement fixe de 60 Hz pour l'affichage (le stock est de 61,2 Hz et peut causer des problèmes de rythme d'image avec l'émulation).\n- Affichage de partage fixe.\n- Étalonnage du stick analogique pour des contrôles plus stricts.\n- Le CPU et le GPU utilisent désormais des régulateurs de performances pour une amélioration supplémentaire des performances.\n- Nouveaux pilotes GPU tirés de Retroid Pocket 3+ pour une nouvelle amélioration des performances.\n \n \n\n \n \nNous devons ce CFW au développeur TheGammaSqueeze qui nous montre comment flasher la console, qui après proposé la v1.0, propose déjà la v1.1.\n \n \nChangelog 1.1 :\n \n(v1.1) Mise à jour de l'image de base du système vers lineage-19.1-20230508-UNOFFICIAL-arm64_bgN.\n(v1.1) Débloquer la fréquence de la mémoire DDR à 1866mhz pour augmenter les performances.\n(v1.1) Déplacement du pilote graphique Retroid Pocket 3+ vers une version expérimentale séparée. Réintroduction par défaut du pilote graphique Anbernic avec des optimisations supplémentaires.\n(v1.1) Mise à jour des scripts de flashage pour utiliser une méthode de flashage alternative afin d'éviter les problèmes avec les appareils incompatibles. Mise à jour des instructions.\n(v1.1) Mise à jour de RetroArch/Daijisho - pour les nouvelles installations/réinitialisation d'usine uniquement. Changement du noyau SNES RetroArch par défaut en Snes9x Current pour résoudre le bug des contrôles qui ne fonctionnaient pas lors du lancement à partir de Daijisho.\n(v1.1) Mise à jour des paramètres de RetroArch - pour les nouvelles installations/réinitialisations d'usine uniquement. La bascule du menu est déplacée vers la combinaison L3 + R3. L'option Close Content menu permet de fermer RetroArch et de revenir à l'application précédente (généralement Daijisho). Augmentation de la taille de la police du menu.\n(v1.1) Mise à jour des raccourcis clavier de RetroArch - pour les nouvelles installations/réinitialisations uniquement (Home/Back button + L1/Slow Motion | L2/Load State | R2/Save State | R1/Fast Forward | X/Show FPS | Y/Screenshot).\n \n \n\n \n \n \nTéléchargement : Gamma OS v1.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1174046/in-multi-la-anbernic-rg405m-voit-debarquer-un-cfw-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1174046/in-multi-la-anbernic-rg405m-voit-debarquer-un-cfw-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1174046/in-multi-la-anbernic-rg405m-voit-debarquer-un-cfw-3.png"
        }
    },
    "news_18": {
        "title": "[Switch] Ultimate-Switch-Hack-Script 4.3.294 disponible",
        "content": "Cela faisait un moment que je n'avait pas posté de new sur mon Ultimate-Switch-Hack-Script qui, depuis près d'un an et demi maintenant, est passé en version 4.3.294.\nPour rappel, mon script permet par exemple de préparer une SD avec le contenu nécessaire au lancement d'un CFW, des homebrews, des modules et des overlays; de plus, il est possible de créer des profiles pour chaque élément se qui permet une configuration à la fois assez précise et qui peut être reproduite rapidement. Le script contient aussi de multiples fonctions permettant d'agir sur la nand (infos, dump, restauration, activation/désactivation de l'auto-rcm, montage d'une partie de la nand sur le PC grâce à Memloader...), il contient un lanceur de payload, on y trouve aussi NSC_Builder traduit en français, des outils pour flasher les différentes puces existantes et encore bien d'autres choses, voir cette page pour voir une liste de fonctionnalités plus détaillée qui doit être elle aussi incomplète tant il y a de choses,mais le mieux reste de naviguer dans les menus du script et de voir se qu'il propose.\nDepuis la dernière new les évolutions sont très nombreuses, bien trop pour être notées ici. Cependant comme d'habitude le support des derniers firmwares a été ajouté, le support du Picofly a été implémenté, les mises à jour des différents logiciels utilisés ainsi que des homebrews ont été effectuées et il y a eu des corrections de bugs et probablement d'autres choses que j'ai oublié de noter ici mais voir plus bas pour savoir comment consulter les changelogs complets.\n \n\nJe me permet de rappeler que mon script n'est qu'une aide pour le hack et même si les choses sont généralement expliquées durant l'exécution des fonctionnalités cela ne dispense pas de comprendre se que l'on fait, par exemple il y a la FAQ qui est un bon point de départ et qui contient pas mal d'informations et de liens vers différents tutoriels, ce sujet qui contient des informations sur les manipulations basiques ou encore ce sujet qui contient des infos pour les consoles équipées de puces SX Core/Lite ou Hwfly. Il y a aussi la documentation du script qui pourra parfois vous aiguiller sur les choses à faire ou sur les éléments contenus dans la préparation d'une SD, n'hésitez pas à la consulter et même à regarder les crédits qui peuvent contenir des informations intéressantes.\nPour voir les évolutions de mon script en détail vous pouvez vous rendre sur cette page pour le changelog du script et sur cette page pour le changelogs des packs de CFW/homebrews/modules/overlays/cheats.\nLa version base peut être téléchargée ici; pour la version complète vous pouvez cliquer ici mais je ne recommande pas de faire ainsi mais plutôt de passer par la version base et d'utiliser le gestionnaire de mises à jour intégré au script pour ajouter ou mettre à jour les différentes fonctionnalités car le téléchargement de la version complète ne récupère pas se qui est lié à des projets externes comme les sig_patches par exemple.\nHistoire de clarifier le comportement du gestionnaire de mises à jour du script je vais réexpliquer son fonctionnement, la demande intervenant en premier lieu juste après le premier message du script met seulement à jour les éléments de base du script comme les menus ou les programmes indispensables au bon fonctionnement de l'ensemble, ensuite chaque fonctionnalité est gérée indépendamment et si la mise à jour est acceptée sur une fonctionnalité, les éléments de base seront aussi mis à jour. Bon maintenant pour expliquer en pratique on va imaginer que vous utilisiez le script pour lancer des payloads et préparer une SD se qui représente deux fonctionnalités différentes, pour avoir la dernière mise à jour des deux fonctionnalités il faudra lancer chacune d'entre elle et accepter à chaque fois la mise à jour. Il y a aussi une fonction qui permet via le menu \"A propos\", de mettre à jour l'ensemble des fonctionnalités du script en même temps mais ceci peut prendre pas mal de temps car il y aura beaucoup de choses que le script devra vérifier/télécharger.\nSi vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal.\nEn cas de bugs, de propositions de fonctionnalités ou d’améliorations veuillez s'il vous plaît passer par le Github du projet ou bien par le sujet dédié à mon script sur le forum, de cette façon je peux traiter bien plus rapidement les informations/demandes.\nEnfin, vous avez cette page pour voir les nombreux crédits pour les outils utilisés dans mon script à un moment ou à un autre, comme d'habitude remercions tout ce beau monde pour leurs travaux, leurs participation au projet d'une manière ou d'une autre et également un grand merci aux quelques donateurs.\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1146702/in-switch-ultimate-switch-hack-script-43216-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[XB] Microsoft dévoile l'application Xbox pour Windows en version 2305.1000.48.0",
        "content": "Microsoft a dévoilé une mise à jour majeure de son application Xbox pour Windows, offrant aux joueurs une expérience encore plus immersive et pratique, du moins à ceux qui se sont inscrits au programme Windows Gaming Insiders.\n \nLa nouvelle version de l'application Xbox pour Windows, la quatrième version 2305, introduit la correction de nombreux bugs. En plus du streaming en 4K, l'application Xbox pour Windows propose également une intégration plus étroite avec le Xbox Game Pass. Les abonnés auront la possibilité de parcourir, télécharger et jouer à une vaste bibliothèque de jeux directement depuis l'application, simplifiant ainsi leur expérience de jeu et leur permettant de découvrir de nouveaux titres en quelques clics. La mise à jour de l'application Xbox pour Windows comprend des améliorations de l'interface utilisateur, rendant la navigation plus intuitive et fluide. \n \n \n\n \n \nCette mise à jour de l'application Xbox pour Windows témoigne de l'engagement continu de Microsoft à offrir aux joueurs une expérience de jeu exceptionnelle sur PC. Avec ses fonctionnalités améliorées, ses nombreuses corrections de bugs et son intégration étroite avec le Xbox Game Pass, l'application Xbox pour Windows est un outil essentiel pour les joueurs passionnés qui souhaitent profiter pleinement de leur expérience de jeu sur PC.\n \n \n\n \n \n \nCorrections de bugs :\n \n- Correction de divers problèmes d'interface utilisateur, y compris des problèmes de navigation ou des problèmes d'images coupées\n- Correction d'un problème où la sélection de Tout reprendre pouvait en fait suspendre certains téléchargements\n- Correction d'un problème où Minecraft pouvait ne pas apparaître correctement comme récemment joué\n- Correction d'un problème où certains achats DLC pouvaient afficher une \"Erreur Réessayez\"\n- Correction d'un problème où le narrateur pouvait ne pas fonctionner correctement après la déconnexion de la lecture à distance\n- Correction d'un problème où le filtrage des jeux pouvait ne pas afficher les titres corrects autour du multijoueur en ligne\n- Correction d'un problème où les utilisateurs pouvaient être invités à sélectionner le lecteur d'installation même après avoir sélectionné l'invite de ne pas\n \nProblèmes connus:\n \n- Les éléments du bundle Hearts of Iron IV affichent le message d'erreur \"Impossible d'afficher maintenant\"\n- L'art peut parfois manquer ou montrer un visage triste sur les cartes de jeu\n \nPour télécharger la dernière version de l'application Xbox pour Windows, les utilisateurs peuvent se rendre sur le site officiel de Microsoft ou mettre à jour l'application existante via le Microsoft Store.\n \n \nTéléchargement : Application Xbox publiée : 2305.1000.48.0  (17h00 PT – 16 mai 2023)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-2030267232.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173989/in-xb-microsoft-devoile-lapplication-xbox-pour-windows-en-version-23051000480-1.png"
        }
    },
    "news_20": {
        "title": "Un bidouilleur transforme son Steam Deck pour y accueillir des Joy-Cons !",
        "content": "Les merveilles techniques sont toujours un plaisir à découvrir lorsque l'on a l'esprit hacker, et les ingénieurs (professionnels ou du dimanche) ne cessent de surprendre par la quantité de créativité qu'ils peuvent apporter aux appareils déjà existants pour combler des besoins très spécifiques.\n \nL'utilisateur Reddit /u/mrblackm123, propriétaire d'un Steam Deck, a commencé à rencontrer des problèmes du côté de la manette de l'appareil. En raison du manque de pièces de rechange pour réparer complètement le Steam Deck, l'utilisateur a plutôt opté pour quelque chose de plutôt ingénieux... Installer quelques rails de Joycon directement dans le Deck, ou plutôt, dans une tablette comprenant la carte mère démontée sans les éléments de la manette d'origine.\n \nEn d'autres termes, ce passionné de hacking a \"NintendoSwitché\" son Steam Deck... (On adopte ce terme ?) \n \n\n \nLa vidéo présente le Steam Deck \"tablette\" avec les rails latéraux installés, puis l'utilisateur attache rapidement les Joycons sur le côté de la tablette du Deck pour commencer à jouer à une variété de jeux avec eux, allant de l'utilisation des Joycons pour jouer à Cyberpunk 2077, à Breath of the Wild ou encore à Link's Awakening via émulateur sur l'appareil.\n \nLa publication est disponible sur Reddit, sous /r/Steam Deck. Cependant, il semble que les modérateurs du subreddit aient confondu l'appareil avec une sorte de console Switch, car ils ont supprimé la publication de l'utilisateur. Espérons que la publication pourra être rétablie une fois que les modérateurs auront réalisé leur erreur.\n \nQuelle sera la prochaine console à NintendoSwitcher ? Et pourquoi pas la PSP... A bon entendeur !\n \n\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1173943/in-un-bidouilleur-transforme-son-steam-deck-pour-y-accueillir-des-joy-cons-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1173943/in-un-bidouilleur-transforme-son-steam-deck-pour-y-accueillir-des-joy-cons-2.png"
        }
    }
}