{
    "news_1": {
        "title": "[Switch] LineageOS 18.1 Bêta 2.75 disponible",
        "content": "Le développeur CTCaer est de retour avec une nouvelle version de  LineageOS 18.1 qui passe en Bêta 2.75 après la sortie express de la 2.5.\n \nIl y a tout juste une semaine sortait la 2.0, mais il semblerait que les versions s'enchainent rapidement puisque de nombreuses corrections ont déjà été apportées par le développeur. \n \nPour rappel LineageOS 18.1 est l'arrivée de la version d'Android 11 sur la Switch, et il faut donc l'ajuster pour qu'elle fonctionne au mieux sur la console de Nintendo. \n \nLa Team SwitchRoot propose donc cette Bêta 2.75 qui corrige de nombreux bugs, notamment sur la double entrée CEC, la correction de l'étalonnage de la Switch Lite, des corrections des paramétrages de la table EMC de L4T, mais aussi l'analyse d'adresse MAC, ou encore un correctif important sur la signature de l'APK du console launcher, ainsi les mises à jour via le Play Store devraient désormais fonctionner. \n \n \n\n \n \nChangelog Beta 2.75 :\n- Correction de la double entrée CEC\n- Correction de l'étalonnage Lite\n- Correction de la table EMC de L4T\n- Meilleure analyse de l'adresse MAC (et correction du MAC Wi-Fi - maintenant le MAC BT avec FF comme dernier octet est utilisé, et seul le joycon_mac.ini est analysé)\n- La signature de l'APK de Console Launcher devrait être corrigée, ce qui signifie que les mises à jour via le Play Store ne devraient plus échouer.\n \nChangelog Bêta 2.5 :\n- Correction des ventilateurs sur les modèles Erista\n \n \nTéléchargement : nx-tab-beta2.75-20230705-rel.7z\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175804/in-switch-lineageos-181-beta-275-disponible-1.png"
        }
    },
    "news_2": {
        "title": "[PS4] PS4 Wee Tools 0.4 disponible",
        "content": "Cela s'accélère du côté de la possibilité de downgrade une PS4 qui dispose d'un firmware supérieur au 9.00. La possibilité de downgrade une console ayant été mise à jour au dessus du firmware 9.00 via une seule mise à jour est désormais certaine, il ne faudra pas que la console ait été mise à jour plus d'une fois, mais au moins cela est envisageable. \n \nUn nouvel utilitaire a fait son apparition il y a quelques jours, il s'agit de PS4 Wee Tools, proposé par Andy-man, il permet d'aider aux dumps PS4 nor et syscon. Pour parler simplement, il s'agit d'une alternative libre et gratuite aux outils PS4-NOR-Validator et Syscon-Patcher de BwE, écrite en Python pour rester simple.\n \n \n\n \n \n \nActuellement, il fournit des fonctionnalités de base et ne peut pas remplacer complètement ces outils, il faudra utiliser en complément PS4 Syscon Tools ou encore NOR validator, mais clairement l'outil progresse à grands pas. \n \nAinsi l'outil PS4 Wee Tools permet d'obtenir des informations détaillées sur le dump de la NOR, permet de basculer en mode UART, de réaliser des tests mémoire, ou sur les clés Keystorage, de nettoyer certains indicateurs système, de modifier la fréquences de la mémoire GDDR5, ou encore de modifier l'indicateur de démarrage SAMU. Il permet aussi d'offrir un contrôle important sur les Syscons, permettant de modifier certains emplacements de contrôles SNVS.\n \n \n\n \n \n \nChangelog v0.4 :\n- Vérification de la possibilité d'appliquer des correctifs à Syscon\n- Correction des bugs du patch manuel\n- Correction d'erreurs mineures \n \nChangelog v0.3 :\n- Statistiques de l'entropie NOR\n- Patch manuel Syscon\n- Correction d'erreurs mineures\n \nChangelog v0.2 :\n- Bascule Syscon DEBUG\n- Classe NVStorage Syscon\n- Syscon show active slot\n \nChangelog v0.1 :\n- Comparaison de fichiers\n- UART, Memtest basculer\n- Sys flags clean\n- Modifier l'horloge mem et le SAMU\n- Downgrade des motifs de commutation\n- Vérification de la base Syscon\n \n \nUn PDF regroupant l'ensemble des étapes a été diffusé sur l'expérience de Ruben Waernewyck qui a réussi à downgrader sa PS4 du firmware 9.03 au firmware 9.00. son expérience s'est appuyé sur de nombreux outils, dont PS4 Wee Tools. \n \nSi l'expérience de downgrade de Ruben vous intéresse elle est dévoilée ici (PDF).\n \n \nAttention, Andy-maN le rappelle, il n'est pas un professionnel de la réparation PS4, il a réussi quelques dumps mais ne peut garantir le fonctionnement parfait de PS4 Wee Tools, il faudra plusieurs mois de développement pour cela, à utiliser donc avec la plus grande prudence compte tenu que vous avez là accès à des éléments sensibles de la console. \n \n \nTéléchargement : ps4-wee-tools\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175803/in-ps4-ps4-wee-tools-04-disponible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175803/in-ps4-ps4-wee-tools-04-disponible-2.png"
        }
    },
    "news_3": {
        "title": "[Vita] PKGJ v0.56 Bêta 3 disponible",
        "content": "Bonne nouvelle, voilà une nouvelle version de PKGJ pour la PlayStation Vita, la version précédente officielle a été proposée en Mai 2020, cela remonte donc à plus de 3 ans, et voilà donc la bêta 3 de la version 0.56.\n \nIl s'agit d'une pre-release, mais comme un concours PlayStation Vita démarre, on voit bien que la scène redémarre, et cela va faire du bien pour tout ceux qui attendaient cela. \n \n \n\n \n \nPKGJ est un utilitaire exceptionnel pour la console, PKGj est un fork de PKGi, par rapport à  PKGi cette mouture met en file d'attente plus de téléchargements, prend en charge le format de fichier TSV, les DLC et mises à jour PSP/PSX et PSM. Pour rappel, \"Pkgj\" est le Freeshop de la PSVita et vous devez toujours installer le plug-in npdrm_free.prx pour faire fonctionner les jeux PSP.\n \nJustement, cette dernière version 0.56 Bêta 3 proposée depuis quelques heures par le développeur LiEnby apporte le support de téléchargement de jeux PSP à partir de Live Area.\n \n \n \nTéléchargement : PKGJ v0.56 Bêta 3\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175802/in-vita-pkgj-v056-beta-3-disponible-1.png"
        }
    },
    "news_4": {
        "title": "[Vita] FuHEN, le nouveau concours Vita Homebrew avec 1 000 $",
        "content": "La scène PlayStation Vita est toujours là, et pour de bons car elle est souvent relayée par des concours d'homebrews, il y a deux ans, c'était le concours homebrew KyuHEN qui avait relancé les développeurs, cette année c'est donc FuHEN qui mettra en avant des jeux, des utilitaires et des portages pour la PlayStation Vita. \n \nIl s'agit de la nouvelle version du concours KyuHEN, les bases sont donc les mêmes, il va falloir proposer son jeu ou son utilitaire contre un prix de 1000 $ répartis entre les 3 catégories, sans compter les goodies. \n \n \n\n \n \nLe concours homebrew FuHEN PS Vita a déjà commencé, soumettez vos candidatures jusqu'au 22 septembre 2023. Attention pour y participer, vous devez avoir créé votre programme (utilitaire, jeu, plugin...) à partir de zéro, ou des SDK existants comme Gamemaker ou Unity. \n \nOn retrouvera probablement des grands noms de la scène Ps Vita comme gl33ntwine , Cimmerian , Frangarcj , 2 Old 4 Gaming,  ou encore SKGleba.\n \n \nVoici les 3 catégories : \n \nJeu : créez un jeu original, soit à partir de zéro, soit avec un moteur de votre choix, par exemple GameMaker ou Unity.\nUtilitaire : Créez un homebrew utilitaire ou un plugin.\nPort : Porter une application ou un jeu depuis un autre système.\n \n \nTout est là : fuhen.homebrew-contest.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175801/in-vita-fuhen-le-nouveau-concours-vita-homebrew-1.png"
        }
    },
    "news_5": {
        "title": "[Switch]DBI 598",
        "content": "Rashevskyv, le développeur de DBI propose une nouvelle version de son logiciel, la version 576. DBI, pour DB Installer, est un gestionnaire et installateur de fichiers NSP/NSZ/XCI et XCZ via SD, USB. Il fonctionne tout aussi bien en standalone ou bien en créant son propre serveur http local. Il permet aussi de gérer et supprimer les fichiers orphelins des tickets (mise à jours par exemple). Hormis une tendance très minimaliste exacerbée, DBI est apprécié pour ses fonctionnalités et une partie backend de Windows qui permet de faciliter les transferts.\n \n\n \nChangelog 598 :\n- Added detailed console information in \"Tools\" > \"System Information\"\n- In MTP mode, the current active USB 3.0 Super Speed / USB 2.0 High Speed connection type is displayed\n- Improvements in the Activity Log interface\n- Code refactoring for game installation queues\n- Fixed error in remaining_file_length data type\n- Fixed 2002-6203 copy error in Browse SD Card\n- Updated the context menu in File actions\n- Added a feature to delete old backups in the context menu in save backups. Deletes those backups for which there are newer ones for the same user.\n- Bugfixes\n \n \nTéléchargement: DBI 598\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175793/in-switchdbi-598-1.jpg"
        }
    },
    "news_6": {
        "title": "[DS] Emulation de la Nintendo DS, en Réalité Augmenté",
        "content": "Zhuowei Zhang, un développeur de homebrews, a récemment dévoilé une démonstration passionnante dans le domaine de la réalité augmentée (RA) pour l'émulation de la Nintendo DS. Cette fonctionnalité révolutionnaire présente une image holographique en 3D du jeu en cours qui flotte au-dessus de la manette utilisée pour l'émulateur. La démonstration de Zhang utilise l'émulateur melonDS et une fonction d'extraction de modèles 3D en temps réel appelée MelonRipper. L'expérience de réalité augmentée est rendue possible grâce à l'utilisation de RealityKit sur iOS.\n \n\n \nLe développeur a partagé des informations détaillées sur cette démonstration de concept sur GitHub. Cependant, Zhang reconnaît également quelques problèmes actuels. Par exemple, le convertisseur MelonRipper ne gère pas bien la transparence des objets, et il y a une fuite de mémoire qui entraîne le plantage de l'application après quelques minutes d'utilisation. De plus, le projet a été testé uniquement avec l'angle de caméra utilisé dans Mario Kart DS, et des fonctionnalités telles que la sélection de ROM ou l'entrée via l'écran tactile ne sont pas encore disponibles.\n \nMalgré ces défis, le projet est déjà remarquable, offrant aux joueurs un aperçu du monde de la réalité augmentée avec des jeux Nintendo DS populaires tels que Mario Kart DS, Pokemon Heart Gold et Pokemon Black. Les images flottantes des jeux sont très détaillées, à l'exception des problèmes de transparence mentionnés précédemment.\n \nActuellement, le projet est open source et peut être consulté via le référentiel GitHub de Zhang, dont le lien est fourni à la fin de cet article.\n \nPour les passionnés de jeux vidéo et les amateurs de réalité augmentée, la démonstration innovante de Zhuowei Zhang représente une avancée significative vers la fusion des expériences virtuelles avec le monde réel, ouvrant ainsi des possibilités d'un gameplay amélioré et d'interactions immersives. Avec un développement et un perfectionnement ultérieurs, cette technologie pourrait révolutionner notre manière d'interagir avec les jeux classiques sur les plateformes modernes.\n\nLien vers le GitHub: https://github.com/zhuowei/DSReality\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-1492724553.png"
        }
    },
    "news_7": {
        "title": "[Switch] L'émulateur Yuzu améliore grandement ses performances sous AMD",
        "content": "La dernière build de Yuzu apporte un lot d'améliorations importantes, et surtout des optimisations pour les propriétaires de cartes AMD. La version 1482 offre de nombreuses optimsations permettant des hausses de performances de l'ordre de 20 % sur GPU AMD. \n \nC'est notamment grâce aux instructions monitorx que l'émulateur Yuzu est désormais capable de mettre en place une gestion d'alimentation terriblement efficace. Une réduction de 11 % de consommation, et une augmentation de 20 % des performances. \n \n \n \n\n \n \n \nDe fait de nombreuses plates-formes AMD comme les Rog Ally, les Aya Neo et autres Steam Deck profitent désormais de ces optimisations. De plus de nombreuses corrections ont été apportées, des temps de chargements réduits, du spécifique pour Zelda : Tears of the Kingdom, ou encore des améliorations générales de performances. \n \n \nTéléchargement : Yuzu\n \n \n \n \n",
        "images": {}
    },
    "news_8": {
        "title": "[PS4/PS5] Emulateur en un clic pour PS5 et PS4 9.00+ (Mast1c0re)",
        "content": "Développé à la base, voici la version PS5/PS4 9.00+ de mon outils de création d'émulateur en un clic, ayant la même fonction que celui publié récemment pour PS4 Jailbreak.\n \n\n \nGrâce à ce petit GUI (toujours en batch) il vous sera très très simple de créer un ISO PS2 d'émulateur rétro pour vos PS5 6.50 et PS4 9.00+ utilisant le hack Mast1c0re, un simple clic sur l'émulateur voulu et tous se fera automatiquement, juste à patienter... Je ne peux pas faire plus simple ^^...\n \nVous pourrez donc en un clic créer un ISO pour Mast1c0re comprenant un émulateur GameBoy - Color, Nes, Snes, GameGear, Master System, Megadrive, Atari 800, Lynx, WonderSwam ou NeoGeo Pocket.\n \nUne seule chose à faire copier/coller vos roms dans le dossier Games, puis cliquer sur l' émulateur voulu, rien d'autre...\n \nAttention !!! Avant le premier lancement du .bat il vous faudra régler imgburn afin qu il crée l' ISO ps2, sans ce réglage, l' émulateur ne trouvera pas vos roms une fois lancé sur vos PS5 et PS4...Cette manip n' est à faire qu' une fois avant le premier lancement du .bat...\n \n- Lancer imgburn.exe  dans le dossier tools/\n- Sélectionner Create image file from files/folders\n- Puis l'onglet Advanced\n- Puis l' onglet Restrictions\n- Et sélectionner bien Level 2 - 31 characters\n- Fermer imgburn\n- Voilà il est bien configuré...\n \n \n\n \n\n \nTuto:\n \n\n- Copier/coller vos roms dans le dossier Games/\n- Cliquer sur l' émulateur de vos roms\n- Patienter\n- Lancer l' ISO obtenu avec la méthode Mast1c0re\n- Jouer\n\n \nTélécharger Retroarch PS2 for Mast1c0re PS4-PS5\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175739/in-ps4ps5-emulateur-en-un-clic-pour-ps5-et-ps4-900-mast1c0re-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175709/in-ps4-creer-un-fpkg-demulateur-en-un-clic-2.png"
        }
    },
    "news_9": {
        "title": "[PS2] Une mise à jour de l'émulateur Play! est disponible",
        "content": "Alors là clairement nous ne nous y attendions pas du tout, mais voilà qu'une mise à jour de l'émulateur Play! vient d'être mise en ligne. \n \nBonne nouvelle, cela débarque sur Windows (32 et 64 bits) mais aussi sur Mac OS, Linux, Android et iOS, que demande le peuple. \n \n \n\n \n \nPlus d'un an après la version 0.56, cette version 0.61 apporte beaucoup de nouveautés, tellement qu'il est impossible aux développeurs de toutes les citer. Play ! est un émulateur de PlayStation 2 gratuit, open-source, de haut niveau et multiplateforme. Sa compatibilité et ses fonctionnalités sont assez éloignées de celles de PCSX2.\n \n \n \n\n \n \n \n \nNouveautés :\n \n- Trop de choses à énumérer depuis la dernière version officielle (0.56), mais de nombreuses mises à jour de compatibilité et quelques optimisations.\n \n- Plus de 930 jeux confirmés comme jouables depuis la dernière fois.\n \n- Support préliminaire du Namco System 246. Il n'est supporté que dans la version desktop pour le moment.\n \n \nBien entendu tout n'est pas parfait, mais on s'approche de plus en plus de l'autre émulateur PS2, PCSX2, qui permet notamment de profiter de l'émulation sans dumper le bios, des paramétrages simples et la prise en charge d'Android sont attractives. \n \n \n \nTéléchargement : Play! 0.61  / code source\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-759839488.png"
        }
    },
    "news_10": {
        "title": "[Switch] switch_AIO_LS_pack 5.1.1 disponible",
        "content": "Le pack switch_AIO_LS_pack continu ses évolutions et passe en version 5.1.1.Pour rappel ce pack contient tout se qu'il faut pour le hack de toutes Switch pouvant lancer un hack en prenant en compte le maximum de configurations possibles.Le homebrew intégré AIO_LS_pack_Updater permet d'installer/mettre à jour le pack, le firmware et de faire tout un tas d'autres choses directement via la console (installation/mise à jour du pack non recommandée sur des SD en EXFAT à cause de la corruption de données possible avec ce format). Le mode Beta de l'application permet d'avoir les dernières évolutions du pack ou du homebrew AIO_LS_pack_Updater, par contre ces versions peuvent être instables. Depuis cette news les évolutions sont les suivantes:- Changelog pour la version 5.1.0:Mise à jour de l'overlay d'EdiZon vers la dernière version de celui-ci.Le script de nettoyage de la SD supprime maintenant certains fichiers liés au module MissionControl si la suppression de module est choisi durant le nettoyage.Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.00.00:Nouvelle fonction d'auto-configuration ajoutée, celle-ci permet de lancer l'installation du pack avec une configuration des options pré-définie. Cette fonction est totalement contrôlable et configurable via le homebrew, voir le menu d'aide de celui-ci pour en savoir plus. Sinon ceci es configurable via un fichier de configuration du homebrew, voir les fichiers de configuration du homebrew sur la page du projet.Détection d'une nouvelle version du pack disponible et affichage d'une notification pour lancer son installation. Si l'auto-configuration sans accès complet à toutes les fonctions du homebrew est activée, si aucune nouvelle version du pack n'est détectée l'installation du firmware seule sera proposée et si elle est refusée l'installation du pack sera proposée.La détection d'une nouvelle version du homebrew fonctionne comme celle du pack, ceci pose un problème aux anciennes versions du homebrew qui ne détecteront pas automatiquement cette nouvelle version, cependant la mise à jour manuelle du homebrew fonctionne toujours et une fois celle-ci faite tout rentrera dans l'ordre.Durant l'installation du pack et du zip complémentaire au pack le SHA256 de chaque fichier à extraire est comparé avant l'extraction si le fichier est présent sur la SD pour savoir s'il est nécessaire de le remplacer et après la copie pour savoir s'il a bien été extrait. Ceci augmente le temps nécessaire à l'extraction du pack mais augmente la durée de vie de la SD en copiant seulement se qui est nécessaire et cela augmente aussi la fiabilité de l'extraction. Ce paramètre peut être désactivé via les fichiers de configuration du homebrew, voir les fichiers de configuration sur la page du projet du homebrew.Si une erreur se produit durant l'extraction d'un fichier pendant l'installation du pack et du zip complémentaire au pack la copie du fichier est réessayée deux fois avant de stopper l'installation.Le nettoyage agressif n'est plus le même lorsqu'il concerne l'installation du pack ou du firmware, les noms des fichiers de configuration de cette fonction ont été mis à jour pour refléter ce changement.Correction d'un bug qui ne détectait pas correctement le répertoire des bootlogos lors de l'extraction du pack en mode beta et correction d'un bug qui faisait que le répertoire du firmware n'était pas forcément nettoyé en mode beta.Ajout d'informations dans le fichier de logs.Certains changements mineurs dans les messages affichés ont été effectués.Probablement des corrections de bugs et modifications mineurs que j'ai oublié.- Changelog pour la version 5.1.1:Mise à jour de AIO_LS_pack_Updater avec les modification suivantes pour sa version 6.00.01:Le calcul du SHA256 d'un fichier dans un zip est bien mieux pour l'usage de la ram (n'importe quel fichier peut être analysé) mais ceci ralenti encore le processus.Pour les détails des changelogs, le téléchargement et les instructions d'installation et d'utilisation du pack c'est sur cette page que ça se passe.Sauf pour la correction de bugs je pense que le homebrew AIO_LS_pack_Updater est arrivé plus ou moins à sa version final, cependant si vous avez des idées pour l'améliorer autres qu'une interface graphique n'hésitez pas à m'en faire part (consultez le readme du Github du projet pour voir les choses que je voudrais faire mais que je n'arrive pas à faire pour l'instant ou les choses que je pourrais faire mais la flemme, c'est dans la todo list), si vous êtes développeur et que vous voulez proposer des pull requests elles seront les bienvenues si elles respectent l'esprit du projet (du C si le C++ n'est pas indispensable, par exemple on évitera de faire appel à des modules en C++ pour la traduction que j'aimerai d'ailleurs faire en pur C car là elle utilise un vecteur qui est du C++ se qui me plaît déjà moyennement).N'hésitez pas à faire vos retours qu'ils soient positifs ou négatifs, ils seront les bienvenues tout comme le signalement de bugs ou encore la proposition d'améliorations, c'est aussi une bonne façon de participer à la scène et de faire vivre les projets.Si vous appréciez mon travail vous pouvez me faire une donation via ce lien si vous avez un compte Paypal (n'engendre pas de frais de transaction) ou via ce lien si vous n'avez pas de compte Paypal",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/validation/in-915403063.jpg",
            "image_2": "https://www.logic-sunrise.com/images/validation/in-557048383.jpg",
            "image_3": "https://www.logic-sunrise.com/images/validation/in-1283467935.jpg",
            "image_4": "https://www.logic-sunrise.com/images/validation/in-810510376.jpg",
            "image_5": "https://www.logic-sunrise.com/images/validation/in-534154846.jpg",
            "image_6": "https://www.logic-sunrise.com/images/validation/in-1618711611.jpg",
            "image_7": "https://www.logic-sunrise.com/images/validation/in-1560198606.jpg"
        }
    },
    "news_11": {
        "title": "[PS4] Créer un FPKG d'émulateur en un clic",
        "content": "Voici un petit programme qui va vous faciliter la création de FPKG PS4, afin de pouvoir jouer à vos émulateurs retros sur vos PS4 5.05/6.72 et 9.00.\n \n\n \nEn effet,  grâce à ce petit GUI (toujours en batch) il vous sera très très simple de créer un FPKG d' émulateur pour vos PS4, un simple clic sur l' émulateur voulu et tous se fera automatiquement, juste à patienter... Je ne peux pas faire plus simple ^^...\n \nVous pourrez donc en un clic créer un FPKG comprenant un émulateur GameBoy - Color, Nes, Snes, GameGear, Master System, Megadrive, Atari 800, Lynx, WonderSwam, NeoGeo Pocket, ou un retroarch tout en un comprenant tous les émulateurs pré-cités.\n \nUne seule chose à faire copier/coller vos roms dans le dossier Games, puis cliquer sur l' émulateur voulu, rien d'autre...\n \nAttention !!! Avant le premier lancement du .bat il vous faudra régler imgburn afin qu il crée l' ISO ps2 pour votre futur FPKG, sans ce réglage, l' émulateur ne trouvera pas vos roms une fois lancé sur vos PS4...Cette manip n' est à faire qu' une fois avant le premier lancement du .bat...\n \n- Lancer imgburn.exe  dans le dossier tools/\n- Sélectionner Create image file from files/folders\n- Puis l'onglet Advanced\n- Puis l' onglet Restrictions\n- Et sélectionner bien Level 2 - 31 characters\n- Fermer imgburn\n- Voilà il est bien configuré...\n \n \n \n \n \n\n \nTuto:\n \n\n- Copier/coller vos roms dans le dossier Games/\n- Cliquer sur l' émulateur de vos roms\n- Patienter\n- Installer le FPKG sur votre ps4\n- Jouer\n \n\n \nTélécharger Retroarch PS2 on PS4\n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175709/in-ps4-creer-un-fpkg-demulateur-en-un-clic-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175709/in-ps4-creer-un-fpkg-demulateur-en-un-clic-2.png"
        }
    },
    "news_12": {
        "title": "[Multi] GaryOPA organise une cagnotte pour redémarrer sa vie",
        "content": "Il semblerait que Gary Bowser n'est peur de rien, il serait à l'origine du lancement d'un cagnotte sur gofundme.com, qui a l'heure où nous écrivons a déjà reçu 14 dons pour pas moins de 1021 $ CAD. \n \nCe qui est surprenant c'est de nombreux développeurs ont dors et déjà participé comme Senaxx ou encore José Coixão (notzecoxao) à moins que là aussi ce soit des noms d'emprunt ou des usurpations d'identité.\n \n \n\n \n \nUn long texte accompagne la cagnotte et on y apprend pas mal de chose, comme le fait qu'il démarre déjà un nouveau projet un serveur Retro Projects sur Discord. \n \n \nBonjour à tous, je m'appelle Gary Bowser alias GaryOPA comme beaucoup d'entre vous le savent, je recommence ma vie après quelques années de lutte contre le système judiciaire, il suffit de rechercher mon pseudo sur Google . \n \nQuoi qu'il en soit, je suis maintenant de retour à Toronto, au Canada, et je reconstruis ma vie, et ce n'est pas facile car je suis hors du Canada depuis 2010, donc je n'ai pas de maison ou d'autres choses ici pour m'aider à recommencer, en tant que tel j'espère pour collecter suffisamment de fonds pour aider à trouver un logement et acheter quelques choses dont j'ai besoin, en plus de m'occuper de ma jambe gauche qui a un gonflement extrême, en raison du lymphoedème en tant que tel, il est douloureux pour moi de marcher beaucoup et j'ai besoin de soins médicaux de base des fournitures comme des pompes à compression et aussi un fauteuil roulant pour me permettre de me déplacer plus facilement.\n \n \nComme vous le savez chaque image à un sens, on voit GaryOPA en tenue de prisonnier sur fonds d'un très vieux PC ou console de développement, et un phénix qui est le logo de son entreprise ( la plupart des éléments sont relatifs à sa chaine Youtube ). Ce qui peut paraitre surprenant c'est que la photo est celle tirée de la première interview de Nick Moses.\n \n \n \n\n \n \nTout est là également sur un site qu'il a humblement intitulé garyopa.com\n \nLa cognotte est ici : Gofundme.com/f/garyopa-restarting-his-life\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175667/in-multi-garyopa-organise-une-cagnotte-pour-redemarrer-sa-vie-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175667/in-multi-garyopa-organise-une-cagnotte-pour-redemarrer-sa-vie-1.jpg"
        }
    },
    "news_13": {
        "title": "[PS5] Specter dévoile des détails sur l'hyperviseur &#34;in-kernel&#34; de la PS5",
        "content": "Le développeur Specter vient de mettre à jour la partie développeur du wiki PS5, il faut dire qu'il y a de la matière avec ce qu'il a présenté lors de sa conférence au Hardwear.io le 02 Juin dernier, il y a tout juste un mois. \n \nAinsi le développeur a montré que les espoirs se tournent désormais vers l'Hyperviseur, qui en quelque sorte protège le kernel et le firmware de la console. \n \nConçu comme un middleware, l'objectif de l'hyperviseur est d'empêcher toute exécution de code non signé, il s'assure que les règles définis dans le kernel soit les bonnes, et il empêche toute attaque ou écriture non prévue. \n \n \n \n\n \n\n \n \nSelon Specter, les premières versions des consoles PS5, celles qui disposent d'un firmware inférieur ou égal au firmware 2.50, intègrent l'hyperviseur au sein du kernel, ce qui le rend plus vulnérable, ou du moins en théorie plus facile à modifier. D'ailleurs le développeur a dévoilé sur le Wiki les 14 Hypercalls dont il parlait dans sa présentation d'il y a un mois. \n \n \n\n \n \nSur les versions 2.50 et antérieures, l'hyperviseur est intégré dans le binaire du kernel. Il s'agit de la \"première itération\" de l'hyperviseur, les versions ultérieures ont l'hyperviseur en tant que composant chargé séparément. Les principaux objectifs de l'hyperviseur sont de protéger l'intégrité du code du noyau et d'appliquer xotext (alias. eXecute Only Memory ou \"XOM\") sur le kernel.\n \nPour ce faire, Sony tire parti de diverses fonctionnalités fournies par AMD Secure Virtual Machine (SVM), telles que ; Tables de pages imbriquées (NPT), interruption d'exécution en mode invité (GMET) et interception des lectures/écritures dans les registres de contrôle (CR) ainsi que dans les registres d'état de la machine (MSR).\n \nDe plus, xotext semble être soutenu par du matériel en tant que collaboration avec AMD, nommée \"nda feature\". L'hyperviseur gère également l'unité de gestion de la mémoire d'E / S (IOMMU), comme l'indique le fait qu'il expose divers hypercalls pour le configurer.\n \nIl convient de noter que l'hyperviseur est très petit, surtout par rapport à celui de la PS3. Il ne prend en charge qu'une poignée d'hypercalls et existe principalement pour protéger le kernel. Il n'exécute pas plusieurs machines virtuelles ou n'utilise pas la virtualisation imbriquée, il ne virtualise que le kernel/l'espace utilisateur, que Sony appelle \"GameOS\".\n \n \n \nComme nous le prouve une nouvelle fois Specter, les premiers modèles de consoles sont toujours très intéressants car les constructeurs font évoluer leur sécurité sur les firmwares plus récents, et tente ainsi d'empêcher l'arrivée d'un jailbreak.\n \n \nTout est là : Hypervisor\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175630/in-ps5-specter-devoile-des-details-sur-lhyperviseur-in-kernel-de-la-ps5-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175630/in-ps5-specter-devoile-des-details-sur-lhyperviseur-in-kernel-de-la-ps5-1.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1175630/in-ps5-specter-devoile-des-details-sur-lhyperviseur-in-kernel-de-la-ps5-2.jpg"
        }
    },
    "news_14": {
        "title": "[Switch] HWFLY va arrêter de fabriquer l'ancien modèle",
        "content": "Il semblerait que l'arrivée de la solution RP2040 a bouleversé le marché des puces Nintendo Switch, à tel point que la Team HWFLY vient d'annoncer qu'elle ne va plus fabriquer l'ancien modèle, celui qui a fait son succès. \n \nLa Team va arrêter de fabriquer l'ancien modchip pour se concentrer sur ceux basés sur le RP2040, une excellente alternative puisqu'elle ne nécessite pas de résistances à souder, sauf pour le modèle OLED bien entendu. \n \n \n\n \n \n \nIl faut dire que les prix n'ont plus rien à voir, les modèles HWFLY basés sur RP2040 disponibles pour toutes les versions de Nintendo Switch tournent entre 10 et 15 $, jusqu'à 30 $ avec tous les flex selon les versions. \n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175596/in-switch-hwfly-va-arreter-de-fabriquer-lancien-modele-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175596/in-switch-hwfly-va-arreter-de-fabriquer-lancien-modele-2.jpg"
        }
    },
    "news_15": {
        "title": "[PS4] Les émulateurs ShadPS4 et RPCSX (PS4 / PS5)",
        "content": "La liste des émulateurs s'étoffe un peu plus encore avec l'annonce de l'arrivée de deux nouveaux protagonistes, avec pour le premier un émulateur PS4, et pour le second un projet PS4/PS5. \n \n \n\n \n \n \nL'émulateur ShadPS4\n \nComme son nom l'indique, il s'agit là d'une émulateur PS4, proposé par le développeur George Moralis, il est à l'origine de PCSX, PCSX2, PCSP, JPCSP, arcadeflex et il a contribué à RPCS3. Récemment il a rajouté le support initial de Linux. \n \nSi le projet vous intéresse c'est par ici : shadPS4\n \n \n \nL'émulateur rpcsx\n \nNous vous l'avions annoncé sous le nom de RPCS4 mais voilà le premier bout de code de l'émulateur rpcsx qui n'est autre que l'émulateur PS4 et PS5 de l'équipe à l'origine de RPCS3. Il s'agit là du 8eme émulateur PS5 qui tente de se faire un nom, mais avec ses développeurs et notamment les trois grands développeurs nekotekina, kd-11 et DH, RPCSX à de l'avenir.\n \n \n\n \nLes premiers samples fonctionnels sur RPCSX\n \n \n \nSi le projet vous intéresse c'est par ici : RPCSX\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175595/in-ps4-les-emulateurs-shadps4-et-rpcsx-ps4-ps5-1.jpeg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175595/in-ps4-les-emulateurs-shadps4-et-rpcsx-ps4-ps5-1.jpg"
        }
    },
    "news_16": {
        "title": "[Switch] Chromium mis à jour pour L4T Ubuntu et seconde Bêta de LineageOS 18.1",
        "content": "Le développeur CTCaer vient de nous informer via Twitter que le navigateur Chromium a été mis à jour pour L4T Ubuntu. \n \nIl nous informe en effet que le navigateur Chromium a été mis à jour, mais que contrairement aux mises à jour précédentes qui n'étaient que personnalisées au niveau de la configuration, celle-ci est construite avec des changements internes.\n \nChangements :\n \n- Ajout du décodage hardware VP9 \n- Support automatique de l'OSK dans les zones de texte (comme le reste de l'OS)\n- Correction d'un bug dans le site Youtube (UHD/HD restauré).\n \n \n \n\n \n \nAutre point intéressant, il nous informe que la seconde Bêta de LineageOS 18.1, qui pour rappel est basé sur Android 11, vient d'arriver hier 30 Juin 2023 pour la Nintendo Switch.\n \nCette deuxième Bêta apporte son lot de nouveautés : \n \n \nPoints forts de la version (Beta 2)\n \n- Ajout du support pour les nouvelles fonctionnalités de L4T comme l'analyse des données de calibration Lite.\n- Ajout du ddr200 pour les cartes microSD (désactivé par défaut contrairement à L4T à cause d'une possible incompatibilité avec certaines cartes) et quelques autres nouvelles options ini.\n- Les performances de l'Erista devraient être corrigées (encore un peu saccadé parfois, vous pouvez blâmer NVIDIA)\n- Les ventilateurs Erista s'allument désormais réellement et devraient utiliser les profils appropriés\n- U-Boot vidconsole devrait fonctionner maintenant (les options de configuration personnalisées et les erreurs durant cette étape sont imprimées sur la console au fur et à mesure qu'elles sont analysées)\n- L'audio ATV devrait être corrigé (duplication de la politique audio de l'onglet au lieu d'utiliser la politique ATV par défaut de NVIDIA)\n- Corrections de bugs diverses\n \nBugs connus (Beta 2)\n \n- Le mode dock nécessite parfois un retrait et un réancrage et certains affichages bizarres ne fonctionnent pas.\n- Le mode dock est parfois réglé par défaut sur une résolution stupide - il suffit de l'ajuster dans l'application Configuration du commutateur.\nSensor HAL (gyro, accel, etc.) est cassé sur tous les appareils - aucun support n'est prévu pour l'IMU Invensense trouvé dans l'OLED, mais les STM devraient fonctionner - je ne sais pas pourquoi ils ne le font pas.\n- CEC ne fonctionne pas\n- L'interface utilisateur du volume ne fonctionne pas en raison d'un bogue de plate-forme.\n- RSMouse n'est pas inclus\n- Le trackpad de la Shield TV Remote ne fonctionne pas\n- adb, mtp, etc. ne fonctionnent pas lorsque l'USB3 est désactivé\n- Les mises à jour sur place à partir de Q sont prises en charge mais peuvent être instables - nous recommandons des installations propres.\n- Le lanceur de console ne parvient pas à se mettre à jour en raison d'une signature qui ne correspond pas - ce problème sera bientôt résolu.\n- Les Joycons ne s'éteignent pas automatiquement en veille, assurez-vous de les éteindre en appuyant sur le bouton 'sync' sur le côté.\n \n \nTéléchargement : Android-11\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175587/in-switch-chromium-mis-a-jour-pour-l4t-ubuntu-et-seconde-beta-de-lineageos-181-1.jpg"
        }
    },
    "news_17": {
        "title": "[PS2] Apollo Save Tool en développement pour la PS2",
        "content": "Le développeur Damián Parrino, Bucanero, continue de décliner les version d'Apollo Save Tool pour les consoles d'anciennes générations. \n \nIl est réellement surprenant de voir comment il arrive à proposer le portage de son outil sur les autres plates-formes, après la PS3, la PS4, la Vita, la PSP, voilà donc qu'il prépare la version PS2. \n \nPour rappel, il s'agit d'une application qui vous permet de gérer les fichiers de sauvegarde de jeu sur la console et qui vous facilite le téléchargement, le déverrouillage, et la correction des fichiers de sauvegarde directement sur la console. \n \n \n\n \n \nLe développeur nous le confirme, Apollo Save Tool fonctionne sur PS2, cependant il reste encore beaucoup de travail.\n \n \nTout est là : twitter.com\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175579/in-ps2-apollo-save-tool-en-developpement-pour-la-ps2-1.jpg"
        }
    },
    "news_18": {
        "title": "[PS4] Participez à la prochaine phase test du flasher E4",
        "content": "Le développeur LightingMods propose à qui veut bien l'entendre qu'il vous est possible de participer à la prochain phase Bêta de l'E4 Flasher.\n \n \n\n \n \nLes flashers sont vendus au prix coûtant (25 $) avec livraison gratuite aux États-Unis et incluent une puce NOR de PS4 slim/pro de rechange pré-soudée à la carte. Pour une livraison en Europe, il faudra juste s'acquitter en plus des frais de port. \n \n \nLe googleform est disponible ici  : docs.google.com\n \nIl rajoute que pour lui la PS4 est beaucoup plus facile à souder que des appareils plus petits comme la Switch, déjà de part sa taille mais aussi par la disposition des puces. \n \n \n\n \n \nLe retour de la scène PS4 ? \n\n \nD'une manière générale cela s'accélère sur le downgrade de PS4, il semble que l'arrivée d'Abkarino a réveillé un peu tout le monde, le développeur BwE vient quand à lui annoncer un pack à 100 $ intégrant tout le nécessaire pour patcher le Syscon et la NOR de la PS4, ainsi que son logiciel BwE PS4 Downgrade Tool.\n \n \n\n \n \n\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175559/in-ps4-participez-a-la-prochaine-phase-test-du-flasher-e4-1.jpg",
            "image_2": "https://www.logic-sunrise.com/images/news/1175559/in-ps4-participez-a-la-prochaine-phase-test-du-flasher-e4-2.jpg",
            "image_3": "https://www.logic-sunrise.com/images/news/1175559/in-ps4-participez-a-la-prochaine-phase-test-du-flasher-e4-1.png"
        }
    },
    "news_19": {
        "title": "[PS5] Reconnaitre l'une des 3 révisions de votre DualSense",
        "content": "Oui il existe déjà 3 révisions de contrôleurs DualSense sur PlayStation 5 alors que la console n'a que 2 années et demi d'existence. \n \nSony tente d'améliorer continuellement ses produits, même si cela ne se voit pas au premier plan, en creusant un peu il est possible de voir les différences entre les manettes. \n \nDravszoo sur son profil Twitter nous propose de découvrir comment vous pourriez confirmer que vous avez la première, la seconde ou la dernière révision de la DualSense. \n \nIl existe différentes méthodes, la première est tout bêtement de regarder le numéro de série liés à l'ID FCC sur l'arrière de la manette, mais cela ne vous permettra que de distinguer un modèle BDM-010 avec un modèle BDM-020. \n \nLa seconde méthode est de vérifier la présence ou pas d'une lettre à côté de la référence du modèle.\n \nEnfin pour la troisième méthode il est possible de regarder l'intérieur des touches L2 et R2 afin de pouvoir les distinguer, ainsi vous pouvez découvrir quelle révision de DualSense vous disposez.\n \n \n\n \n \n \nPhoto ici : twitter.com/dravszoo1/\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175557/in-ps5-reconnaitre-lune-des-3-revisions-de-votre-dualsense-1.jpg"
        }
    },
    "news_20": {
        "title": "[Switch] Joy-Con Utility de Yoti disponible en v1.0.1",
        "content": "Le développeur Yoti, que l'on connaissait davantage pour ses contributions à la PSP et  à ONELua, a développé un utilitaire livré sous format NRO à destination de ceux qui souhaitent modifier leur périphérique Joy-Con de leur Nintendo Switch. Il s'agit d'un fork de Joycon Utility proposé en 2020 par dx4m.\n \nL'outil permet de réaliser une sauvegarde du firmware de la manette, de le restaurer, de changer son numéro de série ou encore de le restaurer. \n \n \n\n \n \nLa nouvelle version 1.0.1 vient apporter quelques optimisations  :\n \n- Vous pouvez maintenant utiliser le SDK le plus récent\n- Correction de quelques plantages lors de l'utilisation de l'application\n- Modification de quelques chaînes de caractères ici et là\n- Utilisation du Joy-Con SN comme nom de fichier par défaut\n \n \n\n \n \n \nTéléchargement : Joy-Con_Utility 1.0.1\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1175556/in-switch-joy-con-utility-de-yoti-disponible-en-v101-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1175556/in-switch-joy-con-utility-de-yoti-disponible-en-v101-1.jpg"
        }
    }
}