{
    "news_1": {
        "title": "[Multi] La mise à jour d'ezRemote Client s'invite sur toutes les consoles",
        "content": "Le développeur cy33hc propose une nouvelle version d'ezRemote pour quasiment toutes les consoles, la version Linux, la version PS5, la version Vita, la version Switch, la version PS3 et PS4 ont toutes été mises à jour, toutes n'ont pas le même avancement dans les numérotations, mais principalement il s'agit de la version 1.12, ou bien encore la 1.35 sur PS4. \n \nLa principale nouveauté est l'ajout de la prise en charge de la navigation et du téléchargement des versions à partir des dépôts GitHub. Sous le serveur, entrez simplement le dépôt Git du homebrew.\n \n \n\n \n \n \nTéléchargement : ezRemote PS3 / ezRemote PS4 / ezRemote Vita / ezRemote Switch / ezRemote PS5\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1204023/in-multi-la-mise-a-jour-dezremote-client-sinvite-sur-toutes-les-consoles-1.png"
        }
    },
    "news_2": {
        "title": "[PS4/PS5] Al-Azif propose un script pour afficher l'IDPS sur PS4 et PS5",
        "content": "Le célèbre développeur Al-Azif, connu pour ses contributions à la scène du jailbreak sur les consoles PlayStation, a récemment publié un nouvel outil, introduisant une nouvelle fonctionnalité permettant d'afficher des informations système partielles sur les PS4 et PS5. \n \nAprès une première version 0.9.0 dévoilée hier, qui était la version initiale, il propose aujourd'hui la version 1.0.0b qui inclut notamment la capacité de notifier l'utilisateur de l'IDPS partiel (Identification de la PlayStation) lorsque la console dispose d'un jailbreak.\n \n \n\n \n \n \nChangelog 1.0.0b : \n \n- Nettoyage du code.\n- Ajout de commentaires pour une meilleure compréhension.\n- Publication du code source.\n- Ajout du support pour la PS5.\n \n \nFonctionnalités principales de l'outil : \n \nAffichage du Partial IDPS : Si la console dispose d'un jailbreak (ou si le payload de jailbreak a réussi), une notification affichera l'IDPS partiel.\n \nInformations supplémentaires : En cas de jailbreak réussi, le Partial Serial (numéro de série partiel) et le Model (modèle de la console) seront également affichés.\n \nSauvegarde des données : Si un périphérique USB est connecté, les données seront automatiquement sauvegardées dans un fichier data.txt à la racine du périphérique. Ce fichier est préformaté pour une utilisation facile sur des forums ou des plateformes de partage.\n \nCompatibilité : L'outil fonctionne en mode userland sur la PS5, mais se limite à l'affichage du Partial IDPS dans les notifications.\n \n \nTéléchargement : Info dumer payload for PS4/PS5 1.0.0b\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203990/in-ps4ps5-al-azif-propose-un-script-pour-afficher-lidps-sur-ps4-et-ps5-1.jpg"
        }
    },
    "news_3": {
        "title": "[PS3] RPCS3 v0.0.35 Alpha disponible",
        "content": "L'équipe de développement de RPCS3, l'émulateur open-source de PlayStation 3, a annoncé la sortie de la version 0.0.35 Alpha. Bien que cette version ne soit pas une build stable, elle apporte une multitude de corrections, d'optimisations et de nouvelles fonctionnalités qui continuent de faire de RPCS3 le meilleur émulateur PS3. .\n \nComme le souligne l'équipe, RPCS3 est un logiciel en \"rolling release\", ce qui signifie qu'il n'existe pas de version stable officielle. Les versions Alpha, comme la 0.0.35, sont des jalons qui regroupent des améliorations significatives, mais elles ne sont pas destinées à un usage grand public en raison de leur nature expérimentale. Les utilisateurs sont invités à toujours télécharger la dernière build disponible sur le site officiel : rpcs3.net/download.\n \n \n\n \n \nLes Principales Améliorations de la Version 0.0.35 \n \nCette nouvelle version introduit une série de correctifs et d'optimisations, notamment :\n \n- Améliorations des performances SPU : Plusieurs optimisations ont été apportées au niveau des réservations SPU, avec des corrections pour la gestion de la mémoire et des notifications.\n \n- Support amélioré pour les contrôleurs PS Move : L'émulateur intègre désormais un meilleur support pour les contrôleurs PS Move, avec des améliorations dans la gestion de l'orientation, du gyroscope et de la calibration.\n \n- Mises à jour des bibliothèques : Des bibliothèques essentielles comme Qt, curl, et wolfssl ont été mises à jour pour améliorer la stabilité et les performances.\n \n- Corrections graphiques : Des problèmes liés au cache des shaders et à la gestion de la mémoire graphique ont été résolus, notamment pour les utilisateurs de Vulkan.\n \n- Améliorations de l'interface utilisateur : L'interface a été enrichie avec de nouvelles fonctionnalités, comme un indicateur d'autosauvegarde, un menu récent pour les sauvegardes, et des dialogues de bienvenue améliorés.\n \n- Support audio et vidéo : Des corrections ont été apportées pour les décodages audio (cellAdec) et vidéo (cellVdec), avec une meilleure gestion des flux multimédias.\n \nNouveautés pour les Développeurs\n \nLes développeurs travaillant sur RPCS3 ou souhaitant contribuer au projet trouveront également des améliorations notables :\n \n- Optimisations LLVM : Des améliorations ont été apportées pour réduire la consommation mémoire et optimiser les performances des recompilateurs PPU et SPU.\n \n- Support pour ARM64 : Les builds pour les processeurs ARM64 sont désormais mieux supportés, avec des correctifs spécifiques pour les plateformes comme macOS et Linux.\n \n- Intégration continue : L'équipe a amélioré les pipelines CI (Continuous Integration) pour garantir une meilleure stabilité des builds futures.\n \n \nChangelog complet ici : RPCS3 v0.0.35 Alpha\n \n \nUn Projet en Évolution Constante\n \nRPCS3 continue de progresser à un rythme impressionnant, avec une communauté active et des contributeurs dévoués. Cette version 0.0.35 Alpha témoigne de l'engagement de l'équipe à améliorer l'émulateur, que ce soit pour les joueurs souhaitant revivre leurs classiques PS3 ou pour les développeurs cherchant à explorer les entrailles de la console de Sony.\n \n \nTéléchargement : RPCS3\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203989/in-ps3-rpcs3-v0035-alpha-disponible-1.jpg"
        }
    },
    "news_4": {
        "title": "[PS5] Le développeur Bucanero ne développe pas Apollo Save Tool sur PS5",
        "content": "Nous venons d'apprendre que le développeur Bucanero vient de débuter le développement d'Apollo Save Tool sur la PS5, un projet de développement lié à la PlayStation 5, spécifiquement une version PS5 d'Apollo Save Tool, l'outil de sauvegarde et de gestion de fichiers pour consoles PlayStation. Le développeur, connu sous le pseudonyme Bucanero (Damian Parrino), travaille sur ce projet, et les commits initiaux sur GitHub montrent une activité récente.\n \n \n \n\n \n \n \nCependant, à notre connaissance, pour l'heure le développeur n'a pas encore annoncé cette nouvelle version, les développeurs de ce type d'outils travaillent souvent de manière discrète, en raison des implications légales et techniques liées au modding et à la manipulation des consoles. Si vous souhaitez suivre l'évolution du projet, vous pouvez consulter régulièrement le dépôt GitHub : Apollo PS5 sur GitHub. \n \nLe hack PS5 évolue rapidement depuis quelques semaines, et le portage de jeux PS4 s'accentue, ce sofwt permettra de porter les sauvegardes de PS4 vers la PS5, ou bien de les resigner, et de les archiver.\n \n \nEdit 01/03/2025 : Après avoir vu que de nombreuses personnes reprenaient le github (fort logiquement) comme un commencement de développement (nous avions d'ailleurs préciser qu'il n'avait pas confirmé ou annoncé le dév) le développeur a confirmé qu'il ne développe pas actuellement la version PS5, dès lors pourquoi créer un github, à priori pour regrouper un certain nombres de requêtes peut être. Donc pour l'heure le développement de la version PS5 d'Apollo Save n'est pas une réalité. \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203972/in-ps5-le-developpeur-bucanero-commence-le-developpement-dapollo-save-tool-sur-ps5-1.png"
        }
    },
    "news_5": {
        "title": "[Switch] SysDVR v6.2 avec support Android 32 bits et de nouvelles fonctions",
        "content": "La communauté des utilisateurs de SysDVR a de quoi se réjouir avec l'arrivée de la version 6.2, qui apporte des améliorations significatives et des corrections attendues depuis plusieurs mois. Pour rappel, sysDVR permet de diffuser l'écran de la Nintendo Switch via USB ou via Réseau en 720p 30 FPS sur un PC.\n \n \n\n \n \n \nChangelog SysDVR 6.2\n \nPrincipales modifications :\n- Support d'Android ARM 32 bits (armeabi-v7a)\nLa version 6.2 introduit le support des appareils Android 32 bits, une avancée majeure qui permet à SysDVR d'être compatible avec une plus large gamme d'appareils, y compris les modèles plus anciens ou économiques. Cependant, les développeurs mettent en garde : bien que l'application puisse désormais fonctionner sur ces appareils, leurs performances matérielles limitées pourraient ne pas offrir une expérience optimale.\n \n- Correction de l'enregistrement vidéo\nUn bug frustrant lors de l'enregistrement de deux vidéos consécutives a été résolu, garantissant désormais une capture vidéo sans interruption.\n \n- Option pour désactiver les entrées du contrôleur sur PC\nUne nouvelle fonctionnalité permet de désactiver les entrées du contrôleur lors de la lecture sur un PC, répondant à une demande récurrente de la communauté.\n \n- Améliorations des entrées de contrôleur/télécommande sur Android\nLa prise en charge des contrôleurs et télécommandes sur Android a été optimisée pour une meilleure réactivité et une expérience plus intuitive.\n \n- Améliorations pour Flatpak\nLes utilisateurs de Flatpak bénéficient de plusieurs corrections et optimisations, rendant l'installation et l'utilisation de SysDVR plus stables sur cette plateforme.\n \n- Ajout de nouvelles langues\nLa version 6.2 accueille deux nouvelles langues : l'espagnol, grâce à la contribution de @unaigonzalezz, et le portugais brésilien, ajouté par @discollizard.\n \n- Infrastructure de débogage améliorée\nUne nouvelle infrastructure de débogage a été mise en place pour fournir des détails plus précis en cas d'erreur, notamment lorsque la journalisation détaillée est activée. Cela facilitera le diagnostic des problèmes pour les utilisateurs et les développeurs.\n \nLa version 6.2 de SysDVR démontre l'engagement continu des développeurs à répondre aux besoins de la communauté. Avec des améliorations de compatibilité, des corrections de bugs et de nouvelles fonctionnalités, cette mise à jour renforce la position de SysDVR comme un outil essentiel pour les passionnés de jeux vidéo. Les utilisateurs sont invités à mettre à jour leur application pour profiter de ces nouveautés et à partager leurs retours pour contribuer à l'amélioration continue du projet.\n \nTéléchargement : SysDVR 6.2\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203969/in-switch-sysdvr-v62-avec-support-android-32-bits-et-de-nouvelles-fonctions-1.png"
        }
    },
    "news_6": {
        "title": "[Switch] MigFlash dévoile le firmware 1.1.8",
        "content": "L'équipe en charge du développement du MigFlash vient de mettre en ligne un article pour proposer un tout nouveau firmware à destination de leur solution.\n \nLe firmware 1.1.8 est affichée comme une mise à jour rapide, la version 1.1.8 corrige un problème dans le Mig Dumper où le dump de certains types de cartes de jeu s'arrêtait prématurément et chutait à une vitesse de transfert nulle.\n \n \n\n \n \n \n \n \nD'autres travaux sont en cours, mais l'équipe a souhaité proposer cette petite mise à jour car plusieurs utilisateurs ont rapporté ce problème et cela coinçait lors de la sauvegarde de certains de leurs jeux préférés !\n \n \nTéléchargement : firmware 1.1.8 MigFlash\n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203946/in-switch-migflash-devoile-le-firmware-118-1.png"
        }
    },
    "news_7": {
        "title": "[PS4/PS5] Sony se lâche et propose une campagne bug bounty durant 2 semaines",
        "content": "Bonne nouvelle, une campagne augmentée du bounty programme, la prime aux bugs redémarre, une campagne de bug bounty (prime aux bugs) de PlayStation, où des primes augmentées sont offertes pour des vulnérabilités critiques spécifiques à un domaine lié à la PS5. C\n \nPlayStation a effectivement un programme de bug bounty en partenariat avec HackerOne, une plateforme reconnue pour la divulgation responsable de vulnérabilités. Les chercheurs en sécurité peuvent signaler des failles et recevoir des récompenses en fonction de la gravité des problèmes trouvés. Les primes peuvent effectivement atteindre des montants élevés pour les vulnérabilités critiques.\n \n \n \n\n \n \n \nCampagne limitée à 50 000 USD : Les campagnes temporaires avec des primes augmentées ne sont pas rares dans le domaine de la cybersécurité. Cette campagne vise à encourager les chercheurs à se concentrer sur des domaines spécifiques, comme celui mentionné (http://ps5.np.playstation.net). \n \nCette campagne a démarré le 25/02/2025 et finit le 11/03/2025, si vous voulez dévoilé vos compétences ! \n \nTout est là : hackerone.com  \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203941/in-ps4ps5-sony-se-lache-et-propose-une-campagne-bug-bounty-durant-2-semaines-1.png"
        }
    },
    "news_8": {
        "title": "[3DS] Le code de l'émulateur 3DS Azahar rendu public",
        "content": "PabloMK7, à l'origine du développement de l'émulateur Azahar, vient de dévoiler le code source de son émulateur 3DS.\n \nLe projet Azahar, un émulateur open-source en développement, vient de franchir une étape importante avec la mise à disposition de son code source au public. Disponible sur GitHub (https://github.com/azahar-emu/azahar), cette annonce marque le début d'une phase de développement ouvert et collaboratif. \n \n \n\n \n \n \nPour l'instant, l'émulateur n'a pas encore de version stable, et les utilisateurs sont invités à la prudence : Azahar est principalement destiné aux développeurs et aux early adopters prêts à tester un logiciel en cours de perfectionnement. Les contributeurs peuvent dès à présent soumettre des pull requests, tandis que les demandes issues de Lime3DS seront intégrées progressivement.\n \nÀ terme, Azahar ambitionne de devenir une alternative à des solutions existantes comme le fork Citra de PabloMK7 ou Lime3DS. Une première version stable devrait voir le jour prochainement, ouvrant la voie à une utilisation grand public.\n \nCe projet, porté par une communauté passionnée, promet de faire parler de lui dans le monde de l'émulation. Affaire à suivre !\n \n \nTéléchargement : Azahar code source\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203936/in-3ds-le-code-de-lemulateur-3ds-azahar-rendu-public-1.png"
        }
    },
    "news_9": {
        "title": "[PS3] Vers une version officielle Android de RPCS3",
        "content": "L'émulation sur Android continue de faire parler d'elle, mais cette fois, c'est une histoire de licences qui prend le devant de la scène. L'équipe derrière RPCS3, l'émulateur open-source de PlayStation 3 pour PC, a récemment dû intervenir pour faire respecter les termes de la licence GPLv2, après qu'un projet concurrent, aPS3e, ait violé ces règles.\n \nLe projet controversé aPS3e aura eu raison de l'équipe RPCS3, et notamment de DH, qui a décidé de donner une suite à cette affaire !\n \n \n \n\n \n \nDH, le développeur original de RPCS3, travaille sur une version Android officielle, alors que le projet aPS3e est actuellement en pause, une nouvelle excitante émerge : DH, le développeur original de RPCS3, travaille activement sur une version Android officielle de l'émulateur. Cette annonce a été accueillie avec enthousiasme par la communauté, qui espère enfin pouvoir profiter d'une expérience d'émulation PS3 de qualité sur mobile, tout en respectant les principes de l'open-source.\n \nDH a confirmé le développement de la version Android en publiant son travail sur Github, bien entendu pour l'heure il ne s'agit que d'une première version, et il faudra du temps pour en faire une plate-forme de référence. \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203933/in-ps3-vers-une-version-officielle-android-de-rpcs3-1.jpg"
        }
    },
    "news_10": {
        "title": "[PS5] Une première version d'ezRemote pour PS5",
        "content": " \nLe développeur cy33hc propose une toute première version d'ezRemote pour PS5. Tout comme sur PS4, cette solution promet de révolutionner l'expérience des joueurs en offrant des fonctionnalités de contrôle à distance améliorées et intuitives.\n \n \n\n \n \nFonctionnalités clés d'ezRemote :\n \n- Contrôle à distance fluide : Prenez le contrôle de votre PS5 depuis votre smartphone ou tablette avec une interface optimisée.\n \n- Gestion des médias : Accédez et gérez vos fichiers multimédias directement depuis l'application.\n \n- Personnalisation : Interface personnalisable pour s'adapter à vos préférences.\n \n- Compatibilité multiplateforme : Disponible sur iOS et Android.\n \n \nCe qu'en dit le développeur :\n \n\"Avec ezRemote, je voulais créer un outil qui simplifie l'interaction avec la PS5, tout en offrant une expérience utilisateur riche et fluide. Cette première version est le fruit de mois de travail et d'optimisation, et j'ai hâte de voir comment la communauté l'adoptera aussi sur PS5\". \n \n \nLe logiciel permet de se connecter à des serveurs distants, via FTP/ SFTP, SMB, NFS, WebDAV ou encore HTTP, via une interface largement inspirée de FileZilla. \n \n \nChangelog 1.01 :\n- Correction du téléchargement de fichiers sur les serveurs WebDAV\n- Correction de la connexion à archive.org\n \nChangelog v1.00 (bêta) :\n- Version initiale\n \nProblèmes connus :\n- Impossible de télécharger des fichiers sur des serveurs WebDAV\n- Impossible de se connecter à archive.org\n \nInstallation :\n- Extrayez le fichier ezremote-client.zip dans le dossier /data/homebrew sur la PS5. Lancez l'application avec l'Homebrew Launcher.\n \n \n \nTéléchargement : ps5-ezremote-client 1.01\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203931/in-ps5-une-premiere-version-dezremote-pour-ps5-1.jpg"
        }
    },
    "news_11": {
        "title": "[PSP] Chronoswitch Downgrader v7.6.5",
        "content": "Le développeur krazynez vient de dévoiler une nouvelle version de Chronoswitch Downgrader, l'outil développé à l'origine par Davee et qui facilite le downgrade de la PSP. \n \nIl est toujours intéressant de comprendre pourquoi ce genre de logiciel resorte du chapeau des années après son développement, tout simplement parce que ces nouvelles versions apportent des nouveautés, le 30 décembre 2024 de nouveaux messages d'impression de diagnostics sont apparus, impliquant l'eboot.pbp, de nouveaux messages d'analyse, des fichiers tampons, et des rapports d'erreurs plus clairs. \n \n \n \n\n \n \n \nLa mise à jour améliore également la prise en charge des PSP Go, avec une détection des fichiers et de réveil plus stable, après une sortie d'hibernation.\n\n \nChangelog ChronoSwitch v7.6.5 :\n \n- PSP GO : Détecte s'il existe un fichier d'hibernation de reprise du jeu ou non.\n\n \n \nTéléchargement : Chronoswitch Downgrader v7.6.5\n \n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203929/in-psp-chronoswitch-downgrader-v765-1.png"
        }
    },
    "news_12": {
        "title": "[PS4] L'émulateur psOff se met à jour",
        "content": "Le développeur SysRay propose une mise à jour de psOff, l'émulateur PS4, psOff est un émulateur PlayStation 4 à code source fermé (couche de compatibilité), écrit en C++20. Ce projet en est encore à ses débuts et de nombreux jeux ne fonctionneront pas correctement avant un certain temps, mais il améliore régulièrement la compatibilité et les performances.\n \n \n\n \n \n \nChangelog :\n \n- Interface utilisateur : Sélection du GPU\n \n- shader correction de la sortie des couleurs\n \n- correction de la sélection du tampon de profondeur\n \n- shader : correction de la négation de l'opcode\n \n- SaveDataDialog : Ajout de divers types de dialogue (LISTE et ASSISTANT toujours manquants)\n \n \nTéléchargement : psOff\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203916/in-ps4-lemulateur-psoff-se-met-a-jour-1.png"
        }
    },
    "news_13": {
        "title": "[PS5] LightningMods personnalise etaHEN 2.0b pour le kstuff 5.10",
        "content": "Il semblerait que les offsets du firmwares 5.10 nécessitent quelques adaptations, il faut dire que de firmware en firmware Sony a appris de ces erreurs bien qu'on puisse s'étonner que la firme japonaise en fasse encore malgré toutes les générations de consoles. \n \nQuoiqu'il en soit, le développeur LightningMods vient de proposer une version personnalisée d'etaHEN 2.0B pour le kstuff du firmware 5.10. \n \n \n \n\n \n \n \nCe nouveau etaHEN 2.0b (de test) est proposé sur le discord, mais la plupart des développeurs qui proposent des alternatives ont donc mis à jour etaHEN 2.0B dans leur solution. \n \nC'est le cas par exemple d'Aldostools qui s'est empressé de l'intégré dans PS5 Payloads 1.8a Mod, ou encore Master-9 dans son host, ou bien même dans PS5 Homebrew v1.6.\n \n \n \n \n",
        "images": {}
    },
    "news_14": {
        "title": "[PS4] FPKGi v0.87 Nightly disponible",
        "content": " \nLe développeur ItsJokerZz propose deux version successives de FPKGi, et les évolutions sont nombreuses ! Ce projet open-source permet de télécharger et d'installer des fichiers .pkg modifiés, notamment pour les jeux backportés sur des firmwares plus anciens de la PS4. FPKGi est conçu pour être utilisé avec des serveurs personnalisés, permettant aux utilisateurs de peupler l'application avec leur propre contenu via des fichiers .json locaux ou en ligne. \n \nCette mise à jour se concentre sur l'amélioration de la stabilité, la correction des bugs et l'amélioration de l'expérience utilisateur, en particulier autour du téléchargement, de la sauvegarde des configurations et de la réactivité de l'interface. \n \n \n \n\n \n \n \nv0.87 [Nightly] Pré-release \n \nComment mettre à jour :\n \nMets à jour via le Homebrew Store ou ouvre simplement l'application pour voir la notification de mise à jour.\n \nCorrectifs :\n \nProblème #8 : Les configurations ne se sauvegardaient pas ou revenaient aux paramètres par défaut à la fermeture de l'application, sauf si le menu était activé.\n \nProblème #9 : Les utilisateurs ne pouvaient pas télécharger du contenu à cause de modifications récentes dans la gestion des pages.\n \n \nv0.86 [Nightly] Pré-release (Version précédente)\n \nCorrectifs :\n \nLes versions d'applications vides ou nulles s'affichent maintenant comme \"?.??\" au lieu d'une chaîne vide.\n \nCorrection des fonctionnalités de filtrage, tri et basculement ascendant ; le contenu s'affiche et se sauvegarde correctement.\n \nRésolution des problèmes de gel de l'interface et de fermeture de l'application, permettant des actions séquentielles plus fluides.\n \nLa musique de fond ne redémarre plus lors de l'activation du menu et se sauvegarde correctement.\n \nLe compteur de contenu se met à jour correctement après une mise à jour, même si l'application reste ouverte.\n \nCorrection du chargement des images de couverture ; l'image par défaut s'affiche maintenant correctement.\n \nLes configurations au chargement ne causent plus de problèmes, car les valeurs manquantes sont ajoutées aux paramètres par défaut.\n \nAméliorations :\n \nRésolution du Problème #4 : Télécharger l'application elle-même ne la fait plus planter ou se supprimer. À la place, elle ouvre/télécharge et lance LM's HB-Store pour les mises à jour si nécessaire.\n \nLes téléchargements incluent maintenant une limite de 20 Mo pour éviter les faux téléchargements et les problèmes associés.\n \nLes titres longs dans l'interface des détails défilent maintenant pour une visibilité complète au lieu d'être coupés.\n \nAjouts :\n \nAjout d'une vérification des mises à jour au lancement, qui installe et lance HB-Store si ce n'est pas déjà présent.\n \nLes valeurs se mettent à jour lors de la visualisation des détails de l'application sous les pages \"Homebrew\" ou \"TOUT\".\n \nIntroduction d'une nouvelle page par défaut pour afficher tout le contenu, définie pour les nouveaux utilisateurs au premier lancement.\n \nAjout de pages dédiées pour les thèmes, émulateurs, jeux PS1/PS2, jeux PSP et tout le contenu en un seul endroit.\n \nOptimisations et autres :\n \nCorrection des problèmes de chargement des images de fond et d'autres contenus avec des URL locales. Les utilisateurs doivent ajouter \"http(s)://\" pour que les connexions locales fonctionnent.\n \nRéduction des délais, gels et écrans noirs, notamment au premier lancement, améliorant la stabilité globale.\n \nAjustement des valeurs par défaut pour les JSON de contenu générés afin de mieux refléter les types de contenu.\n \n \n \nTéléchargement : FPKGi v0.87 Nightly\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203893/in-ps4-fpkgi-v087-nightly-disponible-1.png"
        }
    },
    "news_15": {
        "title": "[PS5] PS5-Jar-Loader v4.1.0 disponible",
        "content": "Le développeur Hammer-83 dévoile une nouvelle version de PS5-Jar-Loader, il s'agit de la version v4.1.0 qui est proposée avec de nouvelles fonctions. \n \nComme vous le savez, l'utilisation de l'exploit BD-J permet d'accéder à des possibilités qui ne sont pas directement accessible à l'exploit webkit, du fait de sa sécurité accrue. \n \nAvec l'exploit bluray, il est possible d'en profiter jusqu'au firmware 7.61.\n \n \n\n \n \nNouvelles fonctionnalités notables :\n \n- Plusieurs améliorations du SDK.\n- Transferts DMA paginés implémentés.\n \nCorrections notables :\n \n- Jailbreak JAR fonctionne désormais avec Menu Loader et est inclus dans Full ISO.\n- Les répertoires auparavant inaccessibles peuvent désormais être lus (bug dans l'utilisation des E/S de fichiers natifs).\n \n \nTéléchargement : PS5-Jar-Loader v4.1.0\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203892/in-ps5-ps5-jar-loader-v410-disponible-1.png"
        }
    },
    "news_16": {
        "title": "[XB360] Le piratage de l'hyperviseur de la Xbox 360 est possible",
        "content": "Le développeur Ryan M (se faisant appelé Grimdoomer sur X) vient de dévoiler un article très intéressant sur tout un tas de documents et de dossiers qu'il dispose sur le piratage de l'hyperviseur de la Xbox 360. \n \nIl ne s'agit que du premier article (la partie 1) de tout d'un tas de réflexion concernant la conception et le hack de l'hyperviseur et des fonctionnalités matérielles de sécurité de la Xbox 360. \n \nCe premier article sert d'introduction a ce que sera la seconde partie qui contiendra la façon dont casser l'hyperviseur et un PoC ou l'exploit lui même. \n \nAfin de rassurer tout le monde, Ryan M explique que cet exploit de l'hyperviseur fonctionne sur la dernière version du firmware Xbox 360 à savoir le 17559. \n \n \n \n\n \n \n \nL'exploit en lui même n'est pas persistant, à savoir qu'il ne s'agit pas d'un softmod, il faudra lancer l'exploit à chaque démarrage, et il dispose d'un taux de réussite très faible, de l'ordre de 30 %, il ne lancera que moins d'une fois sur 3, et son temps d'exécution peut aller jusqu'à 20 minutes. \n \n \n \n\n \nRyan M reste lucide, il ne pense pas que cet exploit pourra être utilisé de manière fiable et permanente, son intention est de montrer qu'il est possible de casser les sécurités de l'hyperviseur de la Xbox 360.\n \nLes fichiers qui seront publiés dans la seconde partie de l'article, dont la diffusion serait prévue pour la semaine prochaine, permettront de patcher l'hyperviseur, et donc d'exécuter du code non signé, à priori un seul exécutable, il n'y aura pas la suppression des contrôles de signatures, ou l'exécution de payloads de développement ou d'exécutables. \n \n \n \n\n \n \nL'hyperviseur de la Xbox 360 est un élément de code très sécurisé, renforcé par des fonctionnalités de sécurité matérielles, et dont l'objectif est unique : empêcher le piratage de la console. Cela présente les défis suivants pour les attaquants :\n \n- L'hyperviseur a très peu de surface d'attaque pour trouver des bugs.\n- La surface d'attaque disponible effectue une validation approfondie de toutes les données et paramètres fournis par le mode noyau.\n- Toutes les communications avec les autres périphériques de la carte mère sont effectuées par le noyau.\n- L'hyperviseur n'effectue aucune analyse des données provenant de ces périphériques (lecteur de DVD, disque dur, port réseau, USB, etc.).\n- La mémoire de l’hyperviseur est protégée par un cryptage et des contrôles d’intégrité.\n- Cela rend très difficile la réalisation d’attaques de corruption de mémoire.\n- L'hyperviseur n'accède presque jamais à la mémoire qui n'est pas protégée.\n \n \nLa première partie de l'article se trouve ici : icode4.coffee\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203875/in-xb360-le-piratage-de-lhyperviseur-de-la-xbox-360-est-possible-1.png",
            "image_2": "https://www.logic-sunrise.com/images/news/1203875/in-xb360-le-piratage-de-lhyperviseur-de-la-xbox-360-est-possible-2.png",
            "image_3": "https://www.logic-sunrise.com/images/news/1203875/in-xb360-le-piratage-de-lhyperviseur-de-la-xbox-360-est-possible-3.png"
        }
    },
    "news_17": {
        "title": "[PS5] LightningMods a créé etaHEN-SDK sur les bases de PS5-payloads-dev SDK",
        "content": "Le développeur LightningMods a décidé de faire un fork de PS5-payloads-dev SDK en l'appelant etaHEN SDK, ce fork est basé sur la proposition de John Tornblom qui regroupe un ensemble SDK détaillé pour créer des payloads PS5 spécifiquement taillé pour etaHEN.\n \n \n\n \n \n \nChangelog : \n \n- Basé sur le SDK 0.21.1, dernière version connue pour fonctionner avec etaHEN\n- Offsets mis à jour pour les firmwares 1.xx - 7.61\n \n \n \nTéléchargement : etaHEN SDK Rev 1\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203874/in-ps5-lightningmods-a-cree-etahen-sdk-sur-les-bases-de-ps5-payloads-dev-sdk-1.png"
        }
    },
    "news_18": {
        "title": "[PS5] PS5-Xplorer v1.04 pour la PS5 disponible",
        "content": "Le développeur Lapy propose aussi la mise à jour de PS5-Xplorer, la version PS5 de PS4-Xplorer, il confirme avoir apporté les mêmes correctifs que sur la version 2.04 de PS4-Xplorer. \n \n \n\n \n \nTéléchargement : PS5-Xplorer 1.04\n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203867/in-ps5-ps5-xplorer-v104-pour-la-ps5-disponible-1.png"
        }
    },
    "news_19": {
        "title": "[PS4] Avatar Changer pour PS4 de Lapy disponible",
        "content": "Le développeur Lapy propose un tout nouvel utilitaire à destination de la PS4, il s'agit d'Avatar Changer\n \n \n\n \n \nChangelog :\n \n- Changez votre photo de profil plus facilement que jamais \n- Vous pouvez également modifier le nom de votre profil pour les comptes activés\n- Remerciement à Anubis_Qz, Wr0zen, DouglasSampaioz et OrlandoLian.\n \n \nTéléchargement : Avatar Changer pour PS4\n \n \n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203866/in-ps4-avatar-changer-pour-ps4-de-lapy-disponible-1.png"
        }
    },
    "news_20": {
        "title": "[PS5] Une première version d'Itemzflow compatible avec kstuff 5.10",
        "content": "Le développeur LightningMods dévoile déjà une première version d'Itemzflow compatible avec le tout nouveau kstuff pour le firmware 5.10. \n \n \n\n \n \n \n \nIl a du adapter Itemzflow pour qu'il fonctionne, officiellement il ne s'agit que d'une version de test, la dernière version officielle proposée étant la v1.08. \n \n \nTéléchargement : Itemzflow compatible Kstuff 5.10 (version de test)\n \n \n",
        "images": {
            "image_1": "https://www.logic-sunrise.com/images/news/1203826/in-ps5-une-premiere-version-ditemzflow-compatible-avec-kstuff-510-1.png"
        }
    }
}